[
    {
        "subreddit": "crashteamracing",
        "sentence": "And you also have my respect for pushing so hard and eventually beating it! This is what matters in the end ☺️ thank you! 🤩"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you ☺️🐧☺️ we all suffered for those at some point believe me and I personally still suffer on a few of those despite having beaten them (yeah, turbo track 🤣)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Eventually though you will get them all believe me, just keep pushing!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You might be right actually, using drift may be an excuse for doing fewer u-Turns"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I will try all these runs with speed eventually too because I am curious to see how many seconds you save by using speed :)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If only I had found this out much sooner would I have not vented to death at my TV for screwing up for hours (350+ attempts) just beating it with drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You have my respect!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Update: I finally got it with drift! ✊🏻"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "With uturn, cutting corners becomes a non-issue"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's actually an advantage with speed since it's easier to travel in a straight line while drifting"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You should try it out with speed anyways to practice u turn corner techniques and improve yourself drastically as a driver"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Cortex castle is also great for this"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Getting used to it will make the developer time feel very easy."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You sick beast, You went for Crash cove first!!?? You deserve nothing but respect, I promise aside a few tracks like dragon mines or papu's pyramid nothing will give You many problems"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Currently making myself miserable by picking up going for dev times again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Love to see these!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It'd be better suited on a personal youtube channel"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ah oui ? J’ai jamais remarqué je fais ça la prochaine fois alors, merci ☺️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ahah t'inquiètes, je disais ça pour rire"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Peut-être couper le son de la vidéo via un éditeur avant de poster, sur smartphone t'as une fonction edit qui permet de retirer le son des vidéos"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Is it not normal content for crash team racing?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Désolé c’était un pote à moi qui écoutait les nouvelles, en fait je sais pas comment couper le son des vidéos sur reddit"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Fair enough"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ah ouais, bête d'ambiance les infos en arrière-plan"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Very nice!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Will these ever stop"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Agreed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Its one of a few that were easier for me with drift engine as there are so many tight corners on which its better to build up more reserves by drifting instead of u turning so it lasts longer for sections where its awkward to drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Overall easier to maintain blue fire this way."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "True, I agree! Never tried this one with speed, maybe I will out of curiosity to see what time I’ll manage to get"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The problem with speed despite giving you more speed than drift is that you can’t cut your corners as much as with drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "At least for me!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It is one of the tracks where drift engine definetly helps."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "**Just as a reminder**, it is always a good thing to directly contact developers through [Activision Support](https://support.activision.com/contact-us).\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/crashteamracing) if you have any questions or concerns.*"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’ve done the Ring of Fire pro challenge + dev time using drift engine featured in a video posted here days ago"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This “exploit” isn’t necessary in either of these."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "🤷‍♂️😅 https://youtu.be/OXB2YspNdng?si=Pdl59tQ\\_uTFMmAL-"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’ve just beaten Roo’s Tubes, Coco Park, and Papu’s Pyramid"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "These are all a cakewalk compared to Crash Cove, and I am dreading when I deal with every William P"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "dev times.\nEdit: Tiger Temple could be brutal because I used drift on this one as I did for nearly all of these, and it took me over 4 hours of attempts to beat."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That's no fun"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Wish there were a way to knock this stuff off"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I am interested!! RaibowPrideAlpa on PSN!!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yes, and this person shows every so often"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s so bad because you could be winning the race and they only will grieve you if you’re the one that’s winning on the last lap."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Honestly I didn't have Turbo Track in my top 10 hardest dev times when I first did it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I just didn't find it that difficult"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I spent a lot more time on so many more tracks compared to this one when I first did it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Even when I replayed all the Dev times on PS5 I did it in my first attempt haha."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice job beating Crash Cove"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know a lot of people consider it to be hard so great job"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also that is a really excellent time for your first time beating the Dev there"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So I trust that you will be able to beat them all."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I counted my attempts for each track, and Turbo Track exceeded 1000 attempts (during a 17 hour session jusf for this track) before I finally beat it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Doing all tracks in order wasn't a healthy choice."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Is this on playstation?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And I think he also goes by the name of Thor there’s another_THOR_"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No way like literally I thought I was going crazy because I was finally winning races and it’s like I found out that this person literally chills and I guess high-ranking lobbies so I was so frustrated that he was at the end of the line getting me with like weapons and it’s just like you really do this people really do this like it’s just sad that this person takes a time out of there to do this"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dude has an infamous record for this"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You’d figure after 2 years he’d just be banned or get bored.\n\nhttps://www.reddit.com/r/crashteamracing/s/vRc8frMQws\n\nhttps://www.reddit.com/r/crashteamracing/s/Un4EjG3206"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Man, that's awesome"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Another reason I wish I bought the PS4 instead of the Switch."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Because that’s its name"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s a PS4 exclusive track, a low-poly version of Turbo Track made to look like the PS1 version"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m still struggling with William P on this level how to take a break and this is out looking at other peoples attempts"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love/hate Skyway"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It feels so satisfying to hit those drifts and jumps but I just cant do 3 laps without messing up"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Why are you calling it 'Retro Stadium'?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah, I only managed to do it because somehow I can do the Z section pretty good (idk why).\nBut I can not keep the blue fire still so, yeah."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "🥲"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "How much time did you spend on beating it? All that time wasn’t wasted on just practicing that one track; you likely improved a good amount in general, meaning the other tracks are going to feel just a bit more natural"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also nice on beating that one! I thought that one was relatively difficult compared to most others."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Good job, if you can do crash cove you can do a lot of the others"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Just look at it as a way to learn the tracks better and improve, helps take the stress off."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You have beaten one of the hardest ones"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’ll caveat that by saying I have four left to beat (Hot Air Skyway, Slide Coliseum, Turbo Track & Drive Thru Danger).\n\nThe simplicity of the track means there is nowhere to hide or make up time."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah, uh… the challenge from Turbo Track is to keep up with William and that **DAMN Z SECTION.** And Slide Coliseum is actually really simple"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "By just looking and following (or improving) what William does is enough to beat him."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That’s interesting! For me Turbo Track and Retro Stadium were one of the easiest tracks, but Crash Cove… still have nightmares from it😂"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You got William's Crash Cove"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That one may be the second hardest dev ghost in the game, just beaten by (also) William's Turbo Track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trust me that the other tracks will feel simpler, specially the CNK tracks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "They have some of the easiest dev ghosts in the game.\n\nVery well done, pal!\n\nNote: You don't have to beat William's Retro Stadium to get the Master wheels"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can very much skip that one if you want to."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You beat one of the hard ones"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We have an active Discord server where we have different platforms running if you'd like to join, DM me for the link if interested!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tsuppanovah is my gamertag"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "On psn also a discord that people play on too."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We have an active Discord server where we have different platforms running if you'd like to join, DM me for the link if interested!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We have an active Discord server where we have different platforms running if you'd like to join, DM me for the link if interested!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love the aesthetics of just about every one of them, but don’t like Oxide Station because of how tight it is (and screwing up on dev time makes my heart drop), Inferno Island being a replica of Crash Cove, Deep Sea Driving because those wretched fan blades in the tubes, and Koala Carnival that might as well be baby park 2 in terms of a basic design (despite that it’s easy to complete Blue Flame All The Way pro challenge)."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thankfully I’ve gotten the hang of it except I despise the dev time where it has to be tight, but being able to drift in the minefield is doable if you proceed through it properly."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I managed to figure out these tracks (in terms of how you can properly dev time them with Speed)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For Turbo track, you can easily  turn as long as you’re roughly in the median of the road allowing you to not accidentally hit the walls almost every time, and Gingerbread Joyride’s shortcut can allow you to jump off the left side of the beginning of the shortcut immediately after the gate, which could be a hit or miss because you might overshoot it a bit, but it works to nearly stay in the air throughout it."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Some say it’s electron Avenue that’s the quickest to farm coins, and I always thought it was Roo’s Tubes."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you!! 😄 That’s understandable, not a lot of people like this track lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Quando vc quiser meu dotadinho 😘😘😘😚😚😚☺☺☺☺"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm asking which tracks to make and I don't want to decide myself."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Fantastic time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I hate this track so you won't see me do this lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But I'm glad you are enjoying it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Congrats on having a top 100 time."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice run"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’d say the twilight tour"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Especially when playing other people online, I would get smoked every time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Due to not knowing how to use blue fire aka ultra sacred fire or blue turbo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I wasn’t able to maintain that blue flame while driving over the green boost pad"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And while racing ghosts"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Maybe I am bad at the advanced or technical aspects of this game"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro Track for far, I only won by first time after 17 attempts, and I'm an advanced player what makes it even worse for me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drift all the way, better turns and average speed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "what you say \"with some more confidence\" is actually one of the best tips, because for me the biggest challenge in this game is not to lose your 5h1t and stay calm! Not sure what engine you use, but if that helps it's possible to beat the developer with drift engine on this one too in case you find speed more challenging"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Anything else you may need, let me know! ;) I am sure you'll nail it eventually!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That is so nice, thank you! I’ll try it again with some more confidence 😈"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "thank you and I am so happy you found this inspiring! if you need any help on any specific spots, I am more than happy to give tips and help if I can!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Insane! I have such a hard time on this course and you’ve inspired me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "thank you! ;)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My heart was pounding in fear that I thought I wouldn’t."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice work"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I see, fair enough!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm not that great at the game and u-turning is beyond me, so this just seems like a fiddly track without a really meaningful shortcut"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The difficulty isn't the factor though I just don't find it enjoyable."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "cut your corners as much as possible and on the big shortcut when you jump u-turn slightly towards the right direction"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's not an easy track by any means, but there are much harder than this IMHO."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Strongly dislike this track."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It depends on the track, I still use Speed on more than half"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But I still use Drift on a good number of tracks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There are tracks that I used Speed to get better times in time trials"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But for those same tracks in an online race I would still probably use Drift."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That is still not a question"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you watch till the end and get to see my times on this track, you’ll see that I had an 01:30:32 and that was the time I had initially beaten the developer with and it was with drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Then, I got a 01:30:25 also with drift but oh dear not only I had to cut the corners, but make out with them"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Pure pain if you do this track with drift and without the big boy grass cut"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "With speed which is the run I’ve posted here I got an 01:30:08 pretty easily and smoothly (so definitely room for improvement), therefore probably for this one I would recommend speed engine (as much as I hate this engine), especially if you’re not planning to go for the big boy grass shortcut."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It has to do with your router"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Gotta log into it and port forward your console\n\nhttps://www.wikihow.com/Change-Nat-Type"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It means you have Different Nat Types, Type 1 is the best, it is open, allows anyone to join you and vice versa, Nat Type 2 allows you to join 1 & 2 and Naty Type 3 is strict, which restricts your enjoyment in these types of games, quite a lot"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No idea how to change it though."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "While not Nitro Fueled, rumor has it that OG CTR has some news coming from it."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Some tracks that I CANNOT stand are…\n* Out of Time due to its invisible walls that tell you \"FCK your fire!”.\n* Koala Carnival as it's just a boring oval and there's no way to catch up once you get behind.\n* Turbo Track bc of my trauma with William's ghost and how the pads give you little to no reserves at all.\n* Nina's Nightmare, same issue with pads.\n* Dingo Canyon, since its turns are so uncomfortable to drive along"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "They just feel… bad."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm Making CTR tracks in Minecraft for a Mario kart themed world."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "still exceptional either way! thanks for the interaction"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "PS definitely has more players, thus it would probably be lower, I’m thinking maybe top 300 there? I’m not sure."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "very good stuff! does Xbox have fewer players vs PS4 hence the 86th position or would it be similar on PS4 you reckon?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Wtf is this poll asking"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you for the kind words!! A 1:38:56 is quite rapid, more than 2 seconds faster than the developer time, which was hard to begin with"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This puts me at 86th position on the Xbox leaderboard, which I didn’t expect at all haha"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "**Just as a reminder**, it is always a good thing to directly contact developers through [Activision Support](https://support.activision.com/contact-us).\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/crashteamracing) if you have any questions or concerns.*"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "is that race done with drift? well in this case, this makes your run even MORE impressive in my opinion, so congrats again! my PB with drift on slide colosseum is 01:38:56 and I thought I was a \"god\" on this track, clearly not! will get back to it when I go home (stuck at the office lol) and try and grind it a bit more! Also totally agree on your point about reserve management and drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I am position 1507 on PS4 with a 01:38:56, what position does this time get you in the leaderboard? thanks for the inspo!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you! 🙂 I used to hate Slide Coliseum, but once I learned how to play it, I have to say it’s a really fun track! I am using drift in this run, I found the reserve management to be easier this way."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I am glad this has been helpful to you, and thanks for the kind words! if you need any further assistance or more tips on how to beat the dev, feel free to ask me and I am happy to help further if needed!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "love to see videos like these and I love slide colosseum too, congrats!! are you playing with speed on this run?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you for this! I can barely do it with speed only because of the 8 portion of the track where I only managed to keep blue flame just once because of how tight it is to maneuver, and then I see this"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You are a hint of fresh air for this track to me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "🙏🏻"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yo can you shut up bro"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thunder Struck is the best track in the gameee!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Turbo track, thunderstruck, and tiny arena."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks! Slide is a hard track for sure, took me a couple hundred attempts lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I always go for drift mostly for muscular memory and because it's better for keeping reserves, I only use speed for special cases like William P time trials or when the track has too many turbo pads that is hard loosing reserves"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice time, slide is definitely hard with the grass cuts and weird turns / layout."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hate:\nCrash Cove\nDingo Canyon\nSpyro Circuit\n\nDislike:\nTwilight Tour\nNina’s Nightmare\nDrive-thru Danger"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingo Canyon is the lamest track ever"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah, the music for that track is way better than the track itself"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you!! :) I swore I’d never play it again after the dev time, but here we are lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know what you mean, it can feel awkward at times, especially the tire jumps and grasscuts."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Great time, congrats"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I suck at slide, to me it just feels so awkward"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I beat the dev time then never played it again lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dragon Mines because of that BS shortcut"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't want to hear about \"learn to u-turn\""
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's not easy at the best of times and that track was not designed for those kinds of shenanigans at all.\n\nDeep Sea Driving purely because of the blades"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Like.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "how am I meant to reliably miss them? It seems like you have to memorize the cycles relative to each other AND just get lucky that the 2 at the end aren't in impossible positions"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Boo.\n\nI dislike that Spyro track because it's just kinda dull"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "A lot of the new tracks are kinda meh to be honest but that's the lamest of them."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Slide colosseum is such a nothing track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Meh"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dragon Mines and Turbo Track."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Speed, unless I want to challenge myself, then I pick turn lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Pretty much commonly Speed or Drift, depending on how I’m feeling that day."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We have an active discord server for various platforms if you'd like to join"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Shoot me a DM for the invite if you're interested!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ah, yes, I remember that one."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Speed or Drift depending on circuit"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was an Acceleration main before the engine swap feature was patched in because I wanted to main Coco (just like j the original CTR), but then I discovered Speed and Druggy superiority"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Polar Pass has been a tricky part for me, especially that last drum for me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m having a hard time understanding how to angle myself for that last spire boost."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There aren’t any I ‘hate’ per se, but there are some tracks I just find really boring"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Inferno Island feels like a carbon copy of Crash Cove, Jungle Boogie isn’t particularly exciting, and the portals on Spyro Circuit make it physically impossible to avoid hitting a beaker or TNT/nitro crate if someone places it immediately on the other side of the portal.\n\nI’m not a huge fan of Out Of Time either, but to be fair it’s a skill issue I have trying to keep blue fire on this track, and the amount of time it took me to beat William P has caused some resentment."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco Park.\n\nNot a hard track by any stretch but was picked every goddam time when playing online because it was quick for farming coins."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Depends on the track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Mainly speed but occasionally drift."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Speed, always!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Overall, I don’t really hate Hey any track? I’m just still learning how to maximize my steering"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m just now realizing this and I’ve been playing this game since the original and I was in the fourth grade"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I am 32 now and I know this game like muscle memory, but now that I understand ultra white fire it changes how I see the tracks and I just now recently started to understand the air breaking and U-turn like I’ve always done them, but never knew why I would cancel my fire with the air brakes."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I prefer acceleration when I'm playing for fun but I'm best with Speed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I completely agree, he has been part of the Video Game Culture for a long time and deserves like Mario, but between all this mess of big money, rights holders and culture we quickly know who has the last and first word"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We can see this with the wait for CTR Nitro-Fueled on PC."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Speed 100%"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can drive flawlessly in nearly every track with Speed already"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I occasionally switch to other engines if the other guys in the lobby aren't that good or if they run another engine other than Speed or Drift."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I like how it feels compared to speed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Mega Mix Mania, its so bs you have to keep up blue fire through minefields and fans and even with it the shortcut jump is ridiculous"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The ones that after beating all developer times, I still struggle to beat the dev and my PB whenever I go back to play them again: 1) Turbo Track (send help) 2) Megamix Mania (cutting the corners isn’t enough, you need to make out with them) 3) Tiger Temple (I am just not good at it - when I beat the dev I did a 01:30:32 vs 01:30:35)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "4) Tiny Arena (many say it’s the one of the easiest to beat the dev, it’s too long and things can go wrong in so many different places!)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s not a hard one, but boring and hard to not lose fire at any time within 03:08:00 minutes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And 5) Prehistoric Playground (simply because the only way for me to beat the dev is drive with speed on this one, and I hate speed engine)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dragon mine used to be one until I learned U-turn, now it's just drive thru danger and thunderstruck, not only do I think they suck but they're so ugly xD"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was purely Speed until I got about a third of the way through the dev trials"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was struggling hard on Slide Coliseum, so tried learning Drift, which eventually got me through it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "After that, I mainly did Drift, and still Speed here and there."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Turbo track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Lastly, third tip: wherever and whenever you see green bright light below the pumpkins don’t pass through/by it and avoid it by all means as that green light slows you down quite a lot!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Deep sea driving"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Outright"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Who was the psycho one who designed it?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For me not one of my favourites but not one of my worst either"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you refer to the fence shortcut do a little hop on the ground before jumping the fence"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I hate this track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Stupid pumpkins, stupid green slime, stupid shortcut I can't do properly."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Speed, there's no reason to drive any other since u-turn eliminates the disadvantage of poor steering"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The only track that I really don't like to drive is Turbo Track, the layout is really simple, I'm not a fan of going off track through the grass and that infamous S section where you have to rapidly u-turn in the ground multiple times.\n\nThen there's the tracks that I like doing time trials on, but I hate playing online.\n\nPrehistoric Playground with that initial blue fire chokepoint where everyone has powers"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The track is literally a coin toss, if you get hit there you already lost, and if you miraculously don't then it's a time trial simulation since you are probably the only player that didn't get hit lol.\n\nGingerbread Joyride with that tight shortcut after the only blue fire pad in the whole track, everyone just fills it with countless nitros and potions in there.\n\nOverall, I don't particularly like any track with blue fire for multiplayer"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "When a race is close, it all comes down to whoever gets hit first and the race is over (since the sources of blue fire are limited to specific pads in the track, and even then there's usually only one pad that gives you the fastest one)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "90% Drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Used to do speed, but once I changed, it was hard to go back"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I like the little bit of extra handling"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Usually, Drift."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm not fond of Dragon Mines, Turbo Track/Retro Stadium, Thunder Struck, or Deep Sea Driving."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I also hate Tiny Arena, its so long and boring lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I have no formal reasoning but I despise Deep Sea Driving"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I just don't like it.\n\nAlso turbo track and by extension, retro stadium."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also, the shortcut that the developer takes on lap 2 and 3 after the starting line isnt necessary and it’s actually not that fast (so don’t bother learning it)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There are more optimal ways to do that"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The ideal one (and if done right) is to build enough reserves before and once you get there after the starting line, you start jumping and hopping through the grass and then you start drifting immediately after once you get to boost pad aiming for perfect boosts"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also when you hop in the grass, as you land from jumping, you should try getting a boost as you land because the challenge with this is not to lose the reserves especially on lap 2, lap 3 can be more forgiving as you’ve built enough reserves"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "On Lap 2 I did this better than the lap 3 and that’s way my lap 2 was faster."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tip for the fence shortcut: hop once first, then jump"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "As you arrive there and after you’re done with your boosts, make a small hop on the ground (not the grass ideally) before the fence, and then jump."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Jesus christ that ending was close thought you lost it haha nice driving!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That’s insane lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I didn’t know you could do that…"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Makes sense"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It would be so nice though!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You have to ask XBox, but given that Crash has passed through many hands (different studios and publishers), it's going to be hard to use all the known elements of the different games unlike Mario which has always been with Nintendo."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "![gif](giphy|9zExs2Q2h1EHfE4P6G|downsized)\n\nElectron Avenue is the GOAT"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For you it's a Dead Game but what is the definition of a Dead Game? Another one with a bad argument"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "good track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This is something I've been waiting for for a long time, I think it's very complicated for the game to come to PC (unfortunately)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Funnily enough I tried doing a blind race but sadly I couldn't even finish Crash Cove"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There's just too many micro adjustments you need to do to actually stay on the line."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I am dowloaded today i hope not only me playing this game, in PS5"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But CTRNF is a dead game"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks! It needs a lot of dedication and practice for those ones yeah, good luck if you decide to get back to it happy to give tips if needed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Well done"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I still need to go back and beat these times, but I'm now horribly out of practice."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "yup , can confirm after 20 years"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Toujours ! 💥🎮"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "T'as besoin d'un truc?\n\nDE GAGNER!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't have a PS4, but it most definitely runs best on it and worst on my sweet little Nintendo Switch"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Jealous of you PS4 owners."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Megamix and turbo track for me are the hardest ones, but this one is far from being easy, I agree 🥵"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This and Megamix were by far the hardest tracks for me when I was doing the dev trials."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "**Just as a reminder**, it is always a good thing to directly contact developers through [Activision Support](https://support.activision.com/contact-us).\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/crashteamracing) if you have any questions or concerns.*"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I play on switch, but I still think PS4 is better."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Playstation 4 pro or x box one X"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Online is more populated on ps4 though"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's not very inspired it must be said, but I would have seen the three Spyro games on the different portal passages or maybe they were thinking of doing grand prix over several years and offering a Track on each game in the Trilogy Spyro per year? \\^\\^"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Back in 2020 wow! It took me a while to get the game myself only got it last year on my bday, was the greatest gift I ever got myself ☺️\n\nThis one I agree it’s painful, not an easy one for sure and not a one-attempt track! \n\nThank you ☺️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "300+ hours and all the dev times beaten and I never knew about this.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "would made some tracks a whole lot easier 🤣"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I remember when I first did the Dev times back in 2020"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This track took around 3hrs to complete"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It was my second hardest track to Prehistoric Playground initially which took me over 7hrs.\n\nNice job getting under 1:54:00 on this track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always hard to keep your blue fire for the whole track."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That and it’s simply amazing to look at!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Platinum relics are tough regardless of difficulty"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I recommend TheViperian as a great CTRNF Youtuber - I think he has videos to help with platinum relics?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah, this track isn't very fun to me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I recently beat all the Velo times and I had to sit down and learn a handful of the new tracks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This one included"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This is the only one I didn't find a new appreciation for"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's just kinda boring"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeap, I was gonna say, similar to Tiny Arena, this track is asking for drop boost abuse."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I still go back and play on Switch and PS4 from time to time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Still buying stuff from the pit stops"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I truly love this game."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Practice the drop boost tech"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Y'know how it goes:\n* Jump to get a hang-time turbo.\n* Keep holding L/R to start a drift on landing.\n* Drop out of any platform or ramp without releasing L/R.\n* Release L/R mid-air.\n* Hold again L/R to start another drift on landing.\n* Repeat."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The absolute banger soundtrack for this stage makes up for it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Fun fact: to beat the developer on this track you must overlap N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy on lap 3🐧"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s just one jump"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I barely have issues with that track."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s one of the nastier ones yeah"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Definitely It goes without saying drift all the way on this one"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "One of the only tracks I haven’t beaten Velo’s time on"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Would you say it’s easier to beat with Drift engine, than with Speed engine?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro circuit can suck my dick"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "One of the ones that I struggled with Oxide's time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "i still play it, they did a fantastic job with this"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "disappointed that the microtransactions are still there but they did A LOT with this game that i didn't expect and they knocked it out the park."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hated this track lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Good stuff"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "While there are less people playing, it’s not dead"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can find games through matchmaking on PlayStation"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Now, and 4 years ago when the updates were done."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This track might be the hardest one of the meta in hard mode, bc AI is faster than other instances"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But the thing that helps to make the trick is trying to be in first place between the first and second portal (on the first lap)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You have to get the sacred fire with the pad right before the first portal, and use the uneven ground to jump twice in order to get the little shortcut more easily before getting into the second portal"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you manage to get to this point without losing reserves since the start of the race, the rest is just trying to not make mistakes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The another thing that helps to keeping competitors away is dropping potions after passing through the portals"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If well positioned, they are pretty unavoidable for the ones who comes behind you."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ghost of Tsushima was released in 2020 it is now on PC this low argument does not work"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ghost of Tsushima was released in 2020 it is now on PC this low argument does not work"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I just bought this game for my PlayStation and I've been getting full lobbies all weekend, is that just a weekend thing?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I mean, rumors say we're getting a PC port of the og Red Dead, it's  not impossible"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I made sure to grab this one physical"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The most fun in a racing game I've had in my life, second only to Ballistics NG"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Afaik they can't pull a The Crew on this one even if they wanted to."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Physical copies will skyrocket soon since this never got a PC release"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No words needed - Out of Time is a pain"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "IMO it’s the 5th hardest track of them all after 1) turbo track 2) megamix mania 3) tiger temple and 4) prehistoric playground"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Done with drift because you can beat the dev easily with drift if you don’t mess up and if you cut your corners"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Quite happy also I managed to get a below 01:54!!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And it is a challenge"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The majority of people who didn’t play the previous nitro fueled games are going to struggle playing on hard mode for the first time.\n\nThis trophy shouldn’t be extremely hard to get considering the amount of other bull shit things you have to do in this game to get the platinum."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "As with Crash 💥 I did a 01:48:54 against a 01:48:64 but according to the leadership this 01:48:54 was quicker than the one I did with Crash 💥"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always with drift engine, never speed engine on this track as it makes reserves management a nightmare."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trophies are supposed to be a challenge lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah makes sense"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks, it makes sense!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I wonder if there will be a new game…"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I hope we get ctr ‘99 on ps4 and ps5 like how they remade back Toy Story 2: Buzz Lightyear on the PSN"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This and A Bug’s Life would be awesome to play again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Perhaps, I am a sucker for seeing the original tantalising (titalising) designs of the trophy girls/nitro squad again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The game is pure muscle memory to me now, both the ps1 and remaster.\n\nI could probably do a blind speed run"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I tried and couldn't get into It's About Time myself."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I didn’t like Crash 4: It’s About Time either, but the Crash Bandicoot remasters were very well-done and faithful to the originals"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There’s just no pleasing some people, I guess."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Blue fire was a great idea and having the cnk courses with proper ctr gameplay is a dream"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "He hates the modern remasters of the old Crash Bandicoot games that were developed by Toys for Bob and Vicarious Visions and published by Activision, as well as Crash 4: It's About Time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "He thinks that people should play the original titles from the PS1 days instead of the remasters"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "His fangame project, \"Retro Hijinks\", was made out of burning hatred for the remasters"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Plus, he comes off as a manchild about everything.\n\nAnd speaking of Nitro Fueled, I played through all eight of the Grand Prix events in the game, and enjoyed every single rubber-burning minute of them, though I did have some frustrating moments."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "When you reach top level play, every race started to feel like an F-Zero race and it felt so good."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What he was trying to say is that you talk too much"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You haven't changed a bit."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I haven't played online in 4 years"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Every time I would check in to see how online was, DEAD"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Idk if there's a discord or group thread around to play with people, but it's definitely needed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I wouldn't say as soon as they stopped updating it, it has been 4 years since the last update"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "He is on Switch, PlayStation has the most players."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Because I didn’t hit it, if I did believe me I’d have lost it xD"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Considering people have to play the AI on hard mode to get the platinum trophy, It’s a good thing it’s not too hard"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It ain’t coming"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This game came out back in 2019"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s 2024 now lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I had so much fun with the Grand Prix events"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It was always fun going online and racing on the new tracks with everyone."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Game was dead as soon as they stopped updating it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can't find a full race online anymore (PlayStation)\n\nThe ai on the hardest difficulty can still be very easy\n\nThose are my only big gripes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Otherwise it's a great remake+ of a classic"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Im still waiting the pc version"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "How did you not lose blue flame when you hit the wall on lap 3 before the big tube?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nitro Fueled is faithful to the original with a graphical overhaul and more characters"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What more could you ask for? What’s wrong with it?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love it!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That XBox doesn't act like Activision and that they arrive on PC one day."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I would appreciate it if it was on PC.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sadly i can't play it (well, not legally)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "this is at least the 2nd time this dude has made this thread"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "last time he started harassing me in my dms when I pointed out how fucking embarrassing it was lol\n\nand here he goes doin it again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "somehow even more embarrassing than before\n\n[receipt](https://www.reddit.com/r/crashteamracing/s/e0TOdDgbcl)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nitro Fueled wasn't just a remake, it felt more like a new game instead! It will always be one of those games that I'll go back every once in a while, even if I have nothing but Online play"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We love NF!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Bro, read their dev dev notes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "They mention something and they actually did it for the games.\n\nPlus, your fangame objectively sux"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Is not that great as you mention.\n\n![gif](giphy|x4kwwbqmmi6jnDC60a|downsized)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I have no idea of what you're talking about"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Therefore I assume you never had a point."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm not blaming Activison alone anyway"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm also blaming VV, Beenox and Toys For Bob"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "None of them cared about Crash-franchise"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Otherwise we'd have an official Crash-equivallent or two to Sonic Mania by now"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Like my fangame if it was officially released by Activision or Microsoft"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "An authentic Crash-experience featuring the true and only Crash Bandicoot (and Co.), but spiced up with new environments, enemies and gimmicks."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I literally asked you to remind me, that's the point"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm about to boot up helldivers please remind me thar it isn't CTR when the arrowhead logo pops up in 2 minutes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "> “[…] _I still grind PBs in Dolphin CNK.”_\n\nSeems like I do, but it seems like you don't considering you shit unjustified towards subsidiary studios just because their Crash games were produced by Activision, specially NF that got free Bonus content that would've fit in the DLC category, knowing today's Activision standards.\n\nI think your hatred towards Crash comes off Activision, being the owner and producer of new Crash games"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ironic, bc it was Titans and MOM producer (and owner) too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Keep in mind that Activision doesn't have full control over the developing games"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The clear example, Spyro Reignited Trilogy."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Your point being...?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Imma need you to remind me of this every time I choose to play a game that I know isn't CTR"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Since apparently we didn't know that games other then CTR exist"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There is no such town"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Where did you blow in from though? Junk yard? State penitentiary of mentally handicapped?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So do you have ANY appreciation towards Crash Team Racing or Crash Nitro Kart?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You just blow in from stupid town?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You mean yup yup yup"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yap yap yap."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I did, I 101% them many times, I speedran CTR once, I goofed around with CTR cheat codes and I still grind PBs in Dolphin CNK"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thus, I CAN compare ND's, VV's and Beenox's kart games.\n\nThat's how I can tell…\n* I prefer NF over CNK because of the new techs, faster speeds, pretty track recreations and big ass customization that includes new chars, pieces and items from CTR, CNK and even from more niche games like CTTR or CNK2/CNK 3D.\n* I prefer CNK over CTR because almost all chars are viable, it's amazing ost, it's intimidating villain, it's more \"regulated\" reserves system that make items an actual option and I do enjoy every single track in CNK whereas CTR has some of my least fav tracks that I still cannot stand in NF."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm saying it's the only true version of Crash Team Racing there is"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Crash Nitro Kart is good too, but that's another topic"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "In nutshell it means that the genuine article deserves love too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Not abandonce over a name-only knock-off thereof"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I did, I played pretty much every crash game but I don't understand the post, are you saying it's the only good crash racing game?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You never played original Crash Team Racing before?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't get it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What is blud waffling about 😭"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Blursed af"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You never played original Crash Team Racing in your life"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nor Crash Nitro Kart for that matter."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Says the guy who openly asked about the \"Shitro Fueled\" situation, showing that **never** tried Nitro Fueled to begin with"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thus, making comparisons invalid.\n\nAlso, what about Crash Nitro Kart? Just because doesn't have the labels 'C-T-R' immediately makes it a non genuine Crash racing game?\n\nPlus, NF has them too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "**LOL**"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yes! Thank you ☺️🏎️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice run!! Deceptively hard track imo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Btw, this is probably the only logo in Crash series with Crash himself in it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I am a fan of them too! 🏎️ thanks!!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Man, those wheels are obnoxious and awesome"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Great run!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice one !"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drift engine all the way on this one, because keeping reserves with speed is a nightmare and using drift helps me cut the corners more"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also the dev is racing pretty well on this track leaving you absolutely no room for error"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "One of the hardest ones for me."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't know if maybe it has to do with the platform I play on"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I've also seen glitches in the ranking system"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "(The famous rank 0), so that could be a possibility."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drifting (and learning to maintain boosts from pads) is the best part"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So if you're already having fun you're in for a good time once you get it down."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks for sharing! How come on crash cove you have 01:19:42 and #723 and my PB is 01:18:97 and I’m #2100+ something?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice one thanks for sharing!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Oxide turns easy when you learn the turbo boost pattern and gain a little bit of u turn knowledge"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "On the other hand, I think the tracks that could be kinda harsh on Oxide times are Nina’s nightmare and Spyro track (at least for me at that time)."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And Oxide"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My best rank in Time Trial is the same as yours Slide Coliseum at 1999 right now! I did a 1.39.09 last week, but I felt really good at that track I think I can shave a second off soon.\n\nSo close to get kicked out of the first 2000 lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My top 4 maps are: \nDrive-thru danger 01:50:16 #806\nClockwork Wumpa 01:55:16 #801\nCrash Cove: 01:19: 42 #723\nAnd my best Papu's Pyramid: 01:27:73 #590\n(Nintendo Switch)\nI'm working on my crash cove time as I want to be top 10 on the leader boards"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I do not believe the leader boards past #5 is legit"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "As i can not find proof of it anywhere"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But it's at 00:57:46."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Moneybaggs"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The dude could have had the classic $ spinners rims and a solid gold color type."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yes I used Speed to get that"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I use to have a few top 1000 times"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But I doubt I still have them besides Jungle Boogie."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So good! Did you use speed engine to get that?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I haven't played the game in awhile"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But I got a 1:12:87 on Jungle Boogie"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know that was top 600 at the time."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I asked if it had been patched to be harder at some point"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Not whether it was hard or not."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No, once you get the learning curve"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Velo and dev times are another thing tho"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "As far as I'm aware, Hard difficulty was toned down at some point during a patch update"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Though, Hard isn't that hard once you get good at the game"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Increasing the difficulty just makes the AI artificially faster"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Bots still follow AI paths and linings just as the original CTR"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No rubber banding here."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We have detected that your question is already answered in our [FAQ Page](https://www.reddit.com/r/CrashTeamRacing/wiki/faq)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "A mod then will remove your thread after certain time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you think this is false, you can reply to this auto-message and the mods will consider keeping your thread up.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/crashteamracing) if you have any questions or concerns.*"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Elora and Ripto were in the game files (but later deleted), that's why they put them on Crash Team Rumble because they were already ready."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm playing as gorilla monkey anus face"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There’re 4 stages of time-trials"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The first is N Tropy the easiest one (need to know how to keep reserves mainly), then Oxide (need to keep reserves a bit longer and take the basic shortcuts, then Velo (need to keep reserves for 3/4 of the track or more and take the shortcuts) and the final time trial challenge once you’ve beaten the above 3 is the developers (not just one developer, there are 5-6 different developers time trialling if I remember correctly) time trials which will give you the master wheels if you beat them all (need to keep reserves for the entire track, take like 99% of the shortcuts, cut corners to the best of your ability and ideally use the quickest engines: drift and speed)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "❤️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Waaait this is so cool!! So when they made the game the creator played a race and that’s his ghost that we can battle now?? I never knew this , that’s really neat! 🤩"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "To be fair you always end up ahead of me and disappear :D"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It was me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I put it there"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "A new comer! Welcome! Ask us for any help any time!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "> CTR lets you customize for looks without compromising stats \n\nI love that about this game as well."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "While driving, press R1 (or L1 if you are left-handed) and right or left on the joystick (depending on the direction you want to go) to start a power slide, the bar at the bottom right corner of the screen will begin to fill, when it turns red press the opposite shoulder bottom to boost, you can boost up to 3 times in a single powerslide\n\nIn the remake, your wheels glow as an additional visual cue of when to press L1"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can activate that function in the options menu\n\nThen there is the reserves system, reserves are a number hidden from players that decreases every second, think of it as your fuel, You won't stop moving if it runs out, but you will lose speed, You can accumulate reserves by boosting, using turbo pads and the turbo item\n\nIf you build reserves your turbos will last longer and you will be able to chain them with the speed that the turbo pads give you because in CTR there is no speed system like in Mario kart (150 cc, 200 cc, etc.) the turbo pads on each track give you different speeds, the main classification on said speeds is:\n\n-Yellow fire\n-Sacred fire\n-Ultimate sacred fire\n\nThe later can't be chained in the original, You loose your speed if You boost but not your reserves, i'm the remake the ultimate sacred fire was renamed as blue fire and can be chained with regular boosts and if You have the skills, mantain it for the whole race\n\nHope this helps, good luck"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I smell..."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "\\*sniff sniff\\*...."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "console plebs, littering this thread....."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "NICE! Good time on mystery caves! Similar thoughts here, it’s quite competitive indeed and I’m glad I managed to hit the 1000’s on one track but I think that will be it unless I keep grinding jungle boogie and crash cove that are my following two PB"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I think my best so far is Speed on Mystery caves just over 2000 on the leaderboards, can’t remember the time maybe 1:56/57 something? I haven’t been able to hit the 1000’s yet on any tracks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I originally thought it might be fun to go for a world record until I saw how competitive the leaderboards are lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also, I’m on ps5"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I've been using Yaya Panda alot lately lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Any of the girlies 😊"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't remember how many tracks this game has, Mario Kart 8 Deluxe has 96, but half are DLC"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "At least the DLC tracks in CTR were free"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also, I hate that you're pretty much forced to use the roller tires in MK8, CTR lets you customize for looks without compromising stats ❤️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You overuse your sticks until the game registers an input even though you're not touching anything\n\n\nOk press either bumper to hop, then as you land push the stick in the direction you wanna drift"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Press the opposite bumper as the boost gauge fills up"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The higher it is when you press it, the better, but if it fills up completely then bye bye boost"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You'll learn the timing, it's the same with any kart combo."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Wow I'm glad you mentioned that this game actually has much more content than Mario Kart"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm getting bombed whenever I make this statement in Nintendo subs.\n\nAnyway, others told you how to drift but I'd like to add, that in Adventure mode your guardian masks (Aku Aku and Uka Uka) give you hints as you progress and the drifting mechanic is explained at some point."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Once you start drifting, a meter on the bottom right corner will fill up"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Once it goes red, press the R1 or L1 depending on which one you are holding down"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Do it 3 times I a row to successfully perform a drift boost.\n\n\n\n\n\n\n\n\nWhy does the game tell you that in world 2? Should’ve been one of the very first things the game  explains you."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No problem"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Takes a bit to get used to but the speed you can get in this game is INSANE"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's so much fun and gives you a lot of control over your kart"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The brake system is fun too because if you brake in midair during a jump and turn before you land your kart does this insanely sharp turns that make it so that you can turn on a dime"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Super fun game."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks a million"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Really appreciate the help."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So theres two drift buttons.\nHold one to initiate"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Once you're drifting the bar in the corner will start going up, hit the other drift button right before it hits the end and youll get a boost but DONT let go of the first drift button that you're holding"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The bar will go back to the beginning and you can boost again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can do this 3 times to get 3 boosts before you must let go of the drift."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drift engine is definitely my preference too, yeah"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For me it’s choosing either full speed (speed) or quick enough but easier to keep reserves and cut corners (drift)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That’s at least the way I see it !"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice, i as well beat 3/4 of my Dev times using Drift as it's my main playing on the Switch Lite."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah I remember this one being a hard time to beat, for sure."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you! With acceleration it’s possible but it’s a pain"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "With turn I highly doubt it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "To be fair I could do better in this run and get a better time with drift but as you can see I was a bit slower on the second lap as I didn’t cut the corners as much as I did on the third lap"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "IMO Matthew had a good run here so for me it’s def not one of the easiest Dev times"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nicely done, wonder if this is even possible with turn or acceleration"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Congrats, great job 👍 I remember when I beat all oxide times it felt pretty damn good"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ghost of Tsushima is finally released on PC, 4 years after its console version, let's hope that CTR Nitro-Fueled does the same this year."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you play via WiFi, make sure that your PS5 is in the 5GHZ network in the internet settings and if possible set your NAT type to type 1 for your PS5, the easiest way is to use PPOE and change the DNS type to Google 8.8.8.8 / 8.8"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "4.4 DNS or cloudflare DNS 1.1.1.1 / 1.1.0.0\r  \nYou only have to do this in the network settings of the PS5 console, nothing in the router or modem.\r  \nThese changes worked wonders for me and actually solved all connection problems for me, especially with Crashteam Racing Nitro Fueled"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I tried to do this too, joining them and still the same message \"connection failed\" appears"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And the strange thing is that it's only me that this happens, I played CTR on the PS4 normally, now that I've migrated to the PS5 I can no longer accept the invitations."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Seems like I remember the top 5% thing"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Did they also give out season specific decals?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Instead of inviting your friends, join them in their own games"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The servers are potato powered and this tends to happen quite constantly"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Try switching hosts until a game can start, them, stock to that host for the rest of the games."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Beenox can suck shit"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yet another shit company ruined a classic…………"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It doesn't appeal to me either but ut's the fastest way to get wumpa coins."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "True true, for some reason the online doesn't appeal to me much, I just like to time trial and improve that way"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The fun part is, if you beat the dev times, you'll be in the same skill range as the online people"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm in exactly the same boat, stopped about mid 2021 and picked it up like a week ago, not bothered with online because I know I'll get cooked so I'm going for plat trophies and all dev times :)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We've been asking for a PC release for years to relaunch people who still want to play it (because some no longer want to and can't take out a subscription for Online mode), but Activision doesn't give a damn and with the buyout by XBox doesn't seem to want to move things forward"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So the only people who continue to play the console versions are people who are in Speedruns or who do professional tournaments with each other"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But hey you have to keep asking."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You haven’t missed anything"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The game just died after the last update released, and Crash 4 came out."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Honestly I’m the same, I hopped on after a long hiatus only to find the community dead lol\n\nI think it’s just the times, people grow bored or"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’ve into other things.\n\nThat being said there is still very much a tight knit community in this sub, most trying to beat developer times."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m sorry if this is dumb because I haven’t paid much attention to this game in a while, but didn’t they patch this shortcut years ago?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sure, I'd be interested in Switch exclusive lobbies."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Theviperian has a video showing how to do it constantly"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "none, it's not that deep."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I wish i could show you how to but i can't send any clips or vids here"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But i can explain to you that right after you pass the finish line you drift to the left & boost x2 then soon as you reach the edge of the cliff you have to jump."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "timing is very essential or else you will fail"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It takes alot of practice lining it up but its easy when you do alot of it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Would you be interested in joining a Discord Server? We play daily races there as well"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Let me know & i'll provide you with the link!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "**Just as a reminder**, it is always a good thing to directly contact developers through [Activision Support](https://support.activision.com/contact-us).\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/crashteamracing) if you have any questions or concerns.*"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm a switch player."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Despite how silly the kangaroo in a straight jacket is, I still have to represent \"Box nation\"."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So even i were to buy the game in 2024, i would still be able to go into the shop?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm playing CTR right now but PS1 lol 😂 just finished the 100% with the platinum relics"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you are using ps app"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can watch video i send you from ps."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If we wanted to play a 1:1 CTR remaster, we would've bought it on the PS3 or *\"Buccaneer\"* around the internet for a ROM, and that's exactly what we did… for 20 years"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We wanted a **remake**"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "We got a whole new game instead."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You don't believe in true Crash Bandicoot?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "All the more reason for Shitro-Fueled to be a direct port/remaster of the original Crash Team Racing INSTEAD of a pale impersonation thereof full of misconducts that it is now"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And people who prefer and appreciate Shitro-Fueled over the true Crash Team Racing aren't true Crash-fans to begin with!\n\nBesides, isn't Shitro-Fueled dead like Team Rum-BLEH is?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Penta is Blizzard Bluff, although the others probably don't have home tracks.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "you could argue that Mystery Caves is Fake Crash's home track, but there's not much relation between the two at all; and N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy, either Turbo Track or Slide Coliseum I guess."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You are definitely onto something there please keep going I want to see what you come up with"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ok thanks, noted"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I didn’t originally realize the AI disdain on here"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The next one will be original art 👍"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can't afford Ps Plus otherwise I'd be online, but I am playing it offline"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Describing the disdain for AI art as \"complaining\" is a little reductive.\nOP you had a good sentiment but a lot of people have misgivings about AI"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I think I would mean much more to the community to see artwork you did yourself and are proud of!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Bc Nitro Fueled is more recent and has Online multiplayer, which enhances the experience and, thus, makes it more popular"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What did you expect?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "![gif](giphy|xUA7aM09ByyR1w5YWc|downsized)\n\nJokes aside, there are way too many posts about Shitro-Fueled and barely any about the true (and only) Crash Team Racing"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Or Crash Nitro Kart for that matter"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Haha I know how frustrating it can be but that’s how it feels so good once you’ve actually done it! I am on PS4 not sure if it’s possible? Send me anything you like on IG and I’ll give you tips if you want"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I play 2 hour in day"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I try beat dev time 1 hour and throw controller :) half hour ago i couldnt stay calm and i forget how to do u turn :) and close ps5"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you are in ps can i add you ? I can send you video and you can tell my mistakes."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "ತ⁠_⁠ತ"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My time zone is UTC+2"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m on GMT time but can’t say I’ve ever even heard of it to be honest."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Cheers - where abouts are you just for time zone reference?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "?tahw"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So, there’s actually 1000 milliseconds in 1 second, which means the game rounds up or down"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You may have got 679 milliseconds while your brother got 676."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Cheers! 🔥"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For time trials someone light (spyro, megumi, polar etc)with the standard car and for chilled runs or personal time trials the penguin with the master car 🏎️🤍 (I think that’s how it’s called? The one you get after you’re done with oxide)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I haven't played Crash Cove in a while, but it one of those tracks where the Dev time is only a few seconds off the WR"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So you really have to play this track well"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So yeah it was a excellent performance."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks! Really had to cut those corners 🥵"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Very nice run"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Very good time on Crash Cove."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That model of Crash reminds me of that one fan game."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "CTR is hard honestly, another tip for these time trials is to stay calm"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Most of the time I lost it was because I was extremely nervous and couldn’t think / play with caution and a clear mind."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks! If you see until the end of the video you’ll see that my best time was 01:18:97 but unfortunately I didn’t film that one therefore posting my second best 🫣"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "^what?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm oxide/velo player(I can beat them but still hit wall)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Every map challenge for me :)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Very fast, it seems very difficult to get under 1:19"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Well done keep pushing and I’m sure you’ll make it, this one is supposed to be one of the easiest to beat the developer on"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Not for me, I found other tracks being much easier than this one"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I will check your ig videos"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I tried S section with uturn and jump"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Now i can do it without lost speed but i need catch dev ghost after S section He is 1-2 second faster than me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sometimes i catch him but small mistake and fall behind again."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thank you very much!! As you can see at the end of the video, my best time is 01:18:97 but unfortunately I didn’t catch it on a video, probably in the future  ☺️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "1:19.01, nice!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "antonis.apeshido the name of my instagram"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "U-turn in and then keep hopping until you get out of there"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you want I can upload a video playing on tiny arena beating the developer"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I post everything on my IG, just haven't posted yet a video on tiny arena but I can do eger istersen."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "%90 i make perfect boost"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I will begin with uturn and finish with jump ? What is IG ? I'm use dritf for this Map ."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "nope let's keep this game alive! playing on PS4"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You know what? I've tried that but it does not work :(\n\nThe only way to correct it in my experience is to beat the record again! \n\nIt works but, can you imagine doing that when the record is pretty optimized?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "didnt pay the dlc for +1sec advantage xd"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Depends on your timezone and if you use Parsec"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "[https://www.youtube.com/watch?v=fTJh-8I3IBQ](https://www.youtube.com/watch?v=fTJh-8I3IBQ)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "make sure you have enough reserves before getting there"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "When you build your reserves make sure you see \"perfect\" and not just \"good\""
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also, if you use speed to beat it, don't"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Use drift and the flames will be gone much harder than when using speed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Once you've built your reserves by doing perfect boosts, when you get to the S section you will have to play doing a combination of hopping and u-turning"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I haven't posted a video on tiny arena yet, but if you want check my IG account where I post reels with my runs and I mention below the videos if I used speed or drift."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "How did you pass S section on map in tiny arena? I always lose speed there."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I used to always be Dingodile on the original PS1 version, but since you can change your driving style to any character now I’ve switched to Komodo Joe being my main in his Wizard get up"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You need a solid lizard wizard on the track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sorry"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always sad to see AI art on my timeline"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I mean from the original game it's coco but in nitro-fueled it's still coco but since they announced trophy girls in that game it's megumi bandicoot"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Reddit is full of miserable people that need to complain about everything, don’t you know?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sometimes I think it just takes a while for it to upload the time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’ve had it happen before where it seems to take a while to update the new time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Try coming back to it later and see if it updates"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also has one of the craziest wall-riding glitches in the entire game with a low skill-ceiling to master it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Lookin at me like I gotta spend 5 nights at his pizzeria"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nah you’re good, I totally get the general dislike for AI art 😆"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Oh"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Welp"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I guess I’m sorry for being rude."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sorry, just trying to spread some fun on short notice 🤷‍♂️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Your mother would be disappointed in you for using ai art💀\n\n\n\nSorry, but this isn’t really welcome here, even if it had good intentions."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro ftw"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That's my boy"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My main I used to beat all dev times."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I main Yaya just because I like pandas."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ami Bandicoot"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Best character! 💙"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you guys wanna join an active Discord to play daily hmu for the invite link!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Would you be interested in joining a Discord Server? We have some people that also play as well so you can farm more"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Penta, parrot skin, always"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was always bothered that he had that orange kart in the original game - so I LOVE the simplicity of giving him a matching teal retro kart in the remake!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That's what I'm running currently lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ripper with Drift is what I usually do!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love Ripper Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Oh that makes sense"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My main is spyro"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ok great 👍"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Im a Ripper Roo loyalist"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There’s 2 Rilla Roos - One dubbed Rilla Roo (large high mouth and a goatee) and the other dubbed “fixed” Rilla Roo (lower smaller mouth and no goatee)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Remember when the internet bullied paramount into changing how sonic looked (for the better) well that happened with Rilla Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And the Fixed version is closer to his original/only appearance in Crash Bash."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What's with the fixed thing on Rilla Roo?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Koala Kong, Rilla Roo (fixed) and Nina!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro, Liz, or megumi"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My killed my Switch, but my Main has always been Crash."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sure, I'll send you a friend request let's see if we can farm soon"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My main since 99 has been tiny"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile since the first game and now Fake Crash as well."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I still play"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Crash because he was always my number 1 but I use Pasadena and Crunch sometimes"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I usually cycle thru alot of characters tho"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I like Goth Coco aka Dark Coco"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco Bandicoot forever"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Almost exclusively have played Zem since the game out, but as of late I also use N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trance and Fake Crash a fair bit"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks for this!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Purple Crate Box"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "😂😂😂"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Forever and always an Ami main 💪🏻"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "YES, though other way around for me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Used Tiny a lot to start with, moved on to just picking whoever i felt like across the roster qfter a while (always in speed tho)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always Crash Bandicoot in his Biker Gear!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always Crash Bandicoot in his Biker Gear!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always a toss up between Pura and Coco"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Penta Main🔥🔥🔥"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ripper roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For some reason I’m usually always drawn to pick Fake Crash.\n\nI’ll sometimes want to pick Von Clutch but half his charm was his original voice, the new one doesn’t do it justice"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N trance 🥚💟 been my main since childhood I’ve always thought he was so adorable idk why loll my silly lil eggman"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There are actually alot of players on the Switch, we have an active Discord server dedicated for it as well as other Consoles"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Looking for more players to play with"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trance"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Space Chicken using Velo's Chopper - Why did the chicken go on a space walk?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBwakuseeeee"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Started out maining Cortex, ended up maining N Trance"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Me too! Maybe we see each other online😎"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Is it that dead?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm on right now"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Perhaps player 3 took way too long to complete the race"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That or in +3 split-screen games, the last players just ends the race as DNF."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah for ps4 and ps5 I believe it’s cross platform"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Anytime I can’t find anyone I back out, select private lobby and then go back to matchmaking and that seems to help reboot it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Could be a placebo but I’ve had success doing that"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Other times it seems like you’re caught waiting in between games maybe"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nitro crate or king chicken"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Was always roo back on ps1."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yes you are, so quit while you're still stable"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And play the TRUE Crash Team Racing instead  \n[https://upload.wikimedia.org/wikipedia/en/4/4f/CrashTeamRacingNACover.png](https://upload.wikimedia.org/wikipedia/en/4/4f/CrashTeamRacingNACover.png)\n\nOr Crash Nitro Kart"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Started with Tiny then moved on to Ami and stayed at that 🤣"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was PS5."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "this is a cross-platform game though, right?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I still main my good ol’ Ripper Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I swap between Coco and Nina."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "my main is n trance-"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Fake Crash doesn't have any skins I'm fond of \n\nso I go with the Winter Spyro skin."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always Ripper Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Respek"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't see this character enough"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sometimes I pick him just because of that."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I did main Crash, but decided to main Isabella"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love the French accent, and I don't have to deal with whooping and yelling all the time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The purple exclamation mark crate if I’m doing time trials so I don’t get distracted with the characters voice"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Otherwise it’s always Liz."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile for most of it, although regularly play Crash, Penta, and Nina"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Play a little of everyone though."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Been using the iron crate box since i unlocked it lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Evil Crash with the oil spill skin, or Nash"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It do be like that, most likely these folks just crossed the finish line at the same time."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco, always since ps1"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know that, I saw the picture, and managed to immediately forget what I saw before I even started writing the post because I'm an idiot"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "😂"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can't play split-screen in online mode."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Usually play private my with my sisters online to maximize wumpa earnings"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "the william p character and spyro"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Were you guys online? This looks like when the players get disconnected from each other at/before the end of the race, and the game displays Player X instead of the username."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Rilla Roo.\n\nWINS."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spiro gang"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Black spiro with black champion kart and master wheels for me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m a purist, I still pick Crash… 😅"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There is hidden beenox crates in all track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You need find and break them."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My main since 1999"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "How do you unlock the iron box skin?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My main is Ami.\n\nWhen I first started I would use Crunch or Tiny, but I decided I preferred using racers that weren’t so big because it’s easier to see around them."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I've always been Tiny, since PS1 days"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was always tiny and my mate was always pinstripe in multiplayer, or N Gin for the story."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My man"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Liz 😅"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Real Velo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I like his quotes taunting other racers."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Usually Crash, Crunch or Spyro."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Shiba/skunk Crash or Isabella my beloved"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Spyro with the space outfit!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Polar"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ami"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Big Norm"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Koala Kong"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's like his body was made for Karting given his tiny legs"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "How did you restarted your console i have the same problem"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Polar forever"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Boy here who chose Crash at 8, now also a Coco main for twenty years."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Golfer big norm 💪"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Pura, he's just too adorable 😭"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Iron checkpoint crate"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Always been dingo, even in the original"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N.gin since Crash Nitro Kart on the PS2"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N Gin!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ami or Liz were always my go-to's    \nespecially after you could change their engines so I could actually use Liz lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco ❤️"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Pinstripe, always"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Megumi, Tawna, Coco or Isabella, I usually switch between some of these."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I literally played race with 8 people yesterday"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can confirm there are people playing."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nitro crate"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Penta Penguin & Ripper Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "During PS1, I always picked polar! Until now I still pick polar."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Iron box, liz and King chicken"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The Goth Skin for Coco is so cool looking"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Polar, Penta, Small Norm, Nash, N.Trance, and N.Tropy are characters I normally go for."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There is no one more loyal to their main than a girl who picked Coco when she was 6"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That being said, Coco"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco bandicoot for life"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Both ps1 and nitro fueled"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yaya Panda ftw"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My main man is the good doctor"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dr"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Neo Cortex."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Can hop on so we are two ppl in the whole world"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m playing CTR Nitro Fueled."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Which console? There’s people on PlayStation, including me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Just finished several games."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "lol I’ll be sure to upload Turbo Track next to be consistent 😆"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I notice you have Tiny Temple too on your channel"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The first video I put on my channel was Tiny Temple then Crash Cove lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's funny we share those same 2 tracks first"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But hey I hope you reach your goal of under 1:19."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Awesome, thanks for the tip and video"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m never confident I have enough reserves lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hey good job beating the Dev, I have a video of getting under 1:19"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I would say a big thing near the end is trying not to really go on the boost pads again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I did on the 2nd lap  but it is not necessary"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The only boost pad you really need to touch is the first one in the track and that's it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That will help shave off time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You really want to be close to the walls during that section at the end.\nhttps://www.youtube.com/watch?v=XsjiY4VfewQ"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tebrik ederim."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah totally doing those time trials helped to improve the skill level a lot"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If it wasn’t for it, probably my level would’ve been as good as Velo’s"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And I agree, managing to finish quicker than the dev with drift or anything else other than speed depends on how well you can u-turn and cut corners so yeah skill level again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s all very personal Anw when it comes to these time trials, everyone has a different experience"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My “weird” cases are coco park and ….tiny arena… yes you heard right Tiny arena being quite hard to achieve a good time in, and that crash cove was way easier for me than others"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "For instance if someone asks me to beat the dev playing crash cove and coco park it would probably take me 1 or 2 attempts to beat crash cove and probably 10-20 to beat coco!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't remember all of it, its been 2 at least since I finished it but I think crash cove was the hardest one for me purely from a time perspective, it was also my first so idk how I would do after doing all the rest.\n\nMost of those I found hard were more skill issues like u-turning corners properly, in crash cove I felt more capped by the speed itself, if that makes sense ? Can't describe it better"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Doing the TTs really levels up my skill back then though"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Congrats on doing all with drift, however I would def not call drift comfortable on tracks like Koala Carnival!! 😅"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I beat dev last night"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drift is definitely possible, since I did all on drift.\n\nTechnically Accel is also possible, but I think for crash cove it's like 2/10th of a second slower than Accel WR"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "At least it used to be idk now.\n\nAccel is definitely pushing it to the limit but drift is \"comfortably\"on all"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hot Wheels Unleashed 2 is actually a pretty big improvement over the first one"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I recently played it and got the Platinum, but I still have some challenges to do and a few secret vehicles to collect"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The drifting system is really fun and rewarding, the car customisation is great both in a practical sense (changing car perks/stats) and aesthetically (user made livery system with hundreds of paintjob designs for each car), around 160-170 vehicles from 6 different classes), and the game modes are a lot of fun"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There is also a pretty active online community and it never takes longer than a few seconds to find a match"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "On top of that, the track builder/share is probably the best I've seen in any racing game which really adds to the already pretty large selection of tracks and environments"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The game opens up even more when you realise that you can build cars to fly over large distances using the boost in order to perform skips on certain tracks/waypoint missions"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Some speed runners have finished entire waypoint missions without their car ever touching the ground."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Haha same"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I actually just jumped on today and beat another dev time and called it a day."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I used drift as well for a lot of them"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I only have like half of them beat but I stopped a while ago because I was just getting annoyed and my hands were hurting 😂 I know I can beat them but because the game died I lost motivation to continue"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This gives me hope"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I hate trying to keep blue flame with speed."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That is cool you mostly used Drift, they are all definitely possible with Drift, but I still used Speed for like half the tracks when I first beat the Dev times back in 2020"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But yeah Drift is very helpful on certain tracks and I still will only use Drift on certain tracks down to this day."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "let me know if you want me to leave comments on the tracks/spots that developers mess a bit per track so that you know where you can capitalize on."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Roo’s Tubes is my comfort track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It was my favorite track to grind for Wumpa Coins, since it was short and could therefore get the Golden Wumpa to spawn more often.\n\nI played it so much, I can even play the entire thing in my head."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "you don't need the big boy shortcut to beat the dev on polar pass"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I beat him using drift engine without the big shortcut on any lap"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My time was 02:09:13 vs 02:09:99"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hello, use whatever you feel comfortable with"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I personally used Drift on this track and got under 3mins"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know the Dev time is a little over 3:09 here so it isn't to bad as long as you keep your fire for most of the track.\n\nThe vehicle should only face the direction you are drifting"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So I'm not to sure"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But as long as it doesn't affect your gameplay it should be fine."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I will start tiny arena tonight"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Speed or drift is better for that map ? While doing drift boost I jump and look other direction for turn and sometime The vehicle changes direction without jumping"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Is this normal or animation bug ?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Samee"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Been a while since I've played but N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy and Tawna were my go-tos"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I especially liked the white N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy costume with the digital clock."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This is not useful for Ring Rally"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Every ring skipped is fewer points and less time to get more.\n\nFor Time Trials; you take a wider line, and get stuck on the wall for a while, so it's a lot slower than the regular cut"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "However, the other block has the same wall ride collision"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you jump into the very side, you get flung up without getting stuck, and it's a bit faster (\\~0.2 s) because it's a better racing line in the air.\n\nI have the top time on the Switch leaderboards, here is the shortcut in action: [https://youtu.be/4n\\_VbqbJmsM?t=1067](https://youtu.be/4n_VbqbJmsM?t=1067)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Gin Labs\n\nCortex Castle\n\nTwilight Tour\n\nRoo's Tubes \n\nSewer Speedway\n\nTiger Temple\n\nPapu's Pyramid\n\nPolar Pass\n\nAssembly Line\n\nAndroid Alley \n\nI'll stop here."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ps1 penta penguin \n\nPs4 Ripper Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I have a handful I bounce between"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So here's my list in order: \n\n1) Dr"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Neo Cortex\n\n2) Coco\n\n3) Penta Penguin (ninja)\n\n4) Ami\n\n5) Hunter\n\n6) Hasty\n\n7) Yaya Panda"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sewer Speedway was always my favorite as a kid\n\nOthers being Polar Pass, N Gin Labs, Cortex Castle"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I just run the default Crash skin"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Can’t beat the original baby"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "i just got the baby dinosaur character and he’s actually pretty good and makes it so much easier to beat roo’s tubes relic race"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco, and Megumi"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Me personally the Crates"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Specifically, the Purple one."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The checkpoint box"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And not for the reason most of you think.😑"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Great work, keep it up 👍"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile my favorite since ps1 and ps2"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "CTR Tracks: N Gin Labs\nCNK Tracks: Electron Ave\nBonus Tracks: Drive thru Danger"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Same here"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Since the PS1 days, Ripper Roo had been my BOY"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile or penta or crash."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Papu’s  Pyramid, Cortex Castle, Roo’s Tubes, Coco Park, Tiger Temple come to mind!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nina and Crunch"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hunter because I love Spyro and he's my favourite Spyro character."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Great to hear."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yoo my dad and I used to play the OG version too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I played crash and he played cortex"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "He always bitched that the game gave crash the better items haha"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I've been using Tiny Tiger since childhood, but I like Cortex too because it was my dad's favorite character."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Eskimo Nash all the way!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ami"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Love her circus skin 🤣"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Liz"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I've used Cortex since probably 1998"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Despite what my flair says, the iron checkpoint crate (and the variants)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Such a stupid idea but I can’t help to love it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Plus, the shiny texture goes well with the fancy silver paints."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Crash lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nash because he has class (it rhymes)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hot Air Skyway is my favorite.\n\nHonorable mentions are:\n\nCortex Castle, Polar Pass\n\nThunderstruck, Barin Ruins\n\nMegamix Mania"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "After total 4 hour i finally beat hım."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco from the original line up but Big Norm in Nitro Fuelled"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "**ABSOLUTELY!!**\n\n• You can start to learn the basic of CTR through Adventure and win some cash in the process.\n\n• You can play a Single Race if you're not in the mood to grind.\n\n• You can play a Battle if you want to have fun and practice your shots.\n\n• Time Trial and it's ghosts are always there to take a challenge and improve massively at the game and look for a personal best squeezing your 101%.\n\n• You have the classic CTR and Crystal challenges too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Everything stays in the same spots as their original counterparts (excepting Hyper Spaceway).\n\n• And Ring Rally remains here too to fully master your U-Turn skills and win more cash as you complete more and more laps.\n\n• Each time you complete any event (race, battle, cups, challenges…) you get Wumpa coins that you can spend in the in-game shop for swag items like new kart sets, paint jobs, characters, skins, wheels with unique trails, stickers, etc."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy, checkpoint crate, Velo, Penta, and Crash"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Some tracks that I can't stop playing are:\n* Slide Coliseum\n* Tiny Arena\n* Hot Air Skyway\n* Electron Avenue\n* Android Alley\n* Drive-Thru Danger\n\nI"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "CAN'T"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "STOP"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "THE MOOSIC!!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love Spyro too! He has cute catchphrases"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If I'm not using a CNK set, I'm using Fake Crash or Megumi, my besto gal!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I mean I will share my video because I got a 2:03:62"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Maybe if you look at some of my lines besides the big shortcut it can help you probably beat him without it.\nhttps://www.youtube.com/watch?v=D72FUX6gFJg"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "All I would say is that it takes practice and you will eventually get the feel of it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I could show you a video of mine but I don't think it would really help"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It just more comes down to having the right feel"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But honestly if you are fast enough you don't have to use the big shortcut to beat the Dev there"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can use the other shortcut"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "When I first beat the Dev there I didn't know how to U Turn and didn't use the big shortcut but the other one"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was able to beat him though but it was close"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I hope you can get it done."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Chick & Stew (and on some occations Ripper roo & Nina)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Iron Checkpoint create"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "(Patricular the purple skin)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco, N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Gin and N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trance"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dr N Gin 100%"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Gin Labs is a big favorite for me, it feels so good zooming around in it."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yaya Panda"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Rostland Polar\nDingodile\nN Oxide as hot rod\nMotorsport Ami"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trance!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Your favourite tracks are like, all my least favourite tracks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "😂"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Fixed Rilla Roo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Pura and Tiny"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah, I really like that first section where the road splits in two.\n\nOnce you master the u-turn is super fun cruising the track with blue fire."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "When you get Cortex Castle down its so satisfying to play"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "From the original CTR tracks: \n\nTiny Arena, Polar Pass, Cortex Castle and Oxide Station \n\nCNK tracks:\n\nClockwork Wumpa and Thunder Struck \n\nBeenox tracks:\n\nDrive Thru Danger"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Crash for OG, Nina Cortex for Nitro Fueled."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I love using Polar on PS1, and Pasadena in Nitro Fueled"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "N.Tropy"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "\"Excitiiing!\""
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ripper roo has always been my go to"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Dingodile."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So for the polar pass shortcut, iirc more height will come from timing the jump at the peak of the ramp.\n\nUturn, once you have that height and youre in the air, gives you insane control to correct yourself :)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Slide Coliseum is perfect for that"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Shape of the track encourages drifting, but it's wide enough (thanks to grass too) to not punish you for errors."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I practice 20 min same area"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can jump now but fall other side road :) is it possible do big jump without blue fire?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I watch your video"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You didnt jump with u turn"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Just jump and look right side?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I was try press jump and u turn button same time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "After 20 min jump same area repeatedly"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can make jump by %60"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My tip is simply to drift boost so much that driving straight feels wrong."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco park in time trial mode and go backwards"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Aside from the annoying message telling you that you’re going the wrong way, you’ll go infinite on the widest track in the game\n\nAfter half an hour of that, you’ll be better already\n\nPractice one aspect of drift boosting at a time (doing it in the straightest line possible, seemlessly ending and starting a new drift, the timing to get perfect boosts, etc)\n\nThen to git good, time trials are the best method"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "After some time in coco park, you should be able to destroy Ntropy"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Once you’ve beaten Oxide everywhere you’ll have a good understanding of the basics, which you’ll then improve on in your fights against Velo"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "After that, you’ll be able to compete online and start tackling the dev time trials"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That's a really good idea"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The rings will automatically give you the boost to go really fast, so even if you do it you can get back up to speed quickly and try again"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Wait - air u-turning is so much simpler as there’s zero risk of losing your fire"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What exactly is tripping you up about it?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco Park"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The first couple tracks are pretty easy to learn them on"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nsanity Beach for instance not a bad track to just repeat and learn the ropes."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Cortex castle is a good one since it also features sharp turns to get the hang of things imo, but for learning id say coco park if your not very skilled because its baby easy"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’d recommend using one of the wide open battle arenas (like Desert Storm, Skull Rock, Rampage Ruins, etc.)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I used Desert Storm when I was practicing u-turns and it helped a lot."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "To learn your Power Sliding, pick the most simple tracks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Those that don't include sharp turns nor Blue Fire, as you're not prepared for them yet"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Those being:\n* Crash Cove\n* Roo's Tubes\n* Slide Coliseum\n* Coco Park\n* Inferno Island\n* Jungle Boogie\n* Meteor Gorge\n* Assembly Lane (without shortcuts)\n\nAnd my absolute favorite…\n* Android Alley\n\nYou'll know that you've already mastered the very basics of Power Sliding if you can keep alive your fire during at least a single lap."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "hot air skyway is pretty nice if you ask me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Since you have the risk of falling off, it really trains the accuracy of your race lines"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "arguably, one of the nastiest shortcut in CTR"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "imagine, you need to perfect the shortcut in 3 lapses"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "the sleepless nights when i tried to beat this map.\n\n[3yrs ago, never looked back"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "](https://youtu.be/tzeRmsvQjq4?si=XYbszggmSKRJk6bs)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco Park, I think it's the widest track of all and it's a turn left x4 track, pretty easy to drive.\n\nYou can also learn chain multiple slide sequences and accumulate boost reserves"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sewer Speedway is pretty good"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "To me it flows really well and its just a fun track to practise on."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Try ring rally, that’ll almost force you to learn the drift boost and it’ll teach you the best lines to take alongside the shortcuts"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Start with a wide track like Coco Park or Roo’s Tubes.\n\nOnce you feel more comfortable move on to the time trials so you haven’t got the items to worry about and give the ghosts a try."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Coco park and slide coliseum are the best to learn in."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "All of them"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Part of being good at the game is knowing the tracks really well and knowing where to start your turns"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But if I had to say one track for a non-advanced player to practice drift boosting, maybe Coco Park? Its a very wide track so its very forgiving if you drift too wide or too sharp"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I doubt it is bugging out"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "First before you can race against the N.Tropy ghost you have to get a time that is at least close to him"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You will always have a ghost of your best time even if you haven't unlocked the chance to face him"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But if you have unlocked the chance to face him then you need to make sure that you select him so you can play against his ghost"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you beat his time but don't play against his ghost then you won't get a star next to that track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That goes the same thing for Oxide, Velo and the Devs"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You have to play against them to beat their time and then you will get a star letting you know it's complete"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But you can only unlock each of the ghosts after you beat every single one then in order which goes from N.Tropy, Oxide, Velo and the Devs."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That's some bullshit, I feel for you"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yes, all rings are valuable"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This would be helpful for the pro challenges that restart once a month"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Right now, we have a challenge to do 12 laps of ring rally on papu's pyramid"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This (if beneficial) could help cut time on later laps that don't give anything more than 5 milliseconds (lap 8+)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I personally have done this challenge, but I can never do it swiftly on the first try"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It always takes me 15 or so minutes to do it"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I'm always looking to improve my own tactics."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Cool discovery! I haven't watched all that many ring rally WRs, are there any where people actually skip rings to take shortcuts? My assumption is that the time and points gained from hitting every ring is always more valuable"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "solid meme"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "3:24 I believe iirc"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "As far as I remember, Oxide is barely faster on this track"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Can you confirm?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You have the right setup its just practice"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Holding L2 (dpad down) is super important for the uturn, if you go a break turn even a second early without L2 itll kill your reserves\n\nIt feels like a hand cramp to do it right but youll get it with practice, maybe try other levels and ring challenge to get used to the uturns, but you definitely have the right setup just more practice!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ok"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I mean, technically speaking, obtaining the master wheels made me much faster and I'd encourage anyone looking to get better at the game to do the grind"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "But that's obviously due to the practice/training involved in unlocking them, not due to the item itself."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Man I do but that Person could read your comment and say \"Do I really have to farm those wheels to be faster?!\" 😭"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": ".."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I forget that people on the Internet don't have a sense of humor."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Also soo confused by the oxide time thing and the ghosts like the setup for all that is confusing for me! Like I have the lil ghost of my character on most those maps but zero stars on all! 🤔 I’ve been told it could be bugging on my end but yeah that sucks if so cause I’ll most likely have to scrap that load and start anew 😫"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "this being nothing scares me LOL"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Just finished getting the beenox crates and that felt like an accomplishment 😅 I just started online recently had the game downloaded for over a year and never thought to play online! Still only about 30 percent on adventure mode cause I can’t figure out what I need to do next to unlock another area or whatever 😂 I need to look up some vids for guidance no doubt haha!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "the dev times got nerfed"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "apparently they were supposed to be few seconds faster every track but then they decided to make it easier that kind of ruined the \"racing against devs\" idea"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Same"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I played online to unlock the champion cart and wheels when the game was active and then I never touched online again lol"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Single player is where it’s at"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So much to do and it’s fun"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I change my button setting down pad switch to L2 button"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "İt is easy ground uturn but jump need more practice"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I think i try make jump and u turn same time maybe this is problem?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Thanks"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "U-turning is hard with the analog, so if you're using it, I suggest going to the arrow keys (dpad)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It makes the mechanic of u-turning less busy and feeling less clunky"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "(Down on the dpad, and whatever direction you're going to go L/R) \n\nTo give yourself a constant timer for your seals, you can turn map intros off, and they'll be in the same place at the exact times, every race"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The jump is best hit using reserves and not slide into from a powerslide, and using the center/right side of the ramp to make the u-turn over"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Try to get a perfect U, and not a sharp U, because the wall is kinda touchy, and sometimes likes to smack you in the water"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sometimes driving styles can help, swap up between drift and speed, and get acclimated with them both (you'll need both) and see what works for you"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I used drift to beat this map"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I don't know anything about play-share, but if you need visual help, I can post a video of the shortcut being executed, as I play on switch."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Good job, we all have to start at the beginning first with beating N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy so nice job"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I look forward to your continuing progress as you get better."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's so good."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Once you play CTR, Mario Kart will feel too bland."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "God yes."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Man remember that this game Was Created for Single player back in the days ! So the experience is great the difficulty is ok and has some spikes in some boss fights that can be challenging."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yup"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I enjoyed the multiplayer, but it’s not why this fans is my 2nd favourite game ever."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You're just getting started, brother"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Good job on beating N Tropy though! Each round of trials is challenging and teaches you more about the depth of the game"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "They're all doable with practice and patience"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Remember to take breaks or you'll throw your controller"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Eventually, these N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy times will seem like nothing."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No, man"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You're right"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No hate to the OP"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Good job, OP, but you're just getting started! Good luck and have fun beating the next few rounds of time trials!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Nice job! A win is a win."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Absolutely"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The story mode is really fun but nothing complicated and there are tons of time trials."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The good news is that they're just cosmetics"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's at least good that it doesn't affect gameplay mechanics.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Aside from the fact that spiro with the master wheels is objectively faster /s"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "A LOOOT of cosmetics to grind"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Theres quite a few modes too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ring rally is new in nitro fueled"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Adventure mode is pretty fun with a lot of back tracking if you want to complete it 100% (or like 101% or whatever the percentage is lol)\n\nTime trials has a lot of replay value too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The ai is really brutal for beginners, but no match for someone who mastered the mechanics and shortcuts.\n\nAnd just a sidenote, the music is awesome :D"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There are 4 tiers of time trials, N.Tropy - Oxide - Velo - Developer, each harder than the last"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If you put your mind to it you can get it done but it will take a very long time."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Kind of depends on what you want out of it\n\nIf it’s just strictly you playing by yourself, no online, no one sitting next to you, then it’s still a fun game.\n\nThere’s a handful of race types and several tracks and cup races.\n\nThen there’s the actual single player game where you race against the bad guys"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It’s fun, but not ground breaking or anything.\n\nFor me, it’s a game I can have fun on my own, but also both my kids like it and will race against each other and me"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That’s my favorite part."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yup, exactly how I felt\n\nI think the downvotes are either from people who can’t beat the devs or actual homophobes 😅🤣"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I play solely single player"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Its relaxing, it zens me out after a long day at work, and is a great game to unwind with.\nThe game does a great job of rewarding you for getting better"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I would recommend it, at least."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Not really"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The single player stuff is tedious"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Wait, you get velo by besting oxide, right? Guess I still have a lot to learn"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I won't do any posts until I get good enough times on advanced courses after this, someday maybe someday"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I just wanted to get N.Trophy to complete my roster."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "probly going to get downvoted into oblivion but fuck it.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "this is nuthin m8! get back to us when you're at least on velo trials lmao"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah, I didn't really feel like I had a real victory on that track because of that"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If he hadn't thrown the race I wouldn't have gotten it."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The main downside to single player is you don't get nearly as many coins as you would online, making unlocking a lot of the cosmetic stuff really slow."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I play almost exclusively in single player, even back when the game was active"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It's great"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Even the hard difficulty cpus are challenging."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Was just gonna say those 2 that you mentioned were literally the last 2 i needed to complete before i got my wheels"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I never got any practice done on the railwagon shortcut so that i had to perfect before beating him"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Slide was my last as i had to master the art of perfect jumping between the tires as well as the grass shortcuts"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Good memories tho! 😂"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Yeah! There’s two sides to it I guess"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "People who needed that fumble at the last moment (me) vs people who felt a bit cheated"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I feel like slide colosseum is more annoying"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "What about you, what track gave you trouble? For me it was dragon mines.\n\nI feel like I have it easier because I played this game since Christmas Day 1999, so it expedited my progress, but it’s still difficult enough\n\nPs"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "lol who are those downvotes from? Homophobes? 😂"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Turbo Track was'nt all that difficult tbh so i feel you, if the Dev did'nt mess up at the end it might have been a problem for most people."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There is a ton of things to do in single player"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Adventure mode for starters and then when you become a true degen you start grinding time trials"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I think I did everything in adventure mode but I always got 100% for doing everything except all gold relics even after doing everything in the game.\n\nI should fix that just, I'm not good at crate and driving at the same time..."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "😅"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I had such a great time doing these back around the time the game came out"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Did all of the platinum relic races too"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tried getting back into the game when dev times came out but I think the muscle memory was just too degraded by that point, I wasn’t nearly as good and it was frustrating enough that I didn’t feel like continuing"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Maybe one day"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Ah ye, wait a tick."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "i mean't for the newer version of the game.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "ignore me :-)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drift boost like, all the time"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And generally just master the tracks i guess"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Time trials can help you find faster lines/shortcuts"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Theres also this hidden tech called uturning which is really good."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Shortcuts and sacred fire"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Is it normal to have some minor flickering black textures on the left and right sides when using widescreen?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You mean online co-op splitscreen?\n\nWell, before that we have to implement online in the first place."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "If anyone could mod it, where 2 people could play online together, from the same console.."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "that would be great"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "ps - great work with this mod btw :-)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "thank you"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "what you did here will go down in crash bandicoot history."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Incredible."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You’re going to love playing against Oxide…"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’d be down for a race, but I’m in Australia, so I would be lagging quite a bit if you’re American"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Oh you poor soul…"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Cool!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "the goat Polar"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Trying to sabotage crash’s cart, typical Oxide being a cheater"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Great work, keep it up 👍"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Except when you're ahead in 1st place and all you get are beakers and nitro crates when a warp orb comes to hit you, or missiles that dodge those to hit you, or still manage to hit you after a jump but your missiles hit a wall when the AI makes a little hop....."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "From Dr, N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Tropy to William P.\n\nA long way to go mate! Keep it up!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "\"You thrashed me, mate"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "No worries, but you'll soon be up against much worse.\""
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Both nitro point and winning online races would work"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "There was a Nitro Points leaderboard and a Online Racing leaderboard and getting 5% in either of them would net you the Champion kart with Decal."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Oh so it was Nitro Points that determined the leaderboard scores? That makes sense"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I did grind a lot back then.\n\nI guess I misremembered how it worked, so unlocking that Kart body wasn't a glitch after all."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Congratulations! I remember how amazing it felt to finally beat his time on that track."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You didnt have to be good at races, getting top 5% on the Nitro points leaderboard (the stuff that you used to unlock stuff)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "And for most seasons the final unlockable on that was more rare than the Champuon Kart decal for that season and iirc Season 1 my friend got it like 2 unlockables into Gold  tier"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I guess that’s how it’s done now"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "During Grand Prix mode people had to get into the top 5% of the leaderboard by the end of a monthly season."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Maybe that’s how it happened"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I remember a pop up telling me about a Back N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Time decal being given to me, followed shortly by another message saying I now have the Champion Kart body unlocked.\n\nThere’s no way I unlocked it properly, though"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I’m bad at online races because I can’t maintain the fire, so most of the time I’m way behind everyone else"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "The only times I’ve ever won an online race was when my controller ran out of power"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "After switching to another one, the other racers were replaced with AI drivers that kept driving into walls lol."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You did it very well bud"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "In time, you’ll find overall tracks easier"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Congratulations!"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Maybe I need to get a better time than this? But if that’s the case I really wish they’d include the time required to receive the stars 😭"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "[http://192.168.0.1/index.html](http://192.168.0.1/index.html)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Must be a bug if you did the track and did beat the ghost"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "My Trophy and oxide times have stars so it must be a bug"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I can’t get any stars on my tracks even though I beat the ghost ? is there something I’m missing 😭 and there’s so many tracks to complete I really want to unlock the Champion Kart but I don’t see that happening any time soon for me 😩"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "As far as I remember, N Tropy is super close to Oxide time on Oxide station"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Like 3 seconds off or something"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "It has to be one of the hardest N Tropy times if I remember correctly."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Although I do agree that Drive-Thru Danger is cruel for casuals and inexperienced players (took me near an hour to get my first flawless lap), the shortcuts are actually quite easy"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "All but one of them are possible with Sacred Fire."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "That depends on if you intend to challenge the dev times."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I feel like I'm missing something cuz I can't get N.trophy to show up"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I thought he'd be easy since this track is crash heavy, but I guess not."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Drive Through Danger, that place is unforgiving to casuals"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Fun fact, that was actually the first one I beat which got me into the time trials! But yeah, congratulations my guy 👌"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I know there's harder stuff, let me have this W pls.\nCurrently suffering at oxide station"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Who gonna tell 'em?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I thought the champion kart was unlocked by beating time trials, or am I misremembering that?"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Out of Time's Velo ghost is the definition of pain"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "oh my sweet summer child."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "![gif](giphy|IjJ8FVe4HVk66yvlV2|downsized)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "So the Back N"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Time decal was glitched and given to everyone (I believe it is still given to people rn too if they get the Champion kart from the Oxide trials)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Idk about the other stuff but like the 5% threshold on S1 nitro gauge was pretty low like it wasnt even halfway through Gold tier was top 5%."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Keep it up!! It's only becoming harder"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Great and this is just the beginning :-)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Sorry to hear that"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "You can try reporting your bug directly to the developers through [Activision Support](https://support.activision.com/contact-us)"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Hopefully they'll resolve your issue.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/crashteamracing) if you have any questions or concerns.*"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "Add me to sourxdieselsdv"
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "I contacted iron galaxy a few months ago but got no response."
    },
    {
        "subreddit": "crashteamracing",
        "sentence": "This is everyone’s reminder to not click on any links in the comments, unless you enjoy getting scammed of course"
    }
]