[
    {
        "subreddit": "euphoria",
        "sentence": "The idol gave the worst acting performance I've ever seen."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I watched the Spanish version and it was really good!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A lot of those type of shows get cancelled after one season, there was a few of them like Grand Army"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You might like Heartbreak High, the 2nd season just came out"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Gossip girl is wild! I’d say it’s one of two shows that are closest to Euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If you haven’t watched it, and you like Euphoria, I’d say 100% give Gossip Girl a watch! You’ll love it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I love Tell Me Lies and am actually in the middle of a rewatch now in preparation for the second season, but I can’t say I find it to be similar to Euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s definitely based more on romance and relationships (plus the >!murder mystery!< ) and doesn’t really have much of a drug theme, whereas drugs are obviously the entire focus basically of Euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus it’s set in college and not high school so it’s a lot less creepy when they show sex scenes lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I also think Euphoria explores so many different themes with all the different characters almost all equally so we really get to know like a dozen characters and know all of their backstories and their feelings and what they’re going through and everything, whereas Tell Me Lies really focuses on the main two characters and the rest are clearly side characters who we don’t get to know nearly as much"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Both amazing shows, just totally different in my opinion!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I always tell anyone who asks this to watch Elite on Netflix! I can’t recommend it enough"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s one of my all time favorite shows"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s Spanish, so if you don’t speak it you’ll need subtitles (I personally hate the English dubbing so I don’t mind the subtitles, plus I love hearing other languages)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s also just FILLED with hot Spanish people that you’ll fall in love with"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If you decide to watch it, I’d recommend only watching the first 3 seasons, as it really changes beyond that and most of the original cast leaves after that season and it just kinda sucks from there, but it’s literally like a different show because the first 3 seasons are soooo good! Super similar to Euphoria, I think you’ll love it if you love Euphoria :) it has such strong writing and characters, the casting is all perfect, the acting is amazing, and it has a lot of different storylines, so there’s at least one everyone can relate to"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Give it a watch!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Insane post but still better than 80% of other posts here"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Skins UK, Shameless US"
    },
    {
        "subreddit": "euphoria",
        "sentence": "genera+ion except they cancelled it after one season 😞"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yes bro"
    },
    {
        "subreddit": "euphoria",
        "sentence": "heartbreak high (the 2020 one) on netflix!!  it reminded me of an australian euphoria/ sex education crossover, with like each episode kind of focusing on how a character relates to the main storyline"
    },
    {
        "subreddit": "euphoria",
        "sentence": "there’s like a fez character type, a jules character type, a nate character type, etc"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it’s just a really fun show!! :)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Degrades the next generation"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Skam"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It is a Scandinavian show."
    },
    {
        "subreddit": "euphoria",
        "sentence": "It really depends on what u like about euphoria but if it’s for the promiscuity and drama, i’d say elite fs but it all turned around when the recent seasons released"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It was a really interesting thriller show."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Skins is kinda like it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know they did a us version but the uk version was better"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Elite (but only seasons 1-3)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Watch Gossip Girl and Elite (First 3 Seasons Only)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i haven't rewatched for a while so i don't fully remember, but at that point doesn't rue have a bit of a tolerance from the oxy she'd been snorting anyways?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "outer banks, stranger things, riverdale, shameless, idk if they’re similar to euphoria or not but they’re super good"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Skins, heartbreak high, elite"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I literally came her to say this lmao."
    },
    {
        "subreddit": "euphoria",
        "sentence": "everything now, grand army and heartbreak high (all shows on netflix)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What about the show everything now?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You know it's a shame that it got cancelled."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Grand army"
    },
    {
        "subreddit": "euphoria",
        "sentence": "watch it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "-Class of 09 (not really a show but you can watch it like one on yt.) It has really realistic and funny high school dialogue"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The protagonist is basically Rue\n\n-13rw is one of the only shows that touches on real teen issues\n\n-obviously The Idol has a similar aesthetic\n\n-thirteen 2003 also touches on some good issues\n\n-I like skins but I'm not from the UK so the slang/jokes don't really hit as hard"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In fact, I can barely make out a good deal of the dialogue due to the accent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Still great\n\n-Everything sucks! is half decent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sydney Sweeny is in it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's okay I guess\n\nAll in all, nothing beats euphoria in my book"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddie's style but Cassie's color"
    },
    {
        "subreddit": "euphoria",
        "sentence": "try heartbreak high on Netflix you love it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yesssssss!!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "“What does my top 5 say about me?” It says you like those characters, idfk"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol you wish but thankfully not those."
    },
    {
        "subreddit": "euphoria",
        "sentence": "My mom recommended skins uk to me so i’ll try that out too! As well as tell me lies! Thanks yall!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is the closest to euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This and skins uk"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Tell Me Lies which is on Hulu."
    },
    {
        "subreddit": "euphoria",
        "sentence": "House is a cool med show, I’m not into med shows but I like House"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Euphoria is pretty unique in the tragedy that it is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Very high highs and super low dark points with raw human interactions in between centered around addictions"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In that regard I also recommend Dopesick on Hulu or Painkiller if you have Netflix"
    },
    {
        "subreddit": "euphoria",
        "sentence": "grand army is short but so good! and ur welcome"
    },
    {
        "subreddit": "euphoria",
        "sentence": "How is gossip girl?!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thank you! I’ll check it out!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Have you tried shameless?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "skins, and maybe degrassi but the acting isn't high quality, I'd start on next gen"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hey Istalktiktok! Thank you for your submission to r/euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Unfortunately your post has been automatically removed for being too short"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Text posts in euphoria require 150 characters or more in the \"text\" field of your post"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It is recommended that you resubmit your post instead of editing it, as AutoModerator will not know to reapprove your post if you edit it to comply"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If your post is a simple question or comment about the latest episode, consider posting in the megathread for episode discussion or weekly discussions"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If your post involves piracy/solicitation, do not post it, as this is against site-wide rules on piracy.\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/euphoria) if you have any questions or concerns.*"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules has a penis in universe tho even tho Hunter doesn’t"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s how she ends up with a speed addiction, and when that stops working she hits the bulbous ore"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Like the One Direction ones"
    },
    {
        "subreddit": "euphoria",
        "sentence": "nate would find Jason idiotic and pitiful."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie would probably be the first to die"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Both Fez and Ash would sleep with guns"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Or maybe just Ash just to get to kill Freddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And Rue would probably find another reason not to get off drugs and probably OD"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Either that or she would sober up."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Good question"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He’d probably back away slowly and rethink terrorizing these kids… they have enough shit going on."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This was a thought lol the braincells really were rubbing together 😂"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Mushrooms are for more than pizza 👀"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I wonder if Bryce from 13RW and Nate would get along"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean an abuser and a rapist, now that's a duo 💀💀💀 but also I feel like they'd hate each other because they'd thing the other's act is worse than their own"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The opening scene of the Rue special episode"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The whole 3 minutes before Jules leaves and Rue goes back to taking drugs seem so harmonic and are the perfect happy ending Jules and Rue will probably never get to live."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy if it were a different color"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m not sure it’s a real song"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I believe it’s a soundtrack"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But it’s not on the soundtrack"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s very difficult"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And it sucks because that beat slaps."
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’d be like a “I know what you did last summer” x “scream” remix"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is a 6 month old post"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Go touch grass."
    },
    {
        "subreddit": "euphoria",
        "sentence": "In the Challengers movie Zendaya has her breasts out and her legs spread and a guys hand fingering her and that's the only thing covering in between her legs.  Very disappointed in her.  Disgusting"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Are you kidding?  Zendaya is nasty in her latest Challengers movie with the scene with her legs spread and the only thing cover"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Freddy would be AGHAST to see inside the heads of these teens"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He’d go from kids being afraid of dissapointing their parents, their futures and possibly a teen pregnancy to whatever the hell is going on inside Nate’s head"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I would love to see what powers the gang would get in a possible dream warriors scenario though."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Agreed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason isn’t like Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hate eachother"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason wasn't a bad guy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was a kid who found out his gf was brutally murdered, his parents and the cops and school did nothing to make sure he got the emotional support he needed for that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The cops let it slip who was a suspect and while dealing with the death of a loved one, he finds out they're doing nothing about it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He spiraled"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason is just a example of what death can do, especially to hormonal and developing kids who receive zero support."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Same!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What 😀"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I bet they'd vibe they're both assholes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "what if?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate would have the hugest hate crush on Billy and Billy would know it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Me too🖤✨"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Okay as much of a whack ass post as this is… I for sure could see an episode where Rue has a Halloween bender that goes wrong and she thinks someone in a Freddy Halloween costume is out to get her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "About that…"
    },
    {
        "subreddit": "euphoria",
        "sentence": "tryna figure out who would make him cry with the thought they have"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Did recently watch Nightmare on Elm Street 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I wish I was even half as pretty as her ❤️"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is a hard question because I would say Rue at first but now that she’s sober she’s pretty good"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Next I might say Nate but I don’t think he would listen to that or care"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like Cassie deserves to be somewhat forgiven because let’s be honest here: she was manipulated"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maybe Cal?? I don’t know though"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I totally agree, he is so much more than just the villain"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I low-key kind of admire his character because it goes to in depth and shows the complexity of life in an understandable way yk?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "they’d date"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Same"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Oh yeah that's right I remember her sorry I haven't the seen the movies in a while lol."
    },
    {
        "subreddit": "euphoria",
        "sentence": "No, her name is Taryn she had a mohawk."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Actually kinda a lil bit maybe possibly not a terrible idea?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "what has this sub come to 😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Your talking about the character Philip right? the one that freddy cause to fall off the roof of the hospital right?."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ohhhh, you should’ve said “first slide”"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There’s some transphobia in this comment section, so I think people are understandably on edge lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If any thing he’d look at Jason as a puppet"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And it’s clear he has genuine love for Jules, even though he is downright evil to her."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yall really just post anything here huh"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Rue would be doomed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In Nightmare on Elm Street 3: Dream Warriors, they had a character somewhat similar to her, and Freddy wound up doing her in by making her overdose in a dream."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie: IM CRAZIER!!!!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "His interaction with Nate would be as gay as Nightmare 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie is the hot blonde who gets killed in the opening scene and Nate is her bf who gets killed in the first act"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Idk I got it off of Google images and it was already like that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This only took like 2 minutes to type I thought it’d be fun but my bad damn it’s harmless lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why is the Cassie surrogate from Lexi’s play in the second picture, instead of Lexi or Jules or Kat or Gia or McKay or Cal or BB or Ethan, etc?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Who has time to play fictional character superlative lmao"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I didn’t even vote for these when I was in school."
    },
    {
        "subreddit": "euphoria",
        "sentence": "He would have trouble catching Rue, she is resourceful"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Fez could definitely hold is own"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But Ash is not a defensive person, she would head on attack Krueger"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Kid has no fear."
    },
    {
        "subreddit": "euphoria",
        "sentence": "What?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "😭 hell no"
    },
    {
        "subreddit": "euphoria",
        "sentence": "How about fezco and rue?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Krueger’s biggest challenge would be Ashtray"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If he came on the scene with that same look in his eye from that picture, he’d be the new Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "To let you know"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Clearly"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Gotta say Jules , y’all gotta realize Jules grew up as a little kid with self image issues and was put into a psych ward and even cut her own wrists and put on meds for it and still later on as a teen suffers from this and craves male validation to feel like she is a “women” So i gotta go with Jules nothing is worse then your own self"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie cosplaying as Maddy and Nate looking past her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah and it already started happening."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol blame sam Levinson since he's to lazy to give us another season"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Meanwhile I garentee that fanfiction writers already writing the episodes already."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah just like main character Nancy Thompson."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ok that's just weird."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Then why you on this page then if you think this show is ass?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He said Freddy would give jules a penis and some pants"
    },
    {
        "subreddit": "euphoria",
        "sentence": "bruh wtf is ur profile picture 😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "😭😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What happen?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is what no release date does to us"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This show sucks lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But I’d watch this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What….."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don’t have any faith in these mfs tbh"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But if this happened Rue and Lexi are the final girls definitely"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie trying to look like Maddie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "definitely get along"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even I hated Jules"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don't know why everyone was making such a big deal out of her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She's not unique or ordinary"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Honestly, the only character I genuinely liked was Lexi."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Beautiful girl"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And our Fez forever being a boss wingman."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Omg True !! I remember the scenes ! It was also really interesting and sad to see how Maddie was a Mixture between being really confident but then falling in love in with Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She has her own background history which imprinted her with her fam"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The scene with one of her Friends/ Fam Members at the Pool really kept me thinking about her tho"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Her saying something like : „Is all love like this“ :-("
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason isn't racist, you just showed you're more ignorant than he is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Either they clash and Nate gets destroyed or they bond over being toxic alpha male's."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Fine happy? I really couldn't decide between the them"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What about Nate & Billy?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3 should have left before 5 because of the impact that outfit had"
    },
    {
        "subreddit": "euphoria",
        "sentence": "DEFFO 3"
    },
    {
        "subreddit": "euphoria",
        "sentence": ":( so sad she really loved him glad she woke up"
    },
    {
        "subreddit": "euphoria",
        "sentence": "*down votes immediately*"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I've always kinda seen it as this: Nate likes the idea of having a popular, well kept girlfriend for his own image\n\nI feel like a part of him did love her in some sick way but never really cared about her as a person"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jigsaw, he's a therapist type villain"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But where's he gonna get it from?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He would be begging for therapy after entering nates dream"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Everyone’s different, im pretty sure some people get harsh withdrawals from « weaker » substances as well\nGuess you were just lucky if i can say it like that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Screaming and crying and throwing up"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol not really since he's powerful in dreams I doubt it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol Jules could be on his list or even better nate."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Would be cool to see all of them haunted by Freddy would really be a great switch up!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "These kids' fucked up heads would have this fucker running, screaming."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol yeah I know and besides this what if scenario just popped into my head a little while ago."
    },
    {
        "subreddit": "euphoria",
        "sentence": "on one hand  this is a crazy ass post \n\non the other it’s refreshing from the usual “would Maddy have been mad if Nate hooked up with Jules?” musings"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know I'm 3 years late but I'm surprised she didn't say anything to you while she was doing it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Most likely they would f\\*\\*\\*k and then become sworn enemies"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is the best comment I’ve read"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason was just a well-rounded Christian high school jock"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes he was a bully, but he was scared shitless over the satanic panic and what the DnD game was doing to their town"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He just wanted answers in a world that didn’t have any…"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She's just so insecure that she'll do the worst of the worst to herself just to feel loved and like she's good enough"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And Lexi was so out of pocket for her play."
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "* long paragraph * 😡😤😡"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It looks exactly like the outfit Cassie had on when dressing more like Maddy to attract Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Oh yeah Monty definitely takes the cake as the worst of the worst"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Bryce was evil but I don’t see him assaulting someone the way Monty did"
    },
    {
        "subreddit": "euphoria",
        "sentence": "lol I literally just made a comment about comparing Nate and Monty and Nate it cruel, but he’s never that evil."
    },
    {
        "subreddit": "euphoria",
        "sentence": "You could also compare him to Monty but again, Nate’s not that evil"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There’s no way Nate would ever attempt to do what Monty did with that broomstick and dare say Monty may be an even better worse than Bryce for that alone."
    },
    {
        "subreddit": "euphoria",
        "sentence": "And that isn't even getting into Monty"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That kid was a demon"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Idk who the second dude is but for some odd reason I thought the second was going to be Bryce from 13 Reasons, which would be interesting cause they’re on two different levels of sociopathy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "To keep it short, I think they would relate on being assholes to women, quarterbacks, rich, and with girlfriends who were for show"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Where they clearly differ is where Nate is more physically and mentally abusive than Bryce who is a serial grapist who deserved jail time but got killed instead"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We can say a lot of things about Nate is horrible but he hasn’t ever been that evil (yet"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Could change in season 3 when it comes out in 2030.)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I wish they had a chance 💔"
    },
    {
        "subreddit": "euphoria",
        "sentence": "there were a lot of references to it on the show"
    },
    {
        "subreddit": "euphoria",
        "sentence": "trophy girlfriend/wife, virgin, hairless, innocent, etc"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he has a very perverse view of women"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you can see how little he actually cares about her by the time he pulled the gun on her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "any time he's ever tried to \"protect\" her, he was just trying to protect his own self image"
    },
    {
        "subreddit": "euphoria",
        "sentence": "having her makes him feel powerful and in control."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Acknowledging someone regularly commits acts of sexual assault and saying they aren’t that bad in the same breath is nasty work 💀"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What do you Think is his idea of her ? id love to hear your opinion"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I thought he Liked her in a weird way lmao"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nah, just the idea of her and how easily she is to control"
    },
    {
        "subreddit": "euphoria",
        "sentence": "that first picture is so gorgeous"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the color is cassie but the style is maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Do you think Nate actually likes Maddie ?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "there are certain terms that are vague enough that they start being used for anything more than others, but i get what you mean."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate is more similar to Billy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No what?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I thought all the time she knew when she wants to get off the car after them stealing alcohol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hey cmon that’s SEVEN YOU CHEATER"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Borderline-\n\n-love bombing/favorite person\n\n-fixating obsession to the point of delusion\n\n-splitting people black when done with them\n\n-unhinged anger/uncontrollable sadness\n\n-traumatic past causing fragmentation of self\n\n-extreme fantasy scenarios\n\nAnd on and on"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She's pretty much textbook borderline"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She 100% has borderline, if you meant bipolar maybe."
    },
    {
        "subreddit": "euphoria",
        "sentence": "So assuming that the first pic is supposed to be her when she was younger or recently?."
    },
    {
        "subreddit": "euphoria",
        "sentence": "He cheated on his wife and exposed her to STDs"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I honestly cannot believe people who excuse non consensual recording of intimate acts"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It doesn’t matter if they’re meant to be distributed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There’s nothing stopping him from divorcing Marsha and living the life he wants"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s such a cop out to play the whole homophobia card as a rich white dude"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was a shitty parent to Nate and that goes beyond the tapes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A middle aged man wanting to sleep with people half his age is a lot creepier than Tyler hooking up with Maddy."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thanks."
    },
    {
        "subreddit": "euphoria",
        "sentence": "What? Jason was a preppy, Christian, do-gooder who believed he was doing the right thing and saving his town from Demons"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate's a traumatized, violent POS who abuses women due to Daddy issues"
    },
    {
        "subreddit": "euphoria",
        "sentence": "These characters are not the same."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Accurate & sweet"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think Cal molested Nate when he was younger"
    },
    {
        "subreddit": "euphoria",
        "sentence": ">\"But she lied about her age?\" \"NO DOESN'T MATTER SHE'S A MINOR\"\n\nI think cal is a bad guy, cal is a cheater, a bad father, films sex tapes without the other party's consent, negatively impacts those around him, and excuses abuse, and I probably know I shouldn't be here, but on the point of him being a pedophile I'll say this.\n\nI am a 15 years old girl, turned two months ago"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If I made an account on a 18+ dating/hook up website, go to meet up with someone, lie and tell them i'm 22, and we sleep together without that person knowing my real age, would that make that person a child predator? Or would that mean that person simply didn't know"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes they should've checked, but them not checking doesn't mean they seek out children, it means they aren't cautious enough, and though they should be condemned for not checking, they shouldn't be accused of intentionally preying on minors, those two things aren't the same.\n\nIf any of you - regardless of whether or not you're the type to - decide to hook up with someone you met on an 18+ dating app, who says their age is 22, and you sleep with them, only to be out one day and see them say in a school uniform, and realize \"oh shit they were actually a kid\", would that make you a child predator?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "nate would talk so much shit to him 😭😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not Jason but Steve's friends from Season 1 would love Nate."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This could be true for literally any adjective too 💀🤣 everyone in this thread must be 4’2 the way they’re reaching"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please dear preferred religious deity let people be free to use silly words to feel joy and be happy judgment free😌🫶🏼"
    },
    {
        "subreddit": "euphoria",
        "sentence": "> But what's the thing that makes his case way more worse then then when other people do it?\n\nI didn’t?  those people are bad too"
    },
    {
        "subreddit": "euphoria",
        "sentence": "People in emotionally and physically abusive and toxic relationships can have actions that they wouldn’t normally have in trying to appease their abuser or in some chemically imbalanced way in keeping them, which they didn’t show a lot with Maddy and Nate but they DID show with Nate and Cassie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie did all types of crazy shit when her brain chemicals were telling her Nate was the only source of goodness"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Speaking from a I’ve been there perspective."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I ALSO WONDERED THIS I KNEW THAT WAS ANOTHER KID IN THAT FAMILY PHOTO!!!!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I always just Shazam any song I like during a show sorry I’m not more help- you can definitely find songs played during episodes but not sure about by scene"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It was a very interesting shot🤣 it was Faye like realizing the cops were showing up and backing away"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Teachers 🤣🤣🤣"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I was wondering what kind of socks he was wearing 😂 thank you for clearing that up for me!!!! I knew I was missing something because I couldn’t be the only one who noticed his shoes changed."
    },
    {
        "subreddit": "euphoria",
        "sentence": "or I guess didn’t change 😂😂"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This should definitely be revisited in season 3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Tyler should get out"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I actually had the same thought because I was curious about why Ash had tights on but when it panned to her full outfit I realized"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That was Faye wearing the white and red airs"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Crazy, we must be watching the finale together rn 🤣🫶🏼"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They’ve confirmed season 3 !"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Late af to the party but him saying he’d been tattooing for years always killed me🤣"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There's a 99% chance guys you know whether they're colleges or friends have filmed a girl from the back without consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This happened to kat too and the guy spread it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What was your thought process? I bet it was \"this guy is such a jerk\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "But with cal who didn't spread the video you thought \"He's evil\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why? Cause its hd?\n\nI agree its bad and it shouldn't be done"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But what's the thing that makes his case way more worse then then when other people do it?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "they would explore each other's bodies"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Omg we agree"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Wow"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's Almost like I wrote that in my post"
    },
    {
        "subreddit": "euphoria",
        "sentence": "\"What kind of high school is this?\"\n\"Does any of the administration or faculty even review the content of this play beforehand?\"\n\"Are we really going to pretend Lexi is some kind of saint for airing her own sister like this?\n\"This is how Lexi wants to do something for herself for once? By humiliating her sister? No matter how much she believes she deserves it?\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "nate would make jason cry"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They wouldn’t get along"
    },
    {
        "subreddit": "euphoria",
        "sentence": "For all of Jason’s faults, I don’t think he’d be cool with someone who beat his girlfriend."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Wasn’t really innocent bc statutory rape is a thing and he didn’t bother asking how old she was before they messed around."
    },
    {
        "subreddit": "euphoria",
        "sentence": "thanks :) i think it might be bots cuz no other comment got downvoted this much"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah someone like Billy might be homies with Nate but not Jason"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason would hate Nate’s treatment of women"
    },
    {
        "subreddit": "euphoria",
        "sentence": "These comments are odd"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason was obviously a good person who was devastated and unraveled due to his girlfriends death"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He would not get along with Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He would not agree with Nate’s morals or how Nate treats others.\n\nAnd even then, I doubt there would be any personal issues since they’d likely not talk and be in different social circles anyways"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Tbf That entire time period was scared of satanists irl"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Satanic panic began and became huge in the 1980’s and 90’s"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why are people downvoting you, other than disagreeing? I don’t think that kat would wear this, but why do they feel the need to downvote you for having a different opinion💀💀."
    },
    {
        "subreddit": "euphoria",
        "sentence": "She did the same thing in Dune.  All frowns and silly faces.  Her harsh stick is old.  You'd never know she even liked the Paul character the way she treated him.  What a bore."
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy clothes, cassie colours"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hate each other"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ryan Murphy? JK"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean she is extremely charming and cute as a button so there is that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "1) Nate\n2) Cal\n3) Gia\n4) Jules\n5) Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They'd get along so well they would end up touching tips"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes but i focus on that more because that's where peoples prejudice comes from"
    },
    {
        "subreddit": "euphoria",
        "sentence": "When you think he's a pedophile people automatically perceive the other things as 10x worse"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's how the human psyche works"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If a pedo steals something from a shop people will hate or even assault him for \"stealing\" while actually they just hate him for being a pedo.\n\n A guy records kat without consent and shares it to everyone: \"what a jerk\"\n\nCal records and shares it with no one: \"he's a evil man lock him up\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "She also isn't Rue's parent or keeper"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Rue has put SO much pressure and emotional burden on Jules throughout their relationship, she created the codependent dynamic they have"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules has her own trauma and damage and it's interacting badly with Rue's"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think she genuinely does feel she's in love with Rue, so the alternative is to lie and break Rue's heart which her character would never do.\n\nRue has always known Jules was not exclusive with her and was actively hooking up with other people"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They're both selfish in a very teenage way."
    },
    {
        "subreddit": "euphoria",
        "sentence": "^ This! Well said."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why do you keep ignoring all the other things he's done and just saying \"but he's not a pedophile\"? It doesn't matter if he's a pedophile or not, the other stuff stuff applies."
    },
    {
        "subreddit": "euphoria",
        "sentence": "IMO he didn't really suddenly turn into a different person"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was clearly insecure about her sexual past and presentation the entire time and treated her badly repeatedly over it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Criticizing her for \"making everything sexual\" then asking for nudes a few hours later, refusing to admit they were in a relationship, forcing her to trade her revealing costume for his jersey...he wanted a sexy baddie but felt ashamed about being with someone his misogynistic friends didn't respect."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Just wondering, if someone recorded you without consent while you were having sex, would you defend them afterwards or want them arrested? I'm gonna assume this logic only applies if you aren't the one being a victim of someone's crime, only applies if it happens to someone else."
    },
    {
        "subreddit": "euphoria",
        "sentence": ".......did we watch the same episode?? His dad doesn't even cheer or smile when he scores the touchdown"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The first thing he says to him is negative and critical, and you can see how defeated Nate is after being so elated at the game"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The time for the lecture about leadership was after letting him have his happy moment, not crushing all the joy out of him right then and there"
    },
    {
        "subreddit": "euphoria",
        "sentence": "His dad isn't unconditionally supportive at all, he treats him like a hard-nosed coach"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Your kid also needs you to be soft sometimes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This and the speech to McKay shows how much value his dad places on \"greatness\" over goodness"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He also 100% escalated the physical altercation they had by getting macho back with Nate instead of trying to defuse the situation, which was his job as the actual adult and parent.\n\nYou also can't divorce his infidelity from his relationship with Nate because Nate saw his sex tapes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You can say that he didn't intend for that but it's kind of irrelevant because he made them and kept them in the house where his children lived"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He directly, through cheating and lying to them and their mother, severely damaged his son's psyche from a young age.\n\nThere's a reason Nate has no tools except rage to process his emotions"
    },
    {
        "subreddit": "euphoria",
        "sentence": "His dad absolutely is emotionally abusive, he just does it through coldness and withholding most of the time."
    },
    {
        "subreddit": "euphoria",
        "sentence": "def not"
    },
    {
        "subreddit": "euphoria",
        "sentence": "nate is so competitive and he doesnt really have any normal friendships"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Omg thats so true !"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lmao"
    },
    {
        "subreddit": "euphoria",
        "sentence": "2nd guy pretends to be all that tough but the first guy is actually a disgusting piece of shit who deserves to rot but the second guy is just a racist pig who is stupid and ignorant but the first one is an abusive dangerous guy."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I love Nate better"
    },
    {
        "subreddit": "euphoria",
        "sentence": "RIVALRY"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Frenemies, for sure."
    },
    {
        "subreddit": "euphoria",
        "sentence": "too competitive nate hated himself so I’d assume anyone similar to him he’d hate to"
    },
    {
        "subreddit": "euphoria",
        "sentence": "fr sounds like a demonic ritual i ain't watching all this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "jason wouldn’t give a fuck about nate but nate would hate him to his bones"
    },
    {
        "subreddit": "euphoria",
        "sentence": "jason would just be really confused by that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah Jason had loyalty"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate, not so much"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I NEED herrr 😭😭🖤🖤"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They will be frenemies it would be a competition"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I love her with all my heart 🖤"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is in season 4 of stranger things"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Frienemies at best"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The key is the followers, Nate doesn’t really have any friends.Jason had guys around him that were sort of friends, because they wanted to belong"
    },
    {
        "subreddit": "euphoria",
        "sentence": "So nah"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not seeing it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "There’s not one person on earth that Nate will genuinely like"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Stranger Things"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If only Tyler weren't such a dumb little bitch"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate could have been stopped."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Idk if I'd call him a decent guy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He's literally constantly cheating on his wife and putting her at risk for STIs without her knowledge or consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Stealing her chance to be with someone who respects and loves her.\n\nHis other son is an asshole too which speaks to the parenting, and that speech he gave to McKay shows that he probably instilled a lot of toxic masculinity in his kids"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's also fairly clear that he knew Nate did abuse Maddy and still convinced him to lie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is still a complex figure but far, far from a good person."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think people are also sort of glossing over the fact that he's extremely charismatic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He says everything like it's simply an indelible fact"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He delights in deceiving and manipulating people.\n\nWho hasn't been in a situation where you did or said things you otherwise wouldn't because someone with an extremely imposing/persuasive presence was pressuring you? It's very human."
    },
    {
        "subreddit": "euphoria",
        "sentence": "She has the most beautiful eye shape I've ever seen"
    },
    {
        "subreddit": "euphoria",
        "sentence": "right?!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Is the second pick from Riverdale or stranger things?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Doing lines off each others dick"
    },
    {
        "subreddit": "euphoria",
        "sentence": "😭😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She is luminescent, the absolute best part of the show for sure."
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy would wear the whole outfit, but cassie would wear that specific shade"
    },
    {
        "subreddit": "euphoria",
        "sentence": "now that i think about it, maddy would look great in that green/blue actually"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She didn't want to disclose the secret in the first place"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was blackmailing her into doing what she already freely promised his dad she'd do"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules is a kind person who doesn't want to destroy anyone's life, so it was never a question whether she was going to stay quiet"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate was trying to get the upper hand in a game that his dad and Jules already settled."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The carnival definitely doesn't count, he literally said they weren't in a relationship"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's not even clear at this point if he willingly calls her his girlfriend."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also charismatic people like Nate are extremely persuasive because they're so confident and say everything like it's a fact"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's easy for someone like that to control someone who isn't very confident in their own thoughts or ideas."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean I don’t think they would interact at all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate is very, very scary because he is able to flawlessly perform vulnerability"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He did it with Jules too - I really thought he was going to say that he actually fell for her and then the switch flipped"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He's the type of person who will systematically ruin your life just because he's bored and then look you in the face and tell you he didn't mean to hurt you"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And it will be believable."
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's Maddie Style but in Cassie blue!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The sentiment, which I agree with, is that love requires respect inherently; if you do not respect someone (which Nate obviously doesn't respect Maddy), you can't truly love them either"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The brain of a person who is actively abusive is too sick to engage with actual love.\n\nI think he is attracted to Maddy and feels connected to and bonded with her, which absolutely does happen with abuse, but it's a trauma bond"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's not real love either"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He will not be able to love someone until he addresses his demons."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Brainwashed mf"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Honestly agreed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He could’ve been such an amazing character until that happened."
    },
    {
        "subreddit": "euphoria",
        "sentence": "A senior in my school commited suicide and we were close from graduating"
    },
    {
        "subreddit": "euphoria",
        "sentence": "So unfortunately it is quite possible.."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Just turned 18"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And yk what she died"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lied"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Multiple times"
    },
    {
        "subreddit": "euphoria",
        "sentence": "did what willingly? and you’re probably in your twenties your damn self and calling a teenager a scum"
    },
    {
        "subreddit": "euphoria",
        "sentence": "crazy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Massie!  But Maddy should get the credit b/c she was the first to pull this outfit off"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Right? It's been so long since I've seen both seasons."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate would most certainly not like those guys😭 he’d probably find them to be lame wannabes or something considering the type of genuine popularity he has (from being football captain, conventionally attractive, dating a pretty popular girl, etc) he got an incredibly intimidating personality, and simply wouldn’t be impressed imo."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nah she did it willingly and showed zero remorse"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She's scum."
    },
    {
        "subreddit": "euphoria",
        "sentence": "first of all, people literally get coerced into making false statements everyday \n\nmaddie was in a toxic relationship and was manipulated into making a statement \n\ntyler had sex with a minor and instead of getting on the sex offender list he got a his ass beat and a assault charge"
    },
    {
        "subreddit": "euphoria",
        "sentence": "that’s all the context the show gave us idk why ur making a big fight about it and defending a literal predator."
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's still a crime"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy no question"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yeah Jason was just scared of satanists the entire time lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules"
    },
    {
        "subreddit": "euphoria",
        "sentence": "she was manipulated into breaking a law but okay"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah most likely"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jason was a Christian IIRC and wasn't exactly a bully jock and kinda loved his gf"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate having dk pick and abusing his girlfriend and being a toxic alpha would make them hate each other"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Is that 2nd guy the one from Stranger Things? Yeah i don't think Nate would like him tbh he would prob call him a pussy bitchboy or some shit like that yk?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy broke a law too."
    },
    {
        "subreddit": "euphoria",
        "sentence": "> I honestly feel bad for cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hope things turn better for him.\n\nYeah, seeing his backstory really makes him a more sympathetic villain, but he’s still a villain.\n\nThe recording of sex acts without consent is evil"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Our ability to sympathize with some of the difficulty in his life doesn’t negate the harm he’s done."
    },
    {
        "subreddit": "euphoria",
        "sentence": "omggg u rlly do!! 💗 u so handsome hehe 💕"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The girl that Jules hooked up with when she was visiting her friend in the city"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes it is a fictional show and we’re having a hypothetical discussion based on opinion which is why im stating mine so much guess you aren’t familiar with the concept??? Also the discussion about his innocence IN THIS CONTEXT only applies to the crime he’s accused of having committed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also I brought up Jules’ father since it is applicable within the context of my opinion"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Pro tip about me: Im not going to just shut up because you think you’re taking the moral high ground by bringing up the party ☺️ I’m old enough and mature enough to see the grey area in things"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Have peace."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Switch out Maddy for Gia and you have my list"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In no particular order"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Loving these oh if only I had the body to slip all’s that up on my skin omg!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Just because someone says that they want to have sex doesn’t mean that they are giving the other person the permission to do whatever they want"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was rough and she was clearly in pain and he just did whatever he wanted"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That scene makes my entire body recoil because I had a boyfriend who decided he wanted to try anal sex without my go ahead and it’s one of the most painful things I had ever experienced and the feeling of violation is also indescribable (He also didn’t give a fuck and didn’t stop)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I can guarantee *that* is not what Jules wanted"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal started out calm and sweet and it gives the idea that the sex would likely be the same but Jules being uncomfortable is quite clear once they begin"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Consent is something that’s given and can also be taken away"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We are just made to feel like we cannot take it back because we’re leading them on or, at the very least, rude 🙄\n\nBottom line is regardless of how Cal was raised, he’s an adult who knows right from wrong and his actions are clearly calculated."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hey how have you been? I am watching the show rn and was reading the episode discussion."
    },
    {
        "subreddit": "euphoria",
        "sentence": "💀"
    },
    {
        "subreddit": "euphoria",
        "sentence": "For me Fez and Rue's mom are always both on the 1st place"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Her sister did not steal her trauma"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They are sisters by blood"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Same mother and father"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lexi’s father walked out on her too"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She and Cassie share the same familial trauma"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What are you on?\n\nMaddy is not indiscriminately violent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She only fights people who have wronged her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And yes she did Tyler so dirty but she was literally being abused by Nate day in and day out"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We saw him threaten her life in at least two different occasions (choking her and putting a gun to her head in her own bedroom)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He had control over her due to their dynamic, which he knew he could manipulate in order to have her lie to police"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We also saw that Maddy’s home life is also toxic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If we want to use Cassie’s trauma to excuse absolutely every crazy thing she says and does, why isn’t Maddy’s trauma relevant to her behavior?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "this would be a interesting storyline like imagine one of the episodes of season3 like the intro/ backstorys was a glimpse of tylers time in jail and his pov on this situation and since theres a 5 year time jump it shows what he did in jail in that span time and he does eventually get out after 5 years and get revenge"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You want your partner to cheat on you by fucking your mutual friend with you in the house?\n\nHot take but okay"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I do hope things get better for you."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules told the same lie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "People LOVE to forget that both Maddy AND Jules lied to the police and implicated Tyler"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules is just as complicit in Tyler going to jail as Maddy is."
    },
    {
        "subreddit": "euphoria",
        "sentence": "tf is the music playing with this video.."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hunter looks so breathtaking in that first pic!\n\nthe godess that she is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Oh there's no doubt about that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Best description ☺️"
    },
    {
        "subreddit": "euphoria",
        "sentence": ">>He did have sex with a minor but he didn't know"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He didn't rape or do anything without consent (except filming which you can give him slack for)\n\nBro just said he participated the non consensual filming of statutory rape, but didn't do any raping or non consensual actions💯💯"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not just him, Maddy as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Came here to say this."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I can 100% see her as either a cancer or a Libra"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy, cassie doesn’t have a monopoly on blue plus this blue is brighter and less pastel than cassies normal shade"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's in the style that Maddy would wear but in Cassie's colour"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Purple would definitely be Maddy."
    },
    {
        "subreddit": "euphoria",
        "sentence": "it's been so long since i've seen euphoria .."
    },
    {
        "subreddit": "euphoria",
        "sentence": "who tf is anna"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Fax"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's not really how consent works, you need verbal consent for sex even if someone has met for a hookup"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules looks uncomfortable/in pain in most of the scene and then drinks and stabs herself afterwards, she wasn't into it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The scene is also shot in a way that emphasizes the power dynamic, and a lot of the episode focuses on Jules' youth/\"purity.\" And it's revealed later in the series by Rue that she depersonalized during the scene because she was so uncomfortable."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I maintain that I feel bad for teenage Cal, not at all for adult Cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Adult Cal is a monster wearing a human face"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It didn’t have to be that way and he sometimes feels regret for it, but it doesn’t change the choices he made and the actions he took that had long lasting consequences for everyone he came into contact with"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Teenage Cal was a confused, repressed kid who was in love with his best friend, teenage Cal had a shot, adult Cal just took everyone down with him."
    },
    {
        "subreddit": "euphoria",
        "sentence": "No, I'm pretty sure he wasn't and that was Jules hallucinating"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3 makes her look deformed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "my point bro 😭 nate knew that and manipulated that whole situation so it could work in his favor i don’t get why everybody’s mad at maddie and not nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy for sure"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m also talking about his intent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "His * intent*is to portray himself as someone who knows/follows BDSM culture when he doesn’t"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is INTENTIONALLY doing that.\n\nThis idea that UWU Poor Cal doesn’t know better about BDSM because he can’t explore it, is laughable"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not only does he have a whole entire secret life of hook ups, which if he was genuinely interested in BDSM he could have driven into the city and found a BDSM club, if he’s able to use his phone to text and schedule hook ups without Marsha knowing then he’s able to use google"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hell Marsha herself was portrayed as being kinky as shit as a teenager so the idea that Cal couldn’t approach her and ask to spice up their sex life and try it out is frankly ridiculous"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He could have done all of that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But he didn’t want to do that because wanted power and control and to be rough with people who were nervous and didn’t know better, and he fulfills that wish without looking deeper into actual BDSM"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He didn’t just stumble into doing it accidentally."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I was thinking funny comedic character too like dylan o’brien when he was in teen wolf"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The show gets too heavy sometimes and it would be nice to have a likeable and happy character to cut the darkness a little bit"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lesbian witch"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jesus christ are you touched in the head"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassieee"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Minor or not, he still recorded these people without their consent!!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Right like I’m baffled by how many people seem to ignore how terrible that is regardless of Jules’ age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And he did it to a lot of people."
    },
    {
        "subreddit": "euphoria",
        "sentence": "A lot* is two words."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean her mother is an alcoholic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But if like her character to be more explored because she was damn funny in season 2 imo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m talking about intention here"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal could’ve not been well versed in BDSM and not taken all the steps that you listed, but if he genuinely didn't know, I'd still consider that an unintentional wrongdoing instead of active predatory behavior"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sorry I don’t know much about the Armie Hammer situation so can’t say anything about that.\n\nAbout the age range, not sure about that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal could’ve set the age range from 20 – 25 or from 20 – 40 and met the same people we saw on the show"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We’ve only seen 4 of Cal’s sex partners: Jules, a young boy, a blonde in a light blue dress and a flamboyant person wearing a glitter top"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The former two are young but the latter two seem more mature, so for the moment I don’t think we can conclude Cal only targets young people specifically."
    },
    {
        "subreddit": "euphoria",
        "sentence": "An alcoholic character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie is kind of alcoholic but her issues are more related to men than alcohol."
    },
    {
        "subreddit": "euphoria",
        "sentence": "100% maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You are so loud and so wrong"
    },
    {
        "subreddit": "euphoria",
        "sentence": "1"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Tyler never showed any signs of being scared of Nate until  Nate mentioned Maddy age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If anything he was freaked out Nate broke into his home.\n2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy never admitted to sleeping with Tyler"
    },
    {
        "subreddit": "euphoria",
        "sentence": "so if Maddy is a big liar like you claimed, why are you so defensive on Tyler admitting it.\n3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There were about 3 characters admitting to seeing Maddy and Tyler hook up"
    },
    {
        "subreddit": "euphoria",
        "sentence": "4"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If Tyler didn’t sleep with Maddy there would’ve been no reason for him to take an assault charge"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he could’ve easily had taken Maddy to a hospital and got checked for dna"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cleared af.\n5"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why would Tyler admit to Nate that he slept with Maddy but didn’t rape her? His only defense was she didn’t tell him she was 17.\n6"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lastly, no"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We never see people strip off their clothes to has sex like you claimed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You said every line in the book to make it seem like Tyler didn’t have sex with Maddy, but it happened"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You fr tried to make it as realistic by saying we never see “Tyler pull his shorts down”"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They had sex, that’s why the events that happened, happened."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I always wondered about this too bc for how visibly uncomfortable she was it looked a bit rapey but she didn’t stop him nor leave immediately afterwards"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think the crime in question is moreso the non consensual recording if not also her age but grey area kinda bc she lied"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie, in her Maddy era!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "> to be honest I don’t think he’s that well versed either. \n\nThat's quite literally the issue and what makes it predatory/abusive/sexual misconduct"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He's using the guise of BDSM to abuse younger partners for his own personal satisfaction/gain"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's the same shit that got Armie Hammer knocked out of the spotlight (granted though Armie Hammer was doing it to much more disturbing degrees)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He's using and abusing the premise of BDSM to abuse his hook ups"
    },
    {
        "subreddit": "euphoria",
        "sentence": ">Plus, there could also be a possibility that the pool of people he wanted to target (app users + just visiting + didn’t know who he was) tended to be young as well.\n\nYou set the age range of who you want to find on Tinder and Grindr"
    },
    {
        "subreddit": "euphoria",
        "sentence": "So it's not like Cal is simply stumbling into young app users accidentally"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He's deliberately seeking out people in their 20s."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Check out r/DarkKenny"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What does she know about Drake?????"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That is the greatest pride moment for me to watch dolling like me"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That is the greatest pride moment for me to watch dolling like me"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If you have to check to make sure the person you’re hooking up with is of legal age, you’re a pedophile"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also, recording sex tapes without consent isn’t something to give someone slack over, it’s a crime"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And disgusting"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You sound like a disgusting person if you’re defending a pedophile that records people in compromising positions without their consent."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Gosh you’re making me unpack that whole disturbing scene lmao"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes I agree Cal didn’t necessarily go through all the steps of BDSM, but to be honest I don’t think he’s that well versed either"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was closeted, married to a seemingly very conservative wife, and only had one night stands"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In that situation I don’t think he could have a healthy enough sex life to thoroughly research BDSM stuff.\n\nBased on the scenes we’ve had of his sexcapades (and I’m not well versed either, I’m totally judging from the viewpoint of an amateur here pls bear with me) I think Cal tried to be as nice as he could"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He got the other person drinks, he initiated convos, there’s ‘foreplay’ involved"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Again I’m not saying that was enough, I’m only saying Cal did the most that he (thought he) could.\n\nAbout the age of his sex partners, I agree all the people we’ve seen seemed younger than Cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However their ages seem to vary as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "For example, we’ve seen Cal meet up with a sassy flamboyant person (that ended up holding and comforting him)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That person seems to be at least in their 20s"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus, there could also be a possibility that the pool of people he wanted to target (app users + just visiting + didn’t know who he was) tended to be young as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I say that because in his meeting with Jules Cal said ‘I’m envious of your generation’ which to me sounded like Cal didn’t necessarily looking for young people, but rather openly queer people.\n\nAgain I have to stress I don’t think Cal is a saint lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I do think some of his actions have malicious intends, like filming without the other’s consent and hiding Nate’s abuse of Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "On the other hand, I think some other actions of him weren’t ill intentioned, and that makes my view of him more nuanced."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I was abt to write that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Idk man pretty sure filming sex without alerting the other person and getting consent is a form of sexual assault"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And I believe people who commit acts of sexual assault are kinda bad idk maybe that’s just me"
    },
    {
        "subreddit": "euphoria",
        "sentence": "NEED"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Colour: Cassie style: Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": ">About being rough with Jules, Cal’s dating app profile literally said ‘Dominant Daddy’"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s his preference and Jules was okay with it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The main issue here was that she was a minor.\n\nThat's not how BDSM is supposed to work though"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The community mantra is Safe, Sane, Consensual for a reason"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You're supposed to prepare for the scene before hand, it shouldn't take your partner by surprise"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There's supposed to be safe words, and signals, and check ins and aftercare, which Cal fails to do"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not to mention the fact that Cal having rough sex with Jules or anyone else fulfills his own fantasy, when in BDSM you're meant to cater to the submissive's fantasies, not the dominants"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The fact that Cal is largely going after younger people (who are less likely to actually be versed/aware of real BDSM culture) ***is*** predatory and abusive."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal’s biggest issue to me is thinking that his money and connections will always save him or his family…also WHERE IS THE THIRD KID?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is absolutely wild"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal might of been happy with Nate being like Mckay, but a lot of the reason Nate is the way he is is because of how he was raised"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Which was probably similar to how Cal was raised himself"
    },
    {
        "subreddit": "euphoria",
        "sentence": "So if Nate were to be more like Mckay, then Cal would have to break the cycle, or his own dad need to also raise him differently"
    },
    {
        "subreddit": "euphoria",
        "sentence": "(I still believe Nate is responsible for his own actions, not Cal)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Drinking at the formal isn’t straight edge"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy for sure"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No I’m talking about the time when Nate choked Maddy (physical abuse) at the carnival and the police came asking him about it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal met with Nate privately and advised him a bit, so when questioned by the police, Nate shifted the blame to Maddy’s use of molly and her being unfaithful"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal and Nate essentially victim blamed Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's a problem that I think I can’t defend when it comes to Cal."
    },
    {
        "subreddit": "euphoria",
        "sentence": "However about the abuse thing"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maybe I've missed thing but the only thing I recall as \"abuse\" was that little fight they had? I don't think I would count that as abuse tho but more as a fight which nate lost"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Unless you're talking about emotional abuse which I would agree with."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Def Maddie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Damn you worded my thought process better then I did"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I fully agree with you"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The things he has done are bad"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But the other things he had done that could be perceived as evil were done unintentionally"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However many people just want to assume he did it with intent cause they go of \"vibes\" and not the writing the show is trying to portray"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thank you for posting to r/euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Unfortunately, your post did not adhere to our policy on uncivil language/behavior"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please be respectful to other users on the sub at all times"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thanks,  \n\nThe Mods"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I wouldn’t go so far as to say Cal is NOT BAD, but I agree that a lot of his less serious actions were blown out of proportions while the really serious ones were overlooked, which is kinda weird.\n\nOverall, the main problems he displayed on the show are: cheating, being a bad influence on Nate, filming sex tapes without the other party’s consent, having sex with a minor (Jules) and being rough with her, trying to cover up Nate’s physical abuse of Maddy.\n\nAbout the cheating, I think we all can understand why he did that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was brought up at a time when LGBT people can’t be themselves, and as we saw in the flashback, he didn’t even love his wife"
    },
    {
        "subreddit": "euphoria",
        "sentence": "These small sexual escapades are the few times he could be true to his sexuality, it’s quite sad to think about it.\n\nAbout being a bad parent, it’s true he was responsible for Nate’s toxic idea of masculinity"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, Nate’s actions are also the results of his own twisted nature"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I believe in another universe, Nate could’ve grown up to be like McKay and Cal would be totally happy about it.\n\nAbout having sex with a minor, again, it’s wrong, but not intentionally"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules lied that she was 22, and although Cal was careless to not double check, other men in the series had made the same mistake or worse: Tyler made out with Maddy in the pool, Luke Kasten had sex with Kat at the carnival DESPITE her saying she was 16"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Besides, Cal showed much remorse and horror when he found out Jules’ real age, so I think he didn’t actively seek out minors.\n\nAbout being rough with Jules, Cal’s dating app profile literally said ‘Dominant Daddy’"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s his preference and Jules was okay with it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The main issue here was that she was a minor.\n\nSo among all of Cal’s problems, filming without consent and trying to cover up Nate’s abuse are the most serious ones"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The others are bad, but we kinda can see where he was coming from"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think many viewers saw Cal as the root of Nate’s evils, and as someone who violated Jules, so it’s all they talk about when it comes to him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In my opinion, Cal did bad things, yes, but I still feel sad for him, because a lot of those bad deeds come from the fact that he had lived an empty, untrue life, and when you’re being untrue to yourself, your actions can veer off the course and have unintended consequences."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I just wished they had used the flashback episode a different way"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Like highschool in the 90s was super homophobic from what I’ve heard, maybe there could of been a focus on how that shaped how he expressed his sexuality"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal’s homophobic father didn’t seem to have a lot of influence on him and just seemed like an inconvenience. \nHim having mutual hookup with a best-friend he’s in love with as his first gay experience doesn’t really explain why he has such weird sexual fetishes and became someone who has frequent violent high-risk hookups that he films. \nIt’s mentioned a few times in S.1 (I think) that Nate’s meant to be just like his Dad"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But he’s nothing like Cal in season 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal actually comes across quite affable, and despite ‘toxic masculinity’ being a big part of his character in s.1, that’s almost non existent in s.2. \nI get that maybe he’s more open because he thinks he’s caught anyway, but I felt like S.1 hinted at some more internalised shame/homophbia, rather than hiding his sexuality just for practical reasons.\n\nIdk, as much as I liked some of his individual scenes in S.2, when mixed with the story of the whole and the themes and issues already established it just seems like a massive wasted opportunity."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I agree they defenitlty left alot of things in the blue from season 1 and just moved on like it isn't a big deal in season 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Would've been interesting to see how his fetish manifested but I geuss there's still season 3 to learn alot more about his character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also I think he was more open in season 2 cause he genuinely couldn't give af anymore"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Before he had a life to think about"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But in season 2 he thought his life was basically over"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please dont comment if you don't have the brain to comprehend some people have different opinions and that it's probably with reason cause its clear that the show is diving deep into this character with  complex writing"
    },
    {
        "subreddit": "euphoria",
        "sentence": "When youre not funny intelligent or creative enough to get engagement or attention any other way so you do obvious rage bait💀"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like the way they portrayed Cal was very confusing"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I actually think it might of been better if they leaned more into making him a despicable character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It felt like in s.2 they almost wanted to retcon some of the things hinted at in season 1.  I feel like his flashback in season 2 doesn’t really explain why he became the type of person who 1"
    },
    {
        "subreddit": "euphoria",
        "sentence": "likes to hurt people during sex and call them demeaning names 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why he films and meticulously catalogues it. \n\n Cal in season 1 seems like he’s taking out his own internalised feelings of shame about his sexuality on the people he sleeps with, and is pretty callous about it, filming them without consent meaning he obviously see’s them as less-than"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like the focus on calling them ‘sluts’ hints at some sort of twisted Madonna/Whore complex, like he see’s the people he sleeps with as sluts/lesser, so then it’s okay to film them without their consent or hurt them during sex. \n\n\n Cal in season 2 seems open about his sexuality at least to himself, and is hiding for practical reasons"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like some of the more problematic/weird things (ie, the filming without consent and cataloguing of violent sex) are glossed over"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like they made him toooo sympathetic at the detriment of his character.\n\n  I feel like it would of been more compelling if more parallels were drawn between himself and Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ie, taking out internal self-hatred/shame on sexual partners etc. \n\n I liked the s.2 Cal flashback individually but I didn’t like the overall arch of his character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I felt like there was a lot more going on with him than ‘bisexual man in the closet due to societal pressures’"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Seeing sex workers/random hookups as frequently as it’s implied he does, him feeling entitled to film them, hurt them, cheat on his wife that frequently hints at much deeper moral issues than I don’t feel was adequately explored."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also nobody has to react to this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is just what I think and just wanted to write it cause I think many people misunderstood his character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sure thing, bud, you have a good day now."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I'm genuinely real"
    },
    {
        "subreddit": "euphoria",
        "sentence": "How tf is this rage bait? I even give arguments of why I think these things"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You just can't fathom someone has an opinion other then you so it must be fake"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nice rage bait💀💀💀 Everyone, don't engage--these people's lives are boring; they need you to react to their post"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Just let them aimlessly throw their punches in the dark, and move on."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also they had a sex date"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They literally agreed to meet up for sex"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Wtf do you mean he's didn't ask for her consent? She literally  came there for sex and when things were escalating she was fine with it and when things were done she was still fine with it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yall are reaching so bad"
    },
    {
        "subreddit": "euphoria",
        "sentence": "How tho? Cheater okay"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Abuser sure after his sons are fully grown and able to defend themselves and over 18"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But pedophile? There's not a single argument you can give that confirms that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules lied about her age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He can't mind read"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please reevaluate your morals and seek therapy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He’s a sexual predator, a pedophile, a cheater, and an abuser"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It doesn’t get much worse than that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "No you're reaching"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He did check"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He litteraly asked \"how old are you\" and Jules lied"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's Jules fault"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also didn't he lose the tape? How do you know he didn't want to destroy it?\n\nAnd yea he's not the best father"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He passed on toxic masculinity unto his sons"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Oh boohoo what a bad evil man"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No he's just raised that way aswell and him being insecure of his sexuality made him want his sons to be even more masculine"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I already admitted he's not the best father"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But he isn't evil"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is a sexual predator"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He has sex with Jules without checking for her consent (rape), and I think it's pretty obvious in the show that she's lying about her age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He tapes these people without their permission (a crime) and (iirc) doesn't take measures to really hide the tapes or destroy Jules' after he realizes she's a minor"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He enforces toxic masculinity onto his sons and doesn't try to treat Nate's anger issues"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He even agknowledges all of this in his breakdown (\"I'm a sexist, a chaser, etc"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I eat what I kill.\")"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you watch the show and take it as it is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "tyler is SCARED of nate, the man was in the hospital! like he was scared of literally being TORTURED again.\noooh we all didn’t watch the show but you have the audacity to say we never saw maddy and nate have sex ? we did, multiple times"
    },
    {
        "subreddit": "euphoria",
        "sentence": "again, we literally see the underwater scene, they were dry humping."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Just have a dart 🎯 game with his face on it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy wore something super similar in season 1, when Cassie was getting ready to go away with mckay over the weekend."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie's color but Maddy's style"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I'd say its something Cassie would wear while imitating Maddy."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie but trying to like nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy, but Cassie's colour"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Wait why would Jules go to jail for?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don’t think this should be a competition"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However if that card is played I would argue that abuse that threatens one’s life is far more traumatic than emotional abuse"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes, Cassie has been objectified for a long time but she chooses to respond to that by giving men what they want at all costs- even if it means harming herself and her friends in some way"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy has been both emotionally and physically abused by Nate, and we saw multiple occasions of him showing homicidal tendencies aimed directly at her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m sorry but nobody put a gun to Cassie’s head and forced her to take her panties off in Nate’s car and end up fucking him at the New Year’s party"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Side note- why is it that everyone refers to Cassie and Lexi’s mom as an alcoholic but not their father? He had devolved into fully dysfunctional alcohol use disorder"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Have we forgotten the ice cream scene?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even if the truth came out in trial he would still be able to be put away for statutory rape of a minor"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Your point? Lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Painting this situation as the girls putting an innocent man in jail is a gross oversimplification and frankly, false"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nowhere did I justify what was done"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also, absolutely no one here was talking about Jules’ father"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Additionally, this is an extremely fictional show with a lot of plot holes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Somehow, no one questioned how or why Tyler got beaten so badly that he had a weeklong hospital admission secondary to his injuries? And his trial proceedings took place in the immediate aftermath of this event? If we want to argue fair trial, then a lot of the details would have come up in the discovery phase"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Of course we didn’t see the trial and that didn’t happen because again, fiction"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Try to remember that, babes."
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s not really how the legal system works babes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ya know fair trial for the crime you committed and all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not to mention them lying puts themselves in major legal trouble and ensures that Nate, THE ACTUAL PROBLEM, never faces any real consequences for his shitty ass behavior"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And I stand by the fact that Jules’ father fucking LOVES her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And she knew that she could’ve gone to him and didn’t because she wanted to protect herself so again"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules, Maddie and Nate are three characters not deserving of forgiveness in my opinion"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And tbh throw Rue in there for stealing her dying dad’s pills."
    },
    {
        "subreddit": "euphoria",
        "sentence": "YES! Exactly!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Well, of course not, because in that situation you would have a personal conflict of interest"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The reality is Tyler wasn’t innocent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No, the girls shouldn’t have lied on him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It might be true that he didn’t choke Maddy but he did have sex with a minor"
    },
    {
        "subreddit": "euphoria",
        "sentence": "As a grown adult that is very illegal as well as immoral"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It was his responsibility to make sure he wasn’t messing with a child while he was at a party where a lot of high schoolers were in attendance."
    },
    {
        "subreddit": "euphoria",
        "sentence": "✨ pretty little liars ✨"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A troupe I’d like in Euphoria? I’d have to say the Avengers"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But a *trope* I’d like to see would have to be bad boy with a heart of gold"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We’ve had bad boy, we’ve had heart of gold"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Combine them."
    },
    {
        "subreddit": "euphoria",
        "sentence": "lexi?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Because he knows that the guys he wants to impress think she’s easy and he’s ashamed of wanting to be with her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s also why he wrestles with being so sexually attracted to her and also not wanting her to be overtly sexual.\n\nHe’s letting his friends get in his head and is not confident enough to own his choices."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate has status McKay doesn’t have"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Teenage social hierarchies are all about image"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate could date Cassie and if he chose her then she’d suddenly be considered a worthy dating prospect because of his apex status"
    },
    {
        "subreddit": "euphoria",
        "sentence": "McKay is insecure and less dominant in the social ranking so if Nate mocks a girl he’s dating, he gets mocked as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He both doesn’t want to hear that degrading stuff about Cassie and doesn’t want to be seen as a loser committing to someone who is seen as “easy.”\n\nNot saying any of this is right or even logical, but in my experience it is extremely accurate to teenage life."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Would’ve loved to see someone completely straight edge- somehow I think Fez would’ve been friends with one"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She knows that Nate is homophobic (either because of finding his dad’s sex tapes as a child or because he is closeted himself)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is disgusted and angered and confused by the idea of being gay"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Calling him a slur and demeaning (in his eyes) his masculinity and the masculinity of the man who raised him is the worst possible insult.\n\nShe was just trying to get under his skin, which obviously worked."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The fact that we don’t know who spent all that money on her for the private session is still bugging me"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Literally nothing"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I would go outside and enjoy the rest of my 20s and freedom and wouldn't try to rock the boat in a way that lands me in jail again."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is for the best and actually a really good decision he made"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maybe wrong genre but I want like one teenage vampire or witch"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But not as a main plot, just a side thing."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Definitely Cassie pretending to be Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Matching two pieces were never really her style before the whole Nate shitshow"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Colour Cassie, style Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy all the way"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A female Fezco would be badass imo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I love his character, but I feel like a lot of shows have male criminals"
    },
    {
        "subreddit": "euphoria",
        "sentence": "School crackdown on behavior that pushes everyone ina corner"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy’s style BUT Cassie’s color"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The style is giving Maddy but the color is giving Cassie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "😭😭😭😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie pretending to be maddy! 😭😂"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Combo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think this is something Kat would wear"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If it had exposed hips, then Maddy would wear it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy 100%"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’d say cassie being a copycat of maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie pretending to be Maddy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's maddies style but cassies color"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Female villain who is beautiful on the outside but has no soul"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ok so not new character necessarily but I wish they would have developed Kat more especially after season 1"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She was getting into some dark stuff and then all of a sudden nothing? They did her dirty"
    },
    {
        "subreddit": "euphoria",
        "sentence": "when the show comes back they will have already graduated bc sam said he’s doing a flash forward"
    },
    {
        "subreddit": "euphoria",
        "sentence": "we won’t see anymore highschool them 😔"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy 100%"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If it was cotton instead of velour and there weren't any rhinestones then it'd be a bit more Cassie."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Amazon prime video not casting"
    },
    {
        "subreddit": "euphoria",
        "sentence": "True, but having no backbone is a LOT better than… being Nate."
    },
    {
        "subreddit": "euphoria",
        "sentence": "this one's gooood"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Final Exams and Homework"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i want a female villian thats the same age as them and maybe shes worse then nate and puts him in check and kinda torments nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i want a funny comedic relife male character thats part of the main cast and thats very animated and bubbly and be maddys love interest kinda like chuck bass or maybe even malaki from heartbreak high i feel like itd give euphoria a different energy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "she can’t even do anything and if she admitted to lying about a crime her jules and nate could go to jail so i doubt she would visit him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like everybody has done something big and really bad before, and most don't find a way to reconcile or make it right but it is definitely thought about from time to time for the rest of their life"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I remember hearing that but I wasn't certain"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thank you for confirming"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I'm always baffled by this community incessantly placing this narrative that Maddy was going to share the tape when that is never made clear."
    },
    {
        "subreddit": "euphoria",
        "sentence": "if you haven't"
    },
    {
        "subreddit": "euphoria",
        "sentence": "watch S2E5 for a lot of this lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Because it’s dumb."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie fans after watching Cassie be a psycho and project that onto Maddie lmao"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i would like to see maddy and cassie falling in love to be honest 😁"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I hate this trope"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Teacher x old enough student trope"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Would be interesting to see their dynamics with someone more mature in the long run.\nThen teacher goes to prison for messing with old enough student trope.\nWould also be interesting to see Jose student reacts to teacher getting ripped from them.\n\nAnyone who’s not Cassie cause with Cassie it would kinda be expected.\n\nThinking Rue, Jules, Maddy, or Nate."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Personally I think the main characters at the moment are strong enough so I don't want to add anyone new.\n\nIn terms of tropes, it might be interesting for Rue to go through a 'the blind leading the blind' situation where she meets someone younger & also has addiction and by helping that person she starts getting more responsible"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We briefly saw that side of Rue when she caught Gia smoking at the carnival, I'd like to see Rue be the mature one for a change.\n\nI also think it would be fun for Kat to have a stalker but since Barbie Ferreira has left the show it's kinda impossible"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I just thought a stalker is the ugly truth of the thing Kat was pursuing: attention & validation."
    },
    {
        "subreddit": "euphoria",
        "sentence": "What episode is this pic from?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Its very much implied by the show that Jules is not the only person who has 1.) Been recorded without their consent, and 2.) Been underage for the recordings"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why on earth would the police not be involved?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Go ahead and delete this girl"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He still committed a crime by filming his hookups without consent *multiple times* \n\nAnd you fell bad for and think this fucker doesn’t deserve everything he had coming?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lost twin plot line and amnesia"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Separate or together is fine."
    },
    {
        "subreddit": "euphoria",
        "sentence": "He’d be charged with statutory rape(and I highly doubt jules is the only one he slept with that was underage) and child porn\n\nOf he somehow got out of the above charges because the kids lied about their ages he’s still be charged with filming people without their consent while having sex, which is video voyeurism/unlawful surveillance"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That is a **crime** and a pretty serious one depending on the state you’re in"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Pretty sure they’re in California which has a two part consent law, since cal is the only one that knows the hookups are being filmed he’s committing a crime \n\nCal is a piece of shit, a cheater, lier, abusive father *and* a sexual predator(even without the underage kids, filming someone without their consent is predatory)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What movie is this??"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think all of these characters (maybe except Nate) will have a moment in their early 20s when their brain wil develop just a tad more and a switch will flip and they'll realize how dumb they were."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal deserves everything he got"
    },
    {
        "subreddit": "euphoria",
        "sentence": "listen, cal isn’t a pedophile"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he’s not actively seeking minors but the fact he’s sleeping with people without getting some sort of proof (esp strangers) is crazy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yall out here risking it for some ass"
    },
    {
        "subreddit": "euphoria",
        "sentence": "lol\n\nbut on the note of cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal is clearly a piece of shit"
    },
    {
        "subreddit": "euphoria",
        "sentence": "we see that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "can we feel bad for his crushed romance and the fact he was baby trapped? yes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "but he’s still a piece of shit and made choices at the end of the day."
    },
    {
        "subreddit": "euphoria",
        "sentence": "lord"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he took the charges cause nate said he’d go to the police station and report him for rape"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i’m sorry, do they show everyone doing every singular thing when they have sex? we never seen maddy and nate have sex and what leads to it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "but we know they did it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it’s a show, not a porno"
    },
    {
        "subreddit": "euphoria",
        "sentence": "they had sex, get over it lol 💀\n\n word for word by tyler\nNate: you raped her.\nTyler: woah! i didn’t rape her, she wanted it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you’re welcome"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah, exactly."
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s good"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Like a teacher from Freedom Writers or Roland from The Wire."
    },
    {
        "subreddit": "euphoria",
        "sentence": "the entire reason he took the charges was because nate beat the fuck out of him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he made he clear that she wanted to have sex but they technically didn’t.\nbikini can be pushed aside but you can not have sex without putting your briefs a bit down…"
    },
    {
        "subreddit": "euphoria",
        "sentence": "School teacher that actually cares about the wellbeing about the studens like ali"
    },
    {
        "subreddit": "euphoria",
        "sentence": "again"
    },
    {
        "subreddit": "euphoria",
        "sentence": "tyler made it clear they had sex hunny"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it is very much statutory rape when he admits it, that was the ENTIRE reason he took the assault charges"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the only thing this man is a victim of is getting assaulted by Nate and taking the assault charges"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you make it seem like you cannot have sex with a bikini on 💀 lord."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hey Mynameisbrk! Thank you for your submission to r/euphoria"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Unfortunately your post has been automatically removed for being too short"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Text posts in euphoria require 150 characters or more in the \"text\" field of your post"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It is recommended that you resubmit your post instead of editing it, as AutoModerator will not know to reapprove your post if you edit it to comply"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If your post is a simple question or comment about the latest episode, consider posting in the megathread for episode discussion or weekly discussions"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If your post involves piracy/solicitation, do not post it, as this is against site-wide rules on piracy.\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/euphoria) if you have any questions or concerns.*"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you know you can do something wrong and still be a victim lol ? \ni think intent is really important in these situations and maddy’s intentions were BAD, she’s not HIS victim.\nalso i was just making a point that it’s not statutory rape because no sex happened, there’s literally an UNDERWATER shot of them clothed while \"doing it\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "I agree"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It doesn't excuse Nate's actions, but his past and home life are a good explanation to why he acts the way he does."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sydney has FAR better breasts, but yes! I will never look at Officer Lewis the same way again!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you just proved my point"
    },
    {
        "subreddit": "euphoria",
        "sentence": "MADDY said they didn’t have sex, that they only kissed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "TYLER said that she was all over him and she wanted it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "did you guys even watch the show?? or…"
    },
    {
        "subreddit": "euphoria",
        "sentence": "like\n\n\nyall need to stop making it seem like this man is a victim"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he could’ve said no, he could’ve asked an age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he could’ve done a lot of things"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you guys make it seem like maddy put a gun to his head making him mess around w her.”"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Friendly neighborhood spiderman./s"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Obviously Nate’s whole family, except his mom"
    },
    {
        "subreddit": "euphoria",
        "sentence": "exactly this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "like, supernatural is NOT a “good” show"
    },
    {
        "subreddit": "euphoria",
        "sentence": "but damn if there aren’t some compelling ideas in it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "euphoria is the same."
    },
    {
        "subreddit": "euphoria",
        "sentence": "like this 😐"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also he sort of raped Jules"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sure she didn't say no but she was clearly uncomfortable"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We see in his tapes that a lot of his encounters play into the role play very clearly and show clear signs of enjoying it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules didn't"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Getting clear consent is a very important part of sex"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal should have explained what he wanted and discussed it with Jules and made sure she was ok."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah that was the episode were she didn’t want to get out of bed to go to the bathroom"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Then she started being manic trying to uncover the situation with Tyler"
    },
    {
        "subreddit": "euphoria",
        "sentence": "When she googled “do people with bipolar know they have bipolar?” She read no."
    },
    {
        "subreddit": "euphoria",
        "sentence": "late but definetly got something to do with thr favt that singapore has a mandatory death penalty for drug dealers and has the tightest drug laws in the world"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No, he was terrible lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "we’ve seen maddy lie MULTIPLE times lol, she’s a liar"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the point was that maddy faked having sex with him in the pool, but couldn’t admit to faking it or saying they actually had sex to nate so she lied and said she blacked out so she would seem like an innocent victim and nate would come to her rescue to feed his ego"
    },
    {
        "subreddit": "euphoria",
        "sentence": "while i do think tyler should have been more cautious by asking her age, he was clearly a pawn here for her and he was the victim of her trap ultimately."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The illegal recordings should have gotten him out of trouble? He wasn’t arrested for statutory, the cops didn’t even see the recording with Jules, he was arrested for recording sex tapes without consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s illegal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Good lord, I hope you don’t think that’s legal in any way shape or form."
    },
    {
        "subreddit": "euphoria",
        "sentence": "A fake id is different than someone just saying they’re x age and you not trying to verify it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "For example, if a bartender serves an underage person because they said they were 21 but the bartender never checked their ID, the bartender is liable"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, if the underage person had a fake ID and the bartender serves them the underaged person can get in trouble for having a fake ID"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Although the bartender might also still get in trouble at that point, I’m not sure"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Either way once you introduce fake IDs into the mix liability works differently."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Libras know how to stand their ground and tell people about themselves"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They don’t let someone try them twice."
    },
    {
        "subreddit": "euphoria",
        "sentence": "tyler did not say that, only maddy did"
    },
    {
        "subreddit": "euphoria",
        "sentence": "one of them are liars hm?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s the same way people put up with Cassie despite her unhinged behavior and constantly crying."
    },
    {
        "subreddit": "euphoria",
        "sentence": "According to this it would in the state of California"
    },
    {
        "subreddit": "euphoria",
        "sentence": "https://www.chamberslawfirmca.com/if-an-underage-person-lies-about-their-age-can-you-still-be-convicted-of-statutory-rape/"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I'm like 19, turning 20 in October not that it matters."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is not a stretch by any means! Again, it would've been lovely if the show had been more proactive in that angle"
    },
    {
        "subreddit": "euphoria",
        "sentence": "To me, it falls in line with the accusations that Nate's father is a pedo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don't think this the case but it's not surprising why people are inclined to think that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That coupled with the fact that Sam has trouble keeping consistent details of his characters"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I wouldn't put it past him to write down an age as a throwaway line (he's done that before).\n\nMy belief? The consistent and constant nightmares that Nate has about his father via the tapes bears most of the weight, which I think suffices for the story and still holds great value in conversations about SA"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In this town, Cal's reputation is Nate's reputation—something he holds to a high standard"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He keeps pristine maintenance of it and his masculinity because he's reassuring himself he would/could never be the type of person to receive the same treatment as his father's sexual partners"
    },
    {
        "subreddit": "euphoria",
        "sentence": "All this effort is put into subverting the subconscious thoughts he has of their relationship"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hell, even the word \"daddy\" isn't sacred anymore"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This of course breaks Nate when Cal tackles him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There's dissonance in the fact that Nate has to navigate life being like his father while also not being him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That alone is enough to harbor resentment the same way an assault would"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Enacting vengeance is Nate's cling to power"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In fact, he fantasizes about it (eg"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy, Tyler, Cal).\n\nThe two confession scenes, Cal's and Nate's respectively, would have confronted the SA more explicitly if it was truly meant as a scorched-earth/one and done deal/tell-all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, Cal's scene is framed as \"I'm abandoning this family to finally live my truth"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don't know where I went wrong with you.\" while Nate turning him in is \"You don't deserve to live your truth"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Here's where you f\\*cked up\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "The play was a critical moment to Nate to show that his reputation is already in the makings of being tarnished, if hasn't been already.\n\nWe can only hope for another season at this point, but even that is on shaky grounds."
    },
    {
        "subreddit": "euphoria",
        "sentence": "they did NOT sleep together, it’s said in the show"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The age of consent thing isn’t the issue because being factually wrong about the person’s age is considered a legal defense (though this argument is looked at with a ton of scrutiny so you better have an iron clad case if you’re trying to argue that you thought the minor was an adult)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Your mistaken belief about the victim’s age has to be reasonable under the circumstances too, you can’t be willfully blind to the fact that they’re a minor.\n\nThe more likely reason Cal went to prison is because recording people in sex acts without their consent is a crime"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Multiply that by the number of people Cal victimized — Cal will probably have to register as a sex offender for that reason alone"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes and Ik the writers are rolling with trying to make up fezcos storyline rn"
    },
    {
        "subreddit": "euphoria",
        "sentence": "“Tyler obviously knew he was wrong” he says in the show he never knew her age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy knew she would get him in trouble so she shouldn’t have forced herself on him and lied about it on top of that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "“that shouldn’t have gone far enough to the point of him getting jail time” \n\nso people in their twenties can just fuck minors and shouldn’t get jail time? \ntyler obviously knew he was wrong, that’s why he took that assault charge instead of statutory rape.\n\nnate manipulated the whole situation"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it not maddie’s fault when she was manipulated by her emotionally abusive boyfriend"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean, I’m thinking maybe for Fez, they could say something like >!Fez had a psychotic break after Ash died, and left town immediately"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The only person he’s still in contact with is Lexi!<"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No, having a tape of child pornography proving your innocence is not going to work in your favor."
    },
    {
        "subreddit": "euphoria",
        "sentence": "8"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I honestly think she forgot about him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Does she even know Nate beat him up?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "His story line genuinely killed me because"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s cause they have a fucking crush on him and will do all the mental gymnastics they can to justify his actions on the show"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Idk I’m 25 but I suspect there are a LOT of teens on this sub."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Eyyyyy I agree with this one"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I also felt like they are glamorizing it and I thought I was just wrong because no one is talking about it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I have mental health issues, same as the kids in the show but I knew from the beginning how to say no to these drugs even though I’ve experienced my friends taking them in front of me"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m fully aware that I’m going to be obsessively drawn into it if ever I tried it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But watching this series is somewhat triggering to try it because of how glorified it was 😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nata and Cassie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "One of them looked younger than Jules and he was still filming them without their consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That could get arrested."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don't believe I'm saying this because even after all these years on the internet I never comment mean things, but after reading every comment I came to the conclusion that OP is just really stupid or at least narrow minded"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In mine a 14 year old can fuck an adult"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thats too young imo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Having sex with minors and secretly videotaping them? I’m sure there are some sort of child porn laws against that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "You know tbh i don't know how can people defend cal Jacob's despite all the bad shit he did smh."
    },
    {
        "subreddit": "euphoria",
        "sentence": "A big trigger for Rue's drug abuse in the beginning was anxiety and panic attacks, but it alludes to BPD and OCD."
    },
    {
        "subreddit": "euphoria",
        "sentence": "There’s a scene in S1 where she’s fighting with her mother and threatens her with a shard of glass displaying a violent outburst that would align with the bipolar diagnosis"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The OCD diagnosis is best supported through her anxious thoughts and distress"
    },
    {
        "subreddit": "euphoria",
        "sentence": "OCD is most often related to intrusive and obsessive thought patterns"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They tried to display this ocd through the  ceiling counting scene but imo that was probably just because of how society perceives ocd"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal is bound to have been arrested for something else, maybe something completely unrelated"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Something real or something that Nate made up"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean it *is* Nate we're talking about here.\n\nOf course you can get arrested, charged and tried for recording sexual acts without all parties' consent, but in order for a judge to issue a warrant the tape wouldn't be enough: you can see some of Cal's partners interacting with the camera and while we know, because of Jules' story, that he does also tape without consent, the coppers don't, and they should have found one of the people in the tapes, interrogated them and convinced them to be a witness"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even if Nate lied and gave a copy of Jules' tape to the coppers, we know she didn't talk to them and a tape that can't be determined with certainty if it's illegally filmed of a 17 yo who lies in that very recording about her age doesn't get you an arrest warrant for the most powerful man in town, it gets you a polite invite to chat at the station"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The fact that Jules' tape is CP may be the one thing that would give them a warrant, but Nate, an adult who made copies, wouldn't be free either in that case.\n\nI think the connection between the arrest and the tapes was a false trail and the story was meant to be about something else entirely."
    },
    {
        "subreddit": "euphoria",
        "sentence": "That is really scary and confusing when it comes to reading about it online lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Odd, I was miss diagnosed years back with bipolar disorder that ended up being border line personality disorder and bipolar was never used under the nickname bpd to me, but I’m from Canada so maybe it’s different or something."
    },
    {
        "subreddit": "euphoria",
        "sentence": "In many places in the US, including my old state, Kansas, that I know live 10 miles east of in KCMO now, has the Romeo and Juliet laws, where the adult has to be within three years of age of the 16 or 17 year old engaging sexually with the adult"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know some places in the US don't have this law, put a goof amount do."
    },
    {
        "subreddit": "euphoria",
        "sentence": "In every western country that is not a few States of the US consensually shagging a 17 yo is legal, your country is the norm, not the exception."
    },
    {
        "subreddit": "euphoria",
        "sentence": "A few things:\n\n1"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s not how statutory rape works, it doesn’t matter if the literal child lies about their age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "As the adult tou should have better judgment in the eyes of the law"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This wasn’t like a minor age gap (pun intended), I look at 16 year olds and they look like babies to me"
    },
    {
        "subreddit": "euphoria",
        "sentence": "2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal deserved everything he got"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Euphoria works because it makes you feel empathy for the characters"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even thought they’re all pretty terrible people who in real life you wouldn’t want to associate with (except suze love me some suze)..Cal was dealt a shitty hand with the whole Nate’s mom getting knocked up after he finally gave into his attraction to his bestie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That doesn’t mean he doesn’t deserve to get arrested for recording people he’s having sex with without consent—which is also illegal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But either way he did break the law with Jules and would be prosecuted irl"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal is a piece of shit who treats all people in his life extremely poorly and has two fucked up sons because of it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not working on yourself to be better after experiencing trauma especially with the amount of time he could have realized he was toxic, makes it hard for me to think he isn’t a huge piece of shit"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Serial killers have trauma too doesn’t negate the terrible stuff they did"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal may not have killed anyone but he ruined many lives by giving other people trauma"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If anyone deserves some jail time besides Nate it’s him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She's graduating high school so she's not gonna have to deal with Maddy or any of her friends much"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She'll probably hole up in her house and drink"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lexi will go to college, come home, look at her sister and sigh"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Suze will try to tell her to get a job but they'll just get annoyed at each other."
    },
    {
        "subreddit": "euphoria",
        "sentence": "California (where the show takes place) is a 2 party consent state, meaning that any private recordings need to be consented to by BOTH the individual being recorded and the person making the recording"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You have to disclose that shit because if you don't in California it is illegal and you can be charged and arrested and convicted for it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Of age or not you can't film people without their consent."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules was definitely wrong to lie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal was wrong in: not clearly getting consent from Jules, cheating, and filming without consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Filming without consent is nonconsensual porn which is illegal in itself"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even plain filming someone in private without consent is illegal in some places"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal is my favorite character because of how complex he is and how good the actor is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But him being likable and complex has nothing to do with him being good as a person"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Everyone has their sides and that's why the show is so good, all the characters are bad ppl in one way it another but we justify it more because we know what they're going through"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If we saw Cassie from only Maddy's, Nate from only Jules', and Cal from only Nate's perspectives, no one would be discussing their nuances."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I may or may not have already done it🙃"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What?? I am not attracted to the actor at all and this is NOT romanticising, it’s merely expression of opinion."
    },
    {
        "subreddit": "euphoria",
        "sentence": "You don’t have to romanticize or defend every character just because you’re attracted to the actor who plays them."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate was on his rich kid spoiled bullshit"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Honestly bruh who gives a fuck if he made you question your sexuality"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He probably been gay lmaooo what type of kid goes back and watches his dads sex tape willingly"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I found my uncles porn stash as a little kid and I didn’t know what it was"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A blank CD in a plain black cover"
    },
    {
        "subreddit": "euphoria",
        "sentence": "As soon as I saw a guy getting sucked off I turned that shit off asap and didn’t go back in his stash"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I was terrified"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate’s a weirdo he always has been even before he found cals tapes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal didn’t deserve to get snitched on considering he provided Nate with everything and more"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also Nate has his own sins, he’s inherently selfish"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal isn’t a predator he has some sadistic and deviant sexual behavior but he asks people for their age and the other people we see in the videos look of age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He doesn’t have a weird kink of having sex with people that look very young."
    },
    {
        "subreddit": "euphoria",
        "sentence": "He didn’t actually commit any crimes? Are you suggesting that video taping people sexually/making pornography without their consent isn’t a crime? \n\nYou can also tack on negligent parenting since Nate found the tapes at such a young age…something that wouldnt have happened if he didn’t have the fucking tapes to begin with"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Some of yall give Cal too many passes."
    },
    {
        "subreddit": "euphoria",
        "sentence": "If Sam Levinson weren’t the writer, I would 100% agree with this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "in the psychology field, BPD can stand for either borderline personality disorder or bipolar disorder :)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s not always black and white"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules probably lies about her age all the time and also on the apps so unless you ask for ID I guess but she consents to everything"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus she genuinely didn’t want any wrong doing to Cal, Nate is just a jack ass and in real court Jules might as well out Nate and defend cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also I love Jules (Hunterrr) 😭😭🖤🖤🖤🥰🥰"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know of a case in Omaha were a girl claimed to be 19 (she was 16) on video"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She even showed him a fake id, it didn't matter, her mom even testified against her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He was still found guilty"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We also don't know for sure if Jules was the only one because he was careless."
    },
    {
        "subreddit": "euphoria",
        "sentence": "that would not hold up in court is the point lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think Maddy is more complex than that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m sure everything with Nate is giving her immense guilt, self-blame, and inner turmoil"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And she’ll of course reflect on Tyler eventually after the pain/some healing and would feel sadness and shame over this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Idk if she would do anything but I think it would be out of fear"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She’s not that shallow to ignore all the trauma and abuse from Nate and be still caught up in the love/obsession of it all."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I just watched Dune"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She is impossibly bad as an actress"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Zero depth"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Zero humanity"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She’s just like watching a void, or an avatar devoid of the understanding of human emotions"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Of the many reasons I disliked the film, her performance stands out as the worst"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Actresses should be cast for talent, not Disney popularity."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy found whoever was closest to smash just to get back at Nate and then lied about being blackout drunk, yes Tyler should’ve probably asked for her age and As an adult he is partially at fault but none of that should’ve gone far enough to the point of him getting jail time and having his life destroyed because she decided she wanted to straight up lie about blacking out"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Saying that Tyler bears most of the responsibility is borderline delusional"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cassie and maddy  were probably at their lockers for a good minute, maybe skipping, or just passing time and we only got bits and pieces of  that scene/ conversation, my guess is they took the picture beforehand when they first got to the locker then after chatting there for a bit cassie asked her about the pics on nates phone"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate removed the only copy of the Jules tape that was known"
    },
    {
        "subreddit": "euphoria",
        "sentence": "So Cal was arrested for filming sexual activities without the other party’s consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thinking about that, he does deserve to have his life ruined, he was also a cheater"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I can excuse trying to figure yourself out as in what you like in a partner, but at least mention it beforehand"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He also screwed his son over mentally by basically having piss contest with his children and himself over who’s the most macho or whatever, and leaving those tapes about where your child can get to them showed to Nate, “violence during sex is good, therefore I can be violent with my girlfriend and choke her”"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The sins of the father fall onto the shoulder of the son, so someone alongside Nate needs to be held culpable to his actions and thinking"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Both Cal and his wife need to be held accountable."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Do you think you can just lie about what your post says and then pretend it's not right there still 🤔 and I'll just believe it? At least edit your post and add that in and then try to lie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Your post doesn't say that"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You said you can't think of a crime he could have committed and don't know why he would have been arrested"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You didn't bring up it being illegal to record people without consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You even say it's \"immoral but not illegal\" \n\n\n\n\nEdit: here, I'll copy and paste your entire post so you can read it yourself again and see what you said because apparently you can't read your own post\n\n\n\n\n\"Hey! I just did a rewatch of euphoria again & I honestly think that Cal Jacobs didn't even deserve what he got"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I understand what he did was unforgivable, cheating on his Wife and recording his hookups without their knowledge BUT It didn't make any sense to me as to why he was even arrested"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Since Cal was recording, wouldn't it work in his favor having it on video Jules lying about her age? Although what he did was morally wrong, he didn't actually commit any crimes if you think about it, I don't even know what charges he could've been arrested on, considering these videos would've shown him asking for their age before doing anything"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I really don't think he deserved what happened, it was just Nate lashing out and dealing with his own issues by getting revenge on Cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What's your guys opinion on this?\""
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mentioned that part, that was literally his only crime"
    },
    {
        "subreddit": "euphoria",
        "sentence": "People talking about jules and how he fucked a minor and made CP from that are literally missing the point."
    },
    {
        "subreddit": "euphoria",
        "sentence": "How do you not know that it's illegal to record yourself having sex with someone without them knowing?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Right but he asked her age and she said she was an adult so where does it stand there? He recorded everything right so the part when he offers her a drink and asks her age would be right there in black and white."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thanks!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Haha WHAT? You’re making absolutely ZERO sense"
    },
    {
        "subreddit": "euphoria",
        "sentence": "‘A minor can lie, but it doesn’t give the green light to fuck them?’."
    },
    {
        "subreddit": "euphoria",
        "sentence": "what?? If someone looks like an adult, confirms their age, what do you MEAN it doesn’t give a green light."
    },
    {
        "subreddit": "euphoria",
        "sentence": "she literally lied and he didn’t knowingly have sex with her knowing she was a minor, he thought he was fucking an ADULT? So what are you even talking about??"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean his only real crime is filming people without their consent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's not like he posted them online or tried to sell them either, the tapes just sat in his drawer"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Knowing that the cops in the city know how well established he is, I think he'll get off with a slap on the wrist"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Worst case scenario, he gets put on an offenders list and goes to jail for a year tops"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What he did was wrong but I doubt he'll rot in prison for it.\n\nAs for Jules, first off, she lied about her age ON TAPE and even though it'd be nice for Cal to ask all his hookups for ID, he's not legally bound to (Nate proves that ID can be faked too)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus, she was 17, not 12, so I doubt anyone would care"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Not to mention that Jules doesn't care to put Cal in jail so there'd be no legal battle at all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal would provide the tape and her dating app profile as evidence, Jules wouldn't care so he would walk free"
    },
    {
        "subreddit": "euphoria",
        "sentence": "HOWEVER, he did have sex with other people that looked pretty young, I doubt he's dumb enough to have sex with someone who actually claims to be a minor, but who knows, maybe there's more to one of *their* stories and they'd like to come forward.\n\nAll in all, we see him get arrested but I don't think he'll go to jail"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He's just gonna get questioned by the cops but that's it\n\nEdit: I don't really fully know how these laws work so don't come for me lol, just using basic logic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Her lying about her age doesn't change the law when it comes to fucking minors"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules doesn't have to testify for it to move forward"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The state has all the evidence they need"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cal not only fucked a minor but recorded it which is child porn"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You think it's not valid, but the law doesn't really care what you think"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A minor can lie, but it doesn't give you a green light to fuck them."
    },
    {
        "subreddit": "euphoria",
        "sentence": "You’re taking it the wrong way, she lied about her age? He went through with it based off the fact she was an adult"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I understand this happens a lot in the real world but she lied and you think in a court of law, jules would come forward and be like yup, let me testify? Obviously she knew what she did was wrong too so why would he even be arrested and prosecuted?? She literally lied and he didn’t know he was making CP"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Him getting in trouble for recording anyway is a valid reason but the whole Jules thing is not valid to be honest."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The idea of having video proof of him fucking an underage person working in his favor is hilarious."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Funfact : in my country its legal 😞"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Jules saying she’s 22 doesn’t change the fact that she is underage.\n\n“I thought she was over 18” is never a viable defense."
    },
    {
        "subreddit": "euphoria",
        "sentence": "A lot of her outfits just scream Bratz to me."
    },
    {
        "subreddit": "euphoria",
        "sentence": "From the DSM:\n\nManic Episode\nA distinct period of abnormally and persistently elevated, expansive, or irritable mood and abnormally and persistently increased activity or energy, lasting at least 1 week and present most of the day, nearly every day (or any duration if hospitalization is necessary).\nDuring the period of mood disturbance and increased energy or activity, three (or more) of the following symptoms (four if the mood is only irritable) are present to a significant degree and represent a noticeable change from usual behavior:\nInflated self-esteem or grandiosity.\nDecreased need for sleep (e.g., feels rested after only 3 hours of sleep).\nMore talkative than usual or pressure to keep talking.\nFlight of ideas or subjective experience that thoughts are racing.\nDistractibility (i.e., attention too easily drawn to unimportant or irrelevant external stimuli), as reported or observed.\nIncrease in goal-directed activity (either socially, at work or school, or sexually) or psychomotor agitation (i.e., purposeless non-goal-directed activity).\nExcessive involvement in activities that have a high potential for painful consequences (e.g., engaging in unrestrained buying sprees, sexual indiscretions, or foolish business investments).\nThe mood disturbance is sufficiently severe to cause marked impairment in social or occupational functioning or to necessitate hospitalization to prevent harm to self or others, or there are psychotic features.\nThe episode is not attributable to the physiological effects of a substance (e.g., a drug of abuse, a medication, other treatment) or another medical condition.\nNote: A full manic episode that emerges during antidepressant treatment (e.g., medication, electroconvulsive therapy) but persists at a fully syndromal level beyond the physiological effect of that treatment is sufficient evidence for a manic episode and, therefore, a bipolar I diagnosis.\nNote: Criteria A–D constitute a manic episode"
    },
    {
        "subreddit": "euphoria",
        "sentence": "At least one lifetime manic episode is required for the diagnosis of bipolar I disorder.\n\nHypomanic Episode\nA distinct period of abnormally and persistently elevated, expansive, or irritable mood and abnormally and persistently increased activity or energy, lasting at least 4 consecutive days and present most of the day, nearly every day.\nDuring the period of mood disturbance and increased energy and activity, three (or more) of the following symptoms (four if the mood is only irritable) have persisted, represent a noticeable change from usual behavior, and have been present to a significant degree:\nInflated self-esteem or grandiosity.\nDecreased need for sleep (e.g., feels rested after only 3 hours of sleep).\nMore talkative than usual or pressure to keep talking.\nFlight of ideas or subjective experience that thoughts are racing.\nDistractibility (i.e., attention too easily drawn to unimportant or irrelevant external stimuli), as reported or observed.\nIncrease in goal-directed activity (either socially, at work or school, or sexually) or psychomotor agitation.\nExcessive involvement in activities that have a high potential for painful consequences (e.g., engaging in unrestrained buying sprees, sexual indiscretions, or foolish business investments).\nThe episode is associated with an unequivocal change in functioning that is uncharacteristic of the individual when not symptomatic.\nThe disturbance in mood and the change in functioning are observable by others.\nThe episode is not severe enough to cause marked impairment in social or occupational functioning or to necessitate hospitalization"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If there are psychotic features, the episode is, by definition, manic.\nThe episode is not attributable to the physiological effects of a substance (e.g., a drug of abuse, a medication, other treatment) or another medical condition.\nNote: A full hypomanic episode that emerges during antidepressant treatment (e.g., medication, electroconvulsive therapy) but persists at a fully syndromal level beyond the physiological effect of that treatment is sufficient evidence for a hypomanic episode diagnosis"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, caution is indicated so that one or two symptoms (particularly increased irritability, edginess, or agitation following antidepressant use) are not taken as sufficient for diagnosis of a hypomanic episode, nor necessarily indicative of a bipolar diathesis.\nNote: Criteria A–F constitute a hypomanic episode"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hypomanic episodes are common in bipolar I disorder but are not required for the diagnosis of bipolar I disorder.\n\nTL;DR: Basically, a manic episode has to be for a week or longer"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Hypomania is like “low grade” mania"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Bipolar disorder and borderline personality disorder are difficult to tease apart, especially when drug use is involved"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A general rule of thumb is that one needs 2 years of continuous sobriety to get a good, accurate mental health diagnosis."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Interesting, thanks!\nHow do you discern whether it’s hypomania or mania?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The use a real needle for a close up"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Then a retractable needle for the shooting part"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s all sleight of hand and editing."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is an uninsightful comment and the OP and this follow up question make perfect sense"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I love the show and it's depiction of addiction and bipolar overlap"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But this is a definite area for critique"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Bipolar people with addiction often self-medicate instead of taking the proper meds"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is a core question"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If Rue is still taking them and still resorting to self-medicating, this should be explored"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It actually seems like she is NOT taking them, as she is exhibiting hypomania in nearly every episode until the last few of the season"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But it's not addressed at all and this puts a little too much emphasis on \"do you want to get better or not?\" without having clarity on what role the bipolar is playing in all of it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "For me until he plays a decent human being I’m not going to really go far is acting because honestly, he all he ever plays a psychopath"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even the kissing Booth movies like he’s such a asshole in those movies just like neat they just try to play it more lightly but his character in the kissing Booth movies is just as dangerous is Nate."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I really did not like Elliot at all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I wouldn't want to see any more of him tbh."
    },
    {
        "subreddit": "euphoria",
        "sentence": "if you rewatch the first few episodes of S1 you should find out, I remember her listing the disorders she has"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the ones I'm 100% sure of are: OCD, Depression, BPD, Bipolar Disorder, Anxiety and I think maybe she mentioned ADHD too?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like my written outline for a proposal special episode which start Elliot & fez can be reintegrated into a farewell to Angus cloud for euphoria, if it won't happen by them, but for me, I will do my best & find a way to present it on how I envision it on how it meant to be seen, for fez"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sam probably forgot this plot line so we may never know"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He didn’t ask her, he just said Maddie was “like 18” when Nate asked Tyler if he knew how old she was"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Then he said he was “like 21” even though he clearly knows his own age which is 22."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yes mam"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "she did not push him to have sex with her 😭😭 yall just making shit up as you go"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it was consensual on both ends"
    },
    {
        "subreddit": "euphoria",
        "sentence": "but it’s still statutory since she was a minor and the AOC is 18."
    },
    {
        "subreddit": "euphoria",
        "sentence": "he didn’t go to jail for SA"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he went to jail for just assault"
    },
    {
        "subreddit": "euphoria",
        "sentence": "so think domestic violence, and realistically they get shit."
    },
    {
        "subreddit": "euphoria",
        "sentence": "BPD - her latching onto jules constantly, idolizing her and acting as if being with jules will be her cure for addiction, or save her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I believe Nate’s innocence was just stripped in that moment thanks to his curiosity of what his dad hides"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But I also wonder about what happened when he was younger, I remember in season 2 after cal leaves, Nate’s mom mentions I think the years 8 or 9? That he changed and became dark, like what happened in that moment? Like someone mentioned on here, I feel like he was SA’d as a child as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But how was he supposed to know it was McKay going away party he probably thought it was a college party…."
    },
    {
        "subreddit": "euphoria",
        "sentence": "regardless he shouldn’t have had sex with a high schooler."
    },
    {
        "subreddit": "euphoria",
        "sentence": "he’s 22 and she’s the teenager"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That's really interesting"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Are you suggesting that Cal was the one who SA'd Nate?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Do your own homework"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I am very much single lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Unless you actually read the contract there is no way to know"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It could be a whole range of things from only getting DVD rights, he have full control of the sound,He get to help select cast members"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We won't know.\n\nIf I had to guess from what I know that is common is that he get some control over the music and can add artist and he can put one person in the show for certain amount of episodes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is really common for producers they donate money and get the ability to put someone In the show."
    },
    {
        "subreddit": "euphoria",
        "sentence": "👋I care about Rue!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i'm going through the same thing babe"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it's been 3 years since I started opiates and it's hard."
    },
    {
        "subreddit": "euphoria",
        "sentence": "it's not as easy as you say"
    },
    {
        "subreddit": "euphoria",
        "sentence": "rehab is expensive (yeah so are drugs but you're not buying it in a big lump sum) i'm an addict and it's hard so I get it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you can't just say go to rehab and therapy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "you have to have money and you have to have people who care."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Right?!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Honestly same lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I understand that my use of the word \"incompetent\" is very strong but please hear me out when I say you're holding me to a position I never made"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I never doubted that his scripts  provided the foundation for my thoughts- I made an entire post about it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That should go without saying"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, It's entirely possible to appreciate certain aspects of 'euphoria' while also recognizing areas where it falls short (which was my intention of writing the sentence with the word \"incompetence\" in it).\n\nFinding something compelling in a piece of writing doesn't necessarily mean that you endorse every aspect of the writer's abilities or style"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Inversely, just because you don't endorse every aspect of the writer's abilities or style doesn't mean you can't find something compelling in a piece of writing."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think Rue just suffers from depression"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Her manic outbursts seem to only come out when she's going through withdrawals or someone gets in the way of her getting her fix"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She uses drugs to escape her depression, but as we see throughout the series, it makes things just way worse"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yeah cause I feel like jules should've minded her own fucking business and Elliot should've kept his mouth close cause he had no idea what was going on and then started fucking jules like dude wtf"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They said he was a private school kid"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Seemed like just a side character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I kind of wish McKay would’ve stayed but after the way he treated Cassie and made her @B°RT their child… nah… that ain’t it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They weren’t ready, but that ain’t no way to treat your girlfriend/someone you love/the mother of your child"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Could’ve been done in a more humane way"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But everything was about him and how selfish he was about his football career"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Glad Cassie curved that but she turned out to not be much better."
    },
    {
        "subreddit": "euphoria",
        "sentence": "You're missing the point"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You got what you got and put into your very thoughtful post *because* of Sam Levinson, not despite him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He wrote these scripts, whether people like it or not."
    },
    {
        "subreddit": "euphoria",
        "sentence": "no lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In Bipolar 2, criteria have *never been met for a manic episode - only hypomanic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In Bipolar 1, there must be full criteria met for *at least one* manic episode"
    },
    {
        "subreddit": "euphoria",
        "sentence": "So no, you cannot have both"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Source - I’ve been a licensed therapist for 13 years."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thank you"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I didn’t even finish what the commenter said because no one can have 1 and 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I just recently got diagnosed with Bipolar 2."
    },
    {
        "subreddit": "euphoria",
        "sentence": "PTSD, BP2, ADHD, Anxiety, Extreme Low Self Value here… I always related with Cassie (with the way she expresses her trauma and self worth) and Rue."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She very much did"
    },
    {
        "subreddit": "euphoria",
        "sentence": "she has bipolar, not bpd, and there was a whole episode on her having a manic episode."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is late, but you’re very strong and I admire you for getting through that ❤️"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don’t think my post argues with yours, no? The posturing, as you have mentioned, is very much a coping mechanism"
    },
    {
        "subreddit": "euphoria",
        "sentence": "One that is very socially regressive considering his anger management issues"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate would be the type to get charged for battery because someone looked at him funny"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The tantrums, fits of rage… That is man-child behavior.\n\nIn a way, Jules wants to conquer femininity and Nate wants to conquer masculinity."
    },
    {
        "subreddit": "euphoria",
        "sentence": "rue does not have bpd as someone with bpd so please don’t use her as an example for that! i think rue is a great example of bipolar disorder, depression, and anxiety."
    },
    {
        "subreddit": "euphoria",
        "sentence": "he’s 22 and fucked a high schooler."
    },
    {
        "subreddit": "euphoria",
        "sentence": "he broke a law regardless why are you guys feeling bad for someone who fucks highschoolers and is grown 😭"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i don’t remember her pushing anything she just asked if he wanted too and he agreed."
    },
    {
        "subreddit": "euphoria",
        "sentence": "First Nate’s mom telling him around 8/9 he started going really dark"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Then we later find out he saw the tapes at 11.\n\nAnother big one, at an even younger age, she said Nate would bring her water all of the time and give her lots of love, but he never did that with his dad"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She points this out.\n\nThe scene of him dreaming about being underneath his father"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A HUGE sign of trauma.\n\nThe scene where Cal was on top of Nate in his room fighting a little bit, the moment Nate saw himself in the mirror (also in his underwear) under Cal, Nate flipped.\n\nAnd the biggest one of all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate’s gatekeeping the tape at the very end and then having his father arrested"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate went through a lot of trouble to keep that CD with Jules on it well kept in order to protect his Father"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He also never told anyone his entire life about the things on those CDs"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Why? \nBecause this was not even the worst"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There was more to Nates story that’s hidden behind everything"
    },
    {
        "subreddit": "euphoria",
        "sentence": "What I’m trying to say is, Nate is not going to go through all of that trouble of keeping a tape from coming out about his Father sleeping with Jules"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate could give two Fs actually"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s about what follows after the discovery of what Cal does behind closed doors, once that info is out there, the floodgates open to Nates SA"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s what he’s protecting.\n\nNow let’s say Nate did all of that work to keep Cals big gay secret under the rug."
    },
    {
        "subreddit": "euphoria",
        "sentence": "just to protect Cal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Does that really align with the ending scene of them two? Nate goes to him and pretty much tells him face to face I’m not scared of you anymore and I remember"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The message is right in front of you if you pay attention enough"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Then he has him arrested"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s very very clear to me that Cal has done more than just make Corn tapes"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nobody said that, the “dirtyferret” commenter is saying to prioritize your own mental health before looking for relationships, which is exactly what Ali and the waitress were trying to tell Rue in her special episode"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Levinson isn’t incompetent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The Nate character is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate isn’t socially stunted, he “not like the other losers” himself via his trauma, convincing himself that he is not wounded or broken, but that it has made him stronger"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is VERY competently laid out for us"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is dangerous because he refuses to admit that he has/is a problem."
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She goes through manic and depressive episodes as seen when she was figuring out what happened with Jules and Nate"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And then ofc the love island parts"
    },
    {
        "subreddit": "euphoria",
        "sentence": "why did yall vote 5………"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is a discussion post after all! This is very interesting… I wish that would’ve have been addressed more, but it is not up to me and the show is not officially over"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I can argue the constant nightmares are enough to explain Nate’s behavior- another complex cog - if Sam never intends to explore it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Please, I would like to know which scenes you’re referring to when you get around to it.\n\nAlso shoutout to the set department and Elordi’s performance"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They made great contributions and really transformed the character."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I believe an important chunk of that sentence is missing"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I said what I said"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The man has a history of creating premises and not having plans for them, creating distracting new premises, and abusing Chekov’s gun for tensions sake just to not have it fired"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s carelessness"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You’d think it would be better considering the initial script was developed a handful of years prior"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I could’ve done a critique post of why Nate’s character is handled poorly but I don’t want to do that and we already have enough critiques on it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "This post is something I personally enjoyed making and a is take I rather get out of the show."
    },
    {
        "subreddit": "euphoria",
        "sentence": "i remember when she was too depressed to get up out of bed and pee, she went to the hospital bc her kidneys were fucked up from it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If you’re anything like Rue this post is a cry for help."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Because idk she said he raped her when that’s not true she was the one pushing to have sex with him"
    },
    {
        "subreddit": "euphoria",
        "sentence": "jules, the way she ratted out rue was completely wrong and bogus 👎🏽"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maybe because she wrongfully accused him of a life destroying crime he didn’t do😱"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Very good"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think you could have even gone deeper"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I am a firm believer that Nate was SA’d not just a witness to corn at a young age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "In fact, I believe the SA started before the CD’s"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If you go back, watch the scene of him watching the CD again"
    },
    {
        "subreddit": "euphoria",
        "sentence": "MOST children at that age would be repulsed and walk away"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I remember when I was a kid before I knew to much about sex, I discovered a vhs tape and when I saw the cover I was immediately disgusted and walked off"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Nate’ watched the tape as if he was trying to “feel something”"
    },
    {
        "subreddit": "euphoria",
        "sentence": "These scenes look to me a child who has experienced something similar and continues to watch because they are trying to rationalize as a result of their trauma"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There are plenty of more scenes through out this show that scream child SA from Nate’s character and lastly, Nate is the most complex character I’ve seen in a show."
    },
    {
        "subreddit": "euphoria",
        "sentence": "in a long time."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The reason I said that is because the person who replied feels he should be held accountable for someone's addiction, meanwhile even if he didn't sell she would still be addicted and probably not alive."
    },
    {
        "subreddit": "euphoria",
        "sentence": "> given Levinson’s incompetence\n\nIntellectually engaging with someone’s work then calling them incompetent in the same breath is kinda wild ngl\n\nI like your analysis and agree with your points tho"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I hope not"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I feel like too much has changed within the cast and crew’s lives."
    },
    {
        "subreddit": "euphoria",
        "sentence": "as a libra, yeah, makes sense"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’d really push OP to *not* use Rainman as an example of autism"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’d also push them to maybe reconsider Gilbert, as it goes a bit beyond autism"
    },
    {
        "subreddit": "euphoria",
        "sentence": "One of my favorite characters that represents autism, or at least what seems to be autism would be the lead in Eagle vs Shark (which also acknowledges bipolar, as eagle’s brother died from suicide and was bipolar)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Spork is also a really phenomenal movie on depression, anxiety, loneliness, growing up, and sexuality"
    },
    {
        "subreddit": "euphoria",
        "sentence": "1 hour photo is representative of trauma and what it can do to someone."
    },
    {
        "subreddit": "euphoria",
        "sentence": "She has bipolar disorder not bpd"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Also OCD"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The show seems to hint it is bipolar"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don’t remember if she was diagnosed with it as a kid, but it looked like “many” things that needed medication"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She did Google bipolar symptoms at one point"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’ve seen videos from psychiatrists watching euphoria who did identify it as bipolar"
    },
    {
        "subreddit": "euphoria",
        "sentence": "We don’t know, but it’s a strong possibility."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don’t agree"
    },
    {
        "subreddit": "euphoria",
        "sentence": "umm yeah not drake he does not have that much power over euphoria lol last I heard he like helped choose music for the series \n\nwhether a series like euphoria gets cancelled is left up to the company that releases it which is HBO and as of right now they’re pushing for a season 3 cuz it’s one of their biggest series ever"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I agree!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he still broke a law regardless because he had sex with a highschooler and he’s 22 why would he need a apology"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yes we do lol i’m pretty sure the directors wanted her to have bipolar disorder"
    },
    {
        "subreddit": "euphoria",
        "sentence": "if you’d ever watched any show with someone having bipolar disorder they portrayed everyone with bipolar disorder the same way they did rue"
    },
    {
        "subreddit": "euphoria",
        "sentence": "and if you know anyone with bipolar disorder then you could see how they mirror each other in a way"
    },
    {
        "subreddit": "euphoria",
        "sentence": "& not to mention rue literally looked up “would someone know that they have bipolar” after having no sleep all night, drinking coffee and dealing with something that might’ve stressed her out (which all can cause manic episodes) and going on a spiral about something jules did if doesn’t scream bipolar to you then idk what will."
    },
    {
        "subreddit": "euphoria",
        "sentence": "BPD is often considered a subset of cptsd where the trauma centers around abandonment, which i say definitely fits rue."
    },
    {
        "subreddit": "euphoria",
        "sentence": "idk if by BPD you meant bipolar disorder, but i think rue has borderline personality disorder as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "her addictive personality, her dependence on jules to the point where a rejection/ abandonment triggers a breakdown and a relapse, her aforementioned fear of abandonment, her impulsive behavior (choosing to run away with jules to try and avoid the prospect of abandonment) etc."
    },
    {
        "subreddit": "euphoria",
        "sentence": "8 please"
    },
    {
        "subreddit": "euphoria",
        "sentence": "uhhh hot take but if you’re mirroring rue the LAST thing you need right now is jules 💀"
    },
    {
        "subreddit": "euphoria",
        "sentence": "which makes it statutory rape, which is certainly an action which warrants legal punishment but is still a very different crime from regular rape, which is what she lied about."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah u can dm me 😊"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ive had the biggest crush on Jacob for a while now so the better question is, are you single?\nBut fr the resemblance is crazy"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You definitely do NOT need a flight risk to project your recovery on; didn’t go too well for rue"
    },
    {
        "subreddit": "euphoria",
        "sentence": "OUD (opioid use disorder) is one you could mention for her too"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It's been so long, I don't even remember what happened."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don't, it's dunzo I feel"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Most of the big players are off doing other stuff, and I doubt they'd be able to sync those calendars"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus, hole old will they be?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yep that's true"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Oh thats so interesting, thanks!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "if there is it should definitely be the last season they do"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No its one or the other, 1 is swinging to mania more often and 2 is swinging to depression more often (the most common one.) But sometimes someone can be diagnosed with bipolar 1 or 2 “with mixed features.” Usually because they have episodes of rapidly swinging back and forth."
    },
    {
        "subreddit": "euphoria",
        "sentence": "just rewatch the show?????"
    },
    {
        "subreddit": "euphoria",
        "sentence": "old post but what i’m confused about is how they record her getting injected with liquid morphine in season two"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the vial fills and mixes with her blood, so do they genuinely inject something like water or do they use a fake arm?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "y u mad"
    },
    {
        "subreddit": "euphoria",
        "sentence": "My love-hate relationship with this show is truly the spice of life"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s like talking with Sam: I like when he speaks his truth, except he gets distracted and talks about his Miami-Vice-drug-lord-music-video fantasies instead"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s when he loses the plot for me lol."
    },
    {
        "subreddit": "euphoria",
        "sentence": "First thing you need to know is bpd is borderline personality disorder, Rue has bipolar disorder and they are completely separate disorders."
    },
    {
        "subreddit": "euphoria",
        "sentence": "2 and 5 are my favorite"
    },
    {
        "subreddit": "euphoria",
        "sentence": "8, i just personally love 3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Rewatch the whole show instead! That’s never a bad idea 😊"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But for me personally, again a personal preference, I absolutely love dark stuff and angst so I’m all ears."
    },
    {
        "subreddit": "euphoria",
        "sentence": "she’s so fine"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Look who missed the point of Jules special episode"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Most definitely"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If the dude from Baby Reindeer can reenact his trauma, pretty sure the actress doing that can be possible too. \nPlus, the show is quite as dark as it is, like."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Minors having sex, drugs, doing lorn."
    },
    {
        "subreddit": "euphoria",
        "sentence": "At this point, I’m expecting anything either extremely dark or disturbing (Ahem, toilet guy)."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thanks fo  showing me this"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I almost felt bad for him being beat up by fezco but this took it away"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If I remember correctly, it was"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know it is defiantly from the first season, but it's like after a mental break down that had something to do with Jules and googled it because she thought she was having a maniac episode."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I need to rewatch this scene!!"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I find it both fascinating and hilarious that you got all of this deep analysis (which is very compelling, btw, so bravo) from things that Sam Levinson has presented, yet somehow still come to the conclusion that Levinson's incompetent."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean- I am a therapist with 8 years of experience and am trauma informed (tribes in several trauma modalities)technically cptsd is not recognized by the dsm- however, you could go to ten different clincians and get ten different diagnoses because symptoms overlap"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Cptsd is something I explore with a client when they have had long standing trauma (several different events or many events of the same kind of trauma or both) \nSome clinicians are very  “by the books which works for some people"
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, I find treating the symptoms is more important than the diagnosis in *most* cases"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If you be into it up to your therapist, I hope they don’t shoot you down and rather explore and talk with you about your ideas, symptoms, thoughts, and concerns"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I'd highly recommend watching Season 1 Episode 7, it portrays both her manic and depressive symptoms of bipolar, and as someone who has bipolar I'd say it's an accurate representation."
    },
    {
        "subreddit": "euphoria",
        "sentence": "But it adds context to why she would lie to and for Nate."
    },
    {
        "subreddit": "euphoria",
        "sentence": "mustve watched a different show then"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I dunno, I have BPD but I was an addict for a long time and that is how a lot of addicts would react to having their stash taken even if it *was* paid for"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Was that her? I thought it was Lexi googling it concerned after they talked on the phone."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think you might be misunderstanding the point of the assignment? \n\nI think you're supposed to pick a depiction of a mental illness from fiction so say for Autism you could pick Dustin Hoffman as Rain Man (Rain Man or Leonardo DiCaprio as Arnie Grape (What's Eating Gilbert Grape) or for BPD (of which Rue is too young to be diagnosed with anyways) Wynonna Ryder as Susanna or for ASPD Angelina Jolie from Girl, Interrupted, etc.\n\nRue doesn't have any diagnosed disorders"
    },
    {
        "subreddit": "euphoria",
        "sentence": "All she has for sure is substance abuse disorder"
    },
    {
        "subreddit": "euphoria",
        "sentence": "You'd be reaching and speculating diagnoses and I think your assignment would be stronger if you picked a fictional depiction of a mental disorder that is supported by the text"
    },
    {
        "subreddit": "euphoria",
        "sentence": "OCD, early onset bipolar 1, depression, substance abuse disorder"
    },
    {
        "subreddit": "euphoria",
        "sentence": "her mood swings and impulsive behavior showcase BPD rlly well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "as someone who has bpd, her outrage after her mom found the suitcase in s2 definitely resembled splitting in borderline"
    },
    {
        "subreddit": "euphoria",
        "sentence": "as well as other episodes like when she banged at fez’s door etc"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i’m sure op meant bipolar but again as someone w bpd rue is very relatable to me as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "people with bpd also struggle with impulsivity & decision making, hence the substance abuse"
    },
    {
        "subreddit": "euphoria",
        "sentence": "there was also a moment in which rue fainted in class claiming ‘there was no more air left in the world’ which is a\ncommon anxiety symptom (ocd being an anxiety disorder)."
    },
    {
        "subreddit": "euphoria",
        "sentence": "we all know this but it's not an excuse."
    },
    {
        "subreddit": "euphoria",
        "sentence": "It would be pretty dark, but I wouldn’t be surprised"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Which is interesting because her actress played a suicidal character in Sharp Objects"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She definitely can channel that energy because she’s done it before."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I hate every single character"
    },
    {
        "subreddit": "euphoria",
        "sentence": "There isn’t one I like or have any time for"
    },
    {
        "subreddit": "euphoria",
        "sentence": "They are all awful, awful humans"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The show has no one to root for"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don’t think it’s a competition and Maddie being a victim of Nate’s abuse has nothing to do with Cassie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It does contribute to why she would go along with the lies related to Tyler."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The development of her addiction stemming from her dads passing, the trialling of his pain pills spiraling into dependency, as well the preexisting mental health issues is really important to mention too"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Shes notably only 14 when he dies, so shes going through puberty trying to handle the grief of losing her father and coping with an already emotionally charged brain."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Id be careful with this one"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Rue is comorbid, theres a lot of overlap in symptoms that can make it difficult to discern what is what"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think the representation of bipolar- particularly in the kidney bladder and the investigator scene is pretty good"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Im not so sure about the representation of ocd"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I dont have ocd but there doesnt seem to be much emphasis on it, other than the tile counting scene, which is not really that useful of an example as its a very limiting and mainstream interpretation of ocd"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Her outburst with fez, her fights with her mom, her lying, and ofc her OD is really heartbreaking window into the impact and consequences SUD"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It really resonated with me as an addict with a little sister"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Id focus on bipolar and SUD for Rue"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She has symptoms of borderline, but the overlap with bipolar and ADHD and attachment types makes it harder to pin point"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Id avoid this only because it may come across poorly, unless you really research it well."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Well..this post is about the Tyler situation so that's why I brought up this part being unrealistic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I'm not going to bring up other random parts I find unrealistic because it's just not relevant right now."
    },
    {
        "subreddit": "euphoria",
        "sentence": "So thats the unrealistic part of Euphoria?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Can you have both 1 and 2??"
    },
    {
        "subreddit": "euphoria",
        "sentence": "How is cptsd diagnosed? It’s such a new term that I feel like some psychiatrists or therapists might not know a whole lot, I want to bring it up with my therapist cause I have all the symptoms and have had an interesting life, I’ll leave it at that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I would highlight #1 her substance use disorder, and I think there are very good examples of depression as well."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yah OCD, Panic disorder, generalized anxiety, ADHD, and depression here, when I saw the opening scene my jaw dropped because I’ve never been able to relate to a character like that."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Yeah that whole school was toxic and just an awful place to get your education at, everyone was on drugs and constantly getting drunk and no one ever faced any real consequences for their actions besides Rue, her mom was the only one who tried to help her the best she could and Rue was genuinely sick, not just an addict I believe she was also bipolar and had OCD, that’s tough to live with"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She also often called out people for their behaviour even Nate, it really seemed like she was the only one who couldn’t look past his bullshit"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I was so sad for Tyler"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even those involved in the case, teachers and the police all knew Nate was aggressive, it was obvious that he did it and even with Tylers (false) confession they surely couldn’t just forget or ignore the fact that Nate abused Maddy and was able to get away with it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "For the love of everything holy, Tyler still had unhealed injuries and bruises from the first time Nate broke into his apartment and beat him up"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know women often psychologically suffer because of the abuse they endure and go to massive lengths to try and protect their abuser so I can’t really blame Maddy for not wanting Nate to face any consequences, however she wasn’t exactly an innocent person, she lied about being taken advantage of by Tyler, I believe she lied to him about her age and had no problem sending an innocent man to jail."
    },
    {
        "subreddit": "euphoria",
        "sentence": "She seems like the type, but again just a theory"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I can’t say for sure or say “she would!” or “she shouldn’t!” but hopefully we get to know soon"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I couldn’t care less about Maddie."
    },
    {
        "subreddit": "euphoria",
        "sentence": "he also let nate slut shame and say disgusting things about cassie in season 1 and 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the guy doesnt have a backbone at all"
    },
    {
        "subreddit": "euphoria",
        "sentence": "this is a great point and i definitely agree"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i also think its a mix of how toxic and kinda misogynistic the school (specifically the guys on the football team) is and what you said"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i mean, most people believed that nate choked maddy and yet when the charges were dropped, even though theres a chance tyler could have been falsely imprisoned (he literally was lol) people still cheered for him when he went to that party i think midway through season 1"
    },
    {
        "subreddit": "euphoria",
        "sentence": "i guess, considering the environment nate lives in excuses and tolerates his behavior is why he has no concern over acting like an unhinged bag of dicks around his peers who dont seem to care."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Zendaya might have been the show in the beginning but no one even cares about her or her storyline anymore"
    },
    {
        "subreddit": "euphoria",
        "sentence": "this show is the adventures of Maddy and Cassie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yeah thats just not true lmfao"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I mean it's really hard to say"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She'll obviously fall deeper into the depression after all this happened but I'm not sure if she'd go that far"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But who knows"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But realistically, Cass needs a fucking therapist."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The OCD I think is her counting the window frames as a kid… the bipolar I think is shown in the manic and depressive episodes when she did the detective thing and never slept (mania) and then got the kidney infection (depressive episode)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Her outburst about the drugs being flushed reminded me of the blind rage that can come with borderline and then the regret after when she is crying and apologizing to Gia in the hall"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And her attachment to Jules reminds me of having a favorite person, another thing in borderline"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I’m sure she has anxiety and depression in general too, and possibly a panic disorder given the panic attacks"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Some things are hard to tell cause they can stem from being on drugs, but I think a lot of them caused her addiction in the first place"
    },
    {
        "subreddit": "euphoria",
        "sentence": "It’s very intertwined."
    },
    {
        "subreddit": "euphoria",
        "sentence": "enough"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "did u even watch the show jesus"
    },
    {
        "subreddit": "euphoria",
        "sentence": "embarrassment is a common feeling after being sa'ed"
    },
    {
        "subreddit": "euphoria",
        "sentence": "cassie is the biggest water sign there is"
    },
    {
        "subreddit": "euphoria",
        "sentence": "no one associates her cheating w that so chill"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I saw someone make a computer animated video of the Cassie restroom breakdown scene and it looked so real! Like it was meant to be like that the whole time"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But they didn't have one for Lexi."
    },
    {
        "subreddit": "euphoria",
        "sentence": "The top part does"
    },
    {
        "subreddit": "euphoria",
        "sentence": "All she needed was pigtails and either ruby or silver slippers."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This is late and I am so sorry but everyone here thinks otherwise but I personally think she’s going to either successfully commit suicide or at least attempt.\nShe’s gone through so much, whether you like her or not"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus, Cassie has Depression therefore she is more likely to experience suicidal thoughts.\nI don’t wish she dies, but I honestly hope Euphoria has it happen to show sometimes people can go way too far plus to spread awareness to suicide"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Plus, got beat up in front of the whole school, lost her best friend and her boyfriend at the same time, lost her dad."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Probably may have no will to live."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This one is small but \n\nThere’s a scene where she’s pacing back and forth outside when she’s talking about being bipolar I believe and to me it looks like she’s taking a certain amount of steps and counting them before she starts walking in the other direction (she zig zags back and forth multiple times)"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I know she’s supposed to look manic in that scene but she could’ve also been counting steps and that could be her ocd as well"
    },
    {
        "subreddit": "euphoria",
        "sentence": "That’s just imo."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Maddy just uses people around her, yes she gets abused by Nate but that doesn’t mean she can’t do wrong by others"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She is a horrible friend and person in general who just cares about appearances and money never actually cares for others until it either affects her or negatively reflects on her plus she only pretends to care if she can benefit from it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "f they cancel it after all this wait and hiatus letting fans wonder, we better get deleted scenes, and more content from season 1 and 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "if they cancel it after all this wait and hiatus letting fans wonder, we better get deleted scenes, and more content from season 1 and 2"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I did think so until the news that Sam has until October to write a better season and if HBO likes it they will film next year"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think around October they will just decide to cancel it. \n\n\nI don't think Fez not being there would have made a huge difference though as much as I liked him and as sad as the actors death was"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I think it's just a combo of bad writing, how much time has passed, and the actors busy schedule will be the reason for no season 3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3 is so boring and basic"
    },
    {
        "subreddit": "euphoria",
        "sentence": "it's a preppy forever 21 outfit that you see teens wear to the mall."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I would also say, make sure to add when she googled if a Bipolar person knows if they are Bipolar"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I always think that is an interesting scene, because I don't know if other people have been there, but I sure have."
    },
    {
        "subreddit": "euphoria",
        "sentence": "This isn’t something to romanticize"
    },
    {
        "subreddit": "euphoria",
        "sentence": "If that’s the case you need help not a real life version of Jules"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol you didn't ruin no one's day"
    },
    {
        "subreddit": "euphoria",
        "sentence": "She doesn't have anything except drug addiction"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Sorry to ruin everyone's whole day lol but I find it pretty unrealistic how the police apparently dealt with Tyler"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I don't remember them ever actually saying that legal punishment he got but he wouldn't be given life in prison for rape just because a girl with bruises said he raped her and so did witnesses"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He would have been given like a month in jail for assault, nothing for rape because there's no proof, and probably probation or something"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But everyone's acting like the man's gonna be in prison forever which just isn't very likely, he wouldn't even get a couple of years for it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Even when someone gets a rape kit done right after a rape actually happens, the chances of the man getting arrested already aren't that high, life in prison tho? Extremely rare"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A few months in jail? Possibly but likely not."
    },
    {
        "subreddit": "euphoria",
        "sentence": "I was trying to figure out the distinctive points in the show that show her bipolar symptoms"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I couldn’t think of any so if anyone has insight that’d be great"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But for me personally I only saw the highs and lows as a symptom of drug use and withdrawal"
    },
    {
        "subreddit": "euphoria",
        "sentence": "I had no idea her character was diagnosed with bipolar at one point."
    },
    {
        "subreddit": "euphoria",
        "sentence": "as someone with OCD, ADHD, and BPD,i find rue to be the most relatable character i've ever seen"
    },
    {
        "subreddit": "euphoria",
        "sentence": "the comorbidity of such drastic disorders makes life a living hell and z portrays it brilliantly"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Ok."
    },
    {
        "subreddit": "euphoria",
        "sentence": "i could see that happening and theres a big chance of that but the idol got cancelled after 1 season."
    },
    {
        "subreddit": "euphoria",
        "sentence": "and it wasn’t received well by people , so if hes smart hed leave jocelyn and the idol seperate from it because the idol was a flop."
    },
    {
        "subreddit": "euphoria",
        "sentence": "However, is that due to bipolar or cycling through drugs and withdrawal? That’s what I’d wanna know! We don’t really have a baseline for Rue"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He wasn't framed or accused of a sex offense, so what happens to sex offenders is frankly irrelevent to tyler's situation."
    },
    {
        "subreddit": "euphoria",
        "sentence": "So? The accusation was *taken* as true, if it wasn't, then he would still be a free man"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Every rapist who walks into prison has the same \"I didn't really do it\" story so I highly doubt that the inmates/guards would believe him even though he's not lying"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Although Maddy/Nate apologizing to him won't take the past back, if they tried to get him outta prison with Jules' help, then that would be commendable"
    },
    {
        "subreddit": "euphoria",
        "sentence": "But a simple \"I'm sorry\" won't cut it."
    },
    {
        "subreddit": "euphoria",
        "sentence": "i can def agree, it’s weird to wanna sleep with 20+ yr olds but not pedo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "3"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Thanks for the reminder, i havent watched it since season 2 came  out"
    },
    {
        "subreddit": "euphoria",
        "sentence": "The carnival scene heavily implied he very much did"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Pls don’t someone had already done it for her and Cassie"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lolll it is a little weird that grown ass adults go for adults that double their age  but yeah, it is not pedo"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He is constantly treated like a helpless toddler, people just roll with his childlike outbursts… \n\nI assume his parents neglected him, never actually raised him or gave him any love, so he acted out and due to his parents being quite influential in their town no one ever dared to oppose him, to tell him off for his inappropriate behaviour"
    },
    {
        "subreddit": "euphoria",
        "sentence": "At the time people realised how dangerous he actually was, they were all too afraid of him to do anything about it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Whenever his peers don’t get along with what he says or does, he gets violent"
    },
    {
        "subreddit": "euphoria",
        "sentence": "He doesn’t have any friends people are just terrified of him and his family so they roll with whatever just to avoid being victims of his violent outbursts."
    },
    {
        "subreddit": "euphoria",
        "sentence": "i think if you have Att for a phone company, you can get hbo free from it"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Oh ok thanks"
    },
    {
        "subreddit": "euphoria",
        "sentence": "And speaking euphoria they do have some episodes available for free to watch on daily motion.com but it's not the whole 2 seasons sadly."
    },
    {
        "subreddit": "euphoria",
        "sentence": "no"
    },
    {
        "subreddit": "euphoria",
        "sentence": "but i see a lot of “he goes for 18 year olds! that’s gross he’s a pedo” kinda stuff"
    },
    {
        "subreddit": "euphoria",
        "sentence": "a fat ass headache"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Does he regret doing it with Jules?"
    },
    {
        "subreddit": "euphoria",
        "sentence": "well i’ll tell you now, she wasn’t ask on her age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "he did try to lie and say “that’s not what she told me” but i went back on that episode and it wasn’t mentioned."
    },
    {
        "subreddit": "euphoria",
        "sentence": "idk i feel like a man who openly sleeps with random girls not asking their age, then trying to lie saying they said they were 18- should get beat idk."
    },
    {
        "subreddit": "euphoria",
        "sentence": "Lol i wish but I don't have HBO anymore."
    },
    {
        "subreddit": "euphoria",
        "sentence": "she didn’t lie about her age"
    },
    {
        "subreddit": "euphoria",
        "sentence": "yall really need to rewatch this show lol"
    },
    {
        "subreddit": "euphoria",
        "sentence": "A real apology is recounting her statement and accepting any punishment given to her"
    },
    {
        "subreddit": "euphoria",
        "sentence": "No amount of words will take back the hell he endured from both of them"
    },
    {
        "subreddit": "euphoria",
        "sentence": "Anything else is just her trying to clear her conscience."
    }
]