[
    {
        "subreddit": "movies",
        "sentence": "It’s already a TV series and movie."
    },
    {
        "subreddit": "movies",
        "sentence": "It holds up"
    },
    {
        "subreddit": "movies",
        "sentence": "Mel Gibson has been blacklist for over 20 year, long enough y’all are just a bunch of haters"
    },
    {
        "subreddit": "movies",
        "sentence": "Everyone’s hating on the Jews now with the whole Palestine yet it’s Mel Gibson who has apologized is still getting hate? nothing makes sense"
    },
    {
        "subreddit": "movies",
        "sentence": "This world is upside down and inside out."
    },
    {
        "subreddit": "movies",
        "sentence": "I don't think so"
    },
    {
        "subreddit": "movies",
        "sentence": "She went from being in a mildly famous family to a nobody as they lost relevancy to having a sex tape leaked and she is a household name now and the rest of her family is famous as a result."
    },
    {
        "subreddit": "movies",
        "sentence": "That's what is going on now?! Wow, I remember when they used to have ushers that didn't want people bootlegging or taping the movie let alone having to answer their cell phones during the picture but now they're allowed to just video chat and Tik Tok? Smh that app has poisoned the entire United States."
    },
    {
        "subreddit": "movies",
        "sentence": "I really wanted to love that movie, but I can't."
    },
    {
        "subreddit": "movies",
        "sentence": "Well directed and acted"
    },
    {
        "subreddit": "movies",
        "sentence": "But retconning Damien's jackal mother to a jackal father was a narrative disaster"
    },
    {
        "subreddit": "movies",
        "sentence": "There would've been so many more themes to examine and discover had they made the protagonist a male priest in the seminary, perhaps struggling with his sexuality etc etc"
    },
    {
        "subreddit": "movies",
        "sentence": "Instead the writers went down the \"scream queen\" route and added a little twist to set up what will undoubtedly be subpar sequels"
    },
    {
        "subreddit": "movies",
        "sentence": "Easily the best Omen movie since the original, but a disappointment nonetheless."
    },
    {
        "subreddit": "movies",
        "sentence": "* Paprika (2006)\n* Ghost in The Shell (1995)\n* Junk Head (2017)\n* The Animatrix (2003)\n* Fantastic Planet (1973)\n* Gandahar (1987)\n* Felidae (1994)\n* Sausage Party (2016)\n* Coraline (2009)\n* Starchaser (1985)\n* Nimona (2023)\n* Mad God (2021)"
    },
    {
        "subreddit": "movies",
        "sentence": "Agreed"
    },
    {
        "subreddit": "movies",
        "sentence": "Your Name is so good"
    },
    {
        "subreddit": "movies",
        "sentence": "I love it."
    },
    {
        "subreddit": "movies",
        "sentence": "This guy makes very unique and fascinating films"
    },
    {
        "subreddit": "movies",
        "sentence": "Ink and The Frame are both a bit rough around the edges but are very conceptually strong and hard not to appreciate, and this absolutely looks to be continuing that trend"
    },
    {
        "subreddit": "movies",
        "sentence": "What a great idea"
    },
    {
        "subreddit": "movies",
        "sentence": "Time for a rewatch, I need some of that energy."
    },
    {
        "subreddit": "movies",
        "sentence": "Makoto Shinkai has been on a roll, Your Name, Weathering With You and Suzume were all tremendous, both artistically and emotionally."
    },
    {
        "subreddit": "movies",
        "sentence": "There’s Something About Mary"
    },
    {
        "subreddit": "movies",
        "sentence": "Oh my gosh!\n\n\nThe Riddler's in this!"
    },
    {
        "subreddit": "movies",
        "sentence": "Thank you for saying Castlevania"
    },
    {
        "subreddit": "movies",
        "sentence": "That was one of my picks too(have not seen Nocturne yet but I'm looking forward to when i do get around to it)."
    },
    {
        "subreddit": "movies",
        "sentence": "The leads in Casablanca and It’s a Wonderful Night all thought they were making forgettable, if not bad, films."
    },
    {
        "subreddit": "movies",
        "sentence": ">CHUCKIE: Look, you're my best friend, so don't take this the wrong way, but in 20 years, if you're livin' next door to me, comin' over watchin' the fuckin' Patriots' games and still workin' construction, I'll fuckin' kill you"
    },
    {
        "subreddit": "movies",
        "sentence": "And that's not a threat, that's a fact"
    },
    {
        "subreddit": "movies",
        "sentence": "I'll fuckin' kill you.\n\n> WILL: Chuckie, what are you talkin'...\n\n> CHUCKIE: Listen, you got somethin' that none of us have.\n\n> WILL: Why is it always this? I owe it to myself? What if I don't want to?\n\n> CHUCKIE: Fuck you"
    },
    {
        "subreddit": "movies",
        "sentence": "You owe it to me"
    },
    {
        "subreddit": "movies",
        "sentence": "Tomorrow I'm gonna wake up and I'll be fifty and I'll still be doin' this"
    },
    {
        "subreddit": "movies",
        "sentence": "And that's all right 'cause I'm gonna make a run at it"
    },
    {
        "subreddit": "movies",
        "sentence": "But you, you're sittin' on a winning lottery ticket and you're too much of a pussy to cash it in"
    },
    {
        "subreddit": "movies",
        "sentence": "And that's bullshit 'cause I'd do anything to have what you got! And so would any of these guys"
    },
    {
        "subreddit": "movies",
        "sentence": "It'd be a fuckin' insult to us if you're still here in twenty years."
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah, I meant Aliens"
    },
    {
        "subreddit": "movies",
        "sentence": "Alien is more claustrophobic, but the sequel is still pretty scary"
    },
    {
        "subreddit": "movies",
        "sentence": "The \"they're 2 meters away!\" scene comes to mind"
    },
    {
        "subreddit": "movies",
        "sentence": "The face hugger on the loose, all the blood and gore"
    },
    {
        "subreddit": "movies",
        "sentence": "Action fits too, but I still consider it horror, first and foremost"
    },
    {
        "subreddit": "movies",
        "sentence": "The aliens are monsters, as is a human."
    },
    {
        "subreddit": "movies",
        "sentence": "I think smith was hilarious, and there was a lot of comedy in it.\n\nLike Smith not being able to 'synchronize' with her, which had never happened to him before."
    },
    {
        "subreddit": "movies",
        "sentence": "It's both."
    },
    {
        "subreddit": "movies",
        "sentence": "Fargo (1996)\n\n\nRushmore (1998)\n\n\n\nThe Matrix (1999)\n\n\nJarhead (2005)\n\n\nThe Road (2009)"
    },
    {
        "subreddit": "movies",
        "sentence": "I saw that at the Drive In!"
    },
    {
        "subreddit": "movies",
        "sentence": "I thought the machines were going to rise from the ashes of nuclear fire to exterminate mankind"
    },
    {
        "subreddit": "movies",
        "sentence": "Instead they're making my favorite movies look shitty and flooding the internet with weird porn"
    },
    {
        "subreddit": "movies",
        "sentence": "I think this is worse."
    },
    {
        "subreddit": "movies",
        "sentence": "Well, now I need to watch ***Ed Wood*** again."
    },
    {
        "subreddit": "movies",
        "sentence": "The Book of Hell's and Wolf Walkers.\nLoved them both so much and rewatch twice a year or so."
    },
    {
        "subreddit": "movies",
        "sentence": "I haven't seen the new one but although I really like Dawn, I don't think they hold a candle to the Irish Folklore trilogy"
    },
    {
        "subreddit": "movies",
        "sentence": "You do know not every movie has to change your life, right?\n\nIt's a pretty okay and entertaining movie with nice visuals and no forced lesson at the end, which is getting rare these days."
    },
    {
        "subreddit": "movies",
        "sentence": "Thank you for including ATLA and LoK"
    },
    {
        "subreddit": "movies",
        "sentence": "And X-Men 97."
    },
    {
        "subreddit": "movies",
        "sentence": "I love this film, but mostly for the first half - the premise, the world-building"
    },
    {
        "subreddit": "movies",
        "sentence": "The second half is just boring run-of-the-mill action movie"
    },
    {
        "subreddit": "movies",
        "sentence": "Nobody asked for this"
    },
    {
        "subreddit": "movies",
        "sentence": "Patlabor movies"
    },
    {
        "subreddit": "movies",
        "sentence": "Anything by Mamoru Oshii really or Satoshi Kon or Hideaki Anno."
    },
    {
        "subreddit": "movies",
        "sentence": "In France, Le Roi et l'Oiseau (1953!) is a classic"
    },
    {
        "subreddit": "movies",
        "sentence": "It aged like fine wine.\n\nOtherwise, Persepolis is a must watch, especially in the current climate.\n\nMaybe more for kids, but beautiful nonetheless, Kirikou and Azur et Asmar.\n\nEt voilà.\n\nEdit: oh and I forgot all the graduation films made by the students of Les Gobelins, the most famous animation school in France"
    },
    {
        "subreddit": "movies",
        "sentence": "They all are and YouTube and a lot of them are real gems."
    },
    {
        "subreddit": "movies",
        "sentence": "I'm not saying this particular video is or isn't AI narration, but it could be"
    },
    {
        "subreddit": "movies",
        "sentence": "I've noticed a lot of youtubers now cloning their own voice with something like [https://elevenlabs.io/voice-cloning](https://elevenlabs.io/voice-cloning) \n\nThen they can just write the script and get AI to record it in their voice, saving them time and convincing most people that it's them."
    },
    {
        "subreddit": "movies",
        "sentence": "Makoto Shinkai films are masterpieces of animation and artwork"
    },
    {
        "subreddit": "movies",
        "sentence": "Like.."
    },
    {
        "subreddit": "movies",
        "sentence": "All of them"
    },
    {
        "subreddit": "movies",
        "sentence": "They should almost be one of the exclusions because of how solid and fantastic they are."
    },
    {
        "subreddit": "movies",
        "sentence": "Did you mean to say Aliens? I always felt that for both series, 1 is more horror and 2 is more action."
    },
    {
        "subreddit": "movies",
        "sentence": ".mkv is a container format and has nothing to do with quality; an .mp4 file can contain the same encoded video and audio streams as an .mkv with no real difference to playback.\n\nRegarding OP's question, there is no recommended size, instead you want to adjust the constant quality setting"
    },
    {
        "subreddit": "movies",
        "sentence": "If it's a 1080p source or lower, encode using x264 and set the constant quality setting to around 20, then tweak it as you see fit"
    },
    {
        "subreddit": "movies",
        "sentence": "Find a Handbrake walkthrough."
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks for clarifying"
    },
    {
        "subreddit": "movies",
        "sentence": "Clint Eastwood in Dirty Harry."
    },
    {
        "subreddit": "movies",
        "sentence": "Lethal Weapon"
    },
    {
        "subreddit": "movies",
        "sentence": "I don’t think Riggs or Murtaugh were detectives"
    },
    {
        "subreddit": "movies",
        "sentence": "But it fits otherwise.\n\n\nLast Action Hero was the first that came to mind though"
    },
    {
        "subreddit": "movies",
        "sentence": "😅"
    },
    {
        "subreddit": "movies",
        "sentence": "La Planete Sauvage! Also known as Fantastic Planet in English"
    },
    {
        "subreddit": "movies",
        "sentence": "Trippy"
    },
    {
        "subreddit": "movies",
        "sentence": "As"
    },
    {
        "subreddit": "movies",
        "sentence": "Hell."
    },
    {
        "subreddit": "movies",
        "sentence": "That’s Tom Tykwer mentioned twice in the thread now, it must be a sign."
    },
    {
        "subreddit": "movies",
        "sentence": "Anastasia \n\nThe Road to El Dorado\n\nThe Iron Giant\n\nThe Swan Princess \n\nIce Age\n\nShrek"
    },
    {
        "subreddit": "movies",
        "sentence": "Event Horizon is so dark"
    },
    {
        "subreddit": "movies",
        "sentence": "It is properly a horror film."
    },
    {
        "subreddit": "movies",
        "sentence": "“First rule of fight club is you don’t talk about fight club second rule of fight club is you don’t talk about fight club”"
    },
    {
        "subreddit": "movies",
        "sentence": "Interface"
    },
    {
        "subreddit": "movies",
        "sentence": "New Rose Hotel"
    },
    {
        "subreddit": "movies",
        "sentence": "Hideously bad movie, but is definitively cyberpunk, being a somewhat direct adaptation of a William Gibson short story."
    },
    {
        "subreddit": "movies",
        "sentence": "all of those besides black panther had a real chance of staying dead"
    },
    {
        "subreddit": "movies",
        "sentence": "Kung Fu Panda 2 is so ridiculously good, it's kinda absurd"
    },
    {
        "subreddit": "movies",
        "sentence": "I mean the fact that can't of the movies in the trilogy are good is absurd, is a movie about a talking Panda who does kung Fu and he's voiced by Jack Black"
    },
    {
        "subreddit": "movies",
        "sentence": "However, the second one is just magnificent from paper to presentation."
    },
    {
        "subreddit": "movies",
        "sentence": "Looper"
    },
    {
        "subreddit": "movies",
        "sentence": "Jay amd silent bob strike back"
    },
    {
        "subreddit": "movies",
        "sentence": "It's not necessary, it gets even better if you watch clerks, mallrats (another great really dumb movie), chasing Amy and dogma beforehand"
    },
    {
        "subreddit": "movies",
        "sentence": "Also, though there is a lot of hate for it"
    },
    {
        "subreddit": "movies",
        "sentence": "Movie 43"
    },
    {
        "subreddit": "movies",
        "sentence": "It's rather a short film collection, loosely connected by a really dumbain plot and the quality of the short films varies quite a bit"
    },
    {
        "subreddit": "movies",
        "sentence": "But they are all dumb at the core while some being also quite genius but also always offensive"
    },
    {
        "subreddit": "movies",
        "sentence": "And the cast is amazing"
    },
    {
        "subreddit": "movies",
        "sentence": "At least watch the short film with Kate Winslet and hugh Jackman, it's the first one anyway."
    },
    {
        "subreddit": "movies",
        "sentence": "It is"
    },
    {
        "subreddit": "movies",
        "sentence": "Because it is"
    },
    {
        "subreddit": "movies",
        "sentence": "At least partially"
    },
    {
        "subreddit": "movies",
        "sentence": "Genre is fluid and far from an exact science"
    },
    {
        "subreddit": "movies",
        "sentence": "If you told me you thought it was a horror picture and gave me reasons why you felt that way, I’d probably agree with you."
    },
    {
        "subreddit": "movies",
        "sentence": "I think of it as horror"
    },
    {
        "subreddit": "movies",
        "sentence": "It's pretty much a slasher"
    },
    {
        "subreddit": "movies",
        "sentence": "I think T2 (which is way more of an action movie) probably colours a lot of people's opinions, too."
    },
    {
        "subreddit": "movies",
        "sentence": "Vampire Hunter D: Bloodlust\n\nRedline\n\nShrek fucking 2\n\nIron Giant"
    },
    {
        "subreddit": "movies",
        "sentence": "You might wanna drop them a thank you note."
    },
    {
        "subreddit": "movies",
        "sentence": "Yes!! The concept was so great but the movie was fucking terrible"
    },
    {
        "subreddit": "movies",
        "sentence": "Especially the second half"
    },
    {
        "subreddit": "movies",
        "sentence": "How Matt Damon read that script and said yeah I def want to do that is beyond me"
    },
    {
        "subreddit": "movies",
        "sentence": "Mars Attacks!"
    },
    {
        "subreddit": "movies",
        "sentence": "Ugh, did his brother get into more debt with the mobsters again?"
    },
    {
        "subreddit": "movies",
        "sentence": "My family quotes this almost every day"
    },
    {
        "subreddit": "movies",
        "sentence": "Any time somebody is eating something they'll get a \"what are ya eating there sport?\" And the response is always, no mostter what they're eating is \"an apple\"."
    },
    {
        "subreddit": "movies",
        "sentence": "this! made me feel disappointed with that scene until the end."
    },
    {
        "subreddit": "movies",
        "sentence": "Old - overacting, weird pacing and weird plot developments\n\nDownsizing - became a different movie 1/3 of the way in\n\nTimeline - enjoyed the Crichton novel"
    },
    {
        "subreddit": "movies",
        "sentence": "The movie was a lazy, cynical cash grab.\n\nGlass - let’s finally do this movie everyone’s wanted for years and have one half-assed fight sequence in a parking lot."
    },
    {
        "subreddit": "movies",
        "sentence": "The Animatrix and The Prince of Egypt"
    },
    {
        "subreddit": "movies",
        "sentence": "I also have a soft spot for Scooby Doo on Zombie Island."
    },
    {
        "subreddit": "movies",
        "sentence": "Ooh I forgot about The Willoughbys, we watched without kids and thought it was excellent."
    },
    {
        "subreddit": "movies",
        "sentence": "\"You see, the train doesn't stop at Tucumcari.\"    \n\n\"This train'll stop at Tucumcari.\""
    },
    {
        "subreddit": "movies",
        "sentence": "Well the execs don't mind so long as it temporarily increases profit"
    },
    {
        "subreddit": "movies",
        "sentence": "What does a cheap hooker know about critical thinking? 😭"
    },
    {
        "subreddit": "movies",
        "sentence": "Time travel + robots = Science fiction"
    },
    {
        "subreddit": "movies",
        "sentence": "It's an intense, dark film at times that I found kinda scary as a kid but I'd be hard pressed to explain it as anything other than sci-fi"
    },
    {
        "subreddit": "movies",
        "sentence": "Aliens I could definitely make a case for even though it's got elements of sci-fi and action, but not so much the first Terminator."
    },
    {
        "subreddit": "movies",
        "sentence": "Your Name had me bawling, it wrecked me emotionally"
    },
    {
        "subreddit": "movies",
        "sentence": "I love that movie."
    },
    {
        "subreddit": "movies",
        "sentence": "I think it's because the Terminator is a strong main character, not some faceless threat hiding in the dark"
    },
    {
        "subreddit": "movies",
        "sentence": "He (?) is equally at home in broad daylight where everyone can see his face"
    },
    {
        "subreddit": "movies",
        "sentence": "He doesn't care about scaring his victims, or making any kind of statement"
    },
    {
        "subreddit": "movies",
        "sentence": "He just wants them dead."
    },
    {
        "subreddit": "movies",
        "sentence": "James Dean in anything tbh"
    },
    {
        "subreddit": "movies",
        "sentence": "It's a film with horror beats, but it's more of a sci-fi action flick"
    },
    {
        "subreddit": "movies",
        "sentence": "To many guns for a proper horror feel and it feels like the MC is chased rather than stalked."
    },
    {
        "subreddit": "movies",
        "sentence": "My most recent example is The American Society of Magical Negroes"
    },
    {
        "subreddit": "movies",
        "sentence": "My first thought was Jeff Bridges in \"True Grit\" 2010"
    },
    {
        "subreddit": "movies",
        "sentence": "I'm sure there are better but his character stuck with me."
    },
    {
        "subreddit": "movies",
        "sentence": "I believe that's when he left to go make Breaking Bad"
    },
    {
        "subreddit": "movies",
        "sentence": "It's still a trash movie"
    },
    {
        "subreddit": "movies",
        "sentence": "Matt Damon's shitty spanish, the half ass love plot"
    },
    {
        "subreddit": "movies",
        "sentence": "It's all trash but that ok same level kid"
    },
    {
        "subreddit": "movies",
        "sentence": "Your Name\n\n\nCastlevania\n\n\nSpider-Man: Into The Spider-verse\n\n\nAvatar the Last Airbender\n\n\nThe Legend of Korra\n\n\nNot sure if these can count because they are by Dreamworks/Pixar but, Kung Fu Panda and the How To Train Your Dragon movies.\n\n\nAmerican Dad(although Disney does own them now currently).\n\n\nMy Hero Academia\n\n\nX-men 97\n\n\nThe Lego Movie\n\n\nMy Adventures With Superman"
    },
    {
        "subreddit": "movies",
        "sentence": "Balls of Fury, Half-Baked, The Other Guys, The Suicide Squad"
    },
    {
        "subreddit": "movies",
        "sentence": "I feel your pain with Cocaine Bear"
    },
    {
        "subreddit": "movies",
        "sentence": "I was excited to watch that movie when it released and I ended up turning it off abt 15min into the movie because I was so disappointed."
    },
    {
        "subreddit": "movies",
        "sentence": "I used to get hammered and watch Jupiter ascending so I could get a baseline for how movies can be."
    },
    {
        "subreddit": "movies",
        "sentence": "It's sensational."
    },
    {
        "subreddit": "movies",
        "sentence": "Secret of NIMH\n\nAn American Tail\n\nThe Bad Guys\n\nThe Spider-Verse movies\n\nThe Last Unicorn\n\nThe Land Before Time\n\nNimona\n\nRango\n\nScooby-Doo on Zombie Island\n\nWolfwalkers\n\nTMNT: Mutant Mayhem\n\nThe Melancholy of Haruhi Suzumiya\n\nDigimon the Movie\n\nSummer Wars\n\nThe Girl Who Leapt Through Time\n\nLittle Nemo\n\nWolf Children\n\nMaquia\n\nYour Name\n\nK-On the Movie\n\nI Want to Eat Your Pancreas"
    },
    {
        "subreddit": "movies",
        "sentence": "Allegro Non Troppo\n\nFantastic Planet\n\nHeavy Metal"
    },
    {
        "subreddit": "movies",
        "sentence": "Waiting for this one!!"
    },
    {
        "subreddit": "movies",
        "sentence": "Upgrade is absolutely amazing"
    },
    {
        "subreddit": "movies",
        "sentence": "All good movies but pretty much all (other than Akita and Elysium) are just regular sci fi"
    },
    {
        "subreddit": "movies",
        "sentence": "People acting like this hasn't been adapted recently.. \n\n\nUmmm 2024 Russia release people"
    },
    {
        "subreddit": "movies",
        "sentence": "Get with the times:\n\n\nhttps://m.imdb.com/title/tt14536120/\n\n\nIt's been done"
    },
    {
        "subreddit": "movies",
        "sentence": "And they did a pretty damn good job at it."
    },
    {
        "subreddit": "movies",
        "sentence": "I also found her performance in Last Night in Soho to be flat and one note"
    },
    {
        "subreddit": "movies",
        "sentence": "Loved her in The Witch and Emma"
    },
    {
        "subreddit": "movies",
        "sentence": "Agree with you about The Menu"
    },
    {
        "subreddit": "movies",
        "sentence": "Very excited to see Furiosa.."
    },
    {
        "subreddit": "movies",
        "sentence": "Noriko Dinner Table (2005)"
    },
    {
        "subreddit": "movies",
        "sentence": "This comment, like the movie, unironically aged like fine wine"
    },
    {
        "subreddit": "movies",
        "sentence": "Night Patrol"
    },
    {
        "subreddit": "movies",
        "sentence": "On netflix you have to dig to find gold but sometimes you still find it.\nI really liked gulliermo del Toros pinocchio and for the holiday season Klaus."
    },
    {
        "subreddit": "movies",
        "sentence": "We've been blown away by how good it's been"
    },
    {
        "subreddit": "movies",
        "sentence": "Glad they're making more."
    },
    {
        "subreddit": "movies",
        "sentence": "Into the Spiderverse and even more so, Across the Spiderverse"
    },
    {
        "subreddit": "movies",
        "sentence": "Was there a movie where Paul Newman didn't look like the coolest guy in the room?"
    },
    {
        "subreddit": "movies",
        "sentence": "I watched the original, then the sequel, in one fell swoop"
    },
    {
        "subreddit": "movies",
        "sentence": "For me, the sequel was ruined by the endless, pointless fight scenes"
    },
    {
        "subreddit": "movies",
        "sentence": "As IF you would make a big effort to meet the man you think is your father, then spend an hour beating the s—t out of him (while surrounded by Elvis and Sinatra holograms, wtf) …before mentioning the purpose of your visit"
    },
    {
        "subreddit": "movies",
        "sentence": "Why not just insert POW! and WHAM! slides like they did in the old Batman cartoons, and spare us the boring details? Then we are supposed to believe that the conclusion is profound because our hero looks SAD when he finally succumbs to his injuries"
    },
    {
        "subreddit": "movies",
        "sentence": "Well, all those humans and replicants you killed had feelings and memories too, Ryan."
    },
    {
        "subreddit": "movies",
        "sentence": "Titan A.E"
    },
    {
        "subreddit": "movies",
        "sentence": "Next you'll tell me they don't wanna watch Alien for the same reason"
    },
    {
        "subreddit": "movies",
        "sentence": "Get new friends."
    },
    {
        "subreddit": "movies",
        "sentence": "Mad Max Fury Road"
    },
    {
        "subreddit": "movies",
        "sentence": "I didn’t say represent the real world"
    },
    {
        "subreddit": "movies",
        "sentence": "\"welcome to the real world\" is a common phrase here in America that is a colloquialism for experiencing that which is unpleasant."
    },
    {
        "subreddit": "movies",
        "sentence": "But...why?"
    },
    {
        "subreddit": "movies",
        "sentence": "The king and the mockingbird (1953)\nBy french producer Paul Grimault"
    },
    {
        "subreddit": "movies",
        "sentence": "People who don't notice the Madame Tussaud cameos never will so...yeah\n\nMy guess is those reviews could be paid for, but remember even if they aren't they are still encouraged to maintain ties with the companies.\n\nThe best review for you, is your own"
    },
    {
        "subreddit": "movies",
        "sentence": "Or Paul Newman just, like, hanging out..."
    },
    {
        "subreddit": "movies",
        "sentence": "Days of thunder used to shake the house good with a subwoofer."
    },
    {
        "subreddit": "movies",
        "sentence": "I'm watching Willie Nelson documentary"
    },
    {
        "subreddit": "movies",
        "sentence": "He was a strange from his wife And he met the singer and recorded a song with her that he didn't even write"
    },
    {
        "subreddit": "movies",
        "sentence": "He said the sexual tension was palpable between them and was reflected in the song"
    },
    {
        "subreddit": "movies",
        "sentence": "This has to be where they got the duet scene in Dewey Cox."
    },
    {
        "subreddit": "movies",
        "sentence": "I agree with your first paragraph, and then it nosedives from there my dude."
    },
    {
        "subreddit": "movies",
        "sentence": "I appreciate it! I want to expose him to all types of art"
    },
    {
        "subreddit": "movies",
        "sentence": "Sometimes that art is jarring.\n\nFantastic suggestions!"
    },
    {
        "subreddit": "movies",
        "sentence": "Your Name fucking destroyed me emotionally"
    },
    {
        "subreddit": "movies",
        "sentence": "Gave me bittersweet emotions"
    },
    {
        "subreddit": "movies",
        "sentence": "I love that movie, even though i know I'll bawl my eyes out watching it again."
    },
    {
        "subreddit": "movies",
        "sentence": "Movies that represent the real world...right."
    },
    {
        "subreddit": "movies",
        "sentence": "Arcane is absolutely brilliant"
    },
    {
        "subreddit": "movies",
        "sentence": "Season 2 finally coming in November!"
    },
    {
        "subreddit": "movies",
        "sentence": "I am shocked at the lack of hoodwinked on this thread"
    },
    {
        "subreddit": "movies",
        "sentence": "It is"
    },
    {
        "subreddit": "movies",
        "sentence": "It's horror-scifi, just like Alien, Predator, Event Horizon, and The Thing.\n\nHowever, we have to have separate genres to put stories into and horror is its own genre"
    },
    {
        "subreddit": "movies",
        "sentence": "Terminator's core premise is scifi, with horror being the tone"
    },
    {
        "subreddit": "movies",
        "sentence": "So it goes in the 'scifi' bucket."
    },
    {
        "subreddit": "movies",
        "sentence": "That was my biggest gripe with the story"
    },
    {
        "subreddit": "movies",
        "sentence": "There's a making-of documentary that showed exactly what went on behind the scenes and it's mindblowing that a gigantic production like this didn't have their core story / emotional arc figured out when it was months away from release"
    },
    {
        "subreddit": "movies",
        "sentence": "They just winged it for a long time until they had to do \\_something\\_ because delaying wasn't an option."
    },
    {
        "subreddit": "movies",
        "sentence": "You're not even trying anymore.\n\nYou cited one, doesn't stop the fact that plenty were successful, Gunn not being able to make one, doesn't change that.\n\nYour whataboutism only defeated your dumb arguments, you've yet to admit TSS did terrible for a pandemic movie, you've yet to admit it had terrible legs for a pandemic movie.\n\nIt makes sense you like DCEU movies, that's all I'm gonna say."
    },
    {
        "subreddit": "movies",
        "sentence": "Boy in Stripped Pajamas (2008)\n\nWhere is My Friend’s House? (1987)\n\nYi Yi (2000)\n\nLa Haine (1995)\n\nHero (2002)\n\nBtw, this is so cool dad of you!"
    },
    {
        "subreddit": "movies",
        "sentence": "Very well put"
    },
    {
        "subreddit": "movies",
        "sentence": "I haven't seen his other work but i like the way you described it."
    },
    {
        "subreddit": "movies",
        "sentence": "> las vegas \n\nthis one for me hurts the most"
    },
    {
        "subreddit": "movies",
        "sentence": "all the posters were full of neon and colors and lighting and shit."
    },
    {
        "subreddit": "movies",
        "sentence": "imagine a zombie movie actually in front of that backdrop full of massive LED screens and light shows and all."
    },
    {
        "subreddit": "movies",
        "sentence": "and then the movie itself is just brown and grey."
    },
    {
        "subreddit": "movies",
        "sentence": "Came here immediately to say Your Name"
    },
    {
        "subreddit": "movies",
        "sentence": "One of my favourite animated movies."
    },
    {
        "subreddit": "movies",
        "sentence": "Paul Newman was the first name that came to mind"
    },
    {
        "subreddit": "movies",
        "sentence": "While not having a roll with an \"iconic look\" like the man with no name or indiana jones, had the pinnacle of \"effortless\" style and drip in pretty much every role he played"
    },
    {
        "subreddit": "movies",
        "sentence": "Cool Hand Luke, Hud, Butch Cassidy, shit.."
    },
    {
        "subreddit": "movies",
        "sentence": "look at him in those 80's aviators in Color of Money."
    },
    {
        "subreddit": "movies",
        "sentence": "Attack of the killer tomatos 1 and 2 trust me if you watched or trued watching the first movie and didn't like it the sequel is slightly more level headed for a movie of this style.\n\nNothing but trouble, yes it's not the greatest movie ever but man it's a fun goofy watch.\n\nDead alive (braindead) early Peter Jackson, it have one of the bloodiest endings I've ever seen, it's a zombie movie set in a Looney tunes world."
    },
    {
        "subreddit": "movies",
        "sentence": "It's a science fiction movie with action and horror elements, the same applies to movies like Predator, and Aliens."
    },
    {
        "subreddit": "movies",
        "sentence": "I read this as Dumb Horror Movies.\n\nAnyway, watch Llamageddon."
    },
    {
        "subreddit": "movies",
        "sentence": "It does - further proof that not even Star Wars fans know what they want"
    },
    {
        "subreddit": "movies",
        "sentence": "Wow I thought this exact thing and was so confused"
    },
    {
        "subreddit": "movies",
        "sentence": "I couldn’t wrap my head around what was going on there."
    },
    {
        "subreddit": "movies",
        "sentence": "I have to throw Jumper points because it's the first movie I saw that was better than the book it was based on.\nThe book was just boring."
    },
    {
        "subreddit": "movies",
        "sentence": "Fantastic Mr fox"
    },
    {
        "subreddit": "movies",
        "sentence": "Momento"
    },
    {
        "subreddit": "movies",
        "sentence": "Counterpoint, clothes and money of an entire theatre full of people disappearing would be an interesting visual."
    },
    {
        "subreddit": "movies",
        "sentence": "Saw this in a film festival when it came out and thought it was amazing"
    },
    {
        "subreddit": "movies",
        "sentence": "Released as Belleville Rendez-vous in the UK"
    },
    {
        "subreddit": "movies",
        "sentence": "If you liked Mary & Max, try the short film Harvie Krumpet (2003).\n\nDon Hertzfeldt is great"
    },
    {
        "subreddit": "movies",
        "sentence": "I really liked World of Tomorrow (2015)"
    },
    {
        "subreddit": "movies",
        "sentence": "And I will always remember that one line from Rejected."
    },
    {
        "subreddit": "movies",
        "sentence": "I'm not sure how you feel about Frozen 2, but to me it was a great sequel"
    },
    {
        "subreddit": "movies",
        "sentence": "Much more adult in tone (assumed the kids grew up along with the film)"
    },
    {
        "subreddit": "movies",
        "sentence": "Great songs just like the first (Into the unknown, Show yourself, The Next Right Thing)"
    },
    {
        "subreddit": "movies",
        "sentence": "It wasn't perfect but overall I really enjoyed it."
    },
    {
        "subreddit": "movies",
        "sentence": "Bro it’s only part one"
    },
    {
        "subreddit": "movies",
        "sentence": "That’s why it said “to be continued”….."
    },
    {
        "subreddit": "movies",
        "sentence": "To be perfectly honest, based on what you described, it sounds like you need uplifting films, and that's a good thing!\n\nYou're close to my age, so look into stuff like sweet baseball movies such as \"The Sandlot\" (1993), or maybe a fun ride like \"True Lies\" (1994) where it's just Arnold blowing stuff up for two hours"
    },
    {
        "subreddit": "movies",
        "sentence": "Start there and I can help more if you'd like."
    },
    {
        "subreddit": "movies",
        "sentence": "But Yorgos Lanthimos on the other hand...."
    },
    {
        "subreddit": "movies",
        "sentence": "Your Name., Akira, anything by Don Hertzfelt, The Tale of the Princess Kaguya, Flee, Persepolis\n\nIn terms of shows, it's just been added to Netflix too - I couldn't recommend Avenger's Reign more"
    },
    {
        "subreddit": "movies",
        "sentence": "really liked his performance in sherlock"
    },
    {
        "subreddit": "movies",
        "sentence": "I should watch that again later."
    },
    {
        "subreddit": "movies",
        "sentence": "Let him finish!"
    },
    {
        "subreddit": "movies",
        "sentence": "The Spider-Verse Films\n\nHow to Train Your Dragon Franchise\n\nShrek Franchise & Puss in Boots the Last Wish\n\nKlaus"
    },
    {
        "subreddit": "movies",
        "sentence": "If we only take the first two movies into account, I think T2 is a rebuttal to the first movie’s time loop"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s an affirmation of freedom of choice and that the future has not been written, a way to throw the entire premise into doubt"
    },
    {
        "subreddit": "movies",
        "sentence": "There is no fate but what we make."
    },
    {
        "subreddit": "movies",
        "sentence": "I also can’t believe I haven’t seen this"
    },
    {
        "subreddit": "movies",
        "sentence": "I watch everything with all of these guys in it, yet I’ve never heard of it somehow."
    },
    {
        "subreddit": "movies",
        "sentence": "Anything JJ Abrams"
    },
    {
        "subreddit": "movies",
        "sentence": "He's the king of great premises that just fizzle out"
    },
    {
        "subreddit": "movies",
        "sentence": "The movie makes perfect sense"
    },
    {
        "subreddit": "movies",
        "sentence": "It's a good film."
    },
    {
        "subreddit": "movies",
        "sentence": "You want a sci-fi horror? Alien, or Event Horizon"
    },
    {
        "subreddit": "movies",
        "sentence": "And young teenage crush Nancy Allen"
    },
    {
        "subreddit": "movies",
        "sentence": "*at best*, I'd say his movies are superbly generic"
    },
    {
        "subreddit": "movies",
        "sentence": "My partner and I watched the Rebel Moon films the other week; we'd worked out what was going to happen roughly ten minutes into each part, and then spent the remainder with our brains switched off"
    },
    {
        "subreddit": "movies",
        "sentence": "There's definitely worse films, but the problem is there's not much good about them either."
    },
    {
        "subreddit": "movies",
        "sentence": "You wouldn't think it's a werewolf movie, but damn..."
    },
    {
        "subreddit": "movies",
        "sentence": "I consider both Terminator and Aliens horror movies"
    },
    {
        "subreddit": "movies",
        "sentence": "They're sci-fi as well, but I think the tension and gore throw them firmly into the horror genre.\n\nThe Terminator is essentially an unstoppable serial killer with superhuman strength."
    },
    {
        "subreddit": "movies",
        "sentence": "Sanctuary (2022)\n\nit turned out to be much deeper and more interesting than I expected! and he is also very handsome"
    },
    {
        "subreddit": "movies",
        "sentence": "Difficult question.\n\nThe answer is yes"
    },
    {
        "subreddit": "movies",
        "sentence": "Event Horizon."
    },
    {
        "subreddit": "movies",
        "sentence": "In Time, so kuch potential, but just ended up as a B-class action movie with the \"time as currency\" gimmick tacked on"
    },
    {
        "subreddit": "movies",
        "sentence": "That poker scene was cool though"
    },
    {
        "subreddit": "movies",
        "sentence": "I watched army of thieves first and really enjoyed it so then put on army of the dead and turned it off cause I was so bored"
    },
    {
        "subreddit": "movies",
        "sentence": "I was very disappointed."
    },
    {
        "subreddit": "movies",
        "sentence": "Because it isn't"
    },
    {
        "subreddit": "movies",
        "sentence": "It's sci-fi."
    },
    {
        "subreddit": "movies",
        "sentence": "[Run Ronnie Run](https://youtu.be/v03ldhD7k-c?si=M9Ce-azuNHnpWQeZ)\n\nEasily one of the best comedies no one knows or talks about"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s Bob Odenkirk and David Cross with a whole lotta cameos"
    },
    {
        "subreddit": "movies",
        "sentence": "Stupid funny and very quotable."
    },
    {
        "subreddit": "movies",
        "sentence": "How to Train your Dragon"
    },
    {
        "subreddit": "movies",
        "sentence": "About time."
    },
    {
        "subreddit": "movies",
        "sentence": "I'd say specifically the T-Rex scene."
    },
    {
        "subreddit": "movies",
        "sentence": "Surprised that Ferngully isn’t on there, or am I getting old"
    },
    {
        "subreddit": "movies",
        "sentence": "Not like Diddy tjo"
    },
    {
        "subreddit": "movies",
        "sentence": "Especially with the IMAX scenes, which are incredible."
    },
    {
        "subreddit": "movies",
        "sentence": "The one film where I'm gonna cry every time while two brothers beat the shit out of each other."
    },
    {
        "subreddit": "movies",
        "sentence": "I’ll check it out, thanks for the suggestion."
    },
    {
        "subreddit": "movies",
        "sentence": "I agree with your statement"
    },
    {
        "subreddit": "movies",
        "sentence": "All the films mentioned gave me that vibe"
    },
    {
        "subreddit": "movies",
        "sentence": "Generally I think Hollywood is struggling to find a formula that will make films profitable again at the cinema."
    },
    {
        "subreddit": "movies",
        "sentence": "If you're doing down this path watch everything Ron Fricke has done, baracca, samsara etc"
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah, I was going to say McQueen in The Great Escape and then I thought....\"well he was cool in all his movies"
    },
    {
        "subreddit": "movies",
        "sentence": "He was even cool in Towering Inferno, and that was as a fireman in a burning high rise \n\nAlso, toss in Paul Newman is just about everything"
    },
    {
        "subreddit": "movies",
        "sentence": "I guess for me it was more about the acceptance"
    },
    {
        "subreddit": "movies",
        "sentence": "Of a unpredictable future"
    },
    {
        "subreddit": "movies",
        "sentence": "In a way it was in the same vein as Arrival's ending, though that was more deterministic."
    },
    {
        "subreddit": "movies",
        "sentence": "In similar style is Run, Fatboy, Run with Simon Pegg"
    },
    {
        "subreddit": "movies",
        "sentence": "I will do definitely"
    },
    {
        "subreddit": "movies",
        "sentence": "Thank you 😊"
    },
    {
        "subreddit": "movies",
        "sentence": "Probably better to say Muslim/Jewish, as up until 1948, both sides were Palestinian, with Jews being referred to as Palestinian Jews (or Yishuv), while Muslims were referred to as Palestinian Arabs (or Syrian, Levantine, Jaffan, Jerusalemite, Nabulsi)"
    },
    {
        "subreddit": "movies",
        "sentence": "[Chow Yun-fat in A Better Tomorrow-series](https://youtu.be/3ychFYp1L2w?si=nJsC262sIyC-O88x)"
    },
    {
        "subreddit": "movies",
        "sentence": "I agree"
    },
    {
        "subreddit": "movies",
        "sentence": "He finds an angle where he can put some depth in the performance, and he's covered most every genre"
    },
    {
        "subreddit": "movies",
        "sentence": "Never phones it it"
    },
    {
        "subreddit": "movies",
        "sentence": "Now, in fairness to Bruce Willis, his brain was going into mothballs for a long time before his family revealed it"
    },
    {
        "subreddit": "movies",
        "sentence": "Really kinda sad"
    },
    {
        "subreddit": "movies",
        "sentence": "He was never an actor of Cages caliber  anyway tho."
    },
    {
        "subreddit": "movies",
        "sentence": "Coraline"
    },
    {
        "subreddit": "movies",
        "sentence": "Passengers"
    },
    {
        "subreddit": "movies",
        "sentence": "I always tell people about the Youtube breakdown that explains how if the film started at where Jennifer Lawrence’s character wakes up, it sets a totally different tone for the whole film and Chris Pratts character."
    },
    {
        "subreddit": "movies",
        "sentence": "Actually those are both very fair points about Loki and She Hulk; I also agree that a lot of them probably weren't necessary - I'd completely forgotten about Moon Knight (for example) until someone mentioned it the other day."
    },
    {
        "subreddit": "movies",
        "sentence": "Ralph Fiennes in Hurt Locker"
    },
    {
        "subreddit": "movies",
        "sentence": "I expected him to be a main character in the movie."
    },
    {
        "subreddit": "movies",
        "sentence": "All I could think of when he talked was Austin Powers after he was thawed: “I seem to have trouble controlling *THE VOLUME OF MY VOICE!*”"
    },
    {
        "subreddit": "movies",
        "sentence": "I really enjoyed Paranorman, and should watch Boxtrolls"
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks for the suggestion."
    },
    {
        "subreddit": "movies",
        "sentence": "This was going to be my suggestion as well"
    },
    {
        "subreddit": "movies",
        "sentence": "Someone hasn't seen _Commando_"
    },
    {
        "subreddit": "movies",
        "sentence": "Secret of Nimh\n\nWizards\n\nWatership Down\n\nTriplets of Belleville\n\nGhost in the Shell\n\nAkira\n\nMindgame\n\nTekkon Kinkreet\n\nThe Last Unicorn"
    },
    {
        "subreddit": "movies",
        "sentence": "I coinsidee it to be a sci-fi slasher"
    },
    {
        "subreddit": "movies",
        "sentence": "Terminator is just like Jason"
    },
    {
        "subreddit": "movies",
        "sentence": "Unstoppable killing machine chasing after the main character."
    },
    {
        "subreddit": "movies",
        "sentence": "Kung pow."
    },
    {
        "subreddit": "movies",
        "sentence": "Over the Garden Wall\n\nIt's a miniseries consisting of 10 episodes lasting 10 minutes each, so it's basically a film and it's so good"
    },
    {
        "subreddit": "movies",
        "sentence": "I watch it every Halloween."
    },
    {
        "subreddit": "movies",
        "sentence": "Bud White in L.A"
    },
    {
        "subreddit": "movies",
        "sentence": "Confidential."
    },
    {
        "subreddit": "movies",
        "sentence": "I gotta throw it out there.."
    },
    {
        "subreddit": "movies",
        "sentence": "Les Grossman in Tropic Thunder..."
    },
    {
        "subreddit": "movies",
        "sentence": "The movie mogul chewing out the director via skype call and even having the key grip punch him on his  behalf..."
    },
    {
        "subreddit": "movies",
        "sentence": "pure gold"
    },
    {
        "subreddit": "movies",
        "sentence": "And so much rage!  \n  \nIts not 100% what you are looking for but it popped up in my mind as I read these examples!\n\n  \nAnother newer one as well is the chief in 21 Jump Street"
    },
    {
        "subreddit": "movies",
        "sentence": "Ice Cube pounding the desk..."
    },
    {
        "subreddit": "movies",
        "sentence": "\"Infiltrate the dealer, and find the supplier!\""
    },
    {
        "subreddit": "movies",
        "sentence": "Romy and Michelle’s High School Reunion"
    },
    {
        "subreddit": "movies",
        "sentence": "McQueen in every thing."
    },
    {
        "subreddit": "movies",
        "sentence": "It really bothers me how often people are like \"it's for kids, who cares?\" as if something being for kids isn't already a really good reason for caring."
    },
    {
        "subreddit": "movies",
        "sentence": "I love how based on the poster we’re just supposed to know it’s Moana 2"
    },
    {
        "subreddit": "movies",
        "sentence": "Most people looking at it would be like “what?”"
    },
    {
        "subreddit": "movies",
        "sentence": "48 Hrs."
    },
    {
        "subreddit": "movies",
        "sentence": "Truly beautiful ♡\n\nThose dialogues are profound."
    },
    {
        "subreddit": "movies",
        "sentence": "What about Theo Von"
    },
    {
        "subreddit": "movies",
        "sentence": "Sci-fi/action I would say are the main two genres."
    },
    {
        "subreddit": "movies",
        "sentence": "Until we found out that’s just how Cameron likes his movies to look… \n\nTrue Lies looks like T2 to me wax wise"
    },
    {
        "subreddit": "movies",
        "sentence": "It was kinda jarring"
    },
    {
        "subreddit": "movies",
        "sentence": "But it sounded good, and I haven’t owned since VHS"
    },
    {
        "subreddit": "movies",
        "sentence": "The Abyss looks okay, but again they seem too smooth at times."
    },
    {
        "subreddit": "movies",
        "sentence": "Heavy Metal"
    },
    {
        "subreddit": "movies",
        "sentence": "Exactly what happened with me and my mother when I was watching it a few decades ago!"
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks for proving my point."
    },
    {
        "subreddit": "movies",
        "sentence": "Ive read it twice and watched three adaptations of it.Baz would've been great."
    },
    {
        "subreddit": "movies",
        "sentence": "I can't say that I'm a particular fan of animated movies outside of certain anime or Disney titles, but I have a real interest in all the titles made by the Fleischers and any animations from Paramount/Famous studios.\nHere is a list off the top of my head of notable characters and shows, some having aged better than others.\n\n\n- Little Lulu/Audrey\n- Baby Huey\n- The Stupidsticious Cat\n- Popeye (Mainly the later theatrical releases, with the more fluid character animations).\n- Grampy (they released the famous Christmas short in HD recently and it looks amazing!).\n- Superman (not my favourite, but amazing none the less).\n- The Enchanted Square (Highly recommended, bring tissues!).\n\n\nHere are a few sample YouTube channels to check out if anyone has an interest in Golden Age animations and film preservation, Seth McFarland himself is in the middle of releasing old content again from the Fleischers too!\n\n\nhttps://youtu.be/USoRYVW0K9Y?si=X2YMOeKsdVDnGRqp\n\n\nhttps://youtu.be/1dfeokaw2xc?si=Z6C8bteetX_alISS\n\n\nhttps://youtube.com/playlist?list=PLUBOvPMkgVXsPjhbDKt7uCJXqvyXEDsIF&si=w7wFyuQKoreGUQVR"
    },
    {
        "subreddit": "movies",
        "sentence": "I love me a good pun"
    },
    {
        "subreddit": "movies",
        "sentence": "I love even a bad pun"
    },
    {
        "subreddit": "movies",
        "sentence": "And that was a bad pun"
    },
    {
        "subreddit": "movies",
        "sentence": "In the best way"
    },
    {
        "subreddit": "movies",
        "sentence": "I look forward to the rest of the series"
    },
    {
        "subreddit": "movies",
        "sentence": "For some reason when I think satoshi kon i just think about the \"rape\" scene in perfect blue where the guy is like \"i'm sorry\" and she's like \"it's ok.\" that's just the first thing that comes to my mind"
    },
    {
        "subreddit": "movies",
        "sentence": "it's like it's creepy but also not creepy, but then also creepy"
    },
    {
        "subreddit": "movies",
        "sentence": "i don't know"
    },
    {
        "subreddit": "movies",
        "sentence": "that's the scene that sticks in my mind"
    },
    {
        "subreddit": "movies",
        "sentence": "anywhoo"
    },
    {
        "subreddit": "movies",
        "sentence": "i'm a bit drunk i suppose"
    },
    {
        "subreddit": "movies",
        "sentence": "night night"
    },
    {
        "subreddit": "movies",
        "sentence": "love me some animation.\n\nanimation is a medium, not a genre"
    },
    {
        "subreddit": "movies",
        "sentence": "rip satoshi kon"
    },
    {
        "subreddit": "movies",
        "sentence": "The Devils Advocate"
    },
    {
        "subreddit": "movies",
        "sentence": "Because of the Thrawn Trilogy"
    },
    {
        "subreddit": "movies",
        "sentence": "Star Wars was dead until those books resurrected it, started the extended universe, and proved there was still money to be had"
    },
    {
        "subreddit": "movies",
        "sentence": "They were and still are better than any of the movies that followed them years later."
    },
    {
        "subreddit": "movies",
        "sentence": "What made Disney movies so good is they were never targeted to specific ages"
    },
    {
        "subreddit": "movies",
        "sentence": "Of course they were always \"family\" movies"
    },
    {
        "subreddit": "movies",
        "sentence": "They were targeted for all audiences not just kids"
    },
    {
        "subreddit": "movies",
        "sentence": "There was crude humor that any adult would get, and more tame humor for the kids"
    },
    {
        "subreddit": "movies",
        "sentence": "Kids wouldn't understand the complexities of crude humor"
    },
    {
        "subreddit": "movies",
        "sentence": "You can easily confirm this yourself when you go back and watch their older movies from pre-2013 (anything post-2013 IMO started to fall off drastically)\n\nThe issue is that kids nowadays are smarter, they understand the crude humor"
    },
    {
        "subreddit": "movies",
        "sentence": "They can't just use the same formula to make their movies accessible anymore"
    },
    {
        "subreddit": "movies",
        "sentence": "So instead they exclusively target people of ages that can't comprehend the humor"
    },
    {
        "subreddit": "movies",
        "sentence": "Making everything they make appear dull."
    },
    {
        "subreddit": "movies",
        "sentence": "Abyss should be fine"
    },
    {
        "subreddit": "movies",
        "sentence": "Eddard Stark in Game of Thrones.."
    },
    {
        "subreddit": "movies",
        "sentence": "😇"
    },
    {
        "subreddit": "movies",
        "sentence": "This one is a maybe; but Kristen Stewart in The Clouds of Sils Maria"
    },
    {
        "subreddit": "movies",
        "sentence": "In that she literally vanishes while hiking mid-scene and didn't appear (or I don't think is even mentioned) for the rest of the film"
    },
    {
        "subreddit": "movies",
        "sentence": "I was like; what the hell just happened? She might have died or injured herself or just run off"
    },
    {
        "subreddit": "movies",
        "sentence": "But it really came out of nowhere."
    },
    {
        "subreddit": "movies",
        "sentence": "If I want a giant screen and sound with a leather recliner in a dark and quiet auditorium where I can focus completely on the film, I go to the theater"
    },
    {
        "subreddit": "movies",
        "sentence": "If I want to sit on the couch and watch a movie on a TV that’s a fraction of the size of a theater screen in my cluttered living room that’s never quite dark enough with people wandering in and out and the phone ringing and kids interrupting the film and pausing it for various reasons and the dog barking, I’ll stay at home and be surrounded by distractions."
    },
    {
        "subreddit": "movies",
        "sentence": "Fair point, but the movie largely focuses on the female murderer, so yeah, is about lust largely"
    },
    {
        "subreddit": "movies",
        "sentence": "Yo chill, my dad took my to see this when I was like 9, snuck into the theatre, movies strait fire and I won’t hear any alternate opinions."
    },
    {
        "subreddit": "movies",
        "sentence": "nor ever rewatch it"
    },
    {
        "subreddit": "movies",
        "sentence": "No Way Out was like that, with Sean Young’s character"
    },
    {
        "subreddit": "movies",
        "sentence": "Well-said!     \nJohnson should have made an original sci-fi movie if he was so set on the genre instead of twisting the franchise into that abomination."
    },
    {
        "subreddit": "movies",
        "sentence": "I wonder who the baddie would be"
    },
    {
        "subreddit": "movies",
        "sentence": "I ain't too proud to beg!"
    },
    {
        "subreddit": "movies",
        "sentence": "With how up they are it's not even realistic that they could see the ground through those binoculars"
    },
    {
        "subreddit": "movies",
        "sentence": "Fat Man"
    },
    {
        "subreddit": "movies",
        "sentence": "This movie could have been absolutely incredible with a more cohesive story and better writing"
    },
    {
        "subreddit": "movies",
        "sentence": "As it stands it's a swing-and-a-miss."
    },
    {
        "subreddit": "movies",
        "sentence": "Loving Vincent is a new favorite of mine.\nSome else mentioned triplets of Seville but it’s worth mentioning again"
    },
    {
        "subreddit": "movies",
        "sentence": "Belle is a newer one that has good animation and a great soundtrack."
    },
    {
        "subreddit": "movies",
        "sentence": "I don't have a fancy set up, but I have seen ***Open Range*** used for the gun fight which sounds fantastic with surround sound."
    },
    {
        "subreddit": "movies",
        "sentence": "I watched it in 2020, the setting of the movie is definitely older, but I think it came out in the past couple of decades"
    },
    {
        "subreddit": "movies",
        "sentence": "Nimona"
    },
    {
        "subreddit": "movies",
        "sentence": "Animal Olympics! Yes!"
    },
    {
        "subreddit": "movies",
        "sentence": "I remember watching the DVD extras and they interviewed the author"
    },
    {
        "subreddit": "movies",
        "sentence": "I got the impression that the book was very different in both content and tone."
    },
    {
        "subreddit": "movies",
        "sentence": "the prince of egypt"
    },
    {
        "subreddit": "movies",
        "sentence": "People who don't want to get killed by someone else doing the same thing"
    },
    {
        "subreddit": "movies",
        "sentence": "There is a 100% chance I would be out of the country for the purge"
    },
    {
        "subreddit": "movies",
        "sentence": "No reason to risk my family"
    },
    {
        "subreddit": "movies",
        "sentence": "Which is another reason the first movie is dumb"
    },
    {
        "subreddit": "movies",
        "sentence": "Rich people would absolutely just leave the US"
    },
    {
        "subreddit": "movies",
        "sentence": "I'm not particularly rich, but have enough money that I could make sure we were out of the US"
    },
    {
        "subreddit": "movies",
        "sentence": "We have a modest boat"
    },
    {
        "subreddit": "movies",
        "sentence": "Feel like worst case, we could drive to the coast and head for Mexico's waters"
    },
    {
        "subreddit": "movies",
        "sentence": "If wasn't possible to get to another country, we would just move to another country."
    },
    {
        "subreddit": "movies",
        "sentence": "Pleasantville (1998) is just before your cutoff date but wasn't a huge movie"
    },
    {
        "subreddit": "movies",
        "sentence": "I Saw the TV Glow"
    },
    {
        "subreddit": "movies",
        "sentence": "Saw that scene when I was kid, up to this day still couldn't wrap how the fuck can that happen"
    },
    {
        "subreddit": "movies",
        "sentence": "Truly a wtf moment for me lol"
    },
    {
        "subreddit": "movies",
        "sentence": "I was checking out his Instagram after I heard about it and someone posted 2 days before his death \"you don't need to exercise anymore\" that's some crazy foreshadowing even though I know it wasn't meant to be"
    },
    {
        "subreddit": "movies",
        "sentence": "RIP Man"
    },
    {
        "subreddit": "movies",
        "sentence": "Says someone with the most confrontational name possible."
    },
    {
        "subreddit": "movies",
        "sentence": "Nic Cage is a brilliant actor! He faced financial problems when the real estate market took a dump"
    },
    {
        "subreddit": "movies",
        "sentence": "Many of us did"
    },
    {
        "subreddit": "movies",
        "sentence": "He wanted to be honorable and not declare bankruptcy, so he took work that was offered"
    },
    {
        "subreddit": "movies",
        "sentence": "I admire him for that"
    },
    {
        "subreddit": "movies",
        "sentence": "Even when he knew some material was subpar and he was grossly  underpaid on some of it, he worked his way through it"
    },
    {
        "subreddit": "movies",
        "sentence": "He put his whole self into each role even if it wasn't ocscar worthy material"
    },
    {
        "subreddit": "movies",
        "sentence": "He respects the craft and seems to have a good grasp on morality"
    },
    {
        "subreddit": "movies",
        "sentence": "I believe he gave each role his best"
    },
    {
        "subreddit": "movies",
        "sentence": "Life and the IRS can get in the way sometimes"
    },
    {
        "subreddit": "movies",
        "sentence": "Several of his current films are showing he's back!"
    },
    {
        "subreddit": "movies",
        "sentence": "That's fucking cool man"
    },
    {
        "subreddit": "movies",
        "sentence": "What a great story to have, and thankfully there was no near-brush with a real great white ! :)"
    },
    {
        "subreddit": "movies",
        "sentence": "I always cue up the lobby shootout to test surround sound."
    },
    {
        "subreddit": "movies",
        "sentence": "Daniels also has some crackers"
    },
    {
        "subreddit": "movies",
        "sentence": "I love the speech he gives to Carver at the end of S1 when he finds out >!he was the rat!<.\n\n\"Couple weeks from now, you're gonna be in some district somewhere with 11 or 12 uniforms looking to you for everything"
    },
    {
        "subreddit": "movies",
        "sentence": "And some of them are gonna be good police"
    },
    {
        "subreddit": "movies",
        "sentence": "Some of them are gonna be young and stupid"
    },
    {
        "subreddit": "movies",
        "sentence": "A few are gonna be pieces of shit"
    },
    {
        "subreddit": "movies",
        "sentence": "But all of them will take their cue from you"
    },
    {
        "subreddit": "movies",
        "sentence": "You show loyalty, they learn loyalty"
    },
    {
        "subreddit": "movies",
        "sentence": "You show them it's about the work, it'll be about the work"
    },
    {
        "subreddit": "movies",
        "sentence": "You show them some other kinda game, then that's the game they'll play"
    },
    {
        "subreddit": "movies",
        "sentence": "I came on in the Eastern, and there was a piece-of-shit lieutenant hoping to be a captain, piece-of-shit sergeants hoping to be lieutenants"
    },
    {
        "subreddit": "movies",
        "sentence": "Pretty soon we had piece-of-shit patrolmen trying to figure the job for themselves"
    },
    {
        "subreddit": "movies",
        "sentence": "And some of what happens then is hard as hell to live down"
    },
    {
        "subreddit": "movies",
        "sentence": "Comes a day you're gonna have to decide whether it's about you .."
    },
    {
        "subreddit": "movies",
        "sentence": "or about the work.\""
    },
    {
        "subreddit": "movies",
        "sentence": "Weirdly enough, Michael Madsen's character in Thelma and Louise"
    },
    {
        "subreddit": "movies",
        "sentence": "He's definitely playing against type."
    },
    {
        "subreddit": "movies",
        "sentence": "I remember this movie more from its ad on free Willy more than actually watching it."
    },
    {
        "subreddit": "movies",
        "sentence": "It sounds like a question in high school philosophy filmed for 2 hours."
    },
    {
        "subreddit": "movies",
        "sentence": "It was colour samples for repainting the boat house at Hereford."
    },
    {
        "subreddit": "movies",
        "sentence": "Frank Gallagher surviving the apocalypse and aiding monkeys seems very on brand for him"
    },
    {
        "subreddit": "movies",
        "sentence": "You should check out loving Vincent!"
    },
    {
        "subreddit": "movies",
        "sentence": "I don't remember Captain Stemkowski yelling, but \"No mercy\" definitely had some of that Dirty Harry vibe."
    },
    {
        "subreddit": "movies",
        "sentence": "You are correct according to Google"
    },
    {
        "subreddit": "movies",
        "sentence": "Someone getting their ass kicked has never looked so good."
    },
    {
        "subreddit": "movies",
        "sentence": "I only heard of it because of r/cultofcinemaknowledge."
    },
    {
        "subreddit": "movies",
        "sentence": "Hollywood needs to stop casting geriatric men in action movies."
    },
    {
        "subreddit": "movies",
        "sentence": "Anastasia"
    },
    {
        "subreddit": "movies",
        "sentence": "An absolutely magical story based on the lost princess of Russia and a way better princess than any Disney character"
    },
    {
        "subreddit": "movies",
        "sentence": "Iron Giant and the prince of Egypt"
    },
    {
        "subreddit": "movies",
        "sentence": "Having watched Hellraiser for the first time recently, that explains a lot!"
    },
    {
        "subreddit": "movies",
        "sentence": "A classic"
    },
    {
        "subreddit": "movies",
        "sentence": "Yup"
    },
    {
        "subreddit": "movies",
        "sentence": "Own it on blue ray."
    },
    {
        "subreddit": "movies",
        "sentence": "I have their season pass"
    },
    {
        "subreddit": "movies",
        "sentence": "I absolutely love Alamo"
    },
    {
        "subreddit": "movies",
        "sentence": "They feel run by people who actually love movies"
    },
    {
        "subreddit": "movies",
        "sentence": "The Breadwinner"
    },
    {
        "subreddit": "movies",
        "sentence": "Where did you watch it?"
    },
    {
        "subreddit": "movies",
        "sentence": "I watched this alone in a movie theater and it bummed me out for so many reasons (not just the obvious)"
    },
    {
        "subreddit": "movies",
        "sentence": "When I was a kid, I used to read Garfield comics religiously (along with Peanuts and Calvin & Hobbes), but besides the '80s cartoon and specials, none of the recent efforts to revive the character have ever seemed to get it right"
    },
    {
        "subreddit": "movies",
        "sentence": "I feel like they sanded down the edges here and made him as innocuous and dull as possible"
    },
    {
        "subreddit": "movies",
        "sentence": "All the cutesy eye kitten stuff was okay, but besides that brief montage of him growing up, we don't really get to see too much of the true Garfield personality"
    },
    {
        "subreddit": "movies",
        "sentence": "It also really bothered me that Jon Arbuckle was so estranged from the events of this film, since he's always been a big part of why the comics worked for me (the quintessential loser who is always trying to get Liz)"
    },
    {
        "subreddit": "movies",
        "sentence": "I mean, I know it's a family movie designed to appeal to kids of all ages, so I'm not the target audience or anything"
    },
    {
        "subreddit": "movies",
        "sentence": "But it just makes me feel so fucking old and obsolete when I think back to all those countless hours I spent invested in those comics and adventures, only for them to reinvent the mythos and throw out the \"canon.\"\n\nAnother pet peeve is that a lot of it takes place on \"Lactose Farms\" (what a terrible, generic name), but they could have easily made it U.S"
    },
    {
        "subreddit": "movies",
        "sentence": "Acres and involved Orson & Friends if they really wanted to go in that direction"
    },
    {
        "subreddit": "movies",
        "sentence": "But instead, we have this weird father-son dynamic that never existed in the comics and now seems to be a permanent staple of this new reboot.\n\nAlso, I don't know what voice Chris Pratt was trying to do here, but this wasn't it"
    },
    {
        "subreddit": "movies",
        "sentence": "And the fact that Samuel L"
    },
    {
        "subreddit": "movies",
        "sentence": "Jackson plays his pop is really weird"
    },
    {
        "subreddit": "movies",
        "sentence": "Even Odie's characterization seemed to be off, but whatever"
    },
    {
        "subreddit": "movies",
        "sentence": "I don't know why I'm investing so much of myself into dumb shit"
    },
    {
        "subreddit": "movies",
        "sentence": "It's just a bummer all around."
    },
    {
        "subreddit": "movies",
        "sentence": "The Warriors had some cool looking mofos for sure."
    },
    {
        "subreddit": "movies",
        "sentence": "I don't usually like dumb movies, but this one is surprisingly funny"
    },
    {
        "subreddit": "movies",
        "sentence": "I did not have high hopes, but right after I watched it, I recommended it to my Mom."
    },
    {
        "subreddit": "movies",
        "sentence": "They're closed minded and clearly have rough taste in movies"
    },
    {
        "subreddit": "movies",
        "sentence": "I get the frustration, but let it go and watch on your own"
    },
    {
        "subreddit": "movies",
        "sentence": "Nothing good will come out of forcing them to watch it or feeling resentful.\n\nAs for Carpenter's The Thing? It's a timeless classic with incredible effects, it's truly a must watch for horror fans and movie buffs."
    },
    {
        "subreddit": "movies",
        "sentence": "Its the dock fees that kill you"
    },
    {
        "subreddit": "movies",
        "sentence": "got a decade in mind?"
    },
    {
        "subreddit": "movies",
        "sentence": "Rob Schneider marathon"
    },
    {
        "subreddit": "movies",
        "sentence": "I miss the roller coaster!\n\nThe popcorn burst was my way of knowing if the sound system was good. \n\nIf it had a deep resonant POP, you knew the speaker system was good\n\nIf it was flat, or mixed with the rest of the sound, I knew I’d have to try harder to be invested."
    },
    {
        "subreddit": "movies",
        "sentence": "End of Eva"
    },
    {
        "subreddit": "movies",
        "sentence": "Inception"
    },
    {
        "subreddit": "movies",
        "sentence": "Do you.."
    },
    {
        "subreddit": "movies",
        "sentence": "genuinely not think women are a minority? That men don't run the planet? Do you think 99% of world leaders have been men because men are naturally better leaders? Gimme a break lol\n\nBtw, not sure why you thought I'd be against women in the draft, lol"
    },
    {
        "subreddit": "movies",
        "sentence": "What are you, 40? I'm against the draft in general because I hate war but I don't see a reason it should be exclusively men\n\nAnd honestly.."
    },
    {
        "subreddit": "movies",
        "sentence": "no, I genuinely don't think there's anything men are required for in society aside from protecting us from other men"
    },
    {
        "subreddit": "movies",
        "sentence": "Like genuinely, in an all-woman planet where we're reproducing on our own (which honestly we're not that far off from scientifically), what would we be unable to do?\n\nWhat does it matter if male soldiers are stronger if there's no male enemy to fight, what does it matter if there are no male cops if there are no male criminals?\n\nMen can't solve a single problem they didn't already cause (maybe boxing would be a little more boring?)\n\nI don't know who ingrained into your head that women are \"ungrateful\" for what men give us, or that other women make you look bad (if you think other women being bad is a valid reason to look down on you, you've got some issues to work through)"
    },
    {
        "subreddit": "movies",
        "sentence": "George Clooney in From Dusk Till Dawn is a contender."
    },
    {
        "subreddit": "movies",
        "sentence": "Anastasia\n\nThe Box Trolls"
    },
    {
        "subreddit": "movies",
        "sentence": "Not as horrendous as the thumbnail on this video."
    },
    {
        "subreddit": "movies",
        "sentence": "A star is born"
    },
    {
        "subreddit": "movies",
        "sentence": "No not this one"
    },
    {
        "subreddit": "movies",
        "sentence": "I'm so annoyed I can't think of more details"
    },
    {
        "subreddit": "movies",
        "sentence": "I vaguely remember there being a ballroom scene with balloons (?)"
    },
    {
        "subreddit": "movies",
        "sentence": "Great flick"
    },
    {
        "subreddit": "movies",
        "sentence": "Thx for reminding me to rewatch!"
    },
    {
        "subreddit": "movies",
        "sentence": "The 4K is one of the worst out there"
    },
    {
        "subreddit": "movies",
        "sentence": "So much DNR that everyone looks waxy"
    },
    {
        "subreddit": "movies",
        "sentence": "Truly a benchmark in how not to do a 4K transfer."
    },
    {
        "subreddit": "movies",
        "sentence": "Haven‘t seen someone mentioning Nimona yet which i find a little bit sad tbh, it‘s such a good movie"
    },
    {
        "subreddit": "movies",
        "sentence": "I think people are deterred by the Netflix Original logo"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ll be honest, it’s a pretty good reveal, so I’d recommended watching it, and I probably won’t do a great job of explaining it."
    },
    {
        "subreddit": "movies",
        "sentence": "Have you watched Samurai Champloo? If not, I feel like you'd dig it a lot"
    },
    {
        "subreddit": "movies",
        "sentence": "Judging from your list, we have somewhat similar tastes"
    },
    {
        "subreddit": "movies",
        "sentence": "It's made by the same people as Cowboy Bebop, and while it's less known, I like it much much more.\n\nAnd only like 20 episodes, so more accessible than a lot of longer running anime series."
    },
    {
        "subreddit": "movies",
        "sentence": "World’s most intelligent techbro."
    },
    {
        "subreddit": "movies",
        "sentence": "Same concept at least"
    },
    {
        "subreddit": "movies",
        "sentence": "Rise of the Guardians"
    },
    {
        "subreddit": "movies",
        "sentence": "“I’m so humble"
    },
    {
        "subreddit": "movies",
        "sentence": "I instantly connected with that because I’m the most humble person I know.” - Mariah Carey"
    },
    {
        "subreddit": "movies",
        "sentence": "Avatar & Avatar 2"
    },
    {
        "subreddit": "movies",
        "sentence": "As an old student of animation, Arcane is a work of art, it's so beautifully done, my heart almost aches watching it.\n\nBut so many more:\n\nAkira\n\nGhost in the Shell\n\nRobotech\n\nAstroboy \n\nCowboy Bebop \n\nYour Name\n\nCastlevania"
    },
    {
        "subreddit": "movies",
        "sentence": "But that's not what the movie is saying"
    },
    {
        "subreddit": "movies",
        "sentence": "In the tv show, they are already getting buried alive by Mr Melancholy"
    },
    {
        "subreddit": "movies",
        "sentence": "Maddy then digs herself out of the grave and is reborn, and goes back to try to help Owen do the same"
    },
    {
        "subreddit": "movies",
        "sentence": "But he suppresses his true self and instead suffocates and is slowly buried alive"
    },
    {
        "subreddit": "movies",
        "sentence": "So it's really the opposite."
    },
    {
        "subreddit": "movies",
        "sentence": "You're allowed to call us crackers but I'm not allowed to call you n"
    },
    {
        "subreddit": "movies",
        "sentence": "The point and over the garden wall"
    },
    {
        "subreddit": "movies",
        "sentence": "It's not.."
    },
    {
        "subreddit": "movies",
        "sentence": "you know because the ring was the central plot point of the movie.Hence, the /s."
    },
    {
        "subreddit": "movies",
        "sentence": "Game Night"
    },
    {
        "subreddit": "movies",
        "sentence": "Exactly"
    },
    {
        "subreddit": "movies",
        "sentence": "The opening credits of Army of the Dead is a blast of a zombie short"
    },
    {
        "subreddit": "movies",
        "sentence": "I wish he would do lots of music videos and even commercials."
    },
    {
        "subreddit": "movies",
        "sentence": "I wouldn't say he is not given credit, he just never 100% focused on being a comedy actor."
    },
    {
        "subreddit": "movies",
        "sentence": "I think it can be also be seen in a slightly more positive light"
    },
    {
        "subreddit": "movies",
        "sentence": "They're starting their new relationship already knowing what they could eventually hate about each other"
    },
    {
        "subreddit": "movies",
        "sentence": "A lot of relationships start out wonderfully because you're blinded by the newness and excitement of the bond you're forming, so when the real and flawed person slowly gets revealed, you can start to resent them for not being the idealic person they never actually were. \n\n\nI think it'd actually be wonderful to start a relationship knowing that some things about the other person are going to drive you insane"
    },
    {
        "subreddit": "movies",
        "sentence": "And to know what they are too. \n\n\nOf course, I think the ending could be interrupted way more pessimisticly too"
    },
    {
        "subreddit": "movies",
        "sentence": "But I like viewing it as a (mostly) happy ending."
    },
    {
        "subreddit": "movies",
        "sentence": "Dying young?\n\nJulia Roberta Campbell scott?"
    },
    {
        "subreddit": "movies",
        "sentence": "Lots of people here are talking about how great the sequels are, but you hit the nail on the head, they're like Saw sequels that you watch for a blood-splattery bit of action under an interesting but now slightly worn premise"
    },
    {
        "subreddit": "movies",
        "sentence": "I mean, I *like* the films and find them incredibly watchable, but I wouldn't call them *quality cinema*"
    },
    {
        "subreddit": "movies",
        "sentence": "Especially when the later films have just been so unashamedly on-the-nose about the political \"subtext\", they could use a little more \"show, don't tell\"."
    },
    {
        "subreddit": "movies",
        "sentence": "Recent one I think is Civil War… turned out to be a whole lot of nothing"
    },
    {
        "subreddit": "movies",
        "sentence": "1"
    },
    {
        "subreddit": "movies",
        "sentence": "*The Super Mario Bros"
    },
    {
        "subreddit": "movies",
        "sentence": "Movie* (2023)\n2"
    },
    {
        "subreddit": "movies",
        "sentence": "*Kung Fu Panda* (2008)\n3"
    },
    {
        "subreddit": "movies",
        "sentence": "*Anomalisa* (2015)\n4"
    },
    {
        "subreddit": "movies",
        "sentence": "*Spider-Man: Across the Spider-Verse* (2023)\n5"
    },
    {
        "subreddit": "movies",
        "sentence": "*Spider-Man: Into the Spider-Verse* (2018)"
    },
    {
        "subreddit": "movies",
        "sentence": "It's animated but The Emperor's New Groove is an absolute riot."
    },
    {
        "subreddit": "movies",
        "sentence": "Oh he's DEFINITELY the killer."
    },
    {
        "subreddit": "movies",
        "sentence": "Prometheus"
    },
    {
        "subreddit": "movies",
        "sentence": "Could have done some absolutely incredible galaxy expanding and bring new depth to the story, instead focussed on destroying the original lore while poorly attempting the exact same tropes done 4 decades ago, but with 100d dumber characters."
    },
    {
        "subreddit": "movies",
        "sentence": "huge wasted potential, especially given how culturally significant the first film is.\n\nRunner up AvP"
    },
    {
        "subreddit": "movies",
        "sentence": "Plus you simply cannot break someone’s neck backwards without superhuman strength"
    },
    {
        "subreddit": "movies",
        "sentence": "That’s absolutely ridiculous."
    },
    {
        "subreddit": "movies",
        "sentence": "Some good taste right here!"
    },
    {
        "subreddit": "movies",
        "sentence": "The real hero here"
    },
    {
        "subreddit": "movies",
        "sentence": "Ohhh, so true"
    },
    {
        "subreddit": "movies",
        "sentence": "Kinda broke my heart a bit since spectre and that final craig movie were so meh"
    },
    {
        "subreddit": "movies",
        "sentence": "Since the first three were just *so* good."
    },
    {
        "subreddit": "movies",
        "sentence": "One of Orson's best films."
    },
    {
        "subreddit": "movies",
        "sentence": "If you are talking about the Step Printing (and perhaps even with the under-cranking on top) effect? With the blurry background (and slowmo foreground)?    \n  \n\nTarantino used it in the intro shot to Reservoir Dogs"
    },
    {
        "subreddit": "movies",
        "sentence": "IIRC there a few shots in Saving Private Ryan here and there using Step Printing"
    },
    {
        "subreddit": "movies",
        "sentence": "A lot of Asian films employed the technique"
    },
    {
        "subreddit": "movies",
        "sentence": "I remember Millenium Mambo had a ton of it"
    },
    {
        "subreddit": "movies",
        "sentence": "And John Woo used it a few times."
    },
    {
        "subreddit": "movies",
        "sentence": "Bro how did you steal my answer? I wish it was socially acceptable to walk around wearing those goggles."
    },
    {
        "subreddit": "movies",
        "sentence": "The blue ray version had too much blue light"
    },
    {
        "subreddit": "movies",
        "sentence": "It's like watching through a blue filter"
    },
    {
        "subreddit": "movies",
        "sentence": "The 4k was significantly better than the Blu-ray"
    },
    {
        "subreddit": "movies",
        "sentence": "However, some background became easily identifiable as backings"
    },
    {
        "subreddit": "movies",
        "sentence": "Pixelation and blur hid a good bit of this."
    },
    {
        "subreddit": "movies",
        "sentence": "People have this weird notion that James Cameron gives a shit about anything that isn't Avatar"
    },
    {
        "subreddit": "movies",
        "sentence": "Dudes literally said he's not going to do anything that isn't Avatar related until he fucking dies"
    },
    {
        "subreddit": "movies",
        "sentence": "The dude is off the rails"
    },
    {
        "subreddit": "movies",
        "sentence": "He gives zero fucks if they put clown noses in Terminator."
    },
    {
        "subreddit": "movies",
        "sentence": "I’ve seen most of the Paula Shore stuff from the 90s"
    },
    {
        "subreddit": "movies",
        "sentence": "The other I haven’t seen"
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks."
    },
    {
        "subreddit": "movies",
        "sentence": "I mean, to be fair, when was the last time we had true undead risen from the graves zombies on the big screen? Its almost always an active infection where the humans are transformed by whatever virus afflicts them."
    },
    {
        "subreddit": "movies",
        "sentence": "Fun fact:       \nCharlton Heston really did play a Mexican in the 1958 movie *TOUCH OF EVIL*"
    },
    {
        "subreddit": "movies",
        "sentence": "Anastasia"
    },
    {
        "subreddit": "movies",
        "sentence": "Adding to the list!"
    },
    {
        "subreddit": "movies",
        "sentence": "As much as I like the two of them, I don’t know how I haven’t seen this one"
    },
    {
        "subreddit": "movies",
        "sentence": "I almost watched it over the weekend."
    },
    {
        "subreddit": "movies",
        "sentence": "Little Nemo"
    },
    {
        "subreddit": "movies",
        "sentence": "It was one of the worst portrayal of Churchill I have ever seen."
    },
    {
        "subreddit": "movies",
        "sentence": "The size will depend on the codec used for compression"
    },
    {
        "subreddit": "movies",
        "sentence": "I always found .mkv files gave the best quality to size ratio, especially for animations"
    },
    {
        "subreddit": "movies",
        "sentence": "VLC is the best player."
    },
    {
        "subreddit": "movies",
        "sentence": "Another banger brought to us by the great Joss"
    },
    {
        "subreddit": "movies",
        "sentence": ">You think his movies don't make sense"
    },
    {
        "subreddit": "movies",
        "sentence": "Wouldn't that make you the stupid one?\n\nGuy kills woman, woman shows up to his party with a detective, doesnt kick detective out"
    },
    {
        "subreddit": "movies",
        "sentence": "Keeps napkin that is evidence in plain sight but its okay its because HES ACTUALLY a moron because he doesnt use the words correctly and woman had an identical twin, twist"
    },
    {
        "subreddit": "movies",
        "sentence": "What a modern day agatha christie.\n\nStill you dawg."
    },
    {
        "subreddit": "movies",
        "sentence": "Ikr? Star wars is like the most overrated thing on the planet"
    },
    {
        "subreddit": "movies",
        "sentence": "It explained so much when I heard that the bigwigs behind it originally just tossed something together in order to sell toys to kids"
    },
    {
        "subreddit": "movies",
        "sentence": "I don't know how in hell it has even gotten so big since it's just some hastily put together toy advert stuff."
    },
    {
        "subreddit": "movies",
        "sentence": "Its both sadly"
    },
    {
        "subreddit": "movies",
        "sentence": "Aliens come from a 2k scan that was upscaled and DNRed."
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah I don't get why more movies aren't set in Australia"
    },
    {
        "subreddit": "movies",
        "sentence": "Especially movies that take places in the distant future"
    },
    {
        "subreddit": "movies",
        "sentence": "Australia has such distinct  wildlife and wilderness its hard to pass of as another country"
    },
    {
        "subreddit": "movies",
        "sentence": "I see you got some Gaspar Noe movies in that list"
    },
    {
        "subreddit": "movies",
        "sentence": "I've watched all of his movies and all I can say is that he sure is a particular director"
    },
    {
        "subreddit": "movies",
        "sentence": "It feels like all of his movies want the viewer to stop watching"
    },
    {
        "subreddit": "movies",
        "sentence": "Jack Black is such a great comedic actor and not given the credit he’s due as a musician because he is a comedian."
    },
    {
        "subreddit": "movies",
        "sentence": "Fantastic Planet"
    },
    {
        "subreddit": "movies",
        "sentence": "A fellow Doomsday enjoyer! Love that movie so much"
    },
    {
        "subreddit": "movies",
        "sentence": "The ending music video to Frankie Goes to Hollywood/Bently ad was fucking hysterical."
    },
    {
        "subreddit": "movies",
        "sentence": "That very basic \"call to adventure\" shouldn't be mistaken for the plot. \n\n\nIt's literally step 1 of 12 in the [heroes journey](https://en.m.wikipedia.org/wiki/Hero%27s_journey) that outlines most fantasy story telling."
    },
    {
        "subreddit": "movies",
        "sentence": "I recommend A Garden Of Words based on your taste 😀"
    },
    {
        "subreddit": "movies",
        "sentence": "The correct answer is the matrix"
    },
    {
        "subreddit": "movies",
        "sentence": "The original."
    },
    {
        "subreddit": "movies",
        "sentence": "Thank you for using an acronym correctly in your post"
    },
    {
        "subreddit": "movies",
        "sentence": "That is all."
    },
    {
        "subreddit": "movies",
        "sentence": "Get new friends"
    },
    {
        "subreddit": "movies",
        "sentence": "Triplets of Bellville, L'Illusioniste, Chico and Rita"
    },
    {
        "subreddit": "movies",
        "sentence": "But if it dumb? 😂"
    },
    {
        "subreddit": "movies",
        "sentence": "The Other Guys (2010)."
    },
    {
        "subreddit": "movies",
        "sentence": "I had a situationship with a new Zealander when I was 19, and when I visited he was like \"Let's watch this little film about the maori culture\""
    },
    {
        "subreddit": "movies",
        "sentence": "We watched \"Once Were Warriors\""
    },
    {
        "subreddit": "movies",
        "sentence": "It is burned into my brain"
    },
    {
        "subreddit": "movies",
        "sentence": "All of it"
    },
    {
        "subreddit": "movies",
        "sentence": "Not in the best way"
    },
    {
        "subreddit": "movies",
        "sentence": "Also Last House on The Left"
    },
    {
        "subreddit": "movies",
        "sentence": "I refuse to watch SA in films now"
    },
    {
        "subreddit": "movies",
        "sentence": "If it's in a film or TV show I turn it off"
    },
    {
        "subreddit": "movies",
        "sentence": "Thank God I can't relate but I feel too much empathy and as a woman I just can't watch it.\n\nIn lighter news, Bridesmaids made me embarrass myself for doing actual spit takes and laughing too much on a plane"
    },
    {
        "subreddit": "movies",
        "sentence": "I don't know why but I found that movie SO fucking funny"
    },
    {
        "subreddit": "movies",
        "sentence": "Also Into the Wild and Across the Universe were staples of highschool for me"
    },
    {
        "subreddit": "movies",
        "sentence": "For existential and shit."
    },
    {
        "subreddit": "movies",
        "sentence": "Controversial opinion: she didn't quite work for me in The Menu"
    },
    {
        "subreddit": "movies",
        "sentence": "But that was mostly due to some poor writing and directing choices. \n\n\nStill liked the movie a lot, just less then the majority of this sub does."
    },
    {
        "subreddit": "movies",
        "sentence": "Lmfao oh no the patriarchy"
    },
    {
        "subreddit": "movies",
        "sentence": "I was wondering when you were going to drop that"
    },
    {
        "subreddit": "movies",
        "sentence": "And i never said women were pathetic or dependent on men"
    },
    {
        "subreddit": "movies",
        "sentence": "That conclusion is all you hon"
    },
    {
        "subreddit": "movies",
        "sentence": "As i dont believe that for a second"
    },
    {
        "subreddit": "movies",
        "sentence": "Do we need men to have a functioning society, Absolutely"
    },
    {
        "subreddit": "movies",
        "sentence": "Men do alot"
    },
    {
        "subreddit": "movies",
        "sentence": "You and all the women who think like you should be ashamed at how easily yall disregard all that men do for us"
    },
    {
        "subreddit": "movies",
        "sentence": "Let me say this now"
    },
    {
        "subreddit": "movies",
        "sentence": "This isnt some competition to me"
    },
    {
        "subreddit": "movies",
        "sentence": "We need each other to have a functioning society"
    },
    {
        "subreddit": "movies",
        "sentence": "We complement each other. \n\n\nWell your point is ridiculous as giving birth and then taking multiple bullets or getting hit by multiple cars and still fighting is not the same thing"
    },
    {
        "subreddit": "movies",
        "sentence": "One is natural"
    },
    {
        "subreddit": "movies",
        "sentence": "One is not"
    },
    {
        "subreddit": "movies",
        "sentence": "Also how well are women fighting after they give birth?! And how well would you fight after a broken rib, or a gun shot or two?! I am not only traditional"
    },
    {
        "subreddit": "movies",
        "sentence": "I am a realist, not a crazy feminist"
    },
    {
        "subreddit": "movies",
        "sentence": "You sound like someone who has never been punched by a man"
    },
    {
        "subreddit": "movies",
        "sentence": "Also I am a twin"
    },
    {
        "subreddit": "movies",
        "sentence": "He is a male"
    },
    {
        "subreddit": "movies",
        "sentence": "I can see our differences and our strengths and we have the same parents and genes"
    },
    {
        "subreddit": "movies",
        "sentence": "Just because you want to live in some made up world where women are somehow superior and can do everything a man can doesn't mean you are living in reality"
    },
    {
        "subreddit": "movies",
        "sentence": "You are living in some make believe world you and other feminists prefer"
    },
    {
        "subreddit": "movies",
        "sentence": "But I like living in the real world where over 85% of our military and cops are male for a reason and this is with quotas and pushing for women to be represented"
    },
    {
        "subreddit": "movies",
        "sentence": "Women are not designed for intense combat"
    },
    {
        "subreddit": "movies",
        "sentence": "Can they do it"
    },
    {
        "subreddit": "movies",
        "sentence": "Yes, but as well as a highly trained man"
    },
    {
        "subreddit": "movies",
        "sentence": "Absolutely not"
    },
    {
        "subreddit": "movies",
        "sentence": "They may be proficient in some areas but they will always lose in some aspect or another to a male counterpart"
    },
    {
        "subreddit": "movies",
        "sentence": "The packs they have to carry around alone in the military most women can't do for miles"
    },
    {
        "subreddit": "movies",
        "sentence": "Women have lost the ability to have children after the basic military training alone and thats not even combat"
    },
    {
        "subreddit": "movies",
        "sentence": "They have been known to lose weight and have severe medical issues while their male counterparts gained muscle mass"
    },
    {
        "subreddit": "movies",
        "sentence": "This isnt an attack on women"
    },
    {
        "subreddit": "movies",
        "sentence": "Stop taking it as that"
    },
    {
        "subreddit": "movies",
        "sentence": "It's biological"
    },
    {
        "subreddit": "movies",
        "sentence": "Men are built differently"
    },
    {
        "subreddit": "movies",
        "sentence": "Being offended is just ridiculous"
    },
    {
        "subreddit": "movies",
        "sentence": "Women are amazing but stop acting like they can do everything as well as men"
    },
    {
        "subreddit": "movies",
        "sentence": "Why men dont take us seriously"
    },
    {
        "subreddit": "movies",
        "sentence": "We literally can't"
    },
    {
        "subreddit": "movies",
        "sentence": "Or are you okay with women being drafted along side the men if a war breaks out?! You willing to sacrifice all women to prove your point that we are equal in this realm? This really shouldn't be controversial"
    },
    {
        "subreddit": "movies",
        "sentence": "It's our reality"
    },
    {
        "subreddit": "movies",
        "sentence": "If you honestly think a 120 pound female can take down 180 pound man you are just not thinking thru"
    },
    {
        "subreddit": "movies",
        "sentence": "Maybe train with men in sparring or boxing classes and come back and talk to me"
    },
    {
        "subreddit": "movies",
        "sentence": "Men and women are not equal"
    },
    {
        "subreddit": "movies",
        "sentence": "But by all means go ahead and fight some men and see how you end up"
    },
    {
        "subreddit": "movies",
        "sentence": "I'm sure you can break a couple of ribs or take a few gun shots and keep on swinging and win"
    },
    {
        "subreddit": "movies",
        "sentence": "You seem like a fighter."
    },
    {
        "subreddit": "movies",
        "sentence": "Blu-ray and DVD is different though."
    },
    {
        "subreddit": "movies",
        "sentence": "Be very WARY of any man who owns a pig farm."
    },
    {
        "subreddit": "movies",
        "sentence": "Oh man, I haven’t seen Airheads in years"
    },
    {
        "subreddit": "movies",
        "sentence": "Saving Silverman is so good"
    },
    {
        "subreddit": "movies",
        "sentence": "“Judith escaped”"
    },
    {
        "subreddit": "movies",
        "sentence": "I know I saw Celtic Price but it’s mostly forgotten now."
    },
    {
        "subreddit": "movies",
        "sentence": "I was going to do a list but you've covered most of what I was going to list.\n\nI'm going to add a few more though:\n\nRene Laloux films - La Planete Sauvage/Fantastic Planet, Les Maitres du Temps, Gandahar\n\nAlice by Jan Svankmajer\n\nFelidae\n\nAnime anthologies - Neo Tokyo, Genius Party (avoid Limitcycle, I was told to avoid it, I didn't, now I'm telling you, avoid it!), Genius Party Beyond, Robot Carnival\n\nPatlabor - The first two movies are fantastic but it's recommended to watch the OVAs first"
    },
    {
        "subreddit": "movies",
        "sentence": "Whole franchise is good though."
    },
    {
        "subreddit": "movies",
        "sentence": "Would’ve been great to get a prequel, so to speak, enlarging on that endless night we saw in the flashbacks"
    },
    {
        "subreddit": "movies",
        "sentence": "Low-budget, visceral, fast."
    },
    {
        "subreddit": "movies",
        "sentence": "Missed his other movie: Oblivion"
    },
    {
        "subreddit": "movies",
        "sentence": "The sky house sound is top notch"
    },
    {
        "subreddit": "movies",
        "sentence": "It was his idea"
    },
    {
        "subreddit": "movies",
        "sentence": "He doesn't like grain, so he uses AI to remove it."
    },
    {
        "subreddit": "movies",
        "sentence": "I wasn’t allowed to watch TR as a kid because of that dancing scene.\n\nI snuck around and watched it anyway."
    },
    {
        "subreddit": "movies",
        "sentence": "Neo from The Matrix"
    },
    {
        "subreddit": "movies",
        "sentence": "Paranorman is Laika's true masterpiece."
    },
    {
        "subreddit": "movies",
        "sentence": "lol"
    },
    {
        "subreddit": "movies",
        "sentence": "Remember when all movies were somehow 3D for some reason? It was the in-thing so studio executives jumped on it even if it made no sense"
    },
    {
        "subreddit": "movies",
        "sentence": "Same thing here"
    },
    {
        "subreddit": "movies",
        "sentence": "AI is the in-thing, so studios are using it"
    },
    {
        "subreddit": "movies",
        "sentence": "And like 3D,  badly."
    },
    {
        "subreddit": "movies",
        "sentence": "barb and star go to vista del mar"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s been suggested a few times"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ll look into it this week and see how I can watch."
    },
    {
        "subreddit": "movies",
        "sentence": "I just got out of a screening, I tend to not do that well with super overtly realistic gore but I was able to mostly make it through without shying away"
    },
    {
        "subreddit": "movies",
        "sentence": "If it's anything the kills don't last super long (there's also no torture) and the truly gory moments you can see coming"
    },
    {
        "subreddit": "movies",
        "sentence": "That being said, I really liked the movie"
    },
    {
        "subreddit": "movies",
        "sentence": "It is super slow at times but if you can meet it at it's level it can really build up the tension."
    },
    {
        "subreddit": "movies",
        "sentence": "The Iron Giant, Batman, Mask of the Phantasm, Teen Titans, Young Justice, Akira, Castlevania, Blood of Zeus, Avatar The Last Airbender, Samurai Jack"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ve seen the first two, heard of the third"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ll look into it."
    },
    {
        "subreddit": "movies",
        "sentence": "Hubris, sheer hubris if you ask me.\n\nMr"
    },
    {
        "subreddit": "movies",
        "sentence": "Keating is so full of resentment towards the school for having responsibility thrust upon him without his say so, he makes out that he loves teaching as a signal of virtue when underneath it all he is doing everything he can to subvert the pupils thereby destroying the institution from the inside.\n\nIf all his pupils flunked, I’m quite sure he would just shrug and pass it off with some smug smile, saying how “success isn’t measured in certificates”…"
    },
    {
        "subreddit": "movies",
        "sentence": "I find him as charming as the devil himself, who couldn’t like him? But ultimately he is the snake in the grass, offering innocent boys the temptations of worldly pleasure and sowing the seed of resentment.\n\nIs it not shown clearly as satanism, to sneak off at midnight under the moon to a dark cave, huddle round a fire and play with passions till demons are summoned? \n\nIt is inevitable of course, everyone must go through this process, but for Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Keating to have such hasty and lofty Pride over what is essentially just common Sin… There’s only one character in this life that is like that, and he has horns and a tail 😂\n\nWhen Neil turned to Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Keating, the Right thing was to tell him to obey his Father"
    },
    {
        "subreddit": "movies",
        "sentence": "Instead he affirmed Neil’s emotions, he had no right to do this"
    },
    {
        "subreddit": "movies",
        "sentence": "A teacher is there to teach, not to get embroiled in the emotional states of children and their relationships to their parents.\n\nSigh, if I had watched this film as a young man, of course I would see Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Keating as some victim of authority but alas I am just too long in the tooth for that now"
    },
    {
        "subreddit": "movies",
        "sentence": "I may add, that I do make a concession for Todd"
    },
    {
        "subreddit": "movies",
        "sentence": "I do think that Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Keating’s approach is somewhat justified when dealing with a boy like Todd"
    },
    {
        "subreddit": "movies",
        "sentence": "He has issues and no relationship with his father at all"
    },
    {
        "subreddit": "movies",
        "sentence": "He is lost completely.\n\nIn conclusion I do not believe that it is worth stirring the emotions and passions of already confused young boys just to save one lost soul.\n\nOnly satanists believe they have the authority to decide which child loses their life at the expense of another’s soul.\n\nWhilst not implicitly responsible for Neil’s death and of course not legally, I do find Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Keating an irresponsible faculty member and believe he should lose the privilege of working in such a school ever again."
    },
    {
        "subreddit": "movies",
        "sentence": "Ikr? Why she look so bad? I don’t know, maybe because she has other things to worry about than her appearance?"
    },
    {
        "subreddit": "movies",
        "sentence": "Rain Man (1988)"
    },
    {
        "subreddit": "movies",
        "sentence": "I watched it for the first time recently"
    },
    {
        "subreddit": "movies",
        "sentence": "And I loved the performances, cinematography, direction, script and the score"
    },
    {
        "subreddit": "movies",
        "sentence": "10/10"
    },
    {
        "subreddit": "movies",
        "sentence": "What insults were in my previous response? I said \"motherfucker\" once, there were no insults before that.\n\n>I'm not arguing semantics with semantics"
    },
    {
        "subreddit": "movies",
        "sentence": "I'm providing the definition of semantics right after providing the definition of wetness.\n\nArguing using definitions is the exact meaning of arguing semantics\n\n>I used semantics\n\nYou even admit it here *right after saying you didn't argue semantics*, you can't go a single sentence without contradicting yourself.\n\n>how fucking stupid you are\n\nMore insults, classy!\n\nAs to your last paragraph, no, you don't get to tell me how I'm feeling or what I'd do, you don't know me"
    },
    {
        "subreddit": "movies",
        "sentence": "If this is what taking a whole class on arguing has led to, I'd be thinking it was a giant waste of time"
    },
    {
        "subreddit": "movies",
        "sentence": "Sounds fun"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ll check it out."
    },
    {
        "subreddit": "movies",
        "sentence": "I know I'm in the minority, but I rather liked it.\n\nDidn't even get hung up on the martha-bit since I don't watch action movies with my brains turned on."
    },
    {
        "subreddit": "movies",
        "sentence": "If his name was Steven Wickerbottom, it would have been rated R, but because of who runs the media in America, who holds the purse strings, it is rated PG."
    },
    {
        "subreddit": "movies",
        "sentence": "I just watched the show since I've been playing the game a lot and I'm kinda split on it"
    },
    {
        "subreddit": "movies",
        "sentence": "It started out really well but the ending was just not it ngl."
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah, Clint Eastwood in the Good, The Bad, and the Ugly"
    },
    {
        "subreddit": "movies",
        "sentence": "I think Quantum usually gets a pass because of the writer's strike that derailed the production"
    },
    {
        "subreddit": "movies",
        "sentence": "What a hot mess that movies was."
    },
    {
        "subreddit": "movies",
        "sentence": "I should note that I work in Visual Effects and have probably worked on a number of movies and TV shows you've watched"
    },
    {
        "subreddit": "movies",
        "sentence": "Some of them I love, some of them I really don't like, and some of them I tolerate for the hard work done by the people who tried their hardest and gave a lot even for a mediocre end product.\n\nMaking movies is really hard"
    },
    {
        "subreddit": "movies",
        "sentence": "So many things can sabotage the project - not just the director or the executives, but simple things like a booking agent who didn't book big enough studios so the main set just feels tiny"
    },
    {
        "subreddit": "movies",
        "sentence": "Or a makeup artists who made a continuity mistake with a scar.\n\nOne of the reasons I think people blame VFX/CGI a lot for films problems is that we are the people who are tasked with fixing problems after the fact"
    },
    {
        "subreddit": "movies",
        "sentence": "That scar on the wrong side? Have VFX fix it .."
    },
    {
        "subreddit": "movies",
        "sentence": "but if you notice it's not quite real in one shot you'll blame it on bad CG"
    },
    {
        "subreddit": "movies",
        "sentence": "That set that is obviously CGI extensions? Have VFX fix it .."
    },
    {
        "subreddit": "movies",
        "sentence": "but the extensions may never feel right with the practical lighting that was shot for the tight space, so you'll blame it on bad CGI.\n\nThere was a time when we couldn't fix as much stuff"
    },
    {
        "subreddit": "movies",
        "sentence": "And I think that did honestly make us make better movies"
    },
    {
        "subreddit": "movies",
        "sentence": "But good film makers, great directors and art directors and make up people and VFX people, still strive to plan and organise and do their best"
    },
    {
        "subreddit": "movies",
        "sentence": "They don't want to \"fix things\" but instead to make the right thing to begin with.\n\nBut it is pretty hard"
    },
    {
        "subreddit": "movies",
        "sentence": "Modern movies are big clunky things :)\n\nI recently loved Everything, Everywhere, All At Once"
    },
    {
        "subreddit": "movies",
        "sentence": "I think it was a modest budget, with a great story, and really cool CGI"
    },
    {
        "subreddit": "movies",
        "sentence": "It was done by a tiny little team and they did such great work .."
    },
    {
        "subreddit": "movies",
        "sentence": "and they were able to do it because the Director cared and sat with the VFX artists and got really involved"
    },
    {
        "subreddit": "movies",
        "sentence": "It was made with a plan, but was agile when it needed to be"
    },
    {
        "subreddit": "movies",
        "sentence": "And it was made with connection, communication and passion"
    },
    {
        "subreddit": "movies",
        "sentence": "Making films like that is still hard .."
    },
    {
        "subreddit": "movies",
        "sentence": "but it's also a joy."
    },
    {
        "subreddit": "movies",
        "sentence": "I’ve seen all but Borat"
    },
    {
        "subreddit": "movies",
        "sentence": "Not a Sacha Baron Cohen person"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ve seen parts of it and didn’t care for it"
    },
    {
        "subreddit": "movies",
        "sentence": "I love all the vacation movies, even the European vacation and the Ed Helms reboot."
    },
    {
        "subreddit": "movies",
        "sentence": "bass note repeats."
    },
    {
        "subreddit": "movies",
        "sentence": "Dicks: The Musical (2023)\n\nIs vulgar af and mind meltingly dumb."
    },
    {
        "subreddit": "movies",
        "sentence": "While I wasn't fond of David having such a big hand in the creation of the xenomorph, I did like how much more hyper-aggressive the xenomorph in the film was"
    },
    {
        "subreddit": "movies",
        "sentence": "The fact that xenomorphs are so mutable based on their host/environment is one of my favorite aspects of them, and I feel like having a strain that was just this...raging, unstoppable killing machine was a take on the creature that I don't think had been done yet."
    },
    {
        "subreddit": "movies",
        "sentence": "Madhouse.\n\nNinja Scroll.\nVampire Hunter D: Bloodlust\nTokyo Godfathers"
    },
    {
        "subreddit": "movies",
        "sentence": "That and The Thin Red Line are the best audio mixes in film history. \n\nHeats shootout gets a close second."
    },
    {
        "subreddit": "movies",
        "sentence": "There were a few moments of what appeared to be robot zombies"
    },
    {
        "subreddit": "movies",
        "sentence": "In one scene of the zombie side of things you can see one with the glowing eyes in the crowd"
    },
    {
        "subreddit": "movies",
        "sentence": "I think it was when the one was giving birth"
    },
    {
        "subreddit": "movies",
        "sentence": "This was my favorite film in highschool."
    },
    {
        "subreddit": "movies",
        "sentence": "calm down satan"
    },
    {
        "subreddit": "movies",
        "sentence": "2011 has one good joke, the rest is shit.\n\nYou know what, here\n\nhttps://www.youtube.com/watch?v=Kj5ADMHizKk"
    },
    {
        "subreddit": "movies",
        "sentence": "Titan AE"
    },
    {
        "subreddit": "movies",
        "sentence": "I can't believe Emily blunt came out of edge of tomorrow and didn't become an action star"
    },
    {
        "subreddit": "movies",
        "sentence": "Absolutely robbery."
    },
    {
        "subreddit": "movies",
        "sentence": "Ernest and Celestine!!! Such a gem"
    },
    {
        "subreddit": "movies",
        "sentence": "He was a better villan than the main villan"
    },
    {
        "subreddit": "movies",
        "sentence": "Better than Christoph Watlz Blofeld, if you can believe it"
    },
    {
        "subreddit": "movies",
        "sentence": "Jekyll and Hyde.."
    },
    {
        "subreddit": "movies",
        "sentence": "Together Again!"
    },
    {
        "subreddit": "movies",
        "sentence": "Can you elaborate, I wanna know more lmao"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ve seen this one"
    },
    {
        "subreddit": "movies",
        "sentence": "Probably due for a rewatch."
    },
    {
        "subreddit": "movies",
        "sentence": "Gotta enforce those family values or somethingrather!"
    },
    {
        "subreddit": "movies",
        "sentence": "Gamer"
    },
    {
        "subreddit": "movies",
        "sentence": "His last brilliant performance until he finally put the working boots on in Killers Of The Flower Moon."
    },
    {
        "subreddit": "movies",
        "sentence": "I don't think that's a weird take"
    },
    {
        "subreddit": "movies",
        "sentence": "Were they trying to give Frozen II as an example of a miss? Because it's very comparably rated to the first."
    },
    {
        "subreddit": "movies",
        "sentence": "Beautiful film"
    },
    {
        "subreddit": "movies",
        "sentence": "Love the intro by David Bowie in one version"
    },
    {
        "subreddit": "movies",
        "sentence": "You can find on YouTube"
    },
    {
        "subreddit": "movies",
        "sentence": "Maximum overdrive was cool as heck until it just became a film about trucks"
    },
    {
        "subreddit": "movies",
        "sentence": "How is this Chekhovs gun?"
    },
    {
        "subreddit": "movies",
        "sentence": "I went and saw it with my best friend and I was making this joke the entire time"
    },
    {
        "subreddit": "movies",
        "sentence": "Yes it do."
    },
    {
        "subreddit": "movies",
        "sentence": "Seen the Hangovers, not the other"
    },
    {
        "subreddit": "movies",
        "sentence": "I like Samberg"
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks."
    },
    {
        "subreddit": "movies",
        "sentence": "Stallone as Rambo."
    },
    {
        "subreddit": "movies",
        "sentence": "I think I prefer his opening look in High Plains Drifter"
    },
    {
        "subreddit": "movies",
        "sentence": "Anime, basically.\n\nTry Akira or Redline"
    },
    {
        "subreddit": "movies",
        "sentence": "Akira was totally hand animated, and Redline is just totally sick.\n\nLots of anime, aside, has great animation or other such quality"
    },
    {
        "subreddit": "movies",
        "sentence": "The new Neon Genesis Rebuild (with the 2.22 and 3.33 naming or whatever, always forget) is also quite exceptional."
    },
    {
        "subreddit": "movies",
        "sentence": "Fun fact: Eminem was considered for the lead role"
    },
    {
        "subreddit": "movies",
        "sentence": "The Fellowship of the Ring...just never saw that ring being a big deal"
    },
    {
        "subreddit": "movies",
        "sentence": "And I never understood why they didn't just use the eagles to fly the ring thing to that burny mountain pit"
    },
    {
        "subreddit": "movies",
        "sentence": "/s"
    },
    {
        "subreddit": "movies",
        "sentence": "Ghiiiiiibli"
    },
    {
        "subreddit": "movies",
        "sentence": "The Triplets of Belleville"
    },
    {
        "subreddit": "movies",
        "sentence": ">Literally just finished watched the first episode 3 minutes ago.\n\nOh my god you are in for such a ride, I think Paranoia Agent is Kon's Magnum Opus (not to be confused with his manga, Opus 😂)"
    },
    {
        "subreddit": "movies",
        "sentence": "Civil War"
    },
    {
        "subreddit": "movies",
        "sentence": "Paul Newman was such a fox in that era"
    },
    {
        "subreddit": "movies",
        "sentence": "I really loved the Hustler with Jackie Gleason."
    },
    {
        "subreddit": "movies",
        "sentence": "I'm not sure it was specifically about female lust considering lust is what dammed Frank."
    },
    {
        "subreddit": "movies",
        "sentence": "Slaughterhouse-Five"
    },
    {
        "subreddit": "movies",
        "sentence": "The 1980s transformers movie.\n\nWatership down even though terrified me as a child it's a great movie.\n\nThe iron giant"
    },
    {
        "subreddit": "movies",
        "sentence": "I started laughing in the theater during the climactic fight scene"
    },
    {
        "subreddit": "movies",
        "sentence": "The obsessive need to CGI destroy tall buildings was so absurd"
    },
    {
        "subreddit": "movies",
        "sentence": "I've never gone back and watched it again."
    },
    {
        "subreddit": "movies",
        "sentence": "[https://youtube.com/shorts/4C\\_FQYJFc\\_E?si=0PBCOtsuXFGIlMhw](https://youtube.com/shorts/4C_FQYJFc_E?si=0PBCOtsuXFGIlMhw)"
    },
    {
        "subreddit": "movies",
        "sentence": "Ninja Scroll"
    },
    {
        "subreddit": "movies",
        "sentence": "[https://youtu.be/6jJcHS-7Olc?si=bVURWiP7FlDfNaeb](https://youtu.be/6jJcHS-7Olc?si=bVURWiP7FlDfNaeb)"
    },
    {
        "subreddit": "movies",
        "sentence": "What part of my comments were mean? I haven't said a mean thing to anyone"
    },
    {
        "subreddit": "movies",
        "sentence": "All I said was that it wasn't obvious"
    },
    {
        "subreddit": "movies",
        "sentence": "When I googled it, all examples I found was of stuff that was on screen for less than a few seconds"
    },
    {
        "subreddit": "movies",
        "sentence": "All I said was that I can't be faulted for missing that."
    },
    {
        "subreddit": "movies",
        "sentence": "I love this movie."
    },
    {
        "subreddit": "movies",
        "sentence": "I can’t believe nobody has said Fantastic Planet"
    },
    {
        "subreddit": "movies",
        "sentence": "You must watch Fantastic Planet"
    },
    {
        "subreddit": "movies",
        "sentence": "It's completely over the top and I love it"
    },
    {
        "subreddit": "movies",
        "sentence": "It uses an American comic book look which is unique for animation"
    },
    {
        "subreddit": "movies",
        "sentence": "Only an hour long though."
    },
    {
        "subreddit": "movies",
        "sentence": "Man that ad lives on in my head"
    },
    {
        "subreddit": "movies",
        "sentence": "I can still, and feel I always will, remember every moment of it so clearly."
    },
    {
        "subreddit": "movies",
        "sentence": "Let’s not attach Baz Luhrmann to anything please"
    },
    {
        "subreddit": "movies",
        "sentence": "Titan AE"
    },
    {
        "subreddit": "movies",
        "sentence": "AI is everywhere."
    },
    {
        "subreddit": "movies",
        "sentence": "GxK??"
    },
    {
        "subreddit": "movies",
        "sentence": "Bruce Willis movies went down hill over the decades, he was great in the 90s/ early 2000s"
    },
    {
        "subreddit": "movies",
        "sentence": "Shows\n* Arcane\n* Legend of Vox Machina \n* Castlevania\n* DOTA: Dragon's Blood\n* SW: Bad Batch\n* Dragon Age: Absolution \n* Dungeons and Dragons (1980s TV series)\n\nMovies \n* Dragon Age: Dawn of the Seeker \n* Witcher: Nightmare of the Wolf\n\nStop motion / puppets:\n* Dark Crystal\n* Dark Crystal: Age of Resistance\n* Wallace and Grommet \n* Chicken Run"
    },
    {
        "subreddit": "movies",
        "sentence": "Tomisaburô Wakayama in any Lone Wolf and Cub film."
    },
    {
        "subreddit": "movies",
        "sentence": "The Curse of La Llorona"
    },
    {
        "subreddit": "movies",
        "sentence": "He was amazing."
    },
    {
        "subreddit": "movies",
        "sentence": "hit me with your insight, where does it look crap? That movie is fuckin' crisp."
    },
    {
        "subreddit": "movies",
        "sentence": "Zazie Dan's le Metro"
    },
    {
        "subreddit": "movies",
        "sentence": "All the li'l Snaps wanna be like Clint; \n\nthey all wanna be like Clint\n\nBut I wanna be like Lee Van Cleef;\n\nya know I wanna be like Lee"
    },
    {
        "subreddit": "movies",
        "sentence": "Ugly Americans was cancelled after two season, but it got a pretty fair shake and they did a wonderful job with it"
    },
    {
        "subreddit": "movies",
        "sentence": "Well worth the watch if you like goofy, irreverent humor."
    },
    {
        "subreddit": "movies",
        "sentence": "Sounds like these friends might be alien shapeshifters."
    },
    {
        "subreddit": "movies",
        "sentence": "Pour J&B down the hatch"
    },
    {
        "subreddit": "movies",
        "sentence": "\"cheating bitch\"."
    },
    {
        "subreddit": "movies",
        "sentence": "Redline\n\nFerngully\n\nMagic Sword : Quest for Camelot\n\nKimi No Na Wa ( Your Name )\n\nSuzume"
    },
    {
        "subreddit": "movies",
        "sentence": "Cameron also endorsed shitty terminator sequels."
    },
    {
        "subreddit": "movies",
        "sentence": "Fantasia 2000"
    },
    {
        "subreddit": "movies",
        "sentence": "Tests the screen colours and imaging as well as the sound."
    },
    {
        "subreddit": "movies",
        "sentence": "I hope you heard the injured squawk he made when you typed that hateful comment, you monster"
    },
    {
        "subreddit": "movies",
        "sentence": "#emotionaldamage"
    },
    {
        "subreddit": "movies",
        "sentence": "BLAME!"
    },
    {
        "subreddit": "movies",
        "sentence": "Abigail"
    },
    {
        "subreddit": "movies",
        "sentence": "Never Hike Alone"
    },
    {
        "subreddit": "movies",
        "sentence": "(2017)"
    },
    {
        "subreddit": "movies",
        "sentence": "lol"
    },
    {
        "subreddit": "movies",
        "sentence": "Oops lol"
    },
    {
        "subreddit": "movies",
        "sentence": "mind game"
    },
    {
        "subreddit": "movies",
        "sentence": "What shit friends"
    },
    {
        "subreddit": "movies",
        "sentence": "Wouldn't want to be stranded in an arctic research station with them, yuck!"
    },
    {
        "subreddit": "movies",
        "sentence": "You think his movies don't make sense"
    },
    {
        "subreddit": "movies",
        "sentence": "Wouldn't that make you the stupid one?"
    },
    {
        "subreddit": "movies",
        "sentence": "Absolutely!  The hyseteria with the teens felt real"
    },
    {
        "subreddit": "movies",
        "sentence": "To this day I never have nor while I ever set foot on a sail boat because of Jaws 2.\n\nI did however swim in the open ocean at Martha's Vineyard before it dawned on me that is where they actually filmed Jaws"
    },
    {
        "subreddit": "movies",
        "sentence": "and lo-and-behold there was a Great White sighting AT THE BEACH I SWAM AT a week after I left..."
    },
    {
        "subreddit": "movies",
        "sentence": "Shaun of the Dead, Hot Fuzz and The Worlds End if Scott Pilgrim went over well"
    },
    {
        "subreddit": "movies",
        "sentence": "Very clever movies with tons of heart, and no nudity or explicit scenes I can recall"
    },
    {
        "subreddit": "movies",
        "sentence": "To quote someone else, the problem with subverting Superman is that Superman is subversive in the first place, someone in a position of absolute superiority dedicating his godlike powers to helping the common man"
    },
    {
        "subreddit": "movies",
        "sentence": "\"What if the most powerful man in the world *abused his power*?\" isn't exactly a mind-blowing premise, it's pretty much just a description of your average main villain"
    },
    {
        "subreddit": "movies",
        "sentence": "It ironically only seems unique because Superman is such an icon."
    },
    {
        "subreddit": "movies",
        "sentence": "May 28, 2024 still working thank you!"
    },
    {
        "subreddit": "movies",
        "sentence": "Is this a joke quote?"
    },
    {
        "subreddit": "movies",
        "sentence": "Interstellar"
    },
    {
        "subreddit": "movies",
        "sentence": "Sure you were"
    },
    {
        "subreddit": "movies",
        "sentence": "You were distracted by her 1 minute appearance at the beginning and her disfigured action shots later on."
    },
    {
        "subreddit": "movies",
        "sentence": "It’s amazing that people get annoyed by somebody having a different opinion"
    },
    {
        "subreddit": "movies",
        "sentence": "I didn’t like furiosa (or fury road for that matter) but really enjoyed The ministry of ungentlemanly warfare"
    },
    {
        "subreddit": "movies",
        "sentence": "I enjoyed boy kills world even more"
    },
    {
        "subreddit": "movies",
        "sentence": "However, I’m not going to say my opinion carries more weight than others who like the mad max films"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s subjective and a matter of personal taste"
    },
    {
        "subreddit": "movies",
        "sentence": "Can’t anyone just enjoy what they like?"
    },
    {
        "subreddit": "movies",
        "sentence": "Sony animation has been amazing the past few years"
    },
    {
        "subreddit": "movies",
        "sentence": "How was Knives Out 2? I enjoyed 1 a lot but never got around to watching the second."
    },
    {
        "subreddit": "movies",
        "sentence": "Doc Holliday"
    },
    {
        "subreddit": "movies",
        "sentence": "That Flintstones movie from like 30 years ago? It's dumb and campy but pretty funny"
    },
    {
        "subreddit": "movies",
        "sentence": "It's not a movie I personally seek out but if I remember it correctly it should fit what you're looking for"
    },
    {
        "subreddit": "movies",
        "sentence": "I was so freaked out for the first 15 minutes until the weirdo dude floated the tree theory"
    },
    {
        "subreddit": "movies",
        "sentence": "Then my eyes rolled back into my head, out of my skull, and into the next county."
    },
    {
        "subreddit": "movies",
        "sentence": "1"
    },
    {
        "subreddit": "movies",
        "sentence": "American pop\n2"
    },
    {
        "subreddit": "movies",
        "sentence": "Waltz with Bashir\n3"
    },
    {
        "subreddit": "movies",
        "sentence": "The congress \n4"
    },
    {
        "subreddit": "movies",
        "sentence": "Persepolis\n5"
    },
    {
        "subreddit": "movies",
        "sentence": "The illusionist \n6"
    },
    {
        "subreddit": "movies",
        "sentence": "The Triplets of Belleville \n7"
    },
    {
        "subreddit": "movies",
        "sentence": "Paprika\n8"
    },
    {
        "subreddit": "movies",
        "sentence": "Scanner darkly"
    },
    {
        "subreddit": "movies",
        "sentence": "Beginners!"
    },
    {
        "subreddit": "movies",
        "sentence": "The Last Unicorn\n\nThe Land Before Time\n\nDetective Conan: The Fourteenth Target (really most of the DC movies)\n\nRankin-Bass' Hobbit and Return of the King\n\nRalph Bakshi's Lord of the Rings\n\nJohn the Fearless\n\nAsterix and the Mansions of the Gods\n\nAsterix and the Secret of the Magic Potion\n\n(really most of the Asterix movies except for Asterix the Gaul and Asterix vs Caesar)\n\nLucky Luke: Ballad of the Daltons\n\nTransformers: The Movie\n\nBravestarr: the Legend\n\nHe-Man and She-Ra: Secret of the Sword\n\nHonestly I've seen so many good animated movies in my life that if I revisit this topic in an hour I'll remember some I forgot to list here"
    },
    {
        "subreddit": "movies",
        "sentence": "I actually don't even think all that highly of Ghibli or Disney (I enjoy them all right but I don't consider them god-tier like most do)."
    },
    {
        "subreddit": "movies",
        "sentence": "Hell yes"
    },
    {
        "subreddit": "movies",
        "sentence": "As a kid Boba Fett was my friend and I's favorite Star Wars character"
    },
    {
        "subreddit": "movies",
        "sentence": "When I saw [Slave 1](https://www.youtube.com/watch?v=vByR7Rarul8) land in The Mandolorian I fucking lost my mind"
    },
    {
        "subreddit": "movies",
        "sentence": "I loved The Book of Boba Fett"
    },
    {
        "subreddit": "movies",
        "sentence": "I fucking love that Jon Favreau and Dave Filoni brought back and highlighted my favorite Star Wars character!  Goddamn they really revived Star Wars!  The Mandalorian and The Book of Boba Fett are the best Star Wars entries that there is"
    },
    {
        "subreddit": "movies",
        "sentence": "I mean, the prequels, wtf"
    },
    {
        "subreddit": "movies",
        "sentence": "Considering that the central plot revolves around the porn industry, I would not recommend The Nice Guys if nudity is a concern."
    },
    {
        "subreddit": "movies",
        "sentence": "yeah same, idk"
    },
    {
        "subreddit": "movies",
        "sentence": "lmk if u find it tho"
    },
    {
        "subreddit": "movies",
        "sentence": "A while back I wanted to find the most gore depraved brutal horror movie and I found this movie that is part of a horror movie genre called \"new french extreme\""
    },
    {
        "subreddit": "movies",
        "sentence": "The only thing they have in common is that they are all in french and that they are all bad shit crazy"
    },
    {
        "subreddit": "movies",
        "sentence": "The sort of movies that you don't watch for fun"
    },
    {
        "subreddit": "movies",
        "sentence": "Some of them I've personally watched are:\n\n* High Tension\n* Inside\n* Irreversible\n* Titane\n* Enter the void\n* Saló (this one is an old italian movie but it fits in with the genre)\n\n  \nand for the real brave people who like me were trying to find the MOST brutal movies, there is actually a tier above these movies"
    },
    {
        "subreddit": "movies",
        "sentence": "The absolute climax that I've watched are compilations of real life murders, rapes, suicides, and illegal medical operations all conveniently located in one single dark-web website (of which I forgot the name)"
    },
    {
        "subreddit": "movies",
        "sentence": "But at that point there's no longer any plot, it's just gore for the sake of it"
    },
    {
        "subreddit": "movies",
        "sentence": "Finally, a post with Spirit"
    },
    {
        "subreddit": "movies",
        "sentence": "This should be at the top."
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah when my sister worked at the cinema I got $2 tickets, so I would watch any movie I wanted"
    },
    {
        "subreddit": "movies",
        "sentence": "Now, I'm selective with what I see (e.g"
    },
    {
        "subreddit": "movies",
        "sentence": "will I regret not seeing this on the big screen later)"
    },
    {
        "subreddit": "movies",
        "sentence": "> Phaser banks in Star Trek are continuous beams, not sub-light pew pews"
    },
    {
        "subreddit": "movies",
        "sentence": "That's clearly Star Wars stuff"
    },
    {
        "subreddit": "movies",
        "sentence": "Similarly, a fist fight on a bridge over a bottomless pit without any guard rails? My mind automatically put lightsabers in their hands"
    },
    {
        "subreddit": "movies",
        "sentence": "JJ clearly wanted to make a Star Wars there"
    },
    {
        "subreddit": "movies",
        "sentence": "Similarly, Kirk falling on an ice planet and then running away from big creature? That's what you see in Star Wars."
    },
    {
        "subreddit": "movies",
        "sentence": "Would the 2004 film Strings count, I feel it should count.\n\nNo Particular order:\n\nStrings, Paprika(all of Satoshi Kon's works really), Don Bluth films in general, Fantastic planet, Sita Sings The Blues, I'm sure I have missed many."
    },
    {
        "subreddit": "movies",
        "sentence": "Jesus wept."
    },
    {
        "subreddit": "movies",
        "sentence": "Wish they had done houseboat in Sleepless in Seattle"
    },
    {
        "subreddit": "movies",
        "sentence": "Reign of Fire"
    },
    {
        "subreddit": "movies",
        "sentence": "Not that I hate the movie we got, but it wasn't the dragons v attack helicopters/destroying London, that the poster promised."
    },
    {
        "subreddit": "movies",
        "sentence": "Get new friends."
    },
    {
        "subreddit": "movies",
        "sentence": "Your Name by Makoto Shinkai is a masterpiece and remains one of the most egregious Oscar snubs IMO.\n\nIron Giant is one of my favorites from my childhood and makes me ugly cry as an adult.\n\nThe Lego Movies were excellent, and also really deserved more critical praise."
    },
    {
        "subreddit": "movies",
        "sentence": "C’mon! You didn’t like watching Will Smith yell at his date to get off him before he nut-blasts holes in the roof of his trailer?"
    },
    {
        "subreddit": "movies",
        "sentence": "Beautiful Girls  \nA Walk In The Clouds  \nIt's Complicated  \nSideways  \nSomething's Gotta Give  \nAs Good As It Gets  \nDazed And Confused\n\nAll are great \"feel good\" movies that are just about life and relationships in general, granted some more dramatic than others."
    },
    {
        "subreddit": "movies",
        "sentence": "It flies away unrealistically to the horizon?"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s shallow in ways that I find to be near-unforgivable at times"
    },
    {
        "subreddit": "movies",
        "sentence": "There’s the one key that Wade finds by reciting an entire movie word for word"
    },
    {
        "subreddit": "movies",
        "sentence": "And there’s a scene where Wade debate-bros a secondary antagonist into submission with better 80s trivia memorization"
    },
    {
        "subreddit": "movies",
        "sentence": "That’s not enjoying an era of media, that’s zealotry"
    },
    {
        "subreddit": "movies",
        "sentence": "And then there’s the funky orientalist overtones with some of the deuteragonists, and a strange non-sequitur message about the difficulties of being a black woman in America from another deuteragonist, and a final incel-manifesto fantasy subplot with the final deuteragonist.\n\nI can enjoy easy reading that doesn’t challenge me too much, but RP1 made a few too many gaffes for me."
    },
    {
        "subreddit": "movies",
        "sentence": "Damn."
    },
    {
        "subreddit": "movies",
        "sentence": "thank u for this"
    },
    {
        "subreddit": "movies",
        "sentence": "I missed that connection"
    },
    {
        "subreddit": "movies",
        "sentence": "Dang that’s so sad."
    },
    {
        "subreddit": "movies",
        "sentence": "The road to el dorado is really good"
    },
    {
        "subreddit": "movies",
        "sentence": "Its very funny"
    },
    {
        "subreddit": "movies",
        "sentence": "* Metropolis (2000)\n* Iron Giant\n* 5CM Per Second"
    },
    {
        "subreddit": "movies",
        "sentence": "Coco"
    },
    {
        "subreddit": "movies",
        "sentence": "Are we also including the Arab conquests and massacres of the 7th century, here? \n\nIt'll be relevant so long as people keep trying to exterminate Jews"
    },
    {
        "subreddit": "movies",
        "sentence": "So it will always be relevant."
    },
    {
        "subreddit": "movies",
        "sentence": "The Snow Queen (1957, Soviet Union)\n\nRoteò and the Magic of the Mirror (2004, Italy)\n\nAlso Coraline and Sinbad: Legend of the Seven Seas"
    },
    {
        "subreddit": "movies",
        "sentence": "Altered Carbon is THE cyberpunk series when I think of one."
    },
    {
        "subreddit": "movies",
        "sentence": "fuckin goof, you know jack shit about acid."
    },
    {
        "subreddit": "movies",
        "sentence": "Joe Dirt gets my vote"
    },
    {
        "subreddit": "movies",
        "sentence": "Only the first one though, the second Joe Dirt movie was a travesty."
    },
    {
        "subreddit": "movies",
        "sentence": "Well! You’ve taught me something today 😊"
    },
    {
        "subreddit": "movies",
        "sentence": "To be fair she did take down Ellen though"
    },
    {
        "subreddit": "movies",
        "sentence": "I can't fully hate on her because someone needed to take down that toxic mfer"
    },
    {
        "subreddit": "movies",
        "sentence": "Came here to say this! If we’re gonna moan, lets get the facts straight."
    },
    {
        "subreddit": "movies",
        "sentence": "Rocknrolla has entered the chat."
    },
    {
        "subreddit": "movies",
        "sentence": "I felt like I was in on the joke, laughing at every, “you’re a life saver,” >! until the end"
    },
    {
        "subreddit": "movies",
        "sentence": "I mean, it’s obviously intentional that the killer kills everyone until he gets to the top - But for whatever reason intended, it’s not satisfying, still !< would recommend"
    },
    {
        "subreddit": "movies",
        "sentence": "Marlon Brando, Wild Ones"
    },
    {
        "subreddit": "movies",
        "sentence": "I read the book in 6th grade and really enjoyed it"
    },
    {
        "subreddit": "movies",
        "sentence": "then watched the movie and that was actually the first instance in my life of liking source material more than an adaptation"
    },
    {
        "subreddit": "movies",
        "sentence": "that being said, watching it again as an adult, I appreciate the animation so much more and feel like it's an animated classic"
    },
    {
        "subreddit": "movies",
        "sentence": "Macross: Do You Remember Love?\n\nMahou Shoujo Madoka Magica Movie III: Rebellion\n\nThe Disappearance of Haruhi Suzumiya\n\nAngel's Egg\n\nThe Garden of Sinners: Paradox Spiral\n\nThe End of Evangelion\n\nKimi no na wa\n\nPerfect Blue\n\nThe Girl Who Leapt Through Time\n\nWeathering With You\n\nJin-Roh\n\nThe Night is Short, Walk on Girl\n\nTamako Love Story\n\nVampire Hunter D - Bloodlust\n\nI Want to Eat Your Pancreas\n\nUrusei Yatsura 2 - Beautiful Dreamer"
    },
    {
        "subreddit": "movies",
        "sentence": "This is one unique convent horror movie"
    },
    {
        "subreddit": "movies",
        "sentence": "Gorgeously shot. One of the best horror films of the year so far."
    },
    {
        "subreddit": "movies",
        "sentence": "Balto\n\n\nThat movie really holds up."
    },
    {
        "subreddit": "movies",
        "sentence": "That movie is plain stupid.\n\n>!Big reveal in the middle that the whole point of the heist was to grab a zombie head, but none of the mercenaries was informed of this and also, there was no need to enter deep into the city, because at the beginning they show a door into the city behind a container.!<\n\n>!Literally just go inside, grab the first zombie and exit.!<\n\n>!Thats it, no need for the fake heist, no need to enter deep into the city and also no need for this shitty movie..!<\n\n>!But hey, that's Zack Snyder for you.!<"
    },
    {
        "subreddit": "movies",
        "sentence": "Klaus is such a beautiful movie"
    },
    {
        "subreddit": "movies",
        "sentence": "It's so frustrating trying to get people to watch it"
    },
    {
        "subreddit": "movies",
        "sentence": "Strong second for Bruce Lee in Enter the Dragon"
    },
    {
        "subreddit": "movies",
        "sentence": "Goddamn I love that film!"
    },
    {
        "subreddit": "movies",
        "sentence": "Watch it in the daytime!"
    },
    {
        "subreddit": "movies",
        "sentence": "Have you seen The Way Way Back? I highly enjoy a few off your list and that one is another that gives me similar vibes, somewhat."
    },
    {
        "subreddit": "movies",
        "sentence": "9 is fantastic and I forgot to put it on my post list"
    },
    {
        "subreddit": "movies",
        "sentence": "Took a while for me to scroll and find it here."
    },
    {
        "subreddit": "movies",
        "sentence": "Over My Head by Lit is an absolute banger"
    },
    {
        "subreddit": "movies",
        "sentence": "Dude I wish I were you right now"
    },
    {
        "subreddit": "movies",
        "sentence": "Go in blind."
    },
    {
        "subreddit": "movies",
        "sentence": "Fannie Mae pays why /what for stolen equipment …I don’t get it ???"
    },
    {
        "subreddit": "movies",
        "sentence": "This was the first “just released”Jurassic movie that I saw with my kids"
    },
    {
        "subreddit": "movies",
        "sentence": "Before the movie, I was super hyped along with the kids in anticipation for something grand.\n\nIn the end, the kids liked it, so I did too"
    },
    {
        "subreddit": "movies",
        "sentence": "And … that’s the only praise I could give for the movie."
    },
    {
        "subreddit": "movies",
        "sentence": "I still watch Conan The Barbarian and The Destroyer sometimes"
    },
    {
        "subreddit": "movies",
        "sentence": "The first has one of my favorite Schwarzenegger [movie lines](https://youtu.be/LyhTxQwSwJU?t=23) and he has so damn many."
    },
    {
        "subreddit": "movies",
        "sentence": "You might be interested in the Axis of Time book series, starting with “Weapons of Choice”"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s essentially the same premise, but an entire near future naval fleet is time-warped instead and scattered about the globe"
    },
    {
        "subreddit": "movies",
        "sentence": "They do intervene"
    },
    {
        "subreddit": "movies",
        "sentence": "Einstein gets an iPad; it’s pretty cool"
    },
    {
        "subreddit": "movies",
        "sentence": "Also, Hitler captures some of the ships"
    },
    {
        "subreddit": "movies",
        "sentence": "I never finished it, and I’m not sure why, now, tbh lol."
    },
    {
        "subreddit": "movies",
        "sentence": ">I think the closest he's come was Inception and he wasn't anywhere near as big as his co-stars in that"
    },
    {
        "subreddit": "movies",
        "sentence": "TDK might count?\n\n\n\n\n...and yet he stole every scene he was in."
    },
    {
        "subreddit": "movies",
        "sentence": "The one movie that made Sean Connery quit acting 😂"
    },
    {
        "subreddit": "movies",
        "sentence": "Kubo and the Two Strings, anything by Bashki, The Last Unicorn, Orin: The Legend of Starchaser, Watership Down, Plague Dogs, Mad God, Panic in a Tiny Town, Marcel the Shell, The Spine of Night, The Fantastic Mr Fox, The Secret Book of Kells, Ice and Fire, Akira, The Iron Giant, Shrek, Rock and Rule, Flushed Away, TinTin, Coraline, Corpse Bride, Rikki Tikki Tavi, Hugo the Hippo, The Prince of Egypt, The Dark Crystal, everything by Rankin/Bass, Charlie Brown, many many more"
    },
    {
        "subreddit": "movies",
        "sentence": "thanks"
    },
    {
        "subreddit": "movies",
        "sentence": "so to sum it up:\n\n- funding was originally split 3/5ths by german part, and 2/5ths by american part of this \"film company\""
    },
    {
        "subreddit": "movies",
        "sentence": "(when you make a film, you start a company for each film you make)\n- since it was filmed mostly in europe, the \"european part of the film company\", paid \"the part they agreed to pay\" to do the filming\n- however, they didn't transfer money for final editing/special effects\n- so the american film company sued to either get the money, or have them kicked off the project\n- (details mentioned about how/why the european company was bad)\n\nso the american part of the film company is either trying to get the money so they can finish editing/adding effects, or just get the european part removed from the film"
    },
    {
        "subreddit": "movies",
        "sentence": "which i guess has not happened yet.\n\nugh."
    },
    {
        "subreddit": "movies",
        "sentence": "The late great Christopher Lee, carried that whole Dracula sequel without saying a word just pure presence."
    },
    {
        "subreddit": "movies",
        "sentence": "Technically that's Disney now"
    },
    {
        "subreddit": "movies",
        "sentence": "Brave Little Toaster\n\nLand Before Time\n\nTroll in Central Park\n\nOnce Upon A Time\n\nAn American Tail\n\nRock-A-Doodle\n\nAll Dogs Go To Heaven\n\nAnastasia\n\nHow To Train Your Dragon\n\nCoraline\n\nKlaus\n\nPagemaster\n\nShrek\n\nRango\n\nSpider-Man (both)\n\nKung-Fu Panda"
    },
    {
        "subreddit": "movies",
        "sentence": "I understand how bacteria works"
    },
    {
        "subreddit": "movies",
        "sentence": "As long as you are not constantly leaving stuff out and then eating it every night, the chart is really overbearing."
    },
    {
        "subreddit": "movies",
        "sentence": "If you are great at PhotoShop then consider using actual movie posters and replacing the faces, actors' names and movie title with your own."
    },
    {
        "subreddit": "movies",
        "sentence": "[5 centimeters per second.](https://en.m.wikipedia.org/wiki/5_Centimeters_per_Second) Gorgeous film 🌸"
    },
    {
        "subreddit": "movies",
        "sentence": "Nope"
    },
    {
        "subreddit": "movies",
        "sentence": "Excellent because it was shot so much better"
    },
    {
        "subreddit": "movies",
        "sentence": "Furiosa looked terrible in comparison and the action just wasn’t that exciting"
    },
    {
        "subreddit": "movies",
        "sentence": "Wanted to love it and I kept checking the time"
    },
    {
        "subreddit": "movies",
        "sentence": "We went to a movie theater restaurant and there was a good crowd but definitely not full."
    },
    {
        "subreddit": "movies",
        "sentence": "That's a really good explanation thank you and it does make sense"
    },
    {
        "subreddit": "movies",
        "sentence": "Not knowing any coked out lunatics on the edge of meltdown I can't now make any comment as to the veracity of the performance"
    },
    {
        "subreddit": "movies",
        "sentence": "Likely it's somewhere in the middle of accurate and over acted"
    },
    {
        "subreddit": "movies",
        "sentence": "Begs the question as to whether this is a script issue then"
    },
    {
        "subreddit": "movies",
        "sentence": "Perhaps a little time should have been spent fleshing out his back story and indeed showing usage in the context of that and the deteriorating relationship with his current partner"
    },
    {
        "subreddit": "movies",
        "sentence": "Maybe I just missed it."
    },
    {
        "subreddit": "movies",
        "sentence": "Oh shit, and Gosling in Only God Forgives"
    },
    {
        "subreddit": "movies",
        "sentence": "Goddamn those are great films."
    },
    {
        "subreddit": "movies",
        "sentence": "Iron Giant."
    },
    {
        "subreddit": "movies",
        "sentence": "One of the two Bond movies to leave me feeling bored for significant periods."
    },
    {
        "subreddit": "movies",
        "sentence": "Yanchar quyon"
    },
    {
        "subreddit": "movies",
        "sentence": "The best example of the trope? Arnold Schwarzenegger and Frank McRae in '[Last Action Hero](https://www.imdb.com/title/tt0107362/?ref_=nv_sr_srsg_0_tt_7_nm_1_q_last%2520action)'."
    },
    {
        "subreddit": "movies",
        "sentence": "Ok, this shit will be good af"
    },
    {
        "subreddit": "movies",
        "sentence": ">  the original poster saying there’s no reason to spend almost $30 for two tickets\n\nI don't know where you live in the UK, but I just searched Furiosa tickets in London and it's £24 ($30) for two on the low end and almost double that at the BFI IMAX, on a Wednesday"
    },
    {
        "subreddit": "movies",
        "sentence": "Save your pity for your countrymen lol.."
    },
    {
        "subreddit": "movies",
        "sentence": "That's impossible"
    },
    {
        "subreddit": "movies",
        "sentence": "Justice league exists"
    },
    {
        "subreddit": "movies",
        "sentence": "Even assuming that 300 isn't an enjoyable time - it is - you really need to try to be worse then justice league."
    },
    {
        "subreddit": "movies",
        "sentence": "DC animated universe"
    },
    {
        "subreddit": "movies",
        "sentence": "Sean Conner's James Bond is my favorite, and Dr"
    },
    {
        "subreddit": "movies",
        "sentence": "No is one of my favorite of his, Goldfinger is probably my second; \"No Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Bond, I expect [you to die](https://youtu.be/Mx9z99YJ_7s?t=48).\"  Connery set the gold standard."
    },
    {
        "subreddit": "movies",
        "sentence": "Honestly, I would probably go to the movies several times a month instead of maybe 3-5 times a year if there were an Alamo Drafthouse near me"
    },
    {
        "subreddit": "movies",
        "sentence": "Nothing to do with money"
    },
    {
        "subreddit": "movies",
        "sentence": "Everything to do with the human race turning into dopamine addicted, brain-rotted idiots who think it's okay to make TikToks, talk, video chat, and be the center of attention during the movie."
    },
    {
        "subreddit": "movies",
        "sentence": "\"A Million Miles away\" a really wonderful, uplifting true story.\n\n  \n\"Jose M Hernandez was born in Mexico"
    },
    {
        "subreddit": "movies",
        "sentence": "While working in the fields, he co-developed the first digital mammography imaging system"
    },
    {
        "subreddit": "movies",
        "sentence": "He then persevered to become a crew member on Space Shuttle mission STS-128.\""
    },
    {
        "subreddit": "movies",
        "sentence": "From memory, the cast carries that movie hard."
    },
    {
        "subreddit": "movies",
        "sentence": "This is why Inception bothered me"
    },
    {
        "subreddit": "movies",
        "sentence": "It's supposedly about dreams but Nolan manages to show almost no dreamlike qualities"
    },
    {
        "subreddit": "movies",
        "sentence": "It's more like a video game with different levels."
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks."
    },
    {
        "subreddit": "movies",
        "sentence": "Some days I reawaken 2 or 3 times a day."
    },
    {
        "subreddit": "movies",
        "sentence": "Was the inspiration for the Metal Gear Solid character Solid Snake."
    },
    {
        "subreddit": "movies",
        "sentence": "Disney Star Wars films."
    },
    {
        "subreddit": "movies",
        "sentence": "Nobody knows what’s going on in End of Evangelion."
    },
    {
        "subreddit": "movies",
        "sentence": "Honestly I quite enjoyed this one"
    },
    {
        "subreddit": "movies",
        "sentence": "I’m shocked to see how many critics it has.  \n\nI enjoyed the time period and the cinematography and the characters"
    },
    {
        "subreddit": "movies",
        "sentence": "Obviously you know they’ll win in the end, but the journey was enjoyable"
    },
    {
        "subreddit": "movies",
        "sentence": "I’d watch it again. \n\nIt’s the kind of classic wholesome feel-good sports movie I grew up on that they don’t make a ton of anymore"
    },
    {
        "subreddit": "movies",
        "sentence": "7/10."
    },
    {
        "subreddit": "movies",
        "sentence": "Bass and Rankins - The Hobbit"
    },
    {
        "subreddit": "movies",
        "sentence": "Much better than that thing Peter Jackson made"
    },
    {
        "subreddit": "movies",
        "sentence": "Hell, if anything i would expect _property crime_ to skyrocket"
    },
    {
        "subreddit": "movies",
        "sentence": "Like, if it was legal, would would _not_ try their hand at being a safecracker in a bank?"
    },
    {
        "subreddit": "movies",
        "sentence": "This is definitely the one! Changed my brain chemistry."
    },
    {
        "subreddit": "movies",
        "sentence": "The Road to El Dorado"
    },
    {
        "subreddit": "movies",
        "sentence": "If the fast pacing is not necessary, then Mr nobody and Time traveler's wife hit you in the feels the same way"
    },
    {
        "subreddit": "movies",
        "sentence": "They have themes like regrets, choices, nostalgia, etc."
    },
    {
        "subreddit": "movies",
        "sentence": "Puss in Boots: The Last Wish"
    },
    {
        "subreddit": "movies",
        "sentence": "My friend pointed out how troublesome Soul was to me and I can't stop thinking about it.\n\nIf you're a child who has experienced the loss of a parent, Soul is basically telling you your parent could have come back to life if they wanted it enough"
    },
    {
        "subreddit": "movies",
        "sentence": "Imagine being a child watching a movie that basically says your parent chose not to come back to you."
    },
    {
        "subreddit": "movies",
        "sentence": "The two recent spider-mans\n\nMinions/Despicable Me\n\nArcane\n\nEdge runners\n\nHave heard good things about the blue eyed samurai :)"
    },
    {
        "subreddit": "movies",
        "sentence": "Rebel Moon: a passionate director who has a Star Wars script, but it’s too edgy for Disney"
    },
    {
        "subreddit": "movies",
        "sentence": "He pushes to adapt this script so he can still make it"
    },
    {
        "subreddit": "movies",
        "sentence": "This director is known for a beautiful artistic approach to movie making"
    },
    {
        "subreddit": "movies",
        "sentence": "But then…"
    },
    {
        "subreddit": "movies",
        "sentence": "Entirely subjective"
    },
    {
        "subreddit": "movies",
        "sentence": "That was a Disney film"
    },
    {
        "subreddit": "movies",
        "sentence": "But it was one of the best."
    },
    {
        "subreddit": "movies",
        "sentence": "In no particular order\n\nJin-Roh: The Wolf Brigade \n\nDead Leaves \n\nMetropolis \n\nRedline \n\nPerfect Blue \n\nON-GAKU: OUR SOUND \n\nMary and The Witch's Flower \n\nLoving Vincent\n\nFantastic Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Fox\n\nAlice (1988)\n\nMy Love\n\nThe Old Man and the Sea\n\nThe Plague Dogs\n\nBatman: Mask of the Phantasm\n\nOld Fangs\n\nFantastic Planet\n\nThe Adventures of Prince Achmed\n\nBirdboy: The Forgotten Children\n\nMy life as a zucchini"
    },
    {
        "subreddit": "movies",
        "sentence": "Never say never..."
    },
    {
        "subreddit": "movies",
        "sentence": "It sounds like an AI recorded the voice for this video."
    },
    {
        "subreddit": "movies",
        "sentence": "Bro literally changed fashion and sensibility in a major way at that time"
    },
    {
        "subreddit": "movies",
        "sentence": "Robot dreams is something that needs more attention, flat out one of the best films I've seen this year."
    },
    {
        "subreddit": "movies",
        "sentence": "In Time\n\nThe Purge"
    },
    {
        "subreddit": "movies",
        "sentence": "Well duh"
    },
    {
        "subreddit": "movies",
        "sentence": "They don’t make movies about losing teams"
    },
    {
        "subreddit": "movies",
        "sentence": "That’s not the point"
    },
    {
        "subreddit": "movies",
        "sentence": "I quite liked this one and getting to know all the characters"
    },
    {
        "subreddit": "movies",
        "sentence": "Sorry you didn’t."
    },
    {
        "subreddit": "movies",
        "sentence": "me, 6 months from your future............\n\nmecha god dammit."
    },
    {
        "subreddit": "movies",
        "sentence": "That and Snatch, the gypsy Mickey O'Neil is one of his best roles in my opinion"
    },
    {
        "subreddit": "movies",
        "sentence": "Every time I watch Hellraiser I swear I get some synthasia of knowing exactly what the set smells like, I can phantom smell like, the old wood aged with paint under hot lights plus like plaster and corn syrup"
    },
    {
        "subreddit": "movies",
        "sentence": "I love how tangible and real the space is, but I also have real trouble seeing the art instead of the craft on that one especially."
    },
    {
        "subreddit": "movies",
        "sentence": "Goat suggestion"
    },
    {
        "subreddit": "movies",
        "sentence": "How so? Seemed like a good movie to me"
    },
    {
        "subreddit": "movies",
        "sentence": "How was it haphazard?"
    },
    {
        "subreddit": "movies",
        "sentence": "Im halfway through it and I don’t like it..\nI love horror films but this one just isn’t good."
    },
    {
        "subreddit": "movies",
        "sentence": "lots of stupid jump scares."
    },
    {
        "subreddit": "movies",
        "sentence": "nothing that’s actually scary.\nThat’s just my opinion.."
    },
    {
        "subreddit": "movies",
        "sentence": "We only have Regal, where I live."
    },
    {
        "subreddit": "movies",
        "sentence": "I think Charlize has a fairly American accent these days."
    },
    {
        "subreddit": "movies",
        "sentence": "I watched it on Saturday and loved it so much I watched it again on Sunday"
    },
    {
        "subreddit": "movies",
        "sentence": "Not a thing I have done since the Avengers back in 2012"
    },
    {
        "subreddit": "movies",
        "sentence": "I love Fury Road and it is the superior action movie, but I think Furiosa is the superior film.\n\nFor me it felt like a biblical story written for the end times"
    },
    {
        "subreddit": "movies",
        "sentence": "Or something in the vein of the Odyssey"
    },
    {
        "subreddit": "movies",
        "sentence": "It all felt hilariously larger than life, like the history man wrote it all for posterity"
    },
    {
        "subreddit": "movies",
        "sentence": "\"And in his youth Dementus the Red led the great congress of destruction across the waste.\"\n\nStuff like that just sticks with me"
    },
    {
        "subreddit": "movies",
        "sentence": "Or how the court of Imorten Joe is like a fucked up version of Olympus"
    },
    {
        "subreddit": "movies",
        "sentence": "I don't know how many people got the same vibe out of this movie, but I am just silly grateful it exists."
    },
    {
        "subreddit": "movies",
        "sentence": "I CREATE LIFE >:(\n\n…and I destroy it :)"
    },
    {
        "subreddit": "movies",
        "sentence": "Same"
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah"
    },
    {
        "subreddit": "movies",
        "sentence": "I enjoyed it"
    },
    {
        "subreddit": "movies",
        "sentence": "Surprised to see its low ratings honestly"
    },
    {
        "subreddit": "movies",
        "sentence": "It was a beautiful movie and I felt for the characters"
    },
    {
        "subreddit": "movies",
        "sentence": "What else do they want from a sports movie?"
    },
    {
        "subreddit": "movies",
        "sentence": "!!!"
    },
    {
        "subreddit": "movies",
        "sentence": "My friends dad used to use black hawk down for this"
    },
    {
        "subreddit": "movies",
        "sentence": "If he closed his eyes and thought it sounded like a bullet really passed him"
    },
    {
        "subreddit": "movies",
        "sentence": "It passed"
    },
    {
        "subreddit": "movies",
        "sentence": "And any time the living room got rearranged the system needed to pass another tour in Somalia."
    },
    {
        "subreddit": "movies",
        "sentence": "VelociPastor did a fantastic job at being an intentional campy ass low budget movie"
    },
    {
        "subreddit": "movies",
        "sentence": "Looks like someone asked Dall-E to make a poster for a generic Netflix show I’ll never watch"
    },
    {
        "subreddit": "movies",
        "sentence": "Iron Giant, Titan AE, Triplets of Belleville, Shaun the Sheep"
    },
    {
        "subreddit": "movies",
        "sentence": "You can't even decide on a numerical score, bwahahaha.\n\nIt was a 3"
    },
    {
        "subreddit": "movies",
        "sentence": "This movie was a strong 3."
    },
    {
        "subreddit": "movies",
        "sentence": "Totally agree but originally from *Out of Sight*."
    },
    {
        "subreddit": "movies",
        "sentence": "Rewatched this a couple of months ago, it was better than I remembered, so anyone who hasn't seen it yet, give it a shot."
    },
    {
        "subreddit": "movies",
        "sentence": "You Don’t Mess With the Zohan"
    },
    {
        "subreddit": "movies",
        "sentence": "You could tell that whole spinoff series was going to fail by looking at the Merch"
    },
    {
        "subreddit": "movies",
        "sentence": "Like 2/3 of the Fantastic Beasts Merch had Daniel Radcliff, Emma Watson, and Rupert Grint on them.\n\nThey aren't in the Fantastic Beasts movies, but the Merch worked hard to make you remember this was \\*Harry Potter\\* stuff"
    },
    {
        "subreddit": "movies",
        "sentence": "If they really believed in these films they wouldn't have felt the need to call back to the older films."
    },
    {
        "subreddit": "movies",
        "sentence": "I thought he had a lot of expression"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s in his eyes and his cute smile"
    },
    {
        "subreddit": "movies",
        "sentence": "He’s just an introvert so doesn’t talk much."
    },
    {
        "subreddit": "movies",
        "sentence": "This was one of the least visually appealing movies I have ever seen."
    },
    {
        "subreddit": "movies",
        "sentence": "It seemed obvious to me that he used to be on the team and was canned because he wouldn’t listen to the coach"
    },
    {
        "subreddit": "movies",
        "sentence": "The coach was giving him a second chance and told him not to screw up this time."
    },
    {
        "subreddit": "movies",
        "sentence": "I love that movie"
    },
    {
        "subreddit": "movies",
        "sentence": "I feel like it's Cosplay the movie"
    },
    {
        "subreddit": "movies",
        "sentence": "Everything in that movie is designed in a specific way"
    },
    {
        "subreddit": "movies",
        "sentence": "Snyder really gets style."
    },
    {
        "subreddit": "movies",
        "sentence": "Nimona, over the garden wall"
    },
    {
        "subreddit": "movies",
        "sentence": "In Time is kinda Cyberpunk"
    },
    {
        "subreddit": "movies",
        "sentence": "More in the rusted undercity beneath the Cyberpunk utopia that exploits it vein like Elysium though."
    },
    {
        "subreddit": "movies",
        "sentence": "The important scientist type guy from *World War Z* on the plane"
    },
    {
        "subreddit": "movies",
        "sentence": "They did him dirty on the accidental death front like the henchman guy on the staircase from *Out of Sight*."
    },
    {
        "subreddit": "movies",
        "sentence": "I just finished Devolution"
    },
    {
        "subreddit": "movies",
        "sentence": "The last hour of that audiobook was fucking magical"
    },
    {
        "subreddit": "movies",
        "sentence": "I am recommending it to everyone"
    },
    {
        "subreddit": "movies",
        "sentence": "I hope the people who bought the movie rights learned from WWZ."
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah the character was named Sharon Stone"
    },
    {
        "subreddit": "movies",
        "sentence": "You do realize this was based on a true story right? They weren’t just going to change who won the race, regardless"
    },
    {
        "subreddit": "movies",
        "sentence": "Had nothing to do with not wanting to show Germany winning"
    },
    {
        "subreddit": "movies",
        "sentence": "Germany really didn’t win."
    },
    {
        "subreddit": "movies",
        "sentence": "The land before time is my favourite kids movie"
    },
    {
        "subreddit": "movies",
        "sentence": "I wore out a vhs tape from watching it so often."
    },
    {
        "subreddit": "movies",
        "sentence": "I'm gonna swing big"
    },
    {
        "subreddit": "movies",
        "sentence": "Star Wars The Last Jedi"
    },
    {
        "subreddit": "movies",
        "sentence": "You had the chance to do anything"
    },
    {
        "subreddit": "movies",
        "sentence": "The prequels were gonna be the prequels cause they had to have a certain ending"
    },
    {
        "subreddit": "movies",
        "sentence": "JJ set this up as a softball to just make more bullshit star wars"
    },
    {
        "subreddit": "movies",
        "sentence": "He gave you a villain and some badass side characters with potential and a fucking droid almost better than R2 and...FUCK."
    },
    {
        "subreddit": "movies",
        "sentence": "- Quest for Camelot\n- The land before time\n- Shrek"
    },
    {
        "subreddit": "movies",
        "sentence": "As heartbroken as Joel was at the start of the movie, as much as he wanted to forget he ever met Clementine, he started to treasure the memories he was losing.\n\nI think the point of the movie was that relationships aren’t just defined by how they end, they’re defined by how we choose to remember them"
    },
    {
        "subreddit": "movies",
        "sentence": "And I think that’s why they’re going to try again, even though they know how it ends."
    },
    {
        "subreddit": "movies",
        "sentence": "You gave it a numerical score three different times because this trash garbage shit movie baffled your attention span into malfunctioning in such a humorous way!\n\nWoo"
    },
    {
        "subreddit": "movies",
        "sentence": "Anything by Makoto Shinkai, although 5cm Per Second will probably stay my favorite"
    },
    {
        "subreddit": "movies",
        "sentence": "Don’t forget about My Father’s Dragon."
    },
    {
        "subreddit": "movies",
        "sentence": "This and Spirit: Stallion of the Cimarron"
    },
    {
        "subreddit": "movies",
        "sentence": "They really committed to an aesthetic."
    },
    {
        "subreddit": "movies",
        "sentence": "A lot of the ones people have already mentioned, but some I haven't seen are:\n\nThe Adventures of Tintin (2011)\n\nThe Legends of Vox Machina\n\nSpider-man: Into the Spider-Verse (although that may be considered Disney given Marvel's involvement)\n\nFantastic Mr Fox\n\nLoving Vincent"
    },
    {
        "subreddit": "movies",
        "sentence": "The irony of being willing to watch it over and over is rich.\n\nKind of like being a fan of “Groundhog Day.”"
    },
    {
        "subreddit": "movies",
        "sentence": "You can still enjoy it as a narrative"
    },
    {
        "subreddit": "movies",
        "sentence": "No movie is true to life, much less biopics"
    },
    {
        "subreddit": "movies",
        "sentence": "I love The Doors but still loved that movie growing up despite doing Morrison absolutely dirty."
    },
    {
        "subreddit": "movies",
        "sentence": "Since no one else mentioned it in doubting myself whether this qualifies: I, Robot."
    },
    {
        "subreddit": "movies",
        "sentence": "Haven't seen Ugly Americans, but Bojack Horseman, lol, hell yes!"
    },
    {
        "subreddit": "movies",
        "sentence": "Your review here says so much about why cinema appeals in some way to at least a portion of the possible viewing audience!"
    },
    {
        "subreddit": "movies",
        "sentence": "Laika animation, Don Bluth"
    },
    {
        "subreddit": "movies",
        "sentence": "How was my post a slight against her? It's just a question."
    },
    {
        "subreddit": "movies",
        "sentence": "Loads of people didn’t like the movie BUT."
    },
    {
        "subreddit": "movies",
        "sentence": "Ghostbusters Afterlife…in the end…I didn’t tear up."
    },
    {
        "subreddit": "movies",
        "sentence": "She was so hot in it, lord almighty."
    },
    {
        "subreddit": "movies",
        "sentence": "That's my puppy's name, she's pretty sweet."
    },
    {
        "subreddit": "movies",
        "sentence": "What the FUCK! Are you telling me that movies aren't real life? My whole life is a lie now."
    },
    {
        "subreddit": "movies",
        "sentence": "My favorite name! A woman named Trish is a woman you can count on"
    },
    {
        "subreddit": "movies",
        "sentence": "All this Barb & Star talk has reminded me: I need to stock up on some new culottes for summer."
    },
    {
        "subreddit": "movies",
        "sentence": "I know a lot of people consider it the easy best of Disney's Star Wars movies, but: Rogue One.\n\n\nThe movie could have been a space noir detective/heist film of discovering the location of the Death Star blue prints and covertly stealing them"
    },
    {
        "subreddit": "movies",
        "sentence": "Instead, we get a bland fetch quest, with an admittedly great Vader hallway scene to let a good taste in everyone's mouth leaving the theater to make them remember fondly a sub-mediocre film."
    },
    {
        "subreddit": "movies",
        "sentence": "Around 18m mark."
    },
    {
        "subreddit": "movies",
        "sentence": "Borderline? Shit...are you telling me you didn't walk out 45 minutes in?"
    },
    {
        "subreddit": "movies",
        "sentence": "I recently watched Nimona on Netflix and that was excellent! The Sea Beast is on there also, and very satisfying.\n\nHonorable Mentions:\nFantastic Mr"
    },
    {
        "subreddit": "movies",
        "sentence": "Fox\nSinbad\nCastlevania\nLegend of Vox Machina\nFrieren\nApothecary Diaries\nBelle\nCloudy with a Chance of Meatballs\nShrek"
    },
    {
        "subreddit": "movies",
        "sentence": "I didn't expect to see Connor O'Malley in this, but I definitely laughed when I wasn't supposed to a couple of times"
    },
    {
        "subreddit": "movies",
        "sentence": "Esp the birthday song enthusiasm"
    },
    {
        "subreddit": "movies",
        "sentence": "I almost want to say this is a AI written review."
    },
    {
        "subreddit": "movies",
        "sentence": "Speak for yourself"
    },
    {
        "subreddit": "movies",
        "sentence": "It was my introduction to this story and I liked it just fine"
    },
    {
        "subreddit": "movies",
        "sentence": "7/10"
    },
    {
        "subreddit": "movies",
        "sentence": "I may read the book too and I’m sure it fills out more details but I really quite enjoyed the movie"
    },
    {
        "subreddit": "movies",
        "sentence": "No complaints really."
    },
    {
        "subreddit": "movies",
        "sentence": "How full was ur session?"
    },
    {
        "subreddit": "movies",
        "sentence": "It's on youtube"
    },
    {
        "subreddit": "movies",
        "sentence": "Maybe it's because Halle Berry was biracial and wore wigs of white-style hair but she always appealed to everyone"
    },
    {
        "subreddit": "movies",
        "sentence": "Her draw was always more than merely being pigeon holed into 'black actress'."
    },
    {
        "subreddit": "movies",
        "sentence": "OP if you want to go see a movie in theaters for the experience then just go"
    },
    {
        "subreddit": "movies",
        "sentence": "If you feel like it then don't"
    },
    {
        "subreddit": "movies",
        "sentence": "I skip most movies since they don't interest me but often enough I'll find a movie I LOVE and am willing to see like 4+ times because it's so fun"
    },
    {
        "subreddit": "movies",
        "sentence": "I have the AMC stubs membership thing which is $26/mo for 4 free tickets a week, shits great literally just 2 screenings a month makes it worth it to me"
    },
    {
        "subreddit": "movies",
        "sentence": "I saw dune two eight times and am seeing Furiosa a 3rd time tomorrow"
    },
    {
        "subreddit": "movies",
        "sentence": "Just check rotten tomatoes and metacritic before seeing a movie if you're worried it'll be bad"
    },
    {
        "subreddit": "movies",
        "sentence": "Most movies do suck, most of everything sucks"
    },
    {
        "subreddit": "movies",
        "sentence": "But if you haven't seen a movie since 2019 I truly do pity you for missing out on premiere night at the cinema for movies like Dune 1 & 2, Spider-Man No Way Home, Spider-verse 2, Barbenheimer, Everything Everywhere All At Once, etc..."
    },
    {
        "subreddit": "movies",
        "sentence": "This is why we keep getting remakes and sequels"
    },
    {
        "subreddit": "movies",
        "sentence": "Dumbass articles like this."
    },
    {
        "subreddit": "movies",
        "sentence": "So...you hated the movie, but want to be polite about it"
    },
    {
        "subreddit": "movies",
        "sentence": "Me too!"
    },
    {
        "subreddit": "movies",
        "sentence": "Rise of skywalker was a shit movie and JJ is a shit director, but there was literally nowhere to go after TLJ because Rian Johnson burnt down every story arc in his meta tantrum"
    },
    {
        "subreddit": "movies",
        "sentence": "You had to reintroduce a new plot and wrap up a trilogy simultaneously"
    },
    {
        "subreddit": "movies",
        "sentence": "It was an impossible task.\n\nImagine if you will for Return of the King: Sauron is dead (after being humiliatingly defeated), Gandalf is dead (after being put through a struggle session), all of the fellowship are dead, the shire was destroyed offscreen"
    },
    {
        "subreddit": "movies",
        "sentence": "Rohan and Gondor are both wiped out offscreen"
    },
    {
        "subreddit": "movies",
        "sentence": "The ring was actually useless and never important to begin with"
    },
    {
        "subreddit": "movies",
        "sentence": "The only main character left is Eowyn and some extras"
    },
    {
        "subreddit": "movies",
        "sentence": "What do you do for the 3rd film?"
    },
    {
        "subreddit": "movies",
        "sentence": "I’m Gonna Git You Sucka"
    },
    {
        "subreddit": "movies",
        "sentence": "Scrolled way too far to find Akira being listed."
    },
    {
        "subreddit": "movies",
        "sentence": "Just tell them it’s live action Amogus."
    },
    {
        "subreddit": "movies",
        "sentence": "You watched the entire thing? Wow..."
    },
    {
        "subreddit": "movies",
        "sentence": "Storks"
    },
    {
        "subreddit": "movies",
        "sentence": "Went in not knowing what to expect and it was great!\n\n\n\nOther recommendations I'd have I've already seen mentioned."
    },
    {
        "subreddit": "movies",
        "sentence": "That's one thing I love about this movie, even though it's sort of a Boogie Nights cautionary tale in a lot of ways, it does have this really inspiring can-do attitude and this very pure hearted childlike joy at movies that got really lost in the cynicism of the 1970s (and even more so today), but you can actually physically feel it in movies from the 1920s-40s they have a real earnestness about them that almost comes off as sort of cringe"
    },
    {
        "subreddit": "movies",
        "sentence": "Miyazaki does this a lot too"
    },
    {
        "subreddit": "movies",
        "sentence": "I think it's just a cultural thing."
    },
    {
        "subreddit": "movies",
        "sentence": "The sequel Trinity is Still My Name (1971) is also good."
    },
    {
        "subreddit": "movies",
        "sentence": "You should start watching good movies."
    },
    {
        "subreddit": "movies",
        "sentence": "I really wanted to like this"
    },
    {
        "subreddit": "movies",
        "sentence": "Cobbler and the Thief \n\nHeavy Metal \n\nPaprika\n\nAngels Egg\n\nSecret of Kells\n\nPerfect Blue\n\nFantastic Planet\n\nAKIRA \n\nHedgehog in The Fog"
    },
    {
        "subreddit": "movies",
        "sentence": "People only defend it because they either don’t like Star wars to begin with and the entire movie is a meta essay on why Rian Johnson hates Star Wars, or because of the greater twitter war where they have to support their camp"
    },
    {
        "subreddit": "movies",
        "sentence": "Haha nice, thoughts?"
    },
    {
        "subreddit": "movies",
        "sentence": "Believe it or not, they weren't legally allowed to market this as a movie in Australia."
    },
    {
        "subreddit": "movies",
        "sentence": "The whole motorcycle gang going in circles around Furiosa didn’t notice her cutting her arm off and escaping?"
    },
    {
        "subreddit": "movies",
        "sentence": "This was one of my favor movies growing up so I was really excited to see this"
    },
    {
        "subreddit": "movies",
        "sentence": "I compared this movie to the remake of Overboard in the way that a lot of the time it felt like the timing and pace was off"
    },
    {
        "subreddit": "movies",
        "sentence": "It felt like they were just trying to hit certain plot points and didn’t get there right with the lines or organically, which made a lot of scenes feel awkward and out of the blue and out of place and random"
    },
    {
        "subreddit": "movies",
        "sentence": "It was missing a lot of cinematic magic"
    },
    {
        "subreddit": "movies",
        "sentence": "The fashion was not there"
    },
    {
        "subreddit": "movies",
        "sentence": "In the original movie we really did see Sue Ellen and Kenny grow and mature become more responsible and adult like and really taking care of the younger the siblings"
    },
    {
        "subreddit": "movies",
        "sentence": "I didn’t get that in the remake."
    },
    {
        "subreddit": "movies",
        "sentence": "Godzilla (2014) the atomic breath scene"
    },
    {
        "subreddit": "movies",
        "sentence": "Scott Pilgrim"
    },
    {
        "subreddit": "movies",
        "sentence": "Either Spiderverse movie"
    },
    {
        "subreddit": "movies",
        "sentence": "The soundtracks are phenomenal."
    },
    {
        "subreddit": "movies",
        "sentence": "He has a few good ones"
    },
    {
        "subreddit": "movies",
        "sentence": "Poor guy"
    },
    {
        "subreddit": "movies",
        "sentence": "He just wanted to be \"an official couple.\" Is that too much to ask?"
    },
    {
        "subreddit": "movies",
        "sentence": "The score was bad."
    },
    {
        "subreddit": "movies",
        "sentence": "Thanks so much! That cast is exquisite"
    },
    {
        "subreddit": "movies",
        "sentence": "10/10"
    },
    {
        "subreddit": "movies",
        "sentence": "A Scanner Darkly.\n\nHas that same surreal rotoscoped vibe as the third on your list, Waking Life, which is an amazing film too."
    },
    {
        "subreddit": "movies",
        "sentence": "Don't Be Menace to South Central While Drinking Your Juice in the Hood"
    },
    {
        "subreddit": "movies",
        "sentence": "The OST is 🙌🏻"
    },
    {
        "subreddit": "movies",
        "sentence": "Fun fact, the writers of this film did a very clever thing for this movie by choosing to introduce each character via a bit of narrative shorthand for modern audiences. \n\n\nEx: Lugosi is introduced in a coffin, Elvira is first seen on a campy TV program, the wrestler guy is introduced in a wrestling ring."
    },
    {
        "subreddit": "movies",
        "sentence": "I've seen all but never finished the Lincoln Lawyer series, only the movie"
    },
    {
        "subreddit": "movies",
        "sentence": "I've also read a few of The Lincoln Lawyer books."
    },
    {
        "subreddit": "movies",
        "sentence": "There’s been group conflict in the Middle East for hundreds of years"
    },
    {
        "subreddit": "movies",
        "sentence": "Even the Palestinian/Jewish conflict goes back hundreds of years."
    },
    {
        "subreddit": "movies",
        "sentence": "Primal\n\nIt's so good, a caveman and dinosaur fight everything, no dialog, just epic and bloody dinosaur battles"
    },
    {
        "subreddit": "movies",
        "sentence": "2 seasons"
    },
    {
        "subreddit": "movies",
        "sentence": "Those tattoos too"
    },
    {
        "subreddit": "movies",
        "sentence": "I'm straight but man he makes me question myself in that movie lmao"
    },
    {
        "subreddit": "movies",
        "sentence": "Nothing about that movie was important"
    },
    {
        "subreddit": "movies",
        "sentence": "A crass, unfunny money grab"
    },
    {
        "subreddit": "movies",
        "sentence": "Pod racing scene in The Phantom Menace is the first thing I play after ant adjustment/additions to my setup"
    },
    {
        "subreddit": "movies",
        "sentence": "For me it’s “a good question for another time” or “kill the past”."
    },
    {
        "subreddit": "movies",
        "sentence": "I think that one could be interpret as probably a dream sequence, the end of that movie sort of flies off the rails and they become more delusional"
    },
    {
        "subreddit": "movies",
        "sentence": "I liked Halle's role because she was just a secretary that wasn't exoticised for her skin colour or ethnic background"
    },
    {
        "subreddit": "movies",
        "sentence": "Her character simply existed like the rest of Bedrock"
    },
    {
        "subreddit": "movies",
        "sentence": "That's how representation ought to be done in a nutshell."
    },
    {
        "subreddit": "movies",
        "sentence": "Arcane"
    },
    {
        "subreddit": "movies",
        "sentence": "That is all."
    },
    {
        "subreddit": "movies",
        "sentence": "This is just gross and sad to see"
    },
    {
        "subreddit": "movies",
        "sentence": "More poor, sloppy, use of AI that shows how terrible it is to use"
    },
    {
        "subreddit": "movies",
        "sentence": "Reminds me of the special edition of the Star Wars trilogy, where Lucas was wowed by the advancement of CG at the time and used it to make his movies worse.\n\nThese 4k remasters might be worse though, because at the very least, as misguided as it was, the Star Wars special editions were done from a purposeful, creative, point of view, compared to these remasters being done to save money and release it faster.\n\n\\*EDIT\\* And the Lucas bit was brought up later in the video too, so on the same page there it seems lol"
    },
    {
        "subreddit": "movies",
        "sentence": "This is one of my favorite Rom-coms of all time!! Hilarious"
    },
    {
        "subreddit": "movies",
        "sentence": "*obligatory scrolled so far to find this one"
    },
    {
        "subreddit": "movies",
        "sentence": "Recency bias but Civil war could have been an all timer if it was an action that was remotely similar to the trailer"
    },
    {
        "subreddit": "movies",
        "sentence": "It was a decent film but the premise of of tx,ca,fla vs USA modern civil war film right now is free money"
    },
    {
        "subreddit": "movies",
        "sentence": "I agree and it's actually wild to me how many self-proclaimed huge Tim Burton fans haven't even heard of it."
    },
    {
        "subreddit": "movies",
        "sentence": "it's kind of sad"
    },
    {
        "subreddit": "movies",
        "sentence": "Its also one of my favorite movies about friendship and drug addiction, a weirdly forward thinking/progressive movie for it's time and setting. \n\n\nAnd yes I can totally confirm that no film captures the desperation of low-budget filmmaking quite like that scene towards the end where Martin Landau has to get in that freezing water and wrestle a fake octopus. \n\n\nI'd also go so far as to say it's my favorite Johnny Depp performance (easily), up there with Fear and Loathing and Dead Man."
    },
    {
        "subreddit": "movies",
        "sentence": "I watched it on Amazon"
    },
    {
        "subreddit": "movies",
        "sentence": "I personally find it sad"
    },
    {
        "subreddit": "movies",
        "sentence": "Yeah it’s sweet they wanna go around again, but they weren’t compatible in the first place and are destined for failure"
    },
    {
        "subreddit": "movies",
        "sentence": "Maybe it’s part of my pessimistic outlook on relationships but it just felt hopeless to me."
    },
    {
        "subreddit": "movies",
        "sentence": "The only redeeming quality is that it’s the ONLY movie with a legit, non-edited _BRRRRRRRRRT_ sound of the M61 Vulcan rotary cannon"
    },
    {
        "subreddit": "movies",
        "sentence": "Oh, and one of the F-14s stalled and almost fell into the ocean"
    },
    {
        "subreddit": "movies",
        "sentence": "I swear, the less I hear those BRRRRRRT the more I’m convinced General Electric patented the sound just like Harley-Davidson did for their bikes."
    },
    {
        "subreddit": "movies",
        "sentence": "Loved it"
    },
    {
        "subreddit": "movies",
        "sentence": "Tight, tense, focused thriller, with a great pair of lead kids, and Kevin Bacon puts in a great performance."
    },
    {
        "subreddit": "movies",
        "sentence": "Nice roster of movies already"
    },
    {
        "subreddit": "movies",
        "sentence": "Adding two that I haven't seen listed:\n\n- Zoolander (2001)\n- Kick-Ass (2010)"
    },
    {
        "subreddit": "movies",
        "sentence": "TLJ is Star Wars for people who hate Star Wars, and a giant meta commentary on why the director hates Star Wars"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s bizarre Disney allowed it to be part of their big budget trilogy"
    },
    {
        "subreddit": "movies",
        "sentence": "As a member of the hardcore fan base, I can tell you that it was the moment we all checked out and simply became apathetic to Star Wars as a brand after that point"
    },
    {
        "subreddit": "movies",
        "sentence": "When we become less toxic a society and the damage control media shield behind TLJ is lifted, It’ll go down in history as a legendary blunder that helped put Disney in its current crisis.\n\nA good litmus test for this movie is for someone to defend it without insulting or bringing down other Star Wars movies"
    },
    {
        "subreddit": "movies",
        "sentence": "I’ve never seen it done except for when the defender is made aware of it."
    },
    {
        "subreddit": "movies",
        "sentence": "I didn’t see any of these but there are to so many comments (and great suggestions), apologies if they are duplicates: \n\n[Senseless](https://youtu.be/A6pM-4m7xQ0?feature=shared)\n\n[21 Jump Street](https://youtu.be/Oj55KinxZx4?feature=shared)\n\n[CB4](https://youtu.be/VaASN9nKD6I?feature=shared)"
    },
    {
        "subreddit": "movies",
        "sentence": "Don't feel bad, the prequel film a couple years later was so awful that it made everyone forget about the first."
    },
    {
        "subreddit": "movies",
        "sentence": "It’s just papyrus IN BOLD"
    },
    {
        "subreddit": "movies",
        "sentence": "Wallace and Gromit"
    },
    {
        "subreddit": "movies",
        "sentence": "Saw the Last Unicorn with my mom when I was ten or eleven, it was amazing"
    },
    {
        "subreddit": "movies",
        "sentence": "Terrifying, but amazing."
    },
    {
        "subreddit": "movies",
        "sentence": "Sorry, I'm a little late:\nSwiss Army Man"
    },
    {
        "subreddit": "movies",
        "sentence": "Jurassic World: Dominion, 5000%."
    },
    {
        "subreddit": "movies",
        "sentence": "I think it’s from late 2000’s"
    },
    {
        "subreddit": "movies",
        "sentence": "King Fury"
    },
    {
        "subreddit": "movies",
        "sentence": "The dude had it coming though"
    },
    {
        "subreddit": "movies",
        "sentence": "Him and that robot fighting did do a lot of property damage"
    },
    {
        "subreddit": "movies",
        "sentence": "I mean, they fucked up the Hubble…"
    },
    {
        "subreddit": "movies",
        "sentence": "...And then Catwoman happened."
    },
    {
        "subreddit": "movies",
        "sentence": "That new interview with the vampire show"
    },
    {
        "subreddit": "movies",
        "sentence": "Annoying"
    },
    {
        "subreddit": "movies",
        "sentence": "Sorry"
    },
    {
        "subreddit": "movies",
        "sentence": "Not even a movie"
    },
    {
        "subreddit": "movies",
        "sentence": "Late but I’m also in the same year+ long wait club!\n\nI first heard about it over in /r/horror, or the “bloody disgusting” website"
    },
    {
        "subreddit": "movies",
        "sentence": "Great sources for upcoming movies worth keeping your eye out for, the next one on the docket that I’m especially excited about is Longlegs!"
    },
    {
        "subreddit": "movies",
        "sentence": "Please Don't Destroy: The Treasure of Foggy Mountain\n\nHonestly one of the most recent so dumb it's actually fucking hilarious I've seen in a long time\n\nAnd to add in one of my all time favorites...Bio-Dome"
    },
    {
        "subreddit": "movies",
        "sentence": "Book of Life (2014)"
    },
    {
        "subreddit": "movies",
        "sentence": "Why are you being so aggressive about something as subjective as movie interests? It's not like I said either of those were bad."
    },
    {
        "subreddit": "movies",
        "sentence": "Basically her naiveté is attractive to a certain kind of man who romanticize innocence in women as the greatest virtue"
    },
    {
        "subreddit": "movies",
        "sentence": "She’s the polar opposite of Kathryn, , kind, sweet, innocent, not a single manipulative bone in her body and sexually inexperienced"
    },
    {
        "subreddit": "movies",
        "sentence": "Sébastien has to trick her and get her drunk to get her to sleep with him initially and then Kathryn basically tells her to throw her box at every man who shows interest, so she can ruin her innocence"
    },
    {
        "subreddit": "movies",
        "sentence": "She’s Kathryn's true foil in the film"
    },
    {
        "subreddit": "movies",
        "sentence": "Attractive and doesn't know or use her sexualty to get what she wants"
    },
    {
        "subreddit": "movies",
        "sentence": "And yet still gets her guy in the end because they love each other"
    },
    {
        "subreddit": "movies",
        "sentence": "Meanwhile Kathryn is denied her final revenge because Cecile was too dumb to recognize that she was being manipulated until Sébastien dies and by then Annette already read the journal and told her what was really going on"
    },
    {
        "subreddit": "movies",
        "sentence": "TLDR her idiocy is exaggerated to contrast the over the top villainy of Kathryn"
    },
    {
        "subreddit": "movies",
        "sentence": "And because the plot requires it"
    },
    {
        "subreddit": "movies",
        "sentence": "It's the weakest part of the story imo as someone who loves this movie."
    },
    {
        "subreddit": "movies",
        "sentence": "Prometheus 4K Blu-ray is absolutely spectacular."
    },
    {
        "subreddit": "movies",
        "sentence": "Really liked how Disney didn't and still doesn't overtly give the female animals' designs to resemble women like plenty of other animated movies from other studios"
    },
    {
        "subreddit": "movies",
        "sentence": "I wasn't sure if Terk was a guy or a girl, and after looking it up? Apparently she's the latter.\n\nI've never really understood why it's done unless it's done for comedy like those Orangina commercials."
    },
    {
        "subreddit": "movies",
        "sentence": "The hype for this movie was unreal"
    },
    {
        "subreddit": "movies",
        "sentence": "The campaign was so much better than the actual movie"
    },
    {
        "subreddit": "movies",
        "sentence": "I remember a collective “wtf was that” from people in the theater when the credits rolled."
    },
    {
        "subreddit": "movies",
        "sentence": "This seems to be a daily question here now.\n\nI think people are more selective on which movies they want to watch.\n\nCost of living crisis and abundance and convenience of streaming options are also factors.\n\nAnd superhero movie fatigue"
    },
    {
        "subreddit": "movies",
        "sentence": "But I will probably watch Deadpool and Wolverine.\n\nAnd then there are the cell phone users and anti social behavior of fellow cinema goers."
    },
    {
        "subreddit": "movies",
        "sentence": "I think they made lots of changes, including to Joel and Clementine! But it's always funny to see what stays and what goes 😊"
    },
    {
        "subreddit": "movies",
        "sentence": "First, they would assemble a crew, including actors, a writer (or writers), camera operators, craft services and a director"
    },
    {
        "subreddit": "movies",
        "sentence": "In preproduction they would come up with a list of shots they would need to shoot and a timeline to shoot it in.\n\nAt this point they will choose if they want Behemoth to be practical effects or CGI or a combination of the two"
    },
    {
        "subreddit": "movies",
        "sentence": "They will do this with other shots too.\n\nOnce that is done, they can go into production where they would point the camera at the actors and have them act out the script"
    },
    {
        "subreddit": "movies",
        "sentence": "Once they filmed everything (or wrapped, in industry speak), they will go into post production where they will edit the footage together and add all the needed digital effects"
    },
    {
        "subreddit": "movies",
        "sentence": "At this point they might show it to the studio and producers"
    },
    {
        "subreddit": "movies",
        "sentence": "Reshoots may be needed and usually are"
    },
    {
        "subreddit": "movies",
        "sentence": "This is called post production.\n\nSo basically the same way they make any movie."
    },
    {
        "subreddit": "movies",
        "sentence": "Lol! I getcha! I'm just jelly of all these gorgeous bastards being mentioned ITT xD"
    },
    {
        "subreddit": "movies",
        "sentence": "Time for some friends who have more open minds? More of a sense of adventure? More willingness to indulge some of your interests instead of only their own?  \n\nThey sound more like casual friends as opposed to good ones"
    },
    {
        "subreddit": "movies",
        "sentence": "The Thing (original one) is a genuinely scary movie"
    },
    {
        "subreddit": "movies",
        "sentence": "The setting and atmosphere are the reason it has enduring popularity to this day."
    },
    {
        "subreddit": "movies",
        "sentence": "I learned today he kissed a 12 yo girl in The Beguiled"
    },
    {
        "subreddit": "movies",
        "sentence": "That had to solidify his Republican credentials!"
    },
    {
        "subreddit": "movies",
        "sentence": "This is what I liked about the Fall Guy"
    },
    {
        "subreddit": "movies",
        "sentence": "Lots of real stunts enhanced by CGI removing the wires or changing the backdrop, but not trying to create the whole stunt on a computer. \n\nAnd the meta aspect was fun"
    },
    {
        "subreddit": "movies",
        "sentence": "Showing us how they digitally map the actors’ face on to the stunt man, and then having “Ryan Gosling” do the stunt in front of us immediately after. \n\nThey tell us exactly how they’re going to trick us"
    },
    {
        "subreddit": "movies",
        "sentence": "And then still trick us. \n\nMovie magic."
    },
    {
        "subreddit": "movies",
        "sentence": "Funny enough, Sherlock Holmes"
    },
    {
        "subreddit": "movies",
        "sentence": "The surround sound from the rear speakers as horses clip-clop through London from one side to the other is as clear as day"
    },
    {
        "subreddit": "movies",
        "sentence": "Great film for ambient sound and clearly showing off how objects transition through the 3D space.\n\nAs a bonus, it's a Hans Zimmer soundtrack as well so of course you have that to look forward to."
    },
    {
        "subreddit": "movies",
        "sentence": "Our society celebrates disorder"
    },
    {
        "subreddit": "movies",
        "sentence": "Michael Jai White in Black Dynamite.\n\n\"I threw that shit before I walked in the room!\""
    },
    {
        "subreddit": "movies",
        "sentence": "."
    },
    {
        "subreddit": "movies",
        "sentence": "and so is the live action version."
    },
    {
        "subreddit": "movies",
        "sentence": "The Mitchells vs the Machines was a genuine delight."
    },
    {
        "subreddit": "movies",
        "sentence": "Well this comment age very well"
    },
    {
        "subreddit": "movies",
        "sentence": "Agree completely\n\nYou Name is devastatingly good\n\nArcane is a miracle"
    },
    {
        "subreddit": "movies",
        "sentence": "I still don't understand how they managed to get animation like that.."
    },
    {
        "subreddit": "movies",
        "sentence": "at all"
    },
    {
        "subreddit": "movies",
        "sentence": "Let alone for a TV show."
    },
    {
        "subreddit": "movies",
        "sentence": "Didn't even process that when watching the movie, was waiting to see when that happens and once it did I was like \"thats it?\""
    },
    {
        "subreddit": "movies",
        "sentence": "Yesh"
    },
    {
        "subreddit": "movies",
        "sentence": "It’s interesting too because Marco and Polo’s dance scene is so adjacent to like…a V/H/S one-off bit of scariness, but it doesn’t go full tilt, so it still feels initially goofy"
    },
    {
        "subreddit": "movies",
        "sentence": "How unfortunate"
    },
    {
        "subreddit": "movies",
        "sentence": "Yes"
    },
    {
        "subreddit": "movies",
        "sentence": "It's a very good film."
    },
    {
        "subreddit": "movies",
        "sentence": "It's the atmosphere, the plot is good even though it makes up like only 40% of the film"
    },
    {
        "subreddit": "movies",
        "sentence": "It's the atmosphere and the music right from the opening scene, the dystopian vibes you get from a city packed full of people like when you see the montage of the city and ultimately makes you question the purpose of life"
    },
    {
        "subreddit": "movies",
        "sentence": "What do you do when you're just a ghost in a shell?"
    },
    {
        "subreddit": "movies",
        "sentence": "Fern Gully\nRockadoodle\nFievel Goes West\nRescuers Down Under\nThumbellina\nAll Dogs Go To Heaven"
    },
    {
        "subreddit": "movies",
        "sentence": "Pretty much all of the DC animated content"
    },
    {
        "subreddit": "movies",
        "sentence": "Whether it's batman, superman, justice league, or the animated movies, it's all so much better than the live action content."
    }
]