[
    {
        "subreddit": "news",
        "sentence": "Crazy to think about a 13 year old boy walking around at night with a gun."
    },
    {
        "subreddit": "news",
        "sentence": "Do you blame someone for not reading an article with a headline that reads like a botched abortion? If the contents are in any way similar to the headline, I'd rather not waste my time."
    },
    {
        "subreddit": "news",
        "sentence": "Because even Hanlon's razor has its limits"
    },
    {
        "subreddit": "news",
        "sentence": "Israel can't be ***this*** incompetent"
    },
    {
        "subreddit": "news",
        "sentence": "This is all the fault of the person trying to stab someone to death."
    },
    {
        "subreddit": "news",
        "sentence": "It's almost like there are articles attached to headlines."
    },
    {
        "subreddit": "news",
        "sentence": "You have been banned by Elon  \n\n“Super rich ex-wives who hate their former spouse” should “be listed among ‘Reasons that Western Civilization died.’” -elonmusk"
    },
    {
        "subreddit": "news",
        "sentence": "Who said it costs that much? It costs money to sustain the ships that assembled the pier, the personnel need to get paid, any repairs and spare parts need to get ordered eventually which costs money, but it’s not as if the U.S"
    },
    {
        "subreddit": "news",
        "sentence": "just spent 320 million on this"
    },
    {
        "subreddit": "news",
        "sentence": "It’s far more likely that the modular floating pier that could be disassembled costs 320 million and when the need for it is over, the U.S"
    },
    {
        "subreddit": "news",
        "sentence": "will just disassemble it and take it back.\nSuch is the case with military aid"
    },
    {
        "subreddit": "news",
        "sentence": "It’s not a direct check, it’s something that was already built and purchased."
    },
    {
        "subreddit": "news",
        "sentence": "The door is not on the ceiling"
    },
    {
        "subreddit": "news",
        "sentence": "But you will be."
    },
    {
        "subreddit": "news",
        "sentence": "I wonder if this is partially her response to Bill's involvement with Epstein.\n\ni.e"
    },
    {
        "subreddit": "news",
        "sentence": "Melinda decides to give $1bn to women's rights, the opposite of being involved with Epstein."
    },
    {
        "subreddit": "news",
        "sentence": "The title reads as if she is donating the rights of women, 1 billion worth, to..something..the world?"
    },
    {
        "subreddit": "news",
        "sentence": "25 cents by my count"
    },
    {
        "subreddit": "news",
        "sentence": ">About $200 million (£157m) will go to organisations fighting for gender and reproductive rights in the US.\n\nSecond line in the article would be a start"
    },
    {
        "subreddit": "news",
        "sentence": "She's donating a billion dollars of womens rights?"
    },
    {
        "subreddit": "news",
        "sentence": "Damn, almost like Israel shouldn't have been supporting Hamas for all these years?\n\nI mean, they've literally said supporting Hamas is the best way to squash a two state solution for decades now."
    },
    {
        "subreddit": "news",
        "sentence": "LADY: \"We've got a pilot in the house, and I guess he landed in my backyard, and we're trying to see if we could get an ambulance to the house, please.\"\n\n911: *Ten minutes of incompetence follows*"
    },
    {
        "subreddit": "news",
        "sentence": "Reading the article can work magic for you."
    },
    {
        "subreddit": "news",
        "sentence": "If he wins he’s not running for a third term because his second term won’t end."
    },
    {
        "subreddit": "news",
        "sentence": "I love the ex-wives of the ultra rich"
    },
    {
        "subreddit": "news",
        "sentence": "They make the world a better place."
    },
    {
        "subreddit": "news",
        "sentence": "who knew incest would get so bad"
    },
    {
        "subreddit": "news",
        "sentence": "Nice, repeating Israeli lies.\n\nNo children were burned by Hamas"
    },
    {
        "subreddit": "news",
        "sentence": "Israel on the other hand? How many videos of dead kids have you seen littering the streets of Palestine."
    },
    {
        "subreddit": "news",
        "sentence": "Their aim is fine"
    },
    {
        "subreddit": "news",
        "sentence": "They were shooting their intended target\n\nAnti-semitism is when you point out this is fucked up and a warcrime."
    },
    {
        "subreddit": "news",
        "sentence": "Nah airbags definitely tend to give people bruises to the face and otherwise injure them regardless of how they sit, but are still way better than smacking your face on a steering wheel"
    },
    {
        "subreddit": "news",
        "sentence": "Have you never seen the videos where people sit on top of them and get launched a good 5ft in the air? They come out with an insane force because they deploy in less than a second to save you, the price of which is getting smacked in the face pretty damn hard"
    },
    {
        "subreddit": "news",
        "sentence": "If your arm was crossed over your body when it goes off (to adjust your seatbelt or something) it could easily break your arm depending on the angle"
    },
    {
        "subreddit": "news",
        "sentence": "If youve known people who have been in accidents where the bags deployed id be surprised if they didnt have bruising on the face afterwards"
    },
    {
        "subreddit": "news",
        "sentence": "Youre right that its worse for people who sit closer to the wheel though of course"
    },
    {
        "subreddit": "news",
        "sentence": "I belive the heading \"Airport executive target and assassinated by ATF Agents who does not know the law\" is more correct as that is actually what happens,  the way this headline is writte seems like the man did wrong in shooting at the unidenifed masked and armed intruders that was there for a unlawful reasons based on politics and not facts.\n\nGive how the warrant was executed,  what the Polic and ATF actually did,  makes my headline more correct,  as there was never wrong of this man to shoot at the agents,  it was however murder for them to shoot him,  even if he shot at them they had no business being there."
    },
    {
        "subreddit": "news",
        "sentence": "if he would win, what consequences would he have if he would pardon them? It's not like he is eligible for another term, and if he would want to stay longer it won't be through election"
    },
    {
        "subreddit": "news",
        "sentence": "He would still need his people to intimidate anyone else."
    },
    {
        "subreddit": "news",
        "sentence": "Any correlation between this and the USMC testing their own robots out just a month ago?"
    },
    {
        "subreddit": "news",
        "sentence": "They hadn’t even taken off at this point."
    },
    {
        "subreddit": "news",
        "sentence": "Respectfully, you’re allowed to have this opinion, but since you’re not a citizen you won’t understand why your reasoning is problematic, especially with American history and what’s currently transpiring in this country. \n\nThis guy is a seditionist. \n\nAmerican taxpayers shouldn’t have to fund him"
    },
    {
        "subreddit": "news",
        "sentence": "A revocation of pension would be more than suitable, he can always look for income elsewhere"
    },
    {
        "subreddit": "news",
        "sentence": "What it boils down to is, I don’t support seditionist proxies of Trump and Putin."
    },
    {
        "subreddit": "news",
        "sentence": "Losing a few rounds in a bag isn't irresponsible gun ownership, it's irresponsible travelling."
    },
    {
        "subreddit": "news",
        "sentence": "I’m think they taking the piss deliberately.\n\nThe whole “tragic mistakes” is their way of saying sorry not sorry."
    },
    {
        "subreddit": "news",
        "sentence": "No no they need to first drop radios playing recordings of babies and children crying to draw out more civilians first...then bomb it.\n\nY'know...for those bonus points"
    },
    {
        "subreddit": "news",
        "sentence": "That's because he didn't know how that would have turned out for him"
    },
    {
        "subreddit": "news",
        "sentence": "It wasn't clear what would happen, whether his voters would still vote for him or maybe it would be used as an evidence tying it to it.\n\nThe pardon doesn't cost him anything and it doesn't look like it hurt him as much, so now he will do it."
    },
    {
        "subreddit": "news",
        "sentence": "I'm from the Southwest"
    },
    {
        "subreddit": "news",
        "sentence": "New Mexico"
    },
    {
        "subreddit": "news",
        "sentence": "Not the best, but usually have better metrics than Mississippi and Alabama"
    },
    {
        "subreddit": "news",
        "sentence": "We usually tell ourselves, \"hey, at least we're not last like Mississippi/Alabama.\""
    },
    {
        "subreddit": "news",
        "sentence": "Would go well with his new motorhome"
    },
    {
        "subreddit": "news",
        "sentence": "Mythbusters tested and it works."
    },
    {
        "subreddit": "news",
        "sentence": "\"Two days after an Israeli airstrike on another camp stirred global condemnation, Gaza emergency services said four tank shells on Tuesday hit a cluster of tents in Al-Mawasi, a coastal strip Israel designated as an expanded humanitarian zone where it advised civilians in Rafah to go for safety.\n\nAt least 12 of the dead on Tuesday were women, according to medical officials in the Hamas militant-run Palestinian enclave.\n\nBut Israel's military later said in a statement: \"Contrary to the reports from the last few hours, the IDF (Israel Defence Forces) did not strike in the Humanitarian Area in Al-Mawasi.\"\n\"\n\nThis reads to me as if it is Hamas statement vs"
    },
    {
        "subreddit": "news",
        "sentence": "Israeli statement? Or are \"Gaza emergency services\" not affiliated with Hamas?"
    },
    {
        "subreddit": "news",
        "sentence": "The absolute irony that the pier will be repaired in an Isreali port while aid trucks are being refused entry to Gaza and Isreal is bombing the shit out of Gaza"
    },
    {
        "subreddit": "news",
        "sentence": "It's mind-blowing."
    },
    {
        "subreddit": "news",
        "sentence": "\"I said otter landing, where we and another plane hold wings as we land so we don't drift apart.\" - SA"
    },
    {
        "subreddit": "news",
        "sentence": "Meanwhile, the US-bombs killing innocent women and children are still working just fine...funny that."
    },
    {
        "subreddit": "news",
        "sentence": "This simply means that Melinda has the most women's rights in the world now"
    },
    {
        "subreddit": "news",
        "sentence": "I love Israel"
    },
    {
        "subreddit": "news",
        "sentence": "I wouldn't support them if they were doing anything remotely close to genocide."
    },
    {
        "subreddit": "news",
        "sentence": "Do I return my book or keep it until the online part comes back?"
    },
    {
        "subreddit": "news",
        "sentence": "I am the same"
    },
    {
        "subreddit": "news",
        "sentence": "My most common flights are routes in which Spirit & Frontier have a big presence"
    },
    {
        "subreddit": "news",
        "sentence": "They are regularly 30-50% lower than the nearest competitor"
    },
    {
        "subreddit": "news",
        "sentence": "I simply can't in the right state of mind pay that premium on a sub 5 hour flight just to be a little more comfortable"
    },
    {
        "subreddit": "news",
        "sentence": "With the money I save I can pay for a good massage in my destination and still have money left for other stuff."
    },
    {
        "subreddit": "news",
        "sentence": "In before Trump declares himself a woman without rights."
    },
    {
        "subreddit": "news",
        "sentence": "[Longest J6 Sentences](https://www.politico.com/news/2023/09/05/enrique-tarrio-prison-sentencing-proud-boys-00114104)"
    },
    {
        "subreddit": "news",
        "sentence": "I read the sources and the reaction you mention was \"localized erythema\" which basically means 3 people had some redness"
    },
    {
        "subreddit": "news",
        "sentence": "Calling it localized means it was a pretty small area"
    },
    {
        "subreddit": "news",
        "sentence": "The article specifically states that no one in the study had an allergic reaction"
    },
    {
        "subreddit": "news",
        "sentence": "The recommendations from the study was to wipe down the area where the allergic person will be sitting/touching."
    },
    {
        "subreddit": "news",
        "sentence": "I think it's a continuance of her previous decisions in funding women's rights and especially women's reproductive rights worldwide"
    },
    {
        "subreddit": "news",
        "sentence": "Sure, it has some flavour of visibility vis a vis Gates/Epstein but she has funded women's issues for decades."
    },
    {
        "subreddit": "news",
        "sentence": "These are always admirable but what is “women’s rights” and where is the $1B going cause that’s a fuckload of money; let’s hope it *actually* goes towards helping women."
    },
    {
        "subreddit": "news",
        "sentence": "Fucking why? Like, the homeless family trying to find something to read while parents look for work or regular people get inconvenienced by this"
    },
    {
        "subreddit": "news",
        "sentence": "They really gots the \"late fee\" gamble going on here but its a one in a million shot they accepted gold buillon as payment on a book never returned from some conquistador or something..."
    },
    {
        "subreddit": "news",
        "sentence": "Probably more likely to get paid in the parking lot tbh."
    },
    {
        "subreddit": "news",
        "sentence": "I assume it’s to get credit card numbers"
    },
    {
        "subreddit": "news",
        "sentence": ">being slaughtered and forced out of their homeland\n\nFunny, I could have sworn that exact thing has been happening to another population for the past 76 years"
    },
    {
        "subreddit": "news",
        "sentence": "Ahh yes, just because you don’t agree with me you get all your knowledge from tiktok"
    },
    {
        "subreddit": "news",
        "sentence": "Captain Holt!"
    },
    {
        "subreddit": "news",
        "sentence": "Nope"
    },
    {
        "subreddit": "news",
        "sentence": "Just a humble reddit poster pointing out he makes a better cop than a mayor."
    },
    {
        "subreddit": "news",
        "sentence": "I'd do klansmen taped/chained to a concrete pole with their pants down so passerbys can spank or mock the statue."
    },
    {
        "subreddit": "news",
        "sentence": "Id made hundreds and hundreds of comments there for over 10 years, critical of anything and everything, with no issues"
    },
    {
        "subreddit": "news",
        "sentence": "A few months back I got permabanned from commenting there for not being a rabid zionist lol"
    },
    {
        "subreddit": "news",
        "sentence": "Whats fucked up is that the sub is astroturfed but also unblockable"
    },
    {
        "subreddit": "news",
        "sentence": "I have it muted because I keep forgetting I cant comment there anymore, but it still shows up in my feed constantly"
    },
    {
        "subreddit": "news",
        "sentence": "I tried to find a way I could block it completely because i keep wasting time writing comments that I cant post, and I discovered it is impossible to block.\n \nSo literally everyone on reddit is having that astroturfed bullshit injected into their feed meanwhile many readers probably have no clue how massively censored the subreddit is and how biased the threads are in favor of zionism\n\nWhole mod team over there needs to get the boot for this shit"
    },
    {
        "subreddit": "news",
        "sentence": "Hell just shut down the sub"
    },
    {
        "subreddit": "news",
        "sentence": "So that’s how Tom Cruise got so short"
    },
    {
        "subreddit": "news",
        "sentence": "Did we (humanity) not learn a GDT, for Fuc-Sake a dude from dead broke Nashville was drafted came back and moved to all hell Detroit and wrote a national anthem about war"
    },
    {
        "subreddit": "news",
        "sentence": "He said war was is good for absolutely nothing"
    },
    {
        "subreddit": "news",
        "sentence": "Why the hell are we doing something for nothing"
    },
    {
        "subreddit": "news",
        "sentence": "I got a bridge I can sell you when you get tired of building piers that break"
    },
    {
        "subreddit": "news",
        "sentence": "Clearly you have not learned."
    },
    {
        "subreddit": "news",
        "sentence": "Frustrated they bury that (along with his victims) under the title of Mayor"
    },
    {
        "subreddit": "news",
        "sentence": "Yeah...it isn't mayors that Americans worry about coming to their home, pulling over their children, or meeting their dogs"
    },
    {
        "subreddit": "news",
        "sentence": "It's cops."
    },
    {
        "subreddit": "news",
        "sentence": "It's crazy that one of the bastions of Neo-Nazism is Huntington Beach, California"
    },
    {
        "subreddit": "news",
        "sentence": "Birthplace of the Nazi Lowriders and Aryan White Brotherhood"
    },
    {
        "subreddit": "news",
        "sentence": "But also home to Rise Above Movement and Proud Boys.\n\nWhat the fuck is wrong with Surf City?"
    },
    {
        "subreddit": "news",
        "sentence": "Is this the longest Jan 6 sentence? If not, who got a longer sentence?"
    },
    {
        "subreddit": "news",
        "sentence": "Tazers aren't used when there is an iminent threat to liklfe because they don't work half the time."
    },
    {
        "subreddit": "news",
        "sentence": "Airbags only fuck you up, if you’re sitting incorrectly or you cover them in some stupid way (people who bedazzle and put ducks on the dash).\n\nAn example would be people who sit like they’re trying to mate with the steering wheel."
    },
    {
        "subreddit": "news",
        "sentence": "We get that alot."
    },
    {
        "subreddit": "news",
        "sentence": "And still their options are Biden or Trump"
    },
    {
        "subreddit": "news",
        "sentence": "They may denounce him for Palestine but they sure as hell aren't going to completely flip sides and vote Trump"
    },
    {
        "subreddit": "news",
        "sentence": "That's just asinine thinking"
    },
    {
        "subreddit": "news",
        "sentence": "Im here for the pier review"
    },
    {
        "subreddit": "news",
        "sentence": "ACB1 could do better."
    },
    {
        "subreddit": "news",
        "sentence": "You betcha."
    },
    {
        "subreddit": "news",
        "sentence": "This is why I have a range bag, a work bag, and a travel bag"
    },
    {
        "subreddit": "news",
        "sentence": "My ccw sometimes goes in my travel bag but never loose ammo"
    },
    {
        "subreddit": "news",
        "sentence": "Malicious compliance for this one, as you demonstrate, until 1A challenge succeeds would probably be super effective."
    },
    {
        "subreddit": "news",
        "sentence": "Isn't it weird how neither the world nor the universe ever listens to the requirements of men?"
    },
    {
        "subreddit": "news",
        "sentence": "Those are features"
    },
    {
        "subreddit": "news",
        "sentence": "We lost a Mohawk pilot in Vietnam when this happened"
    },
    {
        "subreddit": "news",
        "sentence": "A single round took out their hydraulics and they went into a spin"
    },
    {
        "subreddit": "news",
        "sentence": "The TO punched out ok but the pilot punched out when the plane was inverted and went right into the ground."
    },
    {
        "subreddit": "news",
        "sentence": "If I find a piece in my yard, does finders keepers apply?"
    },
    {
        "subreddit": "news",
        "sentence": ">Even if there was a sexual assault involving force, you still don't murder three people"
    },
    {
        "subreddit": "news",
        "sentence": "You call the police"
    },
    {
        "subreddit": "news",
        "sentence": "He should've been aware of that option, being prior law enforcement himself.\n\nThis wasn't even an instance of defense/interference because the incident had happened a few days prior."
    },
    {
        "subreddit": "news",
        "sentence": "Just metal gear solid it, wont shoot at a box"
    },
    {
        "subreddit": "news",
        "sentence": "Oh, you're one of the people that think that's on the news is the only thing that happened.\n\n\nPolitics happen in the backroom, you will only hear about negotiations after they are agreed on by all parties."
    },
    {
        "subreddit": "news",
        "sentence": "Cast it in the form of a klansman locked in a pillary, pants down being paddled by Abraham Lincoln, Rosa Parks, and Dolly Parton."
    },
    {
        "subreddit": "news",
        "sentence": "Not much different than your seatbelt"
    },
    {
        "subreddit": "news",
        "sentence": "There are explosives behind your ear at all times."
    },
    {
        "subreddit": "news",
        "sentence": "I'm sorry that you lack empathy."
    },
    {
        "subreddit": "news",
        "sentence": "Israel just lies it's ass off and keeps on murdering."
    },
    {
        "subreddit": "news",
        "sentence": "I wonder if it is more efficient than just ending the war, surrender Hamas and letting the hostages free.\n\nFeels that people are starting to accept that this is the best solution and forgetting what's the reason for.\n\nDont get me wrong"
    },
    {
        "subreddit": "news",
        "sentence": "Israel should let in as much aid as is needed"
    },
    {
        "subreddit": "news",
        "sentence": "But maybe we can also demand that\n\n1"
    },
    {
        "subreddit": "news",
        "sentence": "Hamas and its allies stop shooting at the pier and at aid deliveries\n\n2"
    },
    {
        "subreddit": "news",
        "sentence": "Hamas and its allies stop plundering the aid deliveries and the reselling at insane prices at gaza civilians\n\n3"
    },
    {
        "subreddit": "news",
        "sentence": "Hamas and its allies to stop raping the hostages, start releasing them and accepting military realities and surrender and therefore ending the war and the suffering altogether.\n\nPeople need to put blame for the situation where the blame lies."
    },
    {
        "subreddit": "news",
        "sentence": "Nobody believes the rhetoric."
    },
    {
        "subreddit": "news",
        "sentence": "Poor bastard herniated every disc in his spine"
    },
    {
        "subreddit": "news",
        "sentence": "Seems no one listens the instructions at the begining of the flight, tragic."
    },
    {
        "subreddit": "news",
        "sentence": "I have questions"
    },
    {
        "subreddit": "news",
        "sentence": "Why have they hit her home twice and why was she naked both times? Like it’s her house, she’s allowed to be"
    },
    {
        "subreddit": "news",
        "sentence": "It just seems a bit strange is all."
    },
    {
        "subreddit": "news",
        "sentence": "And I'm sure you get your news from headlines you read on reddit and what mainstream media tells you to think"
    },
    {
        "subreddit": "news",
        "sentence": "I don't have tiktok installed, but it's certainly more transparent than NYT or Fox News when it comes to international affairs."
    },
    {
        "subreddit": "news",
        "sentence": "I've taught my kids to treat them like they could be killed by them and totally get away with it because that's the cold, hard truth"
    },
    {
        "subreddit": "news",
        "sentence": "I also told them civil servants like firefighters and EMT are there to help them"
    },
    {
        "subreddit": "news",
        "sentence": "Police are not so don't call them because 8/10 times they will only make any given situation worse."
    },
    {
        "subreddit": "news",
        "sentence": "The articles gone"
    },
    {
        "subreddit": "news",
        "sentence": "All I saw was \"Finish them\" in the one I read"
    },
    {
        "subreddit": "news",
        "sentence": "Was there something else or was it just a call to finish a terrorist organization?"
    },
    {
        "subreddit": "news",
        "sentence": "If you shove your head  far enough in the sand you’ll be long dead before the rising ocean gets ya."
    },
    {
        "subreddit": "news",
        "sentence": "How much did THAT fu cost?"
    },
    {
        "subreddit": "news",
        "sentence": "How do I apply for some of this cash?"
    },
    {
        "subreddit": "news",
        "sentence": "What was this book?"
    },
    {
        "subreddit": "news",
        "sentence": "And you don't walk away from that feeling like shit all the time?"
    },
    {
        "subreddit": "news",
        "sentence": "Yes I have already reported him to the authorities"
    },
    {
        "subreddit": "news",
        "sentence": "Silly silly man"
    },
    {
        "subreddit": "news",
        "sentence": "Republicans are about to have a meltdown over this."
    },
    {
        "subreddit": "news",
        "sentence": "Not if you know American history and how it’s handled rightwing white supremacist terrorist and traitors."
    },
    {
        "subreddit": "news",
        "sentence": "I sense that Karma's gonna start up it's game on the corrupt, morally bankrupt, and the down right rotten humans on this planet"
    },
    {
        "subreddit": "news",
        "sentence": "So Karma could definitely do it without a 2/3 senate vote"
    },
    {
        "subreddit": "news",
        "sentence": "As they say \"Karma's a bitch.\""
    },
    {
        "subreddit": "news",
        "sentence": "I will take $6 in rights, please"
    },
    {
        "subreddit": "news",
        "sentence": "They don’t have some form of GPS tracking?"
    },
    {
        "subreddit": "news",
        "sentence": "One of the Americans arrested, Ryan Watson, had loose deer hunting rounds in his wife’s make up bag"
    },
    {
        "subreddit": "news",
        "sentence": "I don’t find that understandable at all"
    },
    {
        "subreddit": "news",
        "sentence": "If you had a kid and they accidentally found and brought that loose round to school to show off to their friends, you’d be in deep doo doo."
    },
    {
        "subreddit": "news",
        "sentence": "don’t forget the weapons and the munitions"
    },
    {
        "subreddit": "news",
        "sentence": "> He doesn't give a shit about them.\n\nThis"
    },
    {
        "subreddit": "news",
        "sentence": "Anything he does while campaigning for election is just that"
    },
    {
        "subreddit": "news",
        "sentence": "Campaigning.\n\nA Trump never pays his debts."
    },
    {
        "subreddit": "news",
        "sentence": "i went to wound college, they were backfilling his stab wounds quickly with bullets"
    },
    {
        "subreddit": "news",
        "sentence": "i do that everyday"
    },
    {
        "subreddit": "news",
        "sentence": "you’ve been on the internet too long."
    },
    {
        "subreddit": "news",
        "sentence": "If they go after some bank or corpo, people would see them as the hero"
    },
    {
        "subreddit": "news",
        "sentence": "Why waste that effort and be hated for extorting a library?"
    },
    {
        "subreddit": "news",
        "sentence": "My EX husband tried to convince me climate change isn’t real and that we only have weather reporting back 75 years or so"
    },
    {
        "subreddit": "news",
        "sentence": "I almost fell over."
    },
    {
        "subreddit": "news",
        "sentence": "Oh, so just a typical Spirit flight"
    },
    {
        "subreddit": "news",
        "sentence": "And Louisiana"
    },
    {
        "subreddit": "news",
        "sentence": "Boy howdy wait until you find out how many hostages Israel is holding if that is what you care about."
    },
    {
        "subreddit": "news",
        "sentence": "The Obama presidency lasted longer than the confederation, just saying."
    },
    {
        "subreddit": "news",
        "sentence": "Pilots are generally told to just get the plane on the ground and not waste runway length trying to soften the landing"
    },
    {
        "subreddit": "news",
        "sentence": "So the hard landing is fine"
    },
    {
        "subreddit": "news",
        "sentence": "Way better to do that then float over the runway and run out of runway at the end"
    },
    {
        "subreddit": "news",
        "sentence": "The descent....yeah it's such a long approach into LAX that there's really no reason for there to be drama there."
    },
    {
        "subreddit": "news",
        "sentence": "/r/worldnews is an unmitigated shithole"
    },
    {
        "subreddit": "news",
        "sentence": "This isn't a real war, it's a genocide"
    },
    {
        "subreddit": "news",
        "sentence": "Hope that clarification helps!"
    },
    {
        "subreddit": "news",
        "sentence": "Well, they used vagrancy and loitering laws to lock up former slaves and then the sheriff would rent them out"
    },
    {
        "subreddit": "news",
        "sentence": "The ones that were \"employed\" weren't allowed to leave without the \"employers\" consent, even if they weren't paid"
    },
    {
        "subreddit": "news",
        "sentence": "For many, the conditions *did* get even worse."
    },
    {
        "subreddit": "news",
        "sentence": "If you are killed by the explosion, you are Hamas, If you're still alive, you could be Hamas。"
    },
    {
        "subreddit": "news",
        "sentence": "fancy word for robbing the shit out of those trucks"
    },
    {
        "subreddit": "news",
        "sentence": "*Looks at Delta and AA flight prices*\n\nMy friend, $650 IS the discount fare."
    },
    {
        "subreddit": "news",
        "sentence": "So that old saying is correct?  \n\n“In Florida, the further north you go, the further ‘south’ you get.”"
    },
    {
        "subreddit": "news",
        "sentence": "For US, federal law applies while in the air, states only get a say when it is grounded"
    },
    {
        "subreddit": "news",
        "sentence": "For countries, mostly follows the plane's country of origin (for Spirit USA) unless you're doing something specifically illegal in the country you are landing in or passing over."
    },
    {
        "subreddit": "news",
        "sentence": "My home county represent"
    },
    {
        "subreddit": "news",
        "sentence": "I can personally attest to the dogshit cops there"
    },
    {
        "subreddit": "news",
        "sentence": "Dear hackers, I heard that the Chinese government is willing to pay BILLIONS in ransom if you hack the Great Firewall."
    },
    {
        "subreddit": "news",
        "sentence": "He even complained that the insurrectionists looked \"low class\""
    },
    {
        "subreddit": "news",
        "sentence": "I guess he wanted the [Brooks Brothers](https://en.wikipedia.org/wiki/Brooks_Brothers_riot)."
    },
    {
        "subreddit": "news",
        "sentence": "It was Spirit it'll be fine, there's probably just warm old Fresca in that shot anyway."
    },
    {
        "subreddit": "news",
        "sentence": "You mean the part of cities that are notoriously underfunded, understaffed, and hit with more budget cuts every year?"
    },
    {
        "subreddit": "news",
        "sentence": "Agree"
    },
    {
        "subreddit": "news",
        "sentence": "However, targeting a medium sized city's public library so people can't check out ebooks is a pretty low-bar for a state actor"
    },
    {
        "subreddit": "news",
        "sentence": "Banks, utilities, corporations, city government, law enforcement, schools, gas stations, political parties, etc.."
    },
    {
        "subreddit": "news",
        "sentence": "would seem more effective than ransoming a library that are barely funded"
    },
    {
        "subreddit": "news",
        "sentence": "Who knows though, to your point, there are certainly countries who probably think library systems hold vast information and are key to city operations here"
    },
    {
        "subreddit": "news",
        "sentence": "I'll stop the bleeding with this hot bullet."
    },
    {
        "subreddit": "news",
        "sentence": "10 out of 10 bullet manufacturers approve!"
    },
    {
        "subreddit": "news",
        "sentence": "Giant metal pipe, it tends to sink fast"
    },
    {
        "subreddit": "news",
        "sentence": "There are fringe cases where having it inflated before impact can save you, but any aircraft hitting the water at such angles would either not break up or instantly kill you with very little in between"
    },
    {
        "subreddit": "news",
        "sentence": "Would be even better if the instigators went to jail."
    },
    {
        "subreddit": "news",
        "sentence": "I see"
    },
    {
        "subreddit": "news",
        "sentence": "My experience in sinking planes is minimal"
    },
    {
        "subreddit": "news",
        "sentence": "Didn't know they fill up so fast."
    },
    {
        "subreddit": "news",
        "sentence": "didn’t the same thing happened to the US made mulberry port after DDay?"
    },
    {
        "subreddit": "news",
        "sentence": "I was told that no need to worry about the blockades and other shenanigans in the border"
    },
    {
        "subreddit": "news",
        "sentence": "And there is no need to negotiate or have a talk to Netanyahu about the aid as this Pier will help with aid going into Gaza"
    },
    {
        "subreddit": "news",
        "sentence": "LOL"
    },
    {
        "subreddit": "news",
        "sentence": "The citizenry of the West are truly taken for fools."
    },
    {
        "subreddit": "news",
        "sentence": "The fuselage floods while it's sinking"
    },
    {
        "subreddit": "news",
        "sentence": "With the jacket inflated, you're pushed into the ceiling and can't push yourself out."
    },
    {
        "subreddit": "news",
        "sentence": "The wife says she told her husband a neighbor she was drinking with exposed his genitals to her, so her husband grabbed his AR, went to drunk man's home and murdered the alleged penis-flasher, his brother, and a third man, because allegedly, a drunk man showed his penis to the killer's wife.\n\nIt was the across the street neighbor"
    },
    {
        "subreddit": "news",
        "sentence": "The brother called 911 to report his brother being shot by the man across the street, at which point more gun shots were heard by the dispatch and the brother quit speaking.\n\nThe cops found the shooter with his AR, a handgun and shell casings and he smelled like alcohol.\n\nHe murdered a man, his brother, and a third person over a penis allegedly being exposed.\n\nEven if there was a sexual assault involving force, you still don't murder three people"
    },
    {
        "subreddit": "news",
        "sentence": "You call the police"
    },
    {
        "subreddit": "news",
        "sentence": "He should've been aware of that option, being prior law enforcement himself."
    },
    {
        "subreddit": "news",
        "sentence": "Hamas *has* been stealing the aid to resell it, and otherwise blocking/attacking land aid convoys"
    },
    {
        "subreddit": "news",
        "sentence": "They even attacked the pier a couple days ago"
    },
    {
        "subreddit": "news",
        "sentence": "Both of the parties in the war want Gazans starving and desperate, for their own reasons."
    },
    {
        "subreddit": "news",
        "sentence": "I still don't understand"
    },
    {
        "subreddit": "news",
        "sentence": "How would it trap you?"
    },
    {
        "subreddit": "news",
        "sentence": "Yes, water rushes into the plane and pushes you up to the ceiling"
    },
    {
        "subreddit": "news",
        "sentence": "You are not capable of getting down to the exit and the plane is already below the waterline and filling up."
    },
    {
        "subreddit": "news",
        "sentence": "Plane is a cylinder"
    },
    {
        "subreddit": "news",
        "sentence": "Unless it flies vertically into the water (which would kill you instantly from the impact), having it inflated basically traps you in the broken-up fuselage until it sinks."
    },
    {
        "subreddit": "news",
        "sentence": "Biden should have used carbonfibre pier modules!"
    },
    {
        "subreddit": "news",
        "sentence": "I watched a video on emergency tracheotomys one time"
    },
    {
        "subreddit": "news",
        "sentence": "Didn't they say it was temporary from the beginning?"
    },
    {
        "subreddit": "news",
        "sentence": "What's wrong with K9s for Warriors? My sister used to train their dogs and they seemed alright although I never really did any digging."
    },
    {
        "subreddit": "news",
        "sentence": "No one cares what an asshole says, shit down a drain instead."
    },
    {
        "subreddit": "news",
        "sentence": "Dusty Rhodes owes them $13 million? Good luck getting that back."
    },
    {
        "subreddit": "news",
        "sentence": "It's your entire premise, you just focus it on the US"
    },
    {
        "subreddit": "news",
        "sentence": "Is every other country's leader doing their absolute best to stop Israel? If they aren't, your argument is everyone who cares should: a) vote for an anti-Israel war candidate; b) if there isn't such a candidate, not vote at all and let the super pro-Israel war candidates win"
    },
    {
        "subreddit": "news",
        "sentence": "That way political parties will learn a lesson over several more years and put up candidates that are anti-Israel war.\n\nIf its just the US that you hold this standard to, you ga e to remember, people chose Biden"
    },
    {
        "subreddit": "news",
        "sentence": "There were other choices, but left-leaning voters chose him as the candidate"
    },
    {
        "subreddit": "news",
        "sentence": "Left leaning people could push for him to not run, push for another candidate to have run in this year's primary, but they didn't"
    },
    {
        "subreddit": "news",
        "sentence": "Atleast not enough to cause change"
    },
    {
        "subreddit": "news",
        "sentence": "Why would 4 more years of Trump cause left-leaning people to go further left in a candidate in 2028? They'd do what they always do, see they lost in 2024 and try to out forward a moderate centrist that can win"
    },
    {
        "subreddit": "news",
        "sentence": "Anyway, we're going in circles"
    },
    {
        "subreddit": "news",
        "sentence": "I just don't get your logic"
    },
    {
        "subreddit": "news",
        "sentence": "Clearly you don't get mine"
    },
    {
        "subreddit": "news",
        "sentence": "Just giving the experience of an American who has been around long enough to know why Biden was chosen: everyone knows he's a centrist who doesn't take a stand on any issue"
    },
    {
        "subreddit": "news",
        "sentence": "That's what the majority of people wanted at the time, an establishment \"grandfather\" who wouldn't do anything because they were burned out after Trump"
    },
    {
        "subreddit": "news",
        "sentence": "Its what we'll do if Trump is reelected"
    },
    {
        "subreddit": "news",
        "sentence": "America simply isn't progressive"
    },
    {
        "subreddit": "news",
        "sentence": "We could have a dozen parties, and we'd be the same"
    },
    {
        "subreddit": "news",
        "sentence": "You see the different flavors, caucuses and coalitions in our Congress- the only things that get passed are moderate and watered down"
    },
    {
        "subreddit": "news",
        "sentence": "Frankly, it's not much different in the rest of the world"
    },
    {
        "subreddit": "news",
        "sentence": "The biggest difference is in countries with more parties, individuals get to say \"not my fault, I'm a Green-Farmer-Social Democrat-Socialist Party voter"
    },
    {
        "subreddit": "news",
        "sentence": "The 4 parliamentary seats we have are trying to get my specific issues listened to in an 8 minority party coalition"
    },
    {
        "subreddit": "news",
        "sentence": "See, I'm making a difference!\""
    },
    {
        "subreddit": "news",
        "sentence": "Ain't no attorney flying Spirit"
    },
    {
        "subreddit": "news",
        "sentence": "Hamas’s health ministry has historically been fairly accurate with casualty numbers"
    },
    {
        "subreddit": "news",
        "sentence": "However, they have not always been accurate in ascertaining the cause of death.\n\nSee: [the Al Ahli Arab Hospital Fire](https://www.fdd.org/analysis/2023/10/19/hamas-unwittingly-admits-gaza-rockets-are-prone-to-misfire/).\n\nI’m not saying the IDF did not shell a refugee area, but to assume that they did would also be fallacious"
    },
    {
        "subreddit": "news",
        "sentence": "This is very much a war and in every war, there is fog."
    },
    {
        "subreddit": "news",
        "sentence": "If it's government-sanctioned hackers, their goal might be more complex than just money"
    },
    {
        "subreddit": "news",
        "sentence": "Any disruption of western infrastructure is long-term beneficial."
    },
    {
        "subreddit": "news",
        "sentence": "They should’ve used Lego instead of Duplo"
    },
    {
        "subreddit": "news",
        "sentence": "SMH…"
    },
    {
        "subreddit": "news",
        "sentence": "This is what low taxes get you - a shitty, corrupt, evil government"
    },
    {
        "subreddit": "news",
        "sentence": "Enjoy fuckers!"
    },
    {
        "subreddit": "news",
        "sentence": "I feel like people are carrying ammo over there to sell it for a high negotiated price"
    },
    {
        "subreddit": "news",
        "sentence": "But, they get caught!"
    },
    {
        "subreddit": "news",
        "sentence": "Well that's exactly what.you don't want to do"
    },
    {
        "subreddit": "news",
        "sentence": "It's worse since the winds are higher\n\n“Overpasses are very poor sheltering areas"
    },
    {
        "subreddit": "news",
        "sentence": "By climbing up underneath the overpass, people are moving into a place where the wind speeds typically will be higher"
    },
    {
        "subreddit": "news",
        "sentence": "In addition, under an overpass, it is possible in some situations that when air is forced through the narrow passage underneath the bridge, this might cause an increase in the wind speeds (as mentioned earlier)"
    },
    {
        "subreddit": "news",
        "sentence": "Further, under different circumstances, the area beneath and just downstream of an overpass might become a debris deposition zone, where piles of debris accumulate.” ["
    },
    {
        "subreddit": "news",
        "sentence": "Far too narrow for my liking"
    },
    {
        "subreddit": "news",
        "sentence": "I fly transatlantic often (Oslo to EWR) and often book SAS Plus which is like a veryyyy comfortable semi-economy class"
    },
    {
        "subreddit": "news",
        "sentence": "That’s usually very good"
    },
    {
        "subreddit": "news",
        "sentence": "But on our flights to Tenerife we did not even have screens"
    },
    {
        "subreddit": "news",
        "sentence": "😂"
    },
    {
        "subreddit": "news",
        "sentence": "I'm shocked a triple homicide was not a family annihilator situation."
    },
    {
        "subreddit": "news",
        "sentence": "Unfortunately, the GOP has been really successful at convincing people they're really not that bad at that the Dems are super radical"
    },
    {
        "subreddit": "news",
        "sentence": "When really the Dems have been moving to the center for years to compromise with a GOP that doesn't want to compromise."
    },
    {
        "subreddit": "news",
        "sentence": "The article has no detail besides Gaza officials claiming one thing, and the IDF claiming another..."
    },
    {
        "subreddit": "news",
        "sentence": "\"My kind\"? What is \"my kind\"? Black people?"
    },
    {
        "subreddit": "news",
        "sentence": "Most countries don't have capital punishment, and of those that do, many don't give the death penalty for assault"
    },
    {
        "subreddit": "news",
        "sentence": "Removing statues isnt erasing history, however a lot of good can come from leaving monuments up while contextualizing them so people have a chance to better understand what has occurred"
    },
    {
        "subreddit": "news",
        "sentence": "In this case, contextualizing them by informing people that they were created decades after the civil war as a counter to the progress made by people during the reconstruction era is particularly helpful"
    },
    {
        "subreddit": "news",
        "sentence": "Simply tearing things down doesnt open any opportunity for people to learn how these and similar monuments are total bullshit intended to spread lies"
    },
    {
        "subreddit": "news",
        "sentence": "Getting rid of them outright opens up the opportunity for people to assume the myth of continual progress, the misguided framing by which US history is often taught"
    },
    {
        "subreddit": "news",
        "sentence": "As in “things were bad for black people during the civil war, but since then have always gotten incrementally better over time”"
    },
    {
        "subreddit": "news",
        "sentence": "The reality is that things were bad, then a lot of gains were made during reconstruction, which led to racist reactionists doing everything they could to upend that progress (including building these statues)"
    },
    {
        "subreddit": "news",
        "sentence": "If we dont draw attention the part of history where people undermined made progress then people can quickly repeat the same mistakes"
    },
    {
        "subreddit": "news",
        "sentence": "Unsurprisingly we see the same theme with women’s rights right now especially regarding bodily autonomy"
    },
    {
        "subreddit": "news",
        "sentence": "If people uncritically adopt the myth of progress that says women must be doing better now than they have in the past then they are accepting a narrative that a) ignores the undoing of women’s rights, and b) implies we dont need to take urgent action to fix things, because in the future we will have made progress"
    },
    {
        "subreddit": "news",
        "sentence": "I primarily studied the relationship between monuments and memory in college, and I personally believe that the only statues/monuments we should urgently tear down are those which contain racist caricaturist depictions of people"
    },
    {
        "subreddit": "news",
        "sentence": "The faithful slave monument is actually one example of that, and I would be happy to see it go"
    },
    {
        "subreddit": "news",
        "sentence": "But its sister monuments that celebrate confederates or the confederacy at large could stay up, be contextualized at the site, and then ideally work against the message they were originally intended to broadcast"
    },
    {
        "subreddit": "news",
        "sentence": "Generally speaking most all scholars Ive ever read the work of argue that tearing down monuments is not the best solution for actually working against those shitty monuments"
    },
    {
        "subreddit": "news",
        "sentence": "I would tend to agree"
    },
    {
        "subreddit": "news",
        "sentence": "Why get rid of a confederate monument if you can use it to teach people how the confederacy is a racist and stupid legacy whose water is carried by the ignorant? Some might say everyone already knows that, but a lot of people in the South dont believe it because of “heritage”"
    },
    {
        "subreddit": "news",
        "sentence": "Getting rid of all the confederate statues is just ammo for people arguing their heritage is being erased"
    },
    {
        "subreddit": "news",
        "sentence": "Leaving them up but making sure anyone who sees them has a chance to learn reality / the truth would do considerably more to undermine that heritage bullshit"
    },
    {
        "subreddit": "news",
        "sentence": "How many people who truly believe in upholding confederate heritage know that the confederacy existed for less time than most people spend in highschool? What would things look like if that was more widely pointed out every time someone engaged with a confederate monument? How many people would carry water for the most self-celebrated losers of all time if they knew fully and accurately what huge losers they were? \n\nThe common academic definition of heritage boils down to “using the past for present purposes”"
    },
    {
        "subreddit": "news",
        "sentence": "Getting rid of past heritage works, rather than trying to transform their impact, is an act that relinquishes an opportunity to use the past for a present purpose that could spark positive change"
    },
    {
        "subreddit": "news",
        "sentence": "Surely, any public employee should have all benefits forfeited if they turn out to be criminals? Not just on January 6th?\n\n\nSo, I mean, if you used to work in the postal service, and then, in your 60s, you are convicted of, say, smoking in an airplane toilet, you should lose pensions, medicaid, medicare etc.? Why should honest taxpayers fund criminals?\n\n\n\nNo punishment except in law, you know"
    },
    {
        "subreddit": "news",
        "sentence": "You cannot make it up as you go along."
    },
    {
        "subreddit": "news",
        "sentence": "I’m patiently waiting for the insurance companies to finally say fuck it, and just start mass suing the oil companies for creating the situation"
    },
    {
        "subreddit": "news",
        "sentence": "It might be until after I die but eventually it will happen (don’t take my dream from me)"
    },
    {
        "subreddit": "news",
        "sentence": "Those interned were American you dunce."
    },
    {
        "subreddit": "news",
        "sentence": "She did that to screw up the other cases which were waiting for this one to start"
    },
    {
        "subreddit": "news",
        "sentence": "But the other judges got Jack and just started anyway"
    },
    {
        "subreddit": "news",
        "sentence": "quick question, is literally everyone in Palestine dead?"
    },
    {
        "subreddit": "news",
        "sentence": "So it’s made of cardboard derivatives?"
    },
    {
        "subreddit": "news",
        "sentence": "if only there were another way to get aid into Gaza"
    },
    {
        "subreddit": "news",
        "sentence": "you know like aid boats that move over land."
    },
    {
        "subreddit": "news",
        "sentence": "Wouldn’t catch me dead administering airline drugs unless it’s for anaphylaxis or someone needs glucose lol"
    },
    {
        "subreddit": "news",
        "sentence": "that will only help slightly"
    },
    {
        "subreddit": "news",
        "sentence": "if the climate changes enough and water becomes scarce in large populated areas then we wont be able to grow enough crops to feed us all"
    },
    {
        "subreddit": "news",
        "sentence": "i see mysterious protein and nutrient bars in our future."
    },
    {
        "subreddit": "news",
        "sentence": "Especially if it was a tornado, and most of the time it’s random where they finally touch down."
    },
    {
        "subreddit": "news",
        "sentence": "This is why they are provided tazers though"
    },
    {
        "subreddit": "news",
        "sentence": "1 trillion taxpayer dollars in production and development"
    },
    {
        "subreddit": "news",
        "sentence": "I'm sure all the insurrectionists were betting on that"
    },
    {
        "subreddit": "news",
        "sentence": "They let you use text books?! My school just told us to cover the back of our necks with our hands"
    },
    {
        "subreddit": "news",
        "sentence": "But they also stuck us in the wind tunnel hallway rather than in interior bathrooms or the semi-basement under the stage, so I don’t think the best minds were on the committee that decided on that safety plan."
    },
    {
        "subreddit": "news",
        "sentence": "Someone is going to make a killing on developing a functional stillsuit."
    },
    {
        "subreddit": "news",
        "sentence": "> The feds generally only prosecute for crimes they know they can prove"
    },
    {
        "subreddit": "news",
        "sentence": "Especially after Fort Smith, they don’t try to overreach and only take what they think they’ll win to trial when it comes to domestic terrorists"
    },
    {
        "subreddit": "news",
        "sentence": "Even now juries struggle to convict on “nebulous” crimes like conspiracy and sedition"
    },
    {
        "subreddit": "news",
        "sentence": "It’s a strategy but it’s debatable whether it’s the best call for these kinds of players"
    },
    {
        "subreddit": "news",
        "sentence": "Sometimes a conviction for a lesser, more provable offense is better than nothing and sometimes it leads to the development of interconnected but disparate cells of extremists who are the number one threat to domestic tranquility."
    },
    {
        "subreddit": "news",
        "sentence": "I'll have to remember that"
    },
    {
        "subreddit": "news",
        "sentence": "Thank you."
    },
    {
        "subreddit": "news",
        "sentence": "Coincidentally:\n\nScientists have found a simple new method to reduce the rate of people suffering from a peanut allergy by a staggering 71%.\n\nHow? By feeding a child peanuts regularly between the ages of four months old and five years old"
    },
    {
        "subreddit": "news",
        "sentence": "What’s more, the method works even if the child then continues to eat peanuts or avoids them entirely after the age of five.\n\n[https://www.reddit.com/r/UpliftingNews/comments/1d2x8aa/peanut\\_allergies\\_could\\_plummet\\_by\\_71\\_with\\_simple/](https://www.reddit.com/r/UpliftingNews/comments/1d2x8aa/peanut_allergies_could_plummet_by_71_with_simple/)"
    },
    {
        "subreddit": "news",
        "sentence": "Soldier is for the army, airman is for the Air Force, sailor is for the navy, marine is for the marine corps."
    },
    {
        "subreddit": "news",
        "sentence": "Holy mother of Christ, $650"
    },
    {
        "subreddit": "news",
        "sentence": "I still remember the $29 \"Peanut Fares\" before 9/11"
    },
    {
        "subreddit": "news",
        "sentence": "Guess they ain't a discount carrier anymore."
    },
    {
        "subreddit": "news",
        "sentence": "Seabees always had Marine Corps Infantry levels of ego"
    },
    {
        "subreddit": "news",
        "sentence": "As an 03 myself, I always loved them for it."
    },
    {
        "subreddit": "news",
        "sentence": "How does this make you drown? Can't get out of the plane?"
    },
    {
        "subreddit": "news",
        "sentence": "And you think that this is an opportunity for levity …"
    },
    {
        "subreddit": "news",
        "sentence": "I mean, yes, but this whole thing is silly to the point of being tragic"
    },
    {
        "subreddit": "news",
        "sentence": "The lengths we're going to to set up this temporary pier, send boats, etc"
    },
    {
        "subreddit": "news",
        "sentence": "would be wholly unnecessary if Israel would just let in an amount of aid that would prevent famine"
    },
    {
        "subreddit": "news",
        "sentence": "Because that is by far the most efficient way of getting aid to Gazans"
    },
    {
        "subreddit": "news",
        "sentence": "And as an added bonus, it's not a war crime!"
    },
    {
        "subreddit": "news",
        "sentence": "Airplanes have medical kits that generally have things like epinephrine and some other drugs."
    },
    {
        "subreddit": "news",
        "sentence": "A blood sugar issue?  Hmm, what was it we had for dinner tonight?"
    },
    {
        "subreddit": "news",
        "sentence": "I was kinda blending the two movies a bit because all of his Mig shoot downs and him getting Ice on his side comes after the ejection that kills Goose."
    },
    {
        "subreddit": "news",
        "sentence": "That’s a hilariously ahistorical take lol"
    },
    {
        "subreddit": "news",
        "sentence": "Are you just going to completely ignore the basis of the conflict? \n\nThis conflict is about land because one side took land from the other"
    },
    {
        "subreddit": "news",
        "sentence": "Regardless of whether you view the conquest as legitimate or not, it is impossible to ignore this fact"
    },
    {
        "subreddit": "news",
        "sentence": "And California"
    },
    {
        "subreddit": "news",
        "sentence": "I just got a letter that Farmers is pulling out of our policy effective *in a couple of days*"
    },
    {
        "subreddit": "news",
        "sentence": "Now that I’m scrambling, I’ve only found a SINGLE insurance provider offering quotes, an they’re an unknown entity to me"
    },
    {
        "subreddit": "news",
        "sentence": "Costco isn’t even offering."
    },
    {
        "subreddit": "news",
        "sentence": "I guess that we disagree"
    },
    {
        "subreddit": "news",
        "sentence": "To me, losing track of a single, disposable, and non-dangerous item from the thousands of similar items due to unusual circumstances doesn't automatically make a person irresponsible"
    },
    {
        "subreddit": "news",
        "sentence": "It's an irresponsible action, sure, but not overall irresponsibility."
    },
    {
        "subreddit": "news",
        "sentence": "Biden is a committed Zionist"
    },
    {
        "subreddit": "news",
        "sentence": "This issue is seemingly the only thing he actually cares about"
    },
    {
        "subreddit": "news",
        "sentence": "It doesn't matter if he loses the election because of it as long as thousands of Palestinian children get blown apart by American supplied bombs."
    },
    {
        "subreddit": "news",
        "sentence": "Water landing or water crash landing?  Definitely a difference."
    },
    {
        "subreddit": "news",
        "sentence": "Don’t forget Egypt, closing their crossings as well."
    },
    {
        "subreddit": "news",
        "sentence": "Not to be that guy but mav’s relations with ice were fine after the first top gun"
    },
    {
        "subreddit": "news",
        "sentence": "Why argue with someone not listening? No side-stepping, just not wasting my time with an internet troll."
    },
    {
        "subreddit": "news",
        "sentence": "you should send your ideas on how it should be done to the government"
    },
    {
        "subreddit": "news",
        "sentence": "I’m sure no one else has thought “why didn’t we make it stronger?”"
    },
    {
        "subreddit": "news",
        "sentence": "How about stop giving israel weapons and demand the aid trucks come through the border.\n\nAlso, all the aid that was delivered at that 'port' was stolen"
    },
    {
        "subreddit": "news",
        "sentence": "None of it reached the intended recipient."
    },
    {
        "subreddit": "news",
        "sentence": "Its been a long time since WW2"
    },
    {
        "subreddit": "news",
        "sentence": "Guarantee world militaries have some nasty secrets they can unleash if they have to."
    },
    {
        "subreddit": "news",
        "sentence": "The co would be nuts to fill the space if it costs them millions of $"
    },
    {
        "subreddit": "news",
        "sentence": "The knuckleheads who “imposed” that tax had to know they’d never see the $"
    },
    {
        "subreddit": "news",
        "sentence": "Capitalism is in full swing."
    },
    {
        "subreddit": "news",
        "sentence": "And over 300 shootings."
    },
    {
        "subreddit": "news",
        "sentence": "I've heard something similar from someone raised in the south"
    },
    {
        "subreddit": "news",
        "sentence": "As a person raised in the north it was a bit of a surprise as I'd expected this kind of thinking to have been long gone"
    },
    {
        "subreddit": "news",
        "sentence": "Boy do I wish I was right."
    },
    {
        "subreddit": "news",
        "sentence": "\"Yes, I did kill him, your Honor, but I'm a good white Christian.\" \n\n\"You're free to go then"
    },
    {
        "subreddit": "news",
        "sentence": "Sorry to trouble you.\""
    },
    {
        "subreddit": "news",
        "sentence": "She did die"
    },
    {
        "subreddit": "news",
        "sentence": "Shot during a riot at capital hill.."
    },
    {
        "subreddit": "news",
        "sentence": "But here we are..."
    },
    {
        "subreddit": "news",
        "sentence": "Where is Anonymous when you need them"
    },
    {
        "subreddit": "news",
        "sentence": "Holy shit your kind are sensitive!"
    },
    {
        "subreddit": "news",
        "sentence": "How about normal people who are outraged we're using 300M dollars to build a stupid dock in the middle east to deliver aid to people who need it because our tax dollars are also funding the bombs causing the shortage of supplies"
    },
    {
        "subreddit": "news",
        "sentence": "All the aid was stolen and it broke immediately"
    },
    {
        "subreddit": "news",
        "sentence": "Legit Biden should resign over this"
    },
    {
        "subreddit": "news",
        "sentence": "Utter failure to fix a problem he is causing and wasting hundreds of millions at the same time."
    },
    {
        "subreddit": "news",
        "sentence": "NYPD receive a State government pension"
    },
    {
        "subreddit": "news",
        "sentence": "Every thread about this I have to bring up 22lr"
    },
    {
        "subreddit": "news",
        "sentence": "Those rounds get everywhere"
    },
    {
        "subreddit": "news",
        "sentence": "If I have a misfeed, I toss it in my pocket instead of the ground and it's gone forever"
    },
    {
        "subreddit": "news",
        "sentence": "Saying all of that my range bag is just a range bag and would never go to an airport"
    },
    {
        "subreddit": "news",
        "sentence": "This is what happened for a number of passengers of Ethiopian 961"
    },
    {
        "subreddit": "news",
        "sentence": "What a shame, to survive a hijacking and water landing only to drown from inflating the life jacket too early."
    },
    {
        "subreddit": "news",
        "sentence": "If you don’t know where all of your ammo is, you’re an irresponsible gun owner"
    },
    {
        "subreddit": "news",
        "sentence": "End of."
    },
    {
        "subreddit": "news",
        "sentence": "Now it’s blaming the Jews, and almost everyone accepts that."
    },
    {
        "subreddit": "news",
        "sentence": "The charge was obstructing a congressional proceeding which carries up to a five year charge"
    },
    {
        "subreddit": "news",
        "sentence": "The charge isn't \"being there,\" it's directly related to forcing the evacuation of Congress to disrupt the formalization of Biden's victory"
    },
    {
        "subreddit": "news",
        "sentence": "He could have trespassed on any other day and wouldn't have gotten those charges, however \"disliked\" he might have been.\n\nImagine Trump had won and some guy with a bullhorn was riling up a mob in Congress on the same day and suddenly you'll understand why it was a serious crime."
    },
    {
        "subreddit": "news",
        "sentence": "Troll or serious?"
    },
    {
        "subreddit": "news",
        "sentence": "So this 64 year old former mayor and cop was talking to his wife (no name or age mentioned that I saw) who told him, \"oh yeah a few days ago, this guy 20 years your junior that I was drinking with for some reason flashed his junk at me and tried to kiss me\" and so he grabs his guns and goes to the guy's house and kills him"
    },
    {
        "subreddit": "news",
        "sentence": "The guy's younger brother calls the police to report this and Mr"
    },
    {
        "subreddit": "news",
        "sentence": "Mayor comes back and shoots him too, and he dies *while talking to the dispatcher.* And he also kills some other guy along the way because death comes in threes and then gives himself up.\n\nSouth Dakota, you alright??"
    },
    {
        "subreddit": "news",
        "sentence": "No, melt it down"
    },
    {
        "subreddit": "news",
        "sentence": "Being old doesn't make it \"history\""
    },
    {
        "subreddit": "news",
        "sentence": "The khamas is calling from inside the tank."
    },
    {
        "subreddit": "news",
        "sentence": "Sorry"
    },
    {
        "subreddit": "news",
        "sentence": "Meant no disrespect"
    },
    {
        "subreddit": "news",
        "sentence": "I thought saying soldier was the proper term."
    },
    {
        "subreddit": "news",
        "sentence": "To be continued in \"The Handmaid's Tale: Prologue\"."
    },
    {
        "subreddit": "news",
        "sentence": "His comments are probably going to cause his unhinged followers to kill people."
    },
    {
        "subreddit": "news",
        "sentence": "An Airman,  not a soldier."
    },
    {
        "subreddit": "news",
        "sentence": "Go figure, the guy gets benefits from the same government he's trying to overthrow"
    },
    {
        "subreddit": "news",
        "sentence": "Can't make up a dumber dude."
    },
    {
        "subreddit": "news",
        "sentence": "Why don't airlines just stop allowing peanuts on their flights, full stop? People acting like peanuts are the only food they can eat while in the air"
    },
    {
        "subreddit": "news",
        "sentence": "It's ridiculous"
    },
    {
        "subreddit": "news",
        "sentence": "I'm not allergic to anything but if I were I sure as shit would hope that people around me aren't such big dick holes that they just HAVE to have that fucking peanut even if it might kill me"
    },
    {
        "subreddit": "news",
        "sentence": "People like that suck."
    },
    {
        "subreddit": "news",
        "sentence": "Obviously Hamas is the most moral army"
    },
    {
        "subreddit": "news",
        "sentence": "Their cause is 100% just"
    },
    {
        "subreddit": "news",
        "sentence": "Killing Jews is the most moral cause possible"
    },
    {
        "subreddit": "news",
        "sentence": "How could someone not support them?\n\nThey also never ever lie"
    },
    {
        "subreddit": "news",
        "sentence": "Israel really did kill 500,000 people at Al Ahi hospital, which was totally destroyed"
    },
    {
        "subreddit": "news",
        "sentence": "And Hamas really did capture IDF special forces troops the other day"
    },
    {
        "subreddit": "news",
        "sentence": "Actually they weren't special forces, they were the IDF's top generals"
    },
    {
        "subreddit": "news",
        "sentence": "Completely true"
    },
    {
        "subreddit": "news",
        "sentence": "Also the IDF killed seventy billion doctor babies today with their laser dolphin tanks"
    },
    {
        "subreddit": "news",
        "sentence": "100% true story"
    },
    {
        "subreddit": "news",
        "sentence": "Hamas never lies about anything ever, they are totally moral and just."
    },
    {
        "subreddit": "news",
        "sentence": "I hope you are not lumping California in there"
    },
    {
        "subreddit": "news",
        "sentence": "Although we may float away also…"
    },
    {
        "subreddit": "news",
        "sentence": "No, but I've used bags other than my usual bag before"
    },
    {
        "subreddit": "news",
        "sentence": "Or transferred items between bags"
    },
    {
        "subreddit": "news",
        "sentence": "Many people are confident that they couldn't possibly make this mistake, but I'm not"
    },
    {
        "subreddit": "news",
        "sentence": "I'm not saying that it's likely, just understandable"
    },
    {
        "subreddit": "news",
        "sentence": "I'd be saying the same thing if it was a tiny bit of coke in pocket or a bit of cannabis in a seam"
    },
    {
        "subreddit": "news",
        "sentence": "Sometimes tiny shit gets into places, and sometimes we forget that that happens"
    },
    {
        "subreddit": "news",
        "sentence": "I'd like to think that I'd definitely double check my bag, but I could see a string of low-chance circumstances leading me to forget a round of ammo in a bag that I end up travelling with."
    },
    {
        "subreddit": "news",
        "sentence": "I would be too if I specialized in an old British windbag."
    },
    {
        "subreddit": "news",
        "sentence": "Reminds me of the weeks when we were leaving Afghanistan"
    },
    {
        "subreddit": "news",
        "sentence": "One NCO in battalion was warning people about the consequences of bringing ammunition or explosives in their bags, and stressed the importance of double-checking.\n\nOne guess who brought explosives (C4, I think - it's been awhile) in their bag to the screening because they forgot to double-check themselves."
    },
    {
        "subreddit": "news",
        "sentence": "It’s tragic but also people seem to forget that happens in real war"
    },
    {
        "subreddit": "news",
        "sentence": "In WW2 the allies both accidentally killed/injured a terrible number of civilians as well as flattened incalculable buildings during WW2 and they were the _good guys_.\n\nThat’s why war should be avoided at all cost"
    },
    {
        "subreddit": "news",
        "sentence": "I don’t know where people get the misconception that an actual ground war is some precision surgical operation"
    },
    {
        "subreddit": "news",
        "sentence": "It is by nature indiscriminate and horrifically destructive and rife with collateral damage."
    },
    {
        "subreddit": "news",
        "sentence": "One hell of a way to waste $320 million"
    },
    {
        "subreddit": "news",
        "sentence": "Only the US could do it the most expensive way possible....knowing it could fail in 15+mph winds and 3+ foot waves"
    },
    {
        "subreddit": "news",
        "sentence": "Jesus Christ...the stupidity and wastefulness of our government."
    },
    {
        "subreddit": "news",
        "sentence": "“Woopsie, we might crash one of these in a few years"
    },
    {
        "subreddit": "news",
        "sentence": "Better add that $ in”"
    },
    {
        "subreddit": "news",
        "sentence": "Military grade materials"
    },
    {
        "subreddit": "news",
        "sentence": "The irresponsibility was in not checking every nook and cranny of the bag before taking it to a country that will put you in prison for a single round of ammo"
    },
    {
        "subreddit": "news",
        "sentence": "And I'm not saying that the guy wasn't irresponsible"
    },
    {
        "subreddit": "news",
        "sentence": "I'm just saying that it's an understandable mistake."
    },
    {
        "subreddit": "news",
        "sentence": "What am I supposed to use as a pillow?"
    },
    {
        "subreddit": "news",
        "sentence": "And people contend libraries are obsolete!"
    },
    {
        "subreddit": "news",
        "sentence": "Lol, do you really want to see your countrymen locked up for their political beliefs? That sounds pretty fucked up to me and antithetical to what America is about, no?"
    },
    {
        "subreddit": "news",
        "sentence": "I don’t get it"
    },
    {
        "subreddit": "news",
        "sentence": "This joke is too heady for me"
    },
    {
        "subreddit": "news",
        "sentence": "I like how the tweet said that they witnessed it happen, but the person behind them gave them details"
    },
    {
        "subreddit": "news",
        "sentence": "It's like they saw the picture on the Internet and just want to take credit for reporting it."
    },
    {
        "subreddit": "news",
        "sentence": "You never lost track of a tiny object that you have hundreds or thousands of? It's not a bottle of cyanide or a stick of dynamite"
    },
    {
        "subreddit": "news",
        "sentence": "I'm not saying that the guy didn't make a mistake or doesn't deserve punishment, I'm just saying that it's an understandable mistake."
    },
    {
        "subreddit": "news",
        "sentence": "I remember in some old ass video a bunch of people ran up under a freeway overpass embankment between girders"
    },
    {
        "subreddit": "news",
        "sentence": "They survived while the ones that stayed in cars below didn't make it."
    },
    {
        "subreddit": "news",
        "sentence": "Lots of things, but nobody who knows those things will ever be able to tell us"
    },
    {
        "subreddit": "news",
        "sentence": "The major theories I've seen are that the F-22 uses a significantly more advanced stealth coating and some truly science-fiction tier avionics and sensor systems.\n\nkeep in mind I have zero relationship to anyone who works in defense aerospace, let alone the F-22 or F-35 space, so ultimately my guess is as good as anyone else's."
    },
    {
        "subreddit": "news",
        "sentence": "Your range bag is also your international travel bag? That's just sloppy."
    },
    {
        "subreddit": "news",
        "sentence": "So.."
    },
    {
        "subreddit": "news",
        "sentence": "the argument kinda falls apart, then"
    },
    {
        "subreddit": "news",
        "sentence": "You cannot punish them harder because they know the laws when they don't need to know the law."
    },
    {
        "subreddit": "news",
        "sentence": "When did I say everyone should stop participating in their countries’ elections?\n\nIt sounds like your solution to displeasure with the Dems is to … vote for them anyway? Why then in 2028 would they run under a different platform?"
    },
    {
        "subreddit": "news",
        "sentence": "Faithful, didn’t run away or disobey because they feared beating whipped and torn away from their families… yeah, same thing"
    },
    {
        "subreddit": "news",
        "sentence": "/s"
    },
    {
        "subreddit": "news",
        "sentence": "There was no alarm though"
    },
    {
        "subreddit": "news",
        "sentence": "This was a minor non-event that if the FAs had just sat in their seats, the plane would've landed normally back in Jamaica"
    },
    {
        "subreddit": "news",
        "sentence": "Contract maintenance would've come on to look at the pressurization issue, signed it off and they would've taken back off within an hour or two"
    },
    {
        "subreddit": "news",
        "sentence": "The FAs overreacted / were too proactive, even they didn't need to do anything or bring up anything to the passengers."
    },
    {
        "subreddit": "news",
        "sentence": "They're not overpriced"
    },
    {
        "subreddit": "news",
        "sentence": "They're cheaper than most of their predecessors once you factor in for inflation"
    },
    {
        "subreddit": "news",
        "sentence": "The high cost was in all the R&D which raised the effective per-unit cost of the first block, but the new ones are far from overpriced for the capabilities they afford."
    },
    {
        "subreddit": "news",
        "sentence": "Chicago to Houston is generally pretty cheap--$60-$150 and like they said, if you just buy the ticket and have a personal bag (not a carryon), it's super cheap"
    },
    {
        "subreddit": "news",
        "sentence": "Even adding a $25 carry-on makes it cheaper than most Ohare to Bush flights"
    },
    {
        "subreddit": "news",
        "sentence": "They might have shot themselves in the foot but soon they'll be shooting other people in the face."
    },
    {
        "subreddit": "news",
        "sentence": "Anytime you wonder why something good has turned to crap, the answer is greed and ignorance"
    },
    {
        "subreddit": "news",
        "sentence": "No"
    },
    {
        "subreddit": "news",
        "sentence": "Just someone pretty horrified at how your legal system works"
    },
    {
        "subreddit": "news",
        "sentence": "And more horrified that people seem to want to make it worse in order to get a kick out of it."
    },
    {
        "subreddit": "news",
        "sentence": "There were cops in NYC who were convicted of doing hits for the mob (one of them was even the wrong guy who happened to have the same name as their target) and still got to keep their pensions"
    },
    {
        "subreddit": "news",
        "sentence": "Legally it's considered money already earned and must be paid, unless laws have changed."
    },
    {
        "subreddit": "news",
        "sentence": "it's the most popular and successful military airframe in human history, what part of it is an embarassment?"
    },
    {
        "subreddit": "news",
        "sentence": "If you truly believe it is a problem, you oppose it wherever you find it.\n\n\nYou're not against it if you support it in cases where it benefits you or punishes someone you dislike."
    },
    {
        "subreddit": "news",
        "sentence": "I read this as “hecklers” and was amused, love a good heckle."
    },
    {
        "subreddit": "news",
        "sentence": "and now you’re being dramatic"
    },
    {
        "subreddit": "news",
        "sentence": "“These same people”\n\nThe ol’ “let me make up groups of people and then also make up what they believe” trick"
    },
    {
        "subreddit": "news",
        "sentence": "A Reddit classic."
    },
    {
        "subreddit": "news",
        "sentence": "That's insane! I Literally just read a reddit comment about a guy who read a chapter in a book about how attributing negative outcomes to external entities enhances group cohesion by diverting blame from human power structures."
    },
    {
        "subreddit": "news",
        "sentence": "Just to play devil's advocate I grew up across the street from a guy who would have to go to the hospital if he *smelled* peanuts"
    },
    {
        "subreddit": "news",
        "sentence": "Literally"
    },
    {
        "subreddit": "news",
        "sentence": "That being said if the allergy is that severe you should take proper steps ahead if time, not wait until you're already on the plane and harass the captain after there's practically nothing the flight staff can do."
    },
    {
        "subreddit": "news",
        "sentence": "So in your world, only the police argue for nulla poena sine lege certa? That's what made you think I was a police officer?\n\n\nIt's a pretty basic idea of most modern legal systems"
    },
    {
        "subreddit": "news",
        "sentence": "Not in China, Russia or Reddit, though."
    },
    {
        "subreddit": "news",
        "sentence": "The shipping costs are the real issue"
    },
    {
        "subreddit": "news",
        "sentence": "That drives up the price so the couple percent tax becomes the GDP of the world several times over!"
    },
    {
        "subreddit": "news",
        "sentence": "Ejection seats are pyrotechnics/ explosives - if anything goes wrong you are very likely dead"
    },
    {
        "subreddit": "news",
        "sentence": "300 millions spend, probably 2 million went into the whole cost of construction and logistics"
    },
    {
        "subreddit": "news",
        "sentence": "The rest went to the pentagon, contractors, and politicians."
    },
    {
        "subreddit": "news",
        "sentence": "$320M and it was operational for 1 week before being destroyed"
    },
    {
        "subreddit": "news",
        "sentence": "and they're taking it to an isntreal port to repair it and bring it back and will take more than a week"
    },
    {
        "subreddit": "news",
        "sentence": "wtf"
    },
    {
        "subreddit": "news",
        "sentence": "> southern \n\nWent to school in the south"
    },
    {
        "subreddit": "news",
        "sentence": "We learned the war was about slavery and fought to end it"
    },
    {
        "subreddit": "news",
        "sentence": "Not every place is Mobile alabama."
    },
    {
        "subreddit": "news",
        "sentence": "The dog killer?"
    },
    {
        "subreddit": "news",
        "sentence": "do you think food is weapons\n\ndrink less zionist kool aid"
    },
    {
        "subreddit": "news",
        "sentence": "Maybe we should criticize the need for the pier in the first place."
    },
    {
        "subreddit": "news",
        "sentence": "It's happening under the leadership of the entire world, so by your logic, everyone should stop participating in their countries' elections until their countries move further left? Would that cause Israel to stop.."
    },
    {
        "subreddit": "news",
        "sentence": "we all just wait several years under insane far-right regimes, hoping a candidate that's left enough is elected.."
    },
    {
        "subreddit": "news",
        "sentence": "Lol, good luck with that"
    },
    {
        "subreddit": "news",
        "sentence": "Concerning that such expensive planes can't even do a basic take off without crashing."
    },
    {
        "subreddit": "news",
        "sentence": "Yes they are on their border with gaza or otherwise aid would get in"
    },
    {
        "subreddit": "news",
        "sentence": "> It is still significantly more efficient then many other ways of delivering aid.\n\nlol no? what? Not a single humanitarian group has requested this stupid pier"
    },
    {
        "subreddit": "news",
        "sentence": "Everyone is very clearly demanding Israel open up land routes which it refuses to do"
    },
    {
        "subreddit": "news",
        "sentence": "It is insane we're trying to get aid into Israel like it's an enemy country rather than an \"ally\".\n\nI guess it's more efficient than other very stupid ideas like airdrops or witches on broomsticks."
    },
    {
        "subreddit": "news",
        "sentence": "You need to get help, you are the one calling all the civilian deaths fake and Isreal a moral army lmfao."
    },
    {
        "subreddit": "news",
        "sentence": "Our country is generally run by incompetent morons."
    },
    {
        "subreddit": "news",
        "sentence": "A lot of these people tried to get leniency in court by testifying they believed they were following Trump and feel misled by him (things that will almost certainly come up in *his* trial), so I'd be extremely surprised if he did a blanket pardon"
    },
    {
        "subreddit": "news",
        "sentence": "*Maybe* the ones who swore fealty and stayed loyal will be picked out for individual pardons, but I suspect he really doesn't care about them anymore since they failed to achieve his goal."
    },
    {
        "subreddit": "news",
        "sentence": "You can also host a fight inside a public library"
    },
    {
        "subreddit": "news",
        "sentence": "I volunteered on my first time abroad, multiple syncopal episodes w/ s&s stomach flu"
    },
    {
        "subreddit": "news",
        "sentence": "A couple days later a credit for a couple hundred shows up on my CC."
    },
    {
        "subreddit": "news",
        "sentence": "Is he an illegal? Because Fox News always has the scoop on illegals and murders."
    },
    {
        "subreddit": "news",
        "sentence": "***Shouldn't have traveled to a country the U.S"
    },
    {
        "subreddit": "news",
        "sentence": "State Department issued a travel advisory for.***"
    },
    {
        "subreddit": "news",
        "sentence": "Yep TSA doesn't have a problem with ammo in checked bags"
    },
    {
        "subreddit": "news",
        "sentence": "T&C does."
    },
    {
        "subreddit": "news",
        "sentence": "We are currently in a cyber war with Russia for sure, maybe even china"
    },
    {
        "subreddit": "news",
        "sentence": "The Cold War never really ended because Putin kicked that shit back up"
    },
    {
        "subreddit": "news",
        "sentence": "It’s the root of most of our problems."
    },
    {
        "subreddit": "news",
        "sentence": "As long as I don't get invited to parties where the guys just hang around making rape jokes and how people should be sexually assaulted as part of their sentences, I'm ok."
    },
    {
        "subreddit": "news",
        "sentence": "No cash, only debit or credit."
    },
    {
        "subreddit": "news",
        "sentence": "So the stabbing victim was probably better off without the police"
    },
    {
        "subreddit": "news",
        "sentence": "“The landing will still be a bit rough as you’ve elected not to pay for tires on the landing gear.”"
    },
    {
        "subreddit": "news",
        "sentence": "The train goes right by it"
    },
    {
        "subreddit": "news",
        "sentence": "I used to commute and watched Xanadu rise and fall."
    },
    {
        "subreddit": "news",
        "sentence": "I moved around a lot growing up, graduated in 06"
    },
    {
        "subreddit": "news",
        "sentence": "History in the south is extremely different from everywhere else"
    },
    {
        "subreddit": "news",
        "sentence": "Civil war was fought for states rights was the wildest thing I had ever heard in my 13 years of life when I ended up in a Georgia public school."
    },
    {
        "subreddit": "news",
        "sentence": "I was outraged on both detentions but I think that comment has a lot of validity."
    },
    {
        "subreddit": "news",
        "sentence": "Treason is a very specific charge and, in this case, would be really hard to prove."
    },
    {
        "subreddit": "news",
        "sentence": "MoA was built to be a mall"
    },
    {
        "subreddit": "news",
        "sentence": "Meadowlands was built to skim public funds"
    },
    {
        "subreddit": "news",
        "sentence": "Yeah but if Turks and Caicos values any relationship with US tourists, they’re not gonna throw the book at him"
    },
    {
        "subreddit": "news",
        "sentence": "That would be like suicide for the industry."
    },
    {
        "subreddit": "news",
        "sentence": "It’s more like we just hand over money so they can buy from us"
    },
    {
        "subreddit": "news",
        "sentence": "If we just GAVE them the weapons, there would be no profiting off taxpayer money."
    },
    {
        "subreddit": "news",
        "sentence": "Yea, should they have waited until he had been stabbed to death to take down the attacker? Or risk shooting the victim which would be a smaller wound and higher chance of survival?\n\n\nThere's no perfect solution, they didn't have time to figure out the best answer"
    },
    {
        "subreddit": "news",
        "sentence": "They just knew if they didn't shoot the attacker the victim would be dead from bleeding out instead of being in critical condition right now"
    },
    {
        "subreddit": "news",
        "sentence": "[Four Proud Boy were convicted of \"seditious conspiracy\"](https://www.nbcnews.com/politics/justice-department/jury-reaches-verdict-proud-boys-seditious-conspiracy-trial-rcna81129) though"
    },
    {
        "subreddit": "news",
        "sentence": "Sentencing hasn't occurred yet."
    },
    {
        "subreddit": "news",
        "sentence": "But then people would go there and the owners would have to staff it and run it properly"
    },
    {
        "subreddit": "news",
        "sentence": "Silly rabbit"
    },
    {
        "subreddit": "news",
        "sentence": "> a critical care nurse.\n\nHe flies on-board a Focker"
    },
    {
        "subreddit": "news",
        "sentence": "You cannot possibly be a serious person"
    },
    {
        "subreddit": "news",
        "sentence": "Get help."
    },
    {
        "subreddit": "news",
        "sentence": "He didn't do this crime as a cop, or even off duty"
    },
    {
        "subreddit": "news",
        "sentence": "He was retired"
    },
    {
        "subreddit": "news",
        "sentence": "Not a cop."
    },
    {
        "subreddit": "news",
        "sentence": "> Opening a mall during a pandemic\n\nIt's been in development for over 25 years"
    },
    {
        "subreddit": "news",
        "sentence": "Does anyone know what happened to the post on The Guardian article about Mossad threatening the woman from the ICC and her family? I can't find it on this sub anymore.\n\nAnother Redditor said pro-Palestine posts on this sub always get locked/removed"
    },
    {
        "subreddit": "news",
        "sentence": "I thought that sounded like a ridiculous conspiracy theory, but it is weird I can't find any posts here about The Guardian's story any more"
    },
    {
        "subreddit": "news",
        "sentence": "It's a major news story."
    },
    {
        "subreddit": "news",
        "sentence": "Cathedrals don't pay taxes"
    },
    {
        "subreddit": "news",
        "sentence": "In many countries they still receive taxes from the gov't"
    },
    {
        "subreddit": "news",
        "sentence": "Thank you for your time."
    },
    {
        "subreddit": "news",
        "sentence": "The fuck does this mean? they're literally palestinians."
    },
    {
        "subreddit": "news",
        "sentence": "Oh the irony of you calling them dense here"
    },
    {
        "subreddit": "news",
        "sentence": "And the confederate flag should be a symbol of treason and not be owned and displayed by anyone civilian"
    },
    {
        "subreddit": "news",
        "sentence": "Encased in a musem only as a reminder of the vileness of slavery and the grotesque atrocities that were forced on them"
    },
    {
        "subreddit": "news",
        "sentence": "I am white and I fully agree for reparations to Native Americans and African Americans"
    },
    {
        "subreddit": "news",
        "sentence": "I disowned the part of my family from MS because of all the racist hate they spewed at me at age 12 wasn't hard to figure out at that age how wrong it is"
    },
    {
        "subreddit": "news",
        "sentence": "I am emabarassed to have had any family from MS and that thought slavery was normal"
    },
    {
        "subreddit": "news",
        "sentence": "I am proud of my  Viking heritage on the other side of my family and that is where I respect my ancestors"
    },
    {
        "subreddit": "news",
        "sentence": "If everyone took a DNA test for your heritatge you be surprised how interacial we all are."
    },
    {
        "subreddit": "news",
        "sentence": "As a European I would guess OP is from the southern regions and you are from the north/outside the US?     \n    \nOr OP went to some weird private conservative school"
    },
    {
        "subreddit": "news",
        "sentence": "The faux outrage here is very entertaining"
    },
    {
        "subreddit": "news",
        "sentence": "That thing has been a pit of corruption since it was dreamed up"
    },
    {
        "subreddit": "news",
        "sentence": "How many times has it gone bankrupt?  How many owners has it gone through?  It's just a way for NJ political contributors to make bank"
    },
    {
        "subreddit": "news",
        "sentence": "It used to be called Xanadu.\n\n>Swiftly fly the years"
    },
    {
        "subreddit": "news",
        "sentence": "Twenty-three years, to be precise"
    },
    {
        "subreddit": "news",
        "sentence": "That's how long American Dream — a.k.a"
    },
    {
        "subreddit": "news",
        "sentence": "Xanadu, a.k.a"
    },
    {
        "subreddit": "news",
        "sentence": "Meadowlands Mills — has been in development, since the notion of a gigantic Meadowlands entertainment complex was first broached in…\n\n>When was it? 1996?  Seriously?\n\n>Plenty of seedlings have turned to sunflowers in the years — now decades — during which politicians, financiers, environmentalists, and giant mega-corporations squabbled over that gleaming white pleasure dome in the Jersey marshes"
    },
    {
        "subreddit": "news",
        "sentence": "Four presidents have come, and three have gone, during those years"
    },
    {
        "subreddit": "news",
        "sentence": "There were kids, not yet born in 1996, who are now old enough to order a drink at the \"For the Win Gastropub\" when American Dream finally — finally! — opens\n\n[Times have changed since 1996, when the American Dream mall plan was pitched"
    },
    {
        "subreddit": "news",
        "sentence": "Here's how](https://www.northjersey.com/story/news/bergen/east-rutherford/2019/09/24/american-dream-mall-nj-1996-2019-historic-timeline/2386154001/)"
    },
    {
        "subreddit": "news",
        "sentence": "“They had weapons nearby something something, human shields something something, Hamas leader there maybe, and Oct 7 or whatevs.”"
    },
    {
        "subreddit": "news",
        "sentence": "Well I agree, I just was surprised the judge had the ability to make that decision since the news was painting it like the minimum sentence applied."
    },
    {
        "subreddit": "news",
        "sentence": "better someone else builds that thing."
    },
    {
        "subreddit": "news",
        "sentence": "Just don't sleep with the life jacket inflated"
    },
    {
        "subreddit": "news",
        "sentence": "It’s pretty clear none of you have watched the J6 tapes."
    },
    {
        "subreddit": "news",
        "sentence": "Makes me more arrow dynamic when I run"
    },
    {
        "subreddit": "news",
        "sentence": "This received a laying in bed ovation"
    },
    {
        "subreddit": "news",
        "sentence": "Full 10/10 chuckle"
    },
    {
        "subreddit": "news",
        "sentence": "Nothing in there is false"
    },
    {
        "subreddit": "news",
        "sentence": "I wonder which states/countries laws apply"
    },
    {
        "subreddit": "news",
        "sentence": "Not all places have Good Samaritan laws"
    },
    {
        "subreddit": "news",
        "sentence": "Where the plane took off from? Is? Was registered.\n\nIs anyone on this plane an attorney?!"
    },
    {
        "subreddit": "news",
        "sentence": "That's awesome about the stadium"
    },
    {
        "subreddit": "news",
        "sentence": "I ended up not going to a lot of sporting events because of it"
    },
    {
        "subreddit": "news",
        "sentence": "I've been going to rugby games here and there more than baseball or football as a result."
    },
    {
        "subreddit": "news",
        "sentence": "they play smaller stadiums and less peanut mess in those"
    },
    {
        "subreddit": "news",
        "sentence": "Or maybe, just maybe if that’s a thing that happens to you on the regular, maybe you’re just not the type of person that should own guns or ammunition?"
    },
    {
        "subreddit": "news",
        "sentence": "The police have oversight of police procedures."
    },
    {
        "subreddit": "news",
        "sentence": "Afterwards numb nuts."
    },
    {
        "subreddit": "news",
        "sentence": "No, I am literally curious since it's basically domestic terrorism"
    },
    {
        "subreddit": "news",
        "sentence": "So here I am wondering if that puts you on the forever no fly list domestically at least."
    },
    {
        "subreddit": "news",
        "sentence": "I would have expected the robot dogs to be carrying small mortar systems rather than a gun"
    },
    {
        "subreddit": "news",
        "sentence": "Imagine a roving pack capable of shelling a suburb"
    },
    {
        "subreddit": "news",
        "sentence": "Drones seem like they'd be a better fit for guns or small explosives like we're seeing in the Russia-Ukraine war, essentially as you described."
    },
    {
        "subreddit": "news",
        "sentence": "In the article the judge said that it would have been unjustified to use the minimum sentence given the circumstances."
    },
    {
        "subreddit": "news",
        "sentence": "Where he gonna fly from prison?"
    },
    {
        "subreddit": "news",
        "sentence": "I'm sure tiktok has all the info you need for a well balanced worldview 🫠"
    },
    {
        "subreddit": "news",
        "sentence": "This sub is bots or brain rot"
    },
    {
        "subreddit": "news",
        "sentence": "Not sure which"
    },
    {
        "subreddit": "news",
        "sentence": "I can’t wait to watch the dramatization on Netflix!"
    },
    {
        "subreddit": "news",
        "sentence": "Hand me the scalpels, im a chiropractor!"
    },
    {
        "subreddit": "news",
        "sentence": "Yikes you are a gross person"
    },
    {
        "subreddit": "news",
        "sentence": "I thought the law was about any importation, not whether it was intentional or not."
    },
    {
        "subreddit": "news",
        "sentence": "To be accurate of Germany after the Holocaust they have the arrifacts underground covered in glass it's resoectful to the millions who were murdered to not step on the glass but respectfully walk around it and not  over it."
    },
    {
        "subreddit": "news",
        "sentence": "Obama had it"
    },
    {
        "subreddit": "news",
        "sentence": "He said it was his first priority when he takes office"
    },
    {
        "subreddit": "news",
        "sentence": "And then he said meh"
    },
    {
        "subreddit": "news",
        "sentence": "So yeah, fuck him"
    },
    {
        "subreddit": "news",
        "sentence": "https://youtu.be/gSV35A1cQDM?feature=shared"
    },
    {
        "subreddit": "news",
        "sentence": "The minimum sentence makes sense if it was proven to be intentionally smuggled in"
    },
    {
        "subreddit": "news",
        "sentence": "All 5 people’s cases in the article indicate they were unintentionally smuggled in, so yeah it doesn’t make sense to set 12 years as the minimum in those situations."
    },
    {
        "subreddit": "news",
        "sentence": "Good Samaritan laws don’t exist in all places…"
    },
    {
        "subreddit": "news",
        "sentence": "That’s exactly the point"
    },
    {
        "subreddit": "news",
        "sentence": "They’re not going to know the laws in all places and whether they’re protected or not"
    },
    {
        "subreddit": "news",
        "sentence": "It’s just not worth the risk in most cases."
    },
    {
        "subreddit": "news",
        "sentence": "Poseidon is Hamas"
    },
    {
        "subreddit": "news",
        "sentence": "And kayakers either give way or ran over."
    },
    {
        "subreddit": "news",
        "sentence": "“Hi I need some help researching how to target good people for a ransom scheme.”\n\n“Patent law is right over… THIS IS A STING! HANDS IN THE AIR! Now, you move a muscle and I’ll shush you so hard your grandchildren will be born slightly irritated and ashamed.”"
    },
    {
        "subreddit": "news",
        "sentence": "It will continue until voters stop putting up with it"
    },
    {
        "subreddit": "news",
        "sentence": "The city of Sturgeon is full of elected officials who all enabled this to happen and have the power to do something about it"
    },
    {
        "subreddit": "news",
        "sentence": "Crying about cops not controlling cops is useless"
    },
    {
        "subreddit": "news",
        "sentence": "They don't have to answer to you"
    },
    {
        "subreddit": "news",
        "sentence": "The elected officials do."
    },
    {
        "subreddit": "news",
        "sentence": "At least $320 million are gone for a pier that nobody wanted except the US."
    },
    {
        "subreddit": "news",
        "sentence": "Great"
    },
    {
        "subreddit": "news",
        "sentence": "Now if they can just do some thing about their murderous governor."
    },
    {
        "subreddit": "news",
        "sentence": "The AI aren’t exactly programmed in a way that would make that easy"
    },
    {
        "subreddit": "news",
        "sentence": "One could put a wrapper around it which tries to detect if the user is trying to get the model to make that kind of image, and if so, prevent it, but, if it is an open weights model people could just remove the wrapper, and even if not people would likely be able to evade it"
    },
    {
        "subreddit": "news",
        "sentence": "Another way would be to try to train the actual thing generating the images to not generate things like that, but, I’m not sure that that would work very well? You would need to like, train it on inputs that *could* produce that kind of output, to like, produce a different kind of output instead, I think? And like...\nwell, if you then wanted to test whether that training worked, and it *hadn’t*..."
    },
    {
        "subreddit": "news",
        "sentence": "I just assumed when it said triple-murder.\n\nCops dirty their hands, real politicians (read this as scumbags that come from wealth and go into politics) get others to dirty their hands for them."
    },
    {
        "subreddit": "news",
        "sentence": "If what he was saying weren’t so dangerous I would say let him talk"
    },
    {
        "subreddit": "news",
        "sentence": "Let him dig holes for himself and make it worse"
    },
    {
        "subreddit": "news",
        "sentence": "I guess somebody is going to have to die."
    },
    {
        "subreddit": "news",
        "sentence": "\"Only\" is what makes your comment read like a defense, by the way."
    },
    {
        "subreddit": "news",
        "sentence": "You think all of Palestinians are hamas terrorists, as evident from your labeling and lack of empathy."
    },
    {
        "subreddit": "news",
        "sentence": "I had to scroll past about 1000 comments before a substantial comment and not a joke was found"
    },
    {
        "subreddit": "news",
        "sentence": "The lesson is that the US Gov doesn't actually care about the civilians dying of famine."
    },
    {
        "subreddit": "news",
        "sentence": "Check out Ryanair on Twitter"
    },
    {
        "subreddit": "news",
        "sentence": "The amount of people that say they'll never fly with them again, and their response is usually \"see you again next time for your €25 return flight from Dublin to Paris\"."
    },
    {
        "subreddit": "news",
        "sentence": "(OP was quoting a a movie.) https://www.youtube.com/watch?v=VTUrdizRZyw"
    },
    {
        "subreddit": "news",
        "sentence": "“Hi, yes"
    },
    {
        "subreddit": "news",
        "sentence": "I have a doctorate in Mathematics.”\n\nFlight Attendant: “This man is dying!”\n\n“Minus one.”"
    },
    {
        "subreddit": "news",
        "sentence": "Holy shit where is this? Not only have I never seen a spirit flight anywhere near that cheap but back like 10 years ago when I used to fly them sometimes, I found that after all the bullshit extra charges for things that other airlines give you for free it was almost the same price as something like American or southwest"
    },
    {
        "subreddit": "news",
        "sentence": "That’s also crazy expensive for southwest in my area."
    },
    {
        "subreddit": "news",
        "sentence": "I don’t think he will either"
    },
    {
        "subreddit": "news",
        "sentence": "Giving comfort to people convicted of treason disqualifies you for the presidency"
    },
    {
        "subreddit": "news",
        "sentence": "Pardoning something convicted of crimes associated with treason would be playing with fire\n\nHe will say he’s going to, and then never will or will in the last week of his presidency"
    },
    {
        "subreddit": "news",
        "sentence": "The race to make 20 unfunny puns and zingers used to be a facet of the threads, not *the* thread."
    },
    {
        "subreddit": "news",
        "sentence": "What piece of shit hacks a public library system? Seriously go fuck yourself/yourselves"
    },
    {
        "subreddit": "news",
        "sentence": "There is zero justification to hack a public service."
    },
    {
        "subreddit": "news",
        "sentence": "Bold-faced anti-semitism"
    },
    {
        "subreddit": "news",
        "sentence": "I’m shocked! Shocked I say!"
    },
    {
        "subreddit": "news",
        "sentence": "All I got right now is this box of one dozen starving, crazed weasels."
    },
    {
        "subreddit": "news",
        "sentence": "So I crawled through the twisted, burning wreckage!"
    },
    {
        "subreddit": "news",
        "sentence": "I like how both subs say that the other is bot infested as if both of them arent heavily astroturfed"
    },
    {
        "subreddit": "news",
        "sentence": "Good good I’m super happy with the way humanity is choosing to progress"
    },
    {
        "subreddit": "news",
        "sentence": "Task failed successfully"
    },
    {
        "subreddit": "news",
        "sentence": "Whenever I think about this scenario the thing that immediately comes to mind is that scene from House MD where he performs a Tracheotomy with a BIC pen."
    },
    {
        "subreddit": "news",
        "sentence": "Some people just need to get back to mindin' their own stabbin' I guess"
    },
    {
        "subreddit": "news",
        "sentence": "Best not for anyone to intervene..."
    },
    {
        "subreddit": "news",
        "sentence": "It's worse than that"
    },
    {
        "subreddit": "news",
        "sentence": "Cops don't just spring up our of the ground"
    },
    {
        "subreddit": "news",
        "sentence": "They are hired"
    },
    {
        "subreddit": "news",
        "sentence": "Somebody manages the city's department"
    },
    {
        "subreddit": "news",
        "sentence": "That person is elected"
    },
    {
        "subreddit": "news",
        "sentence": "If people want to be pissed, start making it political.\n\nProtesting police doesn't do squat when months later you forget about it and vote on a city candidate based on some other inane bullshit."
    },
    {
        "subreddit": "news",
        "sentence": "I’ve worked with plenty of federal grants and just because something is awarded doesn’t mean the whole thing always gets spent"
    },
    {
        "subreddit": "news",
        "sentence": "Sometimes you can finish a project and have remaining funds"
    },
    {
        "subreddit": "news",
        "sentence": "I don’t know how it works when it is federal setting aside funds for itself (I work at a state accountant level), but i’m assuming they would have it under a broader appropriation to pool money towards if the project isn’t entirely expensed."
    },
    {
        "subreddit": "news",
        "sentence": "Why is this all over the news"
    },
    {
        "subreddit": "news",
        "sentence": "Who cares ?"
    },
    {
        "subreddit": "news",
        "sentence": "The length humans will go to kill their fellow man"
    },
    {
        "subreddit": "news",
        "sentence": "We investigated ourselves and we found we did nothing wrong...again."
    },
    {
        "subreddit": "news",
        "sentence": "No I just thought that the AI would be programmed to avoid making art of that content."
    },
    {
        "subreddit": "news",
        "sentence": "So, just to be clear, SCOTUS didn't pick this case up"
    },
    {
        "subreddit": "news",
        "sentence": "That's what the news story is reporting"
    },
    {
        "subreddit": "news",
        "sentence": "Avenatti appealed to the court, and the court rejected it, leaving the lower court ruling in place"
    },
    {
        "subreddit": "news",
        "sentence": "The wording of the headline doesn't make that super clear, but it's in the second sentence of the article."
    },
    {
        "subreddit": "news",
        "sentence": "Pretty sure I remember hearing about the SPCA getting hacked a while back…"
    },
    {
        "subreddit": "news",
        "sentence": "I have this vision of the Nazi in the first Indian Jones movie “shoot zem, shoot zem both”"
    },
    {
        "subreddit": "news",
        "sentence": "They could've asked"
    },
    {
        "subreddit": "news",
        "sentence": "[https://www.dailymail.co.uk/news/article-10888965/Girl-14-nut-allergy-nearly-died-aboard-flight-passenger-ate-peanuts-despite-warning.html](https://www.dailymail.co.uk/news/article-10888965/Girl-14-nut-allergy-nearly-died-aboard-flight-passenger-ate-peanuts-despite-warning.html)"
    },
    {
        "subreddit": "news",
        "sentence": "Teeth"
    },
    {
        "subreddit": "news",
        "sentence": "I went to school in the 90s and learned slavery sucked and we fought a war to end"
    },
    {
        "subreddit": "news",
        "sentence": "Where in the fuck did you go to school?"
    },
    {
        "subreddit": "news",
        "sentence": "They've been launching mortars and rockets at them, so better the soldiers get out of harms way for a bit."
    },
    {
        "subreddit": "news",
        "sentence": "Well, it's not the smell of pepsin that gets me, it's the smell of the wild boar that has been travel by mail for 4 days in an unrefrigerated envelope:-)"
    },
    {
        "subreddit": "news",
        "sentence": ">Wenrich had gone shooting at a gun range with friends and said he forgot he was carrying the ammunition.\n\nLOL"
    },
    {
        "subreddit": "news",
        "sentence": "Anyone else remember all the people here who were **ABSOLUTELY SURE** that this was just a scam by the local authorities and who just couldn't believe that someone would be so careless with ammo?"
    },
    {
        "subreddit": "news",
        "sentence": "“Oh no we triple tapped some aid workers what a freak accident”\n\n“Oh no we burnt people alive in their tents after we destroyed their entire lives what an accident”\n\n“Oh no our tanks hit an evacuation center what an accident”"
    },
    {
        "subreddit": "news",
        "sentence": "Dude is sitting there with his polo shirt, white shorts and sperry’s in Nantucket thinking he’s a dock expert"
    },
    {
        "subreddit": "news",
        "sentence": "I had an a hole turkish man say that peanuts are rarely eaten in Turkish cuisine...."
    },
    {
        "subreddit": "news",
        "sentence": "Check your maths."
    },
    {
        "subreddit": "news",
        "sentence": "I think that's the best time to bring up issues"
    },
    {
        "subreddit": "news",
        "sentence": "It's not like anyone is going to talk about him 6 months from now."
    },
    {
        "subreddit": "news",
        "sentence": "one of these sounds significantly better than the other actually, lmao\n\n(it's the one that stops the genocide if you're having trouble figuring it out!)"
    },
    {
        "subreddit": "news",
        "sentence": "It’s literally happening under Biden as we speak lol"
    },
    {
        "subreddit": "news",
        "sentence": "Least the Dems *might* change their tune"
    },
    {
        "subreddit": "news",
        "sentence": "Winning an election would enable it."
    },
    {
        "subreddit": "news",
        "sentence": "I grew up in Fort Walton Beach and Okaloosa cops have always been the absolute worst"
    },
    {
        "subreddit": "news",
        "sentence": "Total pricks to everybody, making up charges and probable cause, roughing people up, arresting the wrong person in disputes.\n\nI hope their latest cycle of insanity gets the Feds all the way up their asses."
    },
    {
        "subreddit": "news",
        "sentence": "I'm saying its guaranteed with Trump, so your argument is silly"
    },
    {
        "subreddit": "news",
        "sentence": ">...deputies used a battering ram to enter her home while they were serving a search warrant and ordered her at gunpoint to remain nude in front of officers and the public, including her 6-year-old daughter and her 14-year-old son.\n\n>...the deputies’ actions were consistent with “established, reasonable, and generally accepted police procedure.”\n\nAnd that's precisely what's wrong with this fucking picture - that forcing a woman to stand around naked, in front of her kids and a bunch of cops, her hands zip-tied behind her - is \"generally accepted police procedure.\"  This wasn't some stone-cold killer they'd finally apprehended at great personal risk, this woman was NEVER ARRESTED OR CHARGED WITH ANYTHING."
    },
    {
        "subreddit": "news",
        "sentence": "Yes, yes, these are words I recognize and understand."
    },
    {
        "subreddit": "news",
        "sentence": "This is not accurate"
    },
    {
        "subreddit": "news",
        "sentence": "SCOTUS picks and chooses the cases it hears"
    },
    {
        "subreddit": "news",
        "sentence": "There are tens of thousands of appeals every year, and SCOTUS only hears about 70 cases, give or take"
    },
    {
        "subreddit": "news",
        "sentence": "The other guy’s question of why it *chose* to hear such an inconsequential case is completely fair"
    },
    {
        "subreddit": "news",
        "sentence": "Avenatti’s celebrity may be the only reason."
    },
    {
        "subreddit": "news",
        "sentence": "> His pension is from his Union\n\n\nIsn't it from the state?"
    },
    {
        "subreddit": "news",
        "sentence": "Lmao"
    },
    {
        "subreddit": "news",
        "sentence": "Seems you need to take your own advice bud."
    },
    {
        "subreddit": "news",
        "sentence": "Not even remotely true, there are still tons of great content creators out there making awesome short-form documentaries"
    },
    {
        "subreddit": "news",
        "sentence": "In fact I have yet to see any of these AI videos people seem to think are overrunning YouTube."
    },
    {
        "subreddit": "news",
        "sentence": "Yes, but if you’re acting within your scope then you’re generally fine"
    },
    {
        "subreddit": "news",
        "sentence": "But you’re not going to be doing anything invasive on a commercial airplane anyways, so really the most you’ll do is like check someones vital signs and ask questions + relay it to the FA so they can transmit to med advice on ground"
    },
    {
        "subreddit": "news",
        "sentence": "Most invasive would be like CPR for cardiac arrest"
    },
    {
        "subreddit": "news",
        "sentence": "There’s not many situations where you’d need to get hands on outside of this."
    },
    {
        "subreddit": "news",
        "sentence": "Well as for the WB when you teach your children tou die for a lost cause and keep killing and attacking Israelis then yeah, what do you think will happend?\n\nAs for gaza, since 2006 israel has no part in gaza strip.\n\nThey got huge amount of money, free water and electricity..\n\nThey had luxry hotels and Mercedes dealership.\nYet becuse of Islamic fantastic in control they did the 7.10.\n\nThis is the real world.."
    },
    {
        "subreddit": "news",
        "sentence": "Cop bad! Updoots to the left."
    },
    {
        "subreddit": "news",
        "sentence": "Need more signatures from US representatives on the bombs."
    },
    {
        "subreddit": "news",
        "sentence": "Wanna bet he is MAGA? I am sick of these people"
    },
    {
        "subreddit": "news",
        "sentence": "We interned the Japanese people for far less."
    },
    {
        "subreddit": "news",
        "sentence": "This man came here to circle jerk and you bastards better let him!"
    },
    {
        "subreddit": "news",
        "sentence": "Faithful and slave seems like an oxymoron"
    },
    {
        "subreddit": "news",
        "sentence": "You have to choose to be faithful."
    },
    {
        "subreddit": "news",
        "sentence": "Quick question:\nAre we paying for and delivering bombs to Israel that they in turn murder civilians with, then we in turn give those displaced and starving civilians food and aid?"
    },
    {
        "subreddit": "news",
        "sentence": "It's funny how insurance companies and the miliary take climate change seriously, yet other rednecks (like a reply to this one) just stick their heads in the sand and keep voting to make the problems worse."
    },
    {
        "subreddit": "news",
        "sentence": "Literally the most broken when paired with Momus though"
    },
    {
        "subreddit": "news",
        "sentence": "I hope those New Mexicans didn’t take the jet to learn our military secrets"
    },
    {
        "subreddit": "news",
        "sentence": "As is tradition"
    },
    {
        "subreddit": "news",
        "sentence": "See: the fact that somehow confederate traitors waltzed back into congress instead of rope dance"
    },
    {
        "subreddit": "news",
        "sentence": "A 747 flying from Honolulu to Guam \nW/moi aboard had a engine fire 40 minutes into the flight and burned like a fucking shingle factory for the 40 plus minutes it took to get back to hono"
    },
    {
        "subreddit": "news",
        "sentence": "The pilot announced that we were probably ditching at night in big seas"
    },
    {
        "subreddit": "news",
        "sentence": "He got us back, burning chunks coming by the aft cabin portholes"
    },
    {
        "subreddit": "news",
        "sentence": "Everybody had to slide down the ramps on the non burning side and we ran like motherfuckers,I was touching the ground with my big toe every three steps"
    },
    {
        "subreddit": "news",
        "sentence": "Usain bolt would have been trampled.\nAfter sprinting about a mile everybody stood there and shook"
    },
    {
        "subreddit": "news",
        "sentence": "My knees actually were knocking.\nAfter dealing with the faa, we got to bed about 6."
    },
    {
        "subreddit": "news",
        "sentence": "Yes"
    },
    {
        "subreddit": "news",
        "sentence": "Think I read 450 mil, but not not sure"
    },
    {
        "subreddit": "news",
        "sentence": "Completely insane"
    },
    {
        "subreddit": "news",
        "sentence": "Don't need a statue to know history,  knowledge is power"
    },
    {
        "subreddit": "news",
        "sentence": "Actually pick up a history book don't worry they contain pictures of these morbid statues so the actual chunk of garbage can be removed,  study civics"
    },
    {
        "subreddit": "news",
        "sentence": "If you have to stare at a statue to know about history you're uneducated and still promoting the hate and vile beliefs behind it"
    },
    {
        "subreddit": "news",
        "sentence": "And in a modern era lead by example to prevent atrocities from happening again,  these statues represent regression"
    },
    {
        "subreddit": "news",
        "sentence": "Plus it is symbolic for progression to remove them to replace them with something positive"
    },
    {
        "subreddit": "news",
        "sentence": "This whole anti woke movement is what you should worry about eradicaticating history and twisting it so no one gets uncomftorable and has their feelings hurt"
    },
    {
        "subreddit": "news",
        "sentence": "Not everything is pretty and nice in history,  that is why it's crucial to see all sides and use critical thinking skills and show the brutal truth,  the blood shed,  death and destruction of these atrocities and to remember the hate that caused them and leave those beliefs in the past only to learn from and recognize the signs and behaviors that caused them so anyone trying to reincarnate the vile behavior can be identified and shut down"
    },
    {
        "subreddit": "news",
        "sentence": "Whinning over a moronic confederate statue being removed to hinder society's progression as whole is pathetic"
    },
    {
        "subreddit": "news",
        "sentence": "Go take a trip to Germany and see how that's handled, they have banned anything Nazi, should have been done here in the US for confederate tratiorous symbols so racism can be illegal here too the oathetic kkk and neo Nazis should have been domestic terrorist groups long ago"
    },
    {
        "subreddit": "news",
        "sentence": "Staying in the American South bubble and not even studying world-wide history just shows how little has been learned and retained"
    },
    {
        "subreddit": "news",
        "sentence": "I am white and these groups are an embarrassment to be white"
    },
    {
        "subreddit": "news",
        "sentence": "I am in a bi-racial marriage and surround my self with diverse ecclectic people from all hertigages and would prefer to do so over a racist southern white person anyday."
    },
    {
        "subreddit": "news",
        "sentence": "Not American"
    },
    {
        "subreddit": "news",
        "sentence": "Everyone who is able to vote should vote."
    },
    {
        "subreddit": "news",
        "sentence": "Genocide? Lol if it was a real genocide and only 36 k casualts after 8 months you probably slow...\n\nHamas wants israel to release 6k terrorist including those who did 7.10 and international gerantee that hamas will stay in power...\n\nF.u\n\nPeople like you really loved the 7.10 you like seeing dead Israelis.\n\n\nSuck on this."
    },
    {
        "subreddit": "news",
        "sentence": "Should have used galvanized square steel with eco friendly wood veneer."
    },
    {
        "subreddit": "news",
        "sentence": "And currently"
    },
    {
        "subreddit": "news",
        "sentence": "Usa literally it's wire taps for industrial espionage."
    },
    {
        "subreddit": "news",
        "sentence": "Are you talking about adam toledo? They were completely justified in shooting that little shit, and I say that as a guy that is a big fan of police."
    },
    {
        "subreddit": "news",
        "sentence": "No, they aren't appealable"
    },
    {
        "subreddit": "news",
        "sentence": "At least not at this stage"
    },
    {
        "subreddit": "news",
        "sentence": "Interlocutory orders, like these, are not considered \"final\" orders and thus do not allow for an immediate appeal.\n\n\nWhat is notable is that Cannon appears to be deliberately avoiding issuing interlocutory orders in order to prevent the prosecution from being able to take the matter to the appeals court."
    },
    {
        "subreddit": "news",
        "sentence": ">Confederate-era monument to “faithful slaves”.."
    },
    {
        "subreddit": "news",
        "sentence": "The monument has been standing since 1902\n\nThe Confederacy was dissolved in 1865"
    },
    {
        "subreddit": "news",
        "sentence": "Hell, the Reconstruction Era was over by 1877"
    },
    {
        "subreddit": "news",
        "sentence": "This is not a \"Confederate-era\" monument"
    },
    {
        "subreddit": "news",
        "sentence": "It's a \"racists put it up in 1902\" monument"
    },
    {
        "subreddit": "news",
        "sentence": "Do people in the media know they're constantly making excuses for racists?"
    },
    {
        "subreddit": "news",
        "sentence": "Bro, if someone is actively trying to stab someone,we are past the point where a social worker would work."
    },
    {
        "subreddit": "news",
        "sentence": "WOW, so strong"
    },
    {
        "subreddit": "news",
        "sentence": "Nice GDP at work"
    },
    {
        "subreddit": "news",
        "sentence": "Russia and China are so fucked against a country that can't even make a pier."
    },
    {
        "subreddit": "news",
        "sentence": "I would imagine it's the stealth aspect"
    },
    {
        "subreddit": "news",
        "sentence": "Like sdsurf625 said, you can't fight what you never see until it's too late."
    },
    {
        "subreddit": "news",
        "sentence": ">Sauerkraut \n\n>Zelda\n\n>Chainsaw\n\n>Box of starving, crazed weasels\n\nHope this helps clear it up!"
    },
    {
        "subreddit": "news",
        "sentence": "At that point, its not really about the pilot, it's about mechanical failure that happened well before the pilot got in"
    },
    {
        "subreddit": "news",
        "sentence": "They don't let unqualified pilots fly those things."
    },
    {
        "subreddit": "news",
        "sentence": "The high score would be Biden losing the election in November"
    },
    {
        "subreddit": "news",
        "sentence": "But after that he’s irrelevant anyway"
    },
    {
        "subreddit": "news",
        "sentence": "I could see that in an episode of Black Mirror."
    },
    {
        "subreddit": "news",
        "sentence": "Not the cops"
    },
    {
        "subreddit": "news",
        "sentence": "The made up idea of 'Qualified Immunity' was fabricated to step around that little legality."
    },
    {
        "subreddit": "news",
        "sentence": "Sounds like a dream!"
    },
    {
        "subreddit": "news",
        "sentence": "People piss and moan about low cost carriers but they're basically no different - for short haul flying at least (which is the majority of low cost carrier flying)"
    },
    {
        "subreddit": "news",
        "sentence": "With its weapons range if you hear it, it’s already too late"
    },
    {
        "subreddit": "news",
        "sentence": "Radar stealth is where it excels"
    },
    {
        "subreddit": "news",
        "sentence": "As long as you act within the scope of your training yes"
    },
    {
        "subreddit": "news",
        "sentence": "You're very confused"
    },
    {
        "subreddit": "news",
        "sentence": "Read."
    },
    {
        "subreddit": "news",
        "sentence": "But they live, so there's that."
    },
    {
        "subreddit": "news",
        "sentence": "[This USA Today](https://www.usatoday.com/story/news/nation/2024/05/28/jay-ostrem-charged-centerville-south-dakota-three-men-shooting/73883635007/) article has more details.\n\n> Ostrem's wife told authorities at his nearby home that she and Paul Frankus had been drinking together on May 23 when he forcibly kissed her and exposed his genitals to her, court records say.\n> She told Ostrem about the incident Monday evening, which sent him \"raging out of the house,\" documents state."
    },
    {
        "subreddit": "news",
        "sentence": "Your empathy to an allergic reaction that can actually kill a person is truly underwhelming."
    },
    {
        "subreddit": "news",
        "sentence": "In other words yes, the pier represents a substantial amount of money going to military contractors"
    },
    {
        "subreddit": "news",
        "sentence": "How are you so dense?"
    },
    {
        "subreddit": "news",
        "sentence": "My friend got attacked by an American flag at a funeral over a mask dispute"
    },
    {
        "subreddit": "news",
        "sentence": "True story."
    },
    {
        "subreddit": "news",
        "sentence": "If you are so allergic put on a mask."
    },
    {
        "subreddit": "news",
        "sentence": "I see there’s are a lot of boot licking going on in here."
    },
    {
        "subreddit": "news",
        "sentence": "the last \"tragic incident\" is already being taken back by the IDF to \"oh well actually we didn't hit them, we hit the hamas only area and the secret weapons facility nearby caught fire and that killed those civilians! it wasn't our strike at all! it was HAMAS!\" \n\nand then they \"find\" yet another phone call conversation by Hamas the day after they do a war crime that just so happens to say exactly what supports the IDF narrative, word for word"
    },
    {
        "subreddit": "news",
        "sentence": "Amazing how they always can \"find\" or \"intercept\" a phone call just when they need it saying exactly what they want, so convenient"
    },
    {
        "subreddit": "news",
        "sentence": "like legit the phone call they \"intercepted\" for the tent massacre yesterday is just beyond parody when you listen to it, yet again just two HAMAS people calmly discussing what happened and repeating IDF talking points just in bad Arabic"
    },
    {
        "subreddit": "news",
        "sentence": "on that note, funny how they can \"find\" a phone call after a war crime they do but somehow can't ever \"intercept/find\" a phone call on any hostage or any before Oct"
    },
    {
        "subreddit": "news",
        "sentence": "7th"
    },
    {
        "subreddit": "news",
        "sentence": "Hmmmm."
    },
    {
        "subreddit": "news",
        "sentence": "“established, reasonable, and generally accepted police procedure.”\n\n-Where is it written that what they did is police procedure?  Does this mean that if the Sheriff's office writes a procedure that says they are to shoot all people on premises, before serving a warrant, that it is now \"established and acceotable\"?  \n\nGenuine question: Who has oversight of police procedures?"
    },
    {
        "subreddit": "news",
        "sentence": "Ws could always tell them to let the stuff through or no weapons?"
    },
    {
        "subreddit": "news",
        "sentence": "I was just adding more context, not defending.."
    },
    {
        "subreddit": "news",
        "sentence": "See comment above"
    },
    {
        "subreddit": "news",
        "sentence": "You were Navy"
    },
    {
        "subreddit": "news",
        "sentence": "Did you actually try to do any logistics over the shore?  Because The Marines move stuff with trucks and tracks"
    },
    {
        "subreddit": "news",
        "sentence": "If it comes off an amphib, you're good"
    },
    {
        "subreddit": "news",
        "sentence": "Otherwise, you'd best capture an airfield or a port or in 90 days you're fucked.\n\nThe biggest Army landing craft would handle maybe 6 trucks"
    },
    {
        "subreddit": "news",
        "sentence": "A USMC LCAC, perhaps 4, a LCU, two"
    },
    {
        "subreddit": "news",
        "sentence": "And OBTW, I hope that truck can get off the ramp and up the first 50 feet of beach"
    },
    {
        "subreddit": "news",
        "sentence": "The reason they built JLOTS is because once the Army gets involved they require a metric shit ton of stuff per troop, per day"
    },
    {
        "subreddit": "news",
        "sentence": "\"light\" isn't in their vocabulary.\n\nLast time I checked, sea freight doesn't come with a truck attached.\n\nIts not like this isn't anticipated"
    },
    {
        "subreddit": "news",
        "sentence": "Surely you've heard about the Mulberrys used after D-Day"
    },
    {
        "subreddit": "news",
        "sentence": "Those sunk in a storm too"
    },
    {
        "subreddit": "news",
        "sentence": "They had hundreds of landing craft"
    },
    {
        "subreddit": "news",
        "sentence": "They didn't use them as the primary means of moving stuff because you can't move enough stuff with them"
    },
    {
        "subreddit": "news",
        "sentence": "That's why they wanted Caen - deep water port."
    },
    {
        "subreddit": "news",
        "sentence": "No, the articles are quite clear that a severe reaction from airborne exposure has never been proven to be a thing, mild reactions have, but that is what is incredibly rare"
    },
    {
        "subreddit": "news",
        "sentence": "It seems all the peanut free school rules were a huge overreaction, which is probably why they got way less strict between 2008 (when my oldest kids started elementary) and 2020 (when my youngest was last in an elementary school)."
    },
    {
        "subreddit": "news",
        "sentence": "I just tell them what I am willing to pay and they can call me if they want the sale.\n\nProbably wouldn’t have worked during Covid shortages but it generally does the trick"
    },
    {
        "subreddit": "news",
        "sentence": "For better impact go at the end of the month when their sales numbers are due."
    },
    {
        "subreddit": "news",
        "sentence": "Did they give the slaves a pizza party? That's real appreciation of the people that slave for you."
    },
    {
        "subreddit": "news",
        "sentence": "So, were you outraged over this guy but not Brittany Griner? Honest question."
    },
    {
        "subreddit": "news",
        "sentence": "Whoever is responsible can go take a long walk off a temporary pier"
    },
    {
        "subreddit": "news",
        "sentence": "Yeah, straight-up treason should have its consequences"
    },
    {
        "subreddit": "news",
        "sentence": "I can't believe the charges were so weak in general"
    },
    {
        "subreddit": "news",
        "sentence": "They all should have been charged as accessories to murder at least."
    },
    {
        "subreddit": "news",
        "sentence": "Hey, I haven't seen a Unidan reference in forever.\n\nFun fact: this July 30th (just over 2 months away) is the 10th anniversary of the Unidan jackdaw comment and subsequent banning"
    },
    {
        "subreddit": "news",
        "sentence": "Time flies."
    },
    {
        "subreddit": "news",
        "sentence": "Good Samaritan laws protect people like this if i remember correctly."
    },
    {
        "subreddit": "news",
        "sentence": "I don't know about that, Governor Noem seems like a nice lady."
    },
    {
        "subreddit": "news",
        "sentence": "Yes it can, I’ve worked on these off the Pacific, Atlantic, and Indian ocean"
    },
    {
        "subreddit": "news",
        "sentence": "As long as the doctor doesn’t receive compensation for helping, they should be protected by Good Samaritan laws"
    },
    {
        "subreddit": "news",
        "sentence": "Of course, the doctor helping should not be inebriated or otherwise helping in a state that they shouldn’t be practicing medicine"
    },
    {
        "subreddit": "news",
        "sentence": "They’re protected as long as their help wasn’t gross negligence or willful misconduct."
    },
    {
        "subreddit": "news",
        "sentence": "I actually worked on the Navys version of this with the SEABEEs, the only thing I can confirm right now is the shit storm someone is getting"
    },
    {
        "subreddit": "news",
        "sentence": "Rule number 3"
    },
    {
        "subreddit": "news",
        "sentence": "Of firearm safety.\n\nIdentify your target, and what is behind it."
    },
    {
        "subreddit": "news",
        "sentence": "JetBlue flies the A321NEO from JFK to London Gatwick, and reverse"
    },
    {
        "subreddit": "news",
        "sentence": "Sounds pretty bad, but they also have a legit business class (full individual lie back compartments, included drinks and dining) which is usually the cheapest business class you can book"
    },
    {
        "subreddit": "news",
        "sentence": "No lounge though.\n\n\nBut still a narrow body for a transatlantic flight sounds rough."
    },
    {
        "subreddit": "news",
        "sentence": "I figure every robot deserves a warm meal"
    },
    {
        "subreddit": "news",
        "sentence": "It is the loudest aircraft I have ever heard by far and I live by an active airbase and went to a college located on an airport"
    },
    {
        "subreddit": "news",
        "sentence": "It is crazy how incredibly loud it is, guess stealth doesn't need to apply to sound since if you hear it and it's coming for you the bombs or missiles are already on their way."
    },
    {
        "subreddit": "news",
        "sentence": "Apparently Hamas has claimed responsibility"
    },
    {
        "subreddit": "news",
        "sentence": "As someone who worked on these with the SEABEEs, they definitely do not break in the waves often but I was on a craft in the waves and our bottom was punctured by an anchor trying to remove one from a stabbed beach so weird shit does happen lol"
    },
    {
        "subreddit": "news",
        "sentence": "It’s called a joke you goobers"
    },
    {
        "subreddit": "news",
        "sentence": "So many downvotes"
    },
    {
        "subreddit": "news",
        "sentence": "Get a life."
    },
    {
        "subreddit": "news",
        "sentence": "Is this an attempt at a minimization of what he did?"
    },
    {
        "subreddit": "news",
        "sentence": "To hell with your “experts”"
    },
    {
        "subreddit": "news",
        "sentence": "You're commenting on a thread where the guy HAS BEEN CONVICTED AND LOST HIS APPEAL"
    },
    {
        "subreddit": "news",
        "sentence": "Good job keeping up bud."
    },
    {
        "subreddit": "news",
        "sentence": "Yes, but it's not some new novel piece of equipment especially built for this operation"
    },
    {
        "subreddit": "news",
        "sentence": "Sorry if my comment was too much hyperbole"
    },
    {
        "subreddit": "news",
        "sentence": "Trying to argue that somebody war profiteering off some old pier is likely not happening."
    },
    {
        "subreddit": "news",
        "sentence": "Back in the good ol days the romans could build a bridge in a day that an entire army could use to cross."
    },
    {
        "subreddit": "news",
        "sentence": "Hamas escaping folks nothing to see here"
    },
    {
        "subreddit": "news",
        "sentence": "Just an evacuation route for Hamas"
    },
    {
        "subreddit": "news",
        "sentence": "/s"
    },
    {
        "subreddit": "news",
        "sentence": "If you cut out the middle person of insurance companies and replaced it with universal health care you would actually pay less"
    },
    {
        "subreddit": "news",
        "sentence": "Its just the middle man wants their (large) cut"
    },
    {
        "subreddit": "news",
        "sentence": "The f-35 program will cost 2 trillion over 88 years"
    },
    {
        "subreddit": "news",
        "sentence": "The us government spends around 2 trillion a year in healthcare"
    },
    {
        "subreddit": "news",
        "sentence": "This is not the reason why we don’t have universal healthcare"
    },
    {
        "subreddit": "news",
        "sentence": "It’s me   \nit’s me    \nit’s Ernest T"
    },
    {
        "subreddit": "news",
        "sentence": "“We’re sorry you don’t like it” is likely accurate"
    },
    {
        "subreddit": "news",
        "sentence": "my guess is it's history"
    },
    {
        "subreddit": "news",
        "sentence": "i'd say put it in a museum or something because like yeah its not good to have but also you shouldn't get rid of everything that you're not proud of"
    },
    {
        "subreddit": "news",
        "sentence": "Yeah just don’t vote at all, that’ll show em!"
    },
    {
        "subreddit": "news",
        "sentence": "This is great training and experience for the guys working on this"
    },
    {
        "subreddit": "news",
        "sentence": "I mean how often do they get to do a project this size ."
    },
    {
        "subreddit": "news",
        "sentence": "https://www.bbc.com/news/articles/cz9950n003yo\n\n> Right-wing activists, including Jewish settlers living in the occupied West Bank, have uploaded dozens of videos of crowds, including some very young children, hurling food onto the ground and stamping on boxes of aid.\n\n> “It’s important to stop the aid,” one activist says"
    },
    {
        "subreddit": "news",
        "sentence": "“It’s the only way we’ll win"
    },
    {
        "subreddit": "news",
        "sentence": "The only way we’ll get our hostages back.”\n\n> Many argue that Gazans should receive nothing while Israeli hostages remain in captivity, and that providing aid to Gaza merely serves to prolong the war.\n\n> In one video, a group of jubilant protesters dance and celebrate on top of a looted lorry.\nIn another, one of the stranded lorries is ablaze.\n\n> Other videos show Israeli vigilantes stopping lorries in Jerusalem and demanding that drivers show papers proving they are not transporting aid to Gaza"
    },
    {
        "subreddit": "news",
        "sentence": "Their faces are uncovered and they appear to be acting with complete impunity.\n\n> In the West Bank, at least two drivers who were not carrying goods bound for Gaza were dragged from their cabs and beaten."
    },
    {
        "subreddit": "news",
        "sentence": "What does this have to do with the case in particular?"
    },
    {
        "subreddit": "news",
        "sentence": "It’s better that way, in my opinion."
    },
    {
        "subreddit": "news",
        "sentence": "Then you should either work on becoming a responsible owner or give up the hobby if that’s too much fucking work for you"
    },
    {
        "subreddit": "news",
        "sentence": "I swear American gun culture is just the absolute fucking worst in the world."
    },
    {
        "subreddit": "news",
        "sentence": "That was funny, redditers are such wieners"
    },
    {
        "subreddit": "news",
        "sentence": "Fun fact, they’re cheaper than a new F15EX, and likely cheaper than an F18 Super Hornet as well at this point."
    },
    {
        "subreddit": "news",
        "sentence": "Shouldn't have broken the law."
    },
    {
        "subreddit": "news",
        "sentence": "Does this open you up to liability as well?"
    },
    {
        "subreddit": "news",
        "sentence": "Go ahead and make that mistake responsible gun owner.\n\nActions have consequences."
    },
    {
        "subreddit": "news",
        "sentence": "It's approaching 1 million flight hours, this a whole lot of flight hours compared to accidents"
    },
    {
        "subreddit": "news",
        "sentence": "But the number of crashes is going up, its just going down as a percentage of flights because there are more of them"
    },
    {
        "subreddit": "news",
        "sentence": "And that would put American troops on the beach"
    },
    {
        "subreddit": "news",
        "sentence": "Also, while there are a few larger landing craft, short of having a specialized Navy logistics ship or an Amphib with a well deck, just how do you propose loading those landing craft?  With a crane?  And then another one on the beach to offload?\n\nAt least bother to read up on the subject"
    },
    {
        "subreddit": "news",
        "sentence": "Can't fucking believe morons upvoted your comment."
    },
    {
        "subreddit": "news",
        "sentence": "What does \"this state\" even mean? The state government? The people in your town? Everyone you've ever met in state?"
    },
    {
        "subreddit": "news",
        "sentence": "“Because I was inverted” -maverick"
    },
    {
        "subreddit": "news",
        "sentence": "Got you"
    },
    {
        "subreddit": "news",
        "sentence": "The technology leap is too immense, which of course would come with time"
    },
    {
        "subreddit": "news",
        "sentence": "And that it's all about Beyond Visual Range fighting now"
    },
    {
        "subreddit": "news",
        "sentence": "May the skies remain in friendly hands."
    },
    {
        "subreddit": "news",
        "sentence": "Wow, what a nightmare to visualize right before bed 🫠"
    },
    {
        "subreddit": "news",
        "sentence": "Sea water doesn't burn hot enough to melt piers man!"
    },
    {
        "subreddit": "news",
        "sentence": "So much for responsible gun owners."
    },
    {
        "subreddit": "news",
        "sentence": "False flag"
    },
    {
        "subreddit": "news",
        "sentence": "“The bad guys did it, honest!”"
    },
    {
        "subreddit": "news",
        "sentence": "Complete with that iconic expression?"
    },
    {
        "subreddit": "news",
        "sentence": "So you’re saying either way the genocide continues? Then American democracy is rotten to the core"
    },
    {
        "subreddit": "news",
        "sentence": "Damned if you do, damned if you dont"
    },
    {
        "subreddit": "news",
        "sentence": "carry on bombing the hostages?"
    },
    {
        "subreddit": "news",
        "sentence": "It’s not"
    },
    {
        "subreddit": "news",
        "sentence": "It happens"
    },
    {
        "subreddit": "news",
        "sentence": "If you have a bad enough allergy to them"
    },
    {
        "subreddit": "news",
        "sentence": "It might be rare but it happens.\n\nActually read the article, that’s what it says"
    },
    {
        "subreddit": "news",
        "sentence": "Interesting reading though"
    },
    {
        "subreddit": "news",
        "sentence": "At school when we were young we weren’t allowed to bring PB&J sandwiches bc a kid in our lunchroom was allergic"
    },
    {
        "subreddit": "news",
        "sentence": "(If we did bring them we had to eat out in a special area supervised and our parents had to write on our lunch that it contained PB)"
    },
    {
        "subreddit": "news",
        "sentence": "But I suspect it was more so bc the parents couldn’t trust that he wouldn’t trade with someone."
    },
    {
        "subreddit": "news",
        "sentence": "The difference between do shit and plan and then do shit."
    },
    {
        "subreddit": "news",
        "sentence": "Improves gas efficiency"
    },
    {
        "subreddit": "news",
        "sentence": "That seems to be a myth"
    },
    {
        "subreddit": "news",
        "sentence": "There is no evidence other people eating peanuts can cause severe reactions.\n\nhttps://healthtalk.unchealthcare.org/can-simply-smelling-peanuts-cause-an-allergic-reaction/amp/\n\nhttps://ki.se/en/research/airborne-exposure-to-peanuts-did-not-produce-severe-reactions"
    },
    {
        "subreddit": "news",
        "sentence": "Captain *Salty*"
    },
    {
        "subreddit": "news",
        "sentence": "Most ammo isn’t magnetic."
    },
    {
        "subreddit": "news",
        "sentence": "Oh yeah! SPAREJET airlines Most Variable Pilot Award winner"
    },
    {
        "subreddit": "news",
        "sentence": "Masterful"
    },
    {
        "subreddit": "news",
        "sentence": "Just.."
    },
    {
        "subreddit": "news",
        "sentence": "fucking masterful"
    },
    {
        "subreddit": "news",
        "sentence": "Well done."
    },
    {
        "subreddit": "news",
        "sentence": "Now we blame everything on \"them,\" nothing has changed."
    },
    {
        "subreddit": "news",
        "sentence": "JLOTs is exercised every couple of years"
    },
    {
        "subreddit": "news",
        "sentence": "They used it in 2021 in Albania"
    },
    {
        "subreddit": "news",
        "sentence": "I believe it was last used in 23"
    },
    {
        "subreddit": "news",
        "sentence": "That was a 5 second google search."
    },
    {
        "subreddit": "news",
        "sentence": "That's right, and then the armed forces operate them"
    },
    {
        "subreddit": "news",
        "sentence": "On complicated stuff, like aircraft, ships, etc, depot maintenance is done by contractors, otherwise, its done by the armed forces themselves."
    },
    {
        "subreddit": "news",
        "sentence": "I want to see those traitor statues melted down and recast as a [big-ass statue of John Brown in all his glory](https://www.onthisdeity.com/wp-content/uploads/2010/10/hf-john-brown.jpg)."
    },
    {
        "subreddit": "news",
        "sentence": "You've been here for 12 years and you still have no idea how this site works"
    },
    {
        "subreddit": "news",
        "sentence": "Pull the stick out of your ass, dawg."
    },
    {
        "subreddit": "news",
        "sentence": "Wasn’t there a nice black mirror episode about security robots with guns? Seems like fun guys …"
    },
    {
        "subreddit": "news",
        "sentence": "As a SC democrat I am no fan of train wreck \n\nHowever everyone should agree that Hamas needs to be destroyed"
    },
    {
        "subreddit": "news",
        "sentence": "The plane is becoming more common now"
    },
    {
        "subreddit": "news",
        "sentence": "We ordered like an additional 1800 more to add into the 600 already in service."
    },
    {
        "subreddit": "news",
        "sentence": "Hell yeah"
    },
    {
        "subreddit": "news",
        "sentence": "His ejection was only at Mach 10 though."
    },
    {
        "subreddit": "news",
        "sentence": "Both times I’ve stood up on the flight it was kinda like this"
    },
    {
        "subreddit": "news",
        "sentence": "First was AMS likely secondary to heat exhaustion"
    },
    {
        "subreddit": "news",
        "sentence": "Second was a geriatric who likely had an episode of orthostatic hypotension"
    },
    {
        "subreddit": "news",
        "sentence": "I don’t jump out of my seat anymore unless they can’t find anyone because 1"
    },
    {
        "subreddit": "news",
        "sentence": "I’m not a doctor and 2"
    },
    {
        "subreddit": "news",
        "sentence": "It’s been awhile since I’ve worked hands on primary care and emergency medicine"
    },
    {
        "subreddit": "news",
        "sentence": "But if they can’t find anyone I will because I have integrity and my conscience wouldn’t let me live it down if something truly awful were to happen and I may have been able to help."
    },
    {
        "subreddit": "news",
        "sentence": "Yea and everyone can just throw away weapons and live happily together"
    },
    {
        "subreddit": "news",
        "sentence": "Stop all wars and pursue everlasting peace.\n\nWait.."
    },
    {
        "subreddit": "news",
        "sentence": "What were we talking about again?"
    },
    {
        "subreddit": "news",
        "sentence": "Way to Spear-it captain"
    },
    {
        "subreddit": "news",
        "sentence": "Spearhead Airlines MVP"
    },
    {
        "subreddit": "news",
        "sentence": "The fact that you think even 20 years is reasonable is showing the propaganda is still working.\n\nIt should've been life without parole, if not outright the death penalty"
    },
    {
        "subreddit": "news",
        "sentence": "For all of them."
    },
    {
        "subreddit": "news",
        "sentence": "It they move more right, to capture \"moderate\" Republicans and Independents"
    },
    {
        "subreddit": "news",
        "sentence": "Regardless, the genocide as you out it definitely would continue for atleast 4 years with Trump"
    },
    {
        "subreddit": "news",
        "sentence": "Its a silly argument"
    },
    {
        "subreddit": "news",
        "sentence": "What a waste of money, but, that's what our Government does."
    },
    {
        "subreddit": "news",
        "sentence": "The plan from the beginning has been to exterminate them"
    },
    {
        "subreddit": "news",
        "sentence": "It is time for people to wake the fuck up and realize that Israel does not distinguish between Gazans and Hamas"
    },
    {
        "subreddit": "news",
        "sentence": "They say Hamas, but that means something different to them that it does for a majoruty of other people"
    },
    {
        "subreddit": "news",
        "sentence": "Stop believing the rhetoric and look at the remarkably consistent actions taken by Israel."
    },
    {
        "subreddit": "news",
        "sentence": "Yeah it’s for serious adrenaline junkies only."
    },
    {
        "subreddit": "news",
        "sentence": "The fact that even a single treasonous shit didn't get a sentence of behind bars for the rest of their lives, or the fate on that day of their hero who almost endangered legitimate peoples lives is an afront to justice itself.\n\nThese people deserve to be locked up and never looked at again."
    },
    {
        "subreddit": "news",
        "sentence": "I don't know if you've noticed, but the sentences being handed down have been gradually getting longer"
    },
    {
        "subreddit": "news",
        "sentence": "You start with the small fry and work your way up, seeing if you can get anyone to roll on someone further up the chain"
    },
    {
        "subreddit": "news",
        "sentence": "At last check, 718 people have been charged with federal crimes and will likely see some time"
    },
    {
        "subreddit": "news",
        "sentence": "Idiots probably didn't even realize because they were on federal property, *all* their crimes were federal.\n\nThe feds generally only prosecute for crimes they know they can prove"
    },
    {
        "subreddit": "news",
        "sentence": "Most of these people are just patsies anyway"
    },
    {
        "subreddit": "news",
        "sentence": "They're being thrown under the bus.\n\nWould I like to see people of power being charged? Hell fucking yes"
    },
    {
        "subreddit": "news",
        "sentence": "But the people in power are in charge of charging people in power"
    },
    {
        "subreddit": "news",
        "sentence": "Do you not see how that's a no-win situation? \n\nAnd you are correct"
    },
    {
        "subreddit": "news",
        "sentence": "If Trump loses you can expect violence"
    },
    {
        "subreddit": "news",
        "sentence": "They've essentially already said they will"
    },
    {
        "subreddit": "news",
        "sentence": "This November is going to be the biggest turning point the country has seen"
    },
    {
        "subreddit": "news",
        "sentence": "Will we remain a democracy or will be become an authoritarian theocracy?"
    },
    {
        "subreddit": "news",
        "sentence": "But some of them go on to shoot down 5 MIGs afterwards, while also dating Jennifer Connelly, mending their relationship with Val Kilmer and Miles Teller, and putting that stuffy know it all Jon Hamm in his place."
    },
    {
        "subreddit": "news",
        "sentence": "Can someone provide a TLDNR on why the aircraft landed in a stream?"
    },
    {
        "subreddit": "news",
        "sentence": "Or Alabama, Mississippi, Texas or Georgia?"
    },
    {
        "subreddit": "news",
        "sentence": "You expect floating pier experts to use instagram?"
    },
    {
        "subreddit": "news",
        "sentence": "In philosophy"
    },
    {
        "subreddit": "news",
        "sentence": "There's no breakwater there I bet."
    },
    {
        "subreddit": "news",
        "sentence": "yup, but then the US are still going \"oh well we haven't yet seen them really go at Rafah, so it's cool no red line crossed\".."
    },
    {
        "subreddit": "news",
        "sentence": "it's beyond parody: \n\nhttps://www.youtube.com/watch?v=Q8GL-mb3ns0\n\ngoing off arguing semantics basically, blindly believing IDF and not any other news source or footage literally showing them in Rafah"
    },
    {
        "subreddit": "news",
        "sentence": "It's a joke and we know US is never going to stop giving these clowns money and weapons."
    },
    {
        "subreddit": "news",
        "sentence": "Notably less than [deaths by gun violence for that day](https://www.gunviolencearchive.org/last-72-hours)"
    },
    {
        "subreddit": "news",
        "sentence": "By half"
    },
    {
        "subreddit": "news",
        "sentence": "Actually, that's just Sunday"
    },
    {
        "subreddit": "news",
        "sentence": "By a ratio of 1:4 for the whole weekend."
    },
    {
        "subreddit": "news",
        "sentence": "So send the aid through egypt??"
    },
    {
        "subreddit": "news",
        "sentence": "They hit anything and everything they can"
    },
    {
        "subreddit": "news",
        "sentence": "Better to throw 100 darts and get one bullseye then spend a ton of time for a specific target they may not work out."
    },
    {
        "subreddit": "news",
        "sentence": "He’s just messing with them- just like last time"
    },
    {
        "subreddit": "news",
        "sentence": "He couldn’t care less about these losers."
    },
    {
        "subreddit": "news",
        "sentence": "Only @ 5% of pilots return to flight status after an ejection."
    },
    {
        "subreddit": "news",
        "sentence": ">Anyone is welcome to try\n\nIn the US foreign policy is set by the President, not by \"anyone\", and it's the US that has all the leverage here.\n\n>Israel doesn't have issues with aid,\n\nWhy lie about this? Everyone knows it's a lie, it's not remotely an issue up for debate"
    },
    {
        "subreddit": "news",
        "sentence": "So it's a really dumb thing to lie about.\n\n>Words mean very little in this context.\n\nThat is certainly true"
    },
    {
        "subreddit": "news",
        "sentence": "It is long past time for Israel to be cut off from all US arms shipments until they start acting like a civilized nation"
    },
    {
        "subreddit": "news",
        "sentence": "No more of the vague concerns, or the red lines that don't result in any action.\n\nEdit: And for the record, yes, I recognize how important it is that Biden be reelected"
    },
    {
        "subreddit": "news",
        "sentence": "Given Trump's attempted coup and his stated intention to rule as a dictator the US would be unlikely to survive as a democracy if he were elected"
    },
    {
        "subreddit": "news",
        "sentence": "Which is another reason for Biden to stop screwing this up and alienating his base, because as we know elections in the US are won on turnout and he can't afford to lose votes."
    },
    {
        "subreddit": "news",
        "sentence": "YO, this must be the same flight this dude was talking about on Twitter 2 days ago"
    },
    {
        "subreddit": "news",
        "sentence": "What a ride.\n\n\nhttps://x.com/jonxgenius/status/1794830336146493940?t=j7ToA_6d6c4KZgX3kZHjLQ&s=19"
    },
    {
        "subreddit": "news",
        "sentence": "You can bring guns and amml to Turks snd Caicos"
    },
    {
        "subreddit": "news",
        "sentence": "If you get the permits"
    },
    {
        "subreddit": "news",
        "sentence": "He didn’t."
    },
    {
        "subreddit": "news",
        "sentence": "What is this article?  It says he allegedly killed three people and then launches into sexist comments he made at a different point in time"
    },
    {
        "subreddit": "news",
        "sentence": "Are his victims women?  Is this red-pilled shit?  We kind of gathered he was a douchebag by the triple-murder part"
    },
    {
        "subreddit": "news",
        "sentence": "Where are the details?"
    },
    {
        "subreddit": "news",
        "sentence": "The old automated spine shortener"
    },
    {
        "subreddit": "news",
        "sentence": "Ejection seats and rocket aborts are only marginally better than exploding."
    },
    {
        "subreddit": "news",
        "sentence": "Depends on how his recovery goes"
    },
    {
        "subreddit": "news",
        "sentence": "His injuries are far more likely to ground him than the decision to eject."
    },
    {
        "subreddit": "news",
        "sentence": "That’s our ally!   \n\nBirds of a feather."
    },
    {
        "subreddit": "news",
        "sentence": "I also think it’s worth mentioning that most of these “monuments” were not actually put up in the immediate or near-immediate aftermath of slavery"
    },
    {
        "subreddit": "news",
        "sentence": "Most were erected in the aftermath of Plessy v"
    },
    {
        "subreddit": "news",
        "sentence": "Ferguson in the Jim Crow South"
    },
    {
        "subreddit": "news",
        "sentence": "Their purpose was to perpetuate the Lost Cause myth and to help rally whites behind a unified cause to perpetuate discrimination and suppress civil rights movements.\n\nThese were always about a propaganda campaign to disguise racism a noble cause."
    },
    {
        "subreddit": "news",
        "sentence": "Why would they be? It’s not like they are the ones blocking them."
    },
    {
        "subreddit": "news",
        "sentence": "Airbus: ~~Possible water landing~~ Made it back safely\nBoeing: where’s that plane… 10 years later… where’s that plane?"
    },
    {
        "subreddit": "news",
        "sentence": "dude they shot a guy who was being stabbed"
    },
    {
        "subreddit": "news",
        "sentence": "It was so disappointingly predictable to see the reaction from the usual conservative losers over this"
    },
    {
        "subreddit": "news",
        "sentence": "Would be a better system."
    },
    {
        "subreddit": "news",
        "sentence": "You should take a closer look at the link you gave"
    },
    {
        "subreddit": "news",
        "sentence": "Too much Fluoride is bad"
    },
    {
        "subreddit": "news",
        "sentence": "Too much ANYTHING is bad"
    },
    {
        "subreddit": "news",
        "sentence": "The cases of the excess fluoride was from drinking water from the ground that had leached too much from nearby minerals.\n\nEssentially, when you drill a well you should check the fluoride levels"
    },
    {
        "subreddit": "news",
        "sentence": "It has nothing to do with the normal drinking water that most people get from the tap"
    },
    {
        "subreddit": "news",
        "sentence": "They're not adding fluoride in the excess that cause those issues."
    },
    {
        "subreddit": "news",
        "sentence": "As an Atlanta native, I do declare, that thing should be re-carved in the image of Lincoln, Grant, and Sherman.\n\nCast the bronze into a bell and set it on the summit."
    },
    {
        "subreddit": "news",
        "sentence": "Sounds a lot like terrorism."
    },
    {
        "subreddit": "news",
        "sentence": "That'd be TERRIFYING as a pick-up line ngl."
    },
    {
        "subreddit": "news",
        "sentence": "I scrolled down for ages and didn’t see anyone address that Isreal flatly denied this happened"
    },
    {
        "subreddit": "news",
        "sentence": "Usually they /spin the truth or similar but when they flatly deny it’s usually true."
    },
    {
        "subreddit": "news",
        "sentence": "yup, just another small oopsie from the IDF, no biggiie, US will \"voice it's concern\", Israel will \"investigate\" and we'll never hear another thing about this just like all the other \"we'll investigate\" incidents"
    },
    {
        "subreddit": "news",
        "sentence": "Hey, you're a real person with real thoughts and that's good enough for me"
    },
    {
        "subreddit": "news",
        "sentence": "It doesn't shock me Israel/Palestine gets all the attention in media given its.."
    },
    {
        "subreddit": "news",
        "sentence": "SPECIAL history with the US and its people, that makes sense"
    },
    {
        "subreddit": "news",
        "sentence": "For college kids - idealistically attributing black/white binaries to the world that's nothing if not just fiften billion shades of gray in a trenchcoat is pretty on brand"
    },
    {
        "subreddit": "news",
        "sentence": "My local uni seemed fairly singularly focused on divestment from ties to Israel but I was only around on one day and I'm sure they had their own bands of."
    },
    {
        "subreddit": "news",
        "sentence": "non-realists for lack of better terminology"
    },
    {
        "subreddit": "news",
        "sentence": "In general I do think the."
    },
    {
        "subreddit": "news",
        "sentence": "I'd hesitate to say \"restrained\" but certainly less \"scorched earth\"."
    },
    {
        "subreddit": "news",
        "sentence": "response by Israel was likely directly US pressure only possible as a result of Biden being in office which if media firestorms or social media posts are anything to go by it would seem that Biden's response so far has been bad enough to curtail votes over\n\n\nKudos for being a real person and not just jumping to declare anything opposite to you as unbelievable inconceivable and thus bad and stupid forever times infinity"
    },
    {
        "subreddit": "news",
        "sentence": "I might not fully agree with your view of it, but I understand it and can leave it there"
    },
    {
        "subreddit": "news",
        "sentence": "At the end of the day our opinions on this are a hill of beans to those who are living and breathing it"
    },
    {
        "subreddit": "news",
        "sentence": "Take care"
    },
    {
        "subreddit": "news",
        "sentence": "Gotta waste $320 million in taxpayer money instead of just forcing Israel to open the blockades on roads into Gaza so aid can enter."
    },
    {
        "subreddit": "news",
        "sentence": "Why do redditors feel the need to speak on subjects outside their domain of expertise?  \n\nThe pier that was destroyed was a floating pier"
    },
    {
        "subreddit": "news",
        "sentence": "The pier was operational within 40 days of the start of its construction and was capable of delivery of about 150 trucks per day"
    },
    {
        "subreddit": "news",
        "sentence": "A traditional pier takes much longer with optimal conditions, even longer in suboptimal conditions such as this."
    },
    {
        "subreddit": "news",
        "sentence": "Minecraft bridges be like"
    },
    {
        "subreddit": "news",
        "sentence": "Mom I need help, my piers are broken"
    },
    {
        "subreddit": "news",
        "sentence": "Allot means to sequester a portion of something give to give to someone else"
    },
    {
        "subreddit": "news",
        "sentence": "If I have a crop of apples, I can allot a portion of them to give to the local orphanage"
    },
    {
        "subreddit": "news",
        "sentence": "It's an allocation"
    },
    {
        "subreddit": "news",
        "sentence": "A lot means to have a significant portion of something"
    },
    {
        "subreddit": "news",
        "sentence": "If I have a crop of apples, it's a lot of apples"
    },
    {
        "subreddit": "news",
        "sentence": "So if we have an apple farm we can allot a lot of apples"
    },
    {
        "subreddit": "news",
        "sentence": "*beep boop, I'm a bot, and i allot a lot*"
    },
    {
        "subreddit": "news",
        "sentence": "Ugh I recently flew A320NEO from Oslo to Tenerife and the plane felt like a total mess"
    },
    {
        "subreddit": "news",
        "sentence": "I can’t believe SAS uses that plane for a 5 hour flight"
    },
    {
        "subreddit": "news",
        "sentence": "Ironically enough the day we flew back almost all flights back to Oslo were cancelled due to emergency maintenance on all A320NEO."
    },
    {
        "subreddit": "news",
        "sentence": "It's probably about distribution from said pier rather than how effective it moves aid in bulk"
    },
    {
        "subreddit": "news",
        "sentence": "The aid needs to get to the places it needs to go over land still."
    },
    {
        "subreddit": "news",
        "sentence": "I think that’s normally only if you commit the felony in the line of duty, but I don’t know for sure."
    },
    {
        "subreddit": "news",
        "sentence": "These mother fuckers would literally watch an asteroid coming straight for their foreheads and they would blame the democrats."
    },
    {
        "subreddit": "news",
        "sentence": "They couldnt be charged with multiple crimes for the same incident? \n\nThey could have"
    },
    {
        "subreddit": "news",
        "sentence": "> The feds do not fuck around.\n\nThey lowballed this as much as they could, they got that 99% certainty by making sure it will barely have any effect"
    },
    {
        "subreddit": "news",
        "sentence": "All of these people should have gone to prison for at least a decade, and the prosecutor right behind them"
    },
    {
        "subreddit": "news",
        "sentence": "They tried to overthrow the fucking government, and they'll be out in time to try it with the next election."
    },
    {
        "subreddit": "news",
        "sentence": "I'm struggling to see how shipments of flour from countries allied to Israel translates to missiles for Hamas, but I don't think it makes sense to you, either"
    },
    {
        "subreddit": "news",
        "sentence": "It's just what makes you feel better when you defend genocide."
    },
    {
        "subreddit": "news",
        "sentence": "You will drown if you inflate your life jacket inside the plane - it has happened before"
    },
    {
        "subreddit": "news",
        "sentence": "If the plane starts to sink, and you’d have to dive to swim out, the life jacket will make it impossible for you to get out, and you will be trapped inside"
    },
    {
        "subreddit": "news",
        "sentence": "People have actually died this way before"
    },
    {
        "subreddit": "news",
        "sentence": "Do not inflate the life jacket until you are outside the aircraft."
    },
    {
        "subreddit": "news",
        "sentence": "No 2 different incidents"
    },
    {
        "subreddit": "news",
        "sentence": "1st was airstrike, 2nd is tanks."
    },
    {
        "subreddit": "news",
        "sentence": "dont worry they are \"working towards a peaceful outcome\" whatever the fuck that means"
    },
    {
        "subreddit": "news",
        "sentence": "Plus, now we have real world experience for this shit"
    },
    {
        "subreddit": "news",
        "sentence": "What other nation has the resources to pull off this bullshit?\n\nGotta show everyone why we don't have healthcare."
    },
    {
        "subreddit": "news",
        "sentence": "I make good money, but when a non-stop, round trip, same time, same airports flight from Southwest is $650 and Spirit is $89, I'm choosing Spirit"
    },
    {
        "subreddit": "news",
        "sentence": "Especially when I can fit all my clothes and stuff in a backpack going under the seat."
    },
    {
        "subreddit": "news",
        "sentence": "Helped him walk across the water of the bay in fact."
    },
    {
        "subreddit": "news",
        "sentence": "Whoa, that sounds serious, when will Egypt be prosecuted?"
    },
    {
        "subreddit": "news",
        "sentence": "Can't wait for total robot war."
    },
    {
        "subreddit": "news",
        "sentence": "Jane's dad was just very upset thwt day doing air traffic control."
    },
    {
        "subreddit": "news",
        "sentence": "You can’t park there"
    },
    {
        "subreddit": "news",
        "sentence": "Stories like [https://www.cnn.com/2024/05/21/politics/us-gaza-pier-aid-not-delivered/index.html](https://www.cnn.com/2024/05/21/politics/us-gaza-pier-aid-not-delivered/index.html)"
    },
    {
        "subreddit": "news",
        "sentence": "If we put reddit in charge, the whole middle east would be  resolved in a week!"
    },
    {
        "subreddit": "news",
        "sentence": "They didn't confirm those stories to be 100% true"
    },
    {
        "subreddit": "news",
        "sentence": "There was no real evidence besides word of mouth."
    },
    {
        "subreddit": "news",
        "sentence": "Except that’s a war crime"
    },
    {
        "subreddit": "news",
        "sentence": "The materials used to build it came from China"
    },
    {
        "subreddit": "news",
        "sentence": "We're all gonna die no matter what"
    },
    {
        "subreddit": "news",
        "sentence": "No matter who is at the helm, every single one of us is gonna die"
    },
    {
        "subreddit": "news",
        "sentence": "I'm going to be presumptuous here, and say that what you're trying to express is that many people will suffer because of this fallacy, and several may unduly die."
    },
    {
        "subreddit": "news",
        "sentence": "It's not"
    },
    {
        "subreddit": "news",
        "sentence": "I've swam in the Med right off the coast of Israel and that's some of the calmest water I've ever seen."
    },
    {
        "subreddit": "news",
        "sentence": "We South Dakotans don’t get in the news very often but when we do you know it’s some crazy shit."
    },
    {
        "subreddit": "news",
        "sentence": "Naaaaaaaaaw we're outa glazed donuts"
    },
    {
        "subreddit": "news",
        "sentence": "Yes, this pier which has been sitting at Fort Eustis for the past 30 years probably."
    },
    {
        "subreddit": "news",
        "sentence": "Upper level management has entered the chat…"
    },
    {
        "subreddit": "news",
        "sentence": "Oh lol I didn't even know there was a monument like that"
    },
    {
        "subreddit": "news",
        "sentence": "Good grief, what poor taste"
    },
    {
        "subreddit": "news",
        "sentence": "Any monument celebrating anything at all in the context of slavery other than abolishing it should not exist"
    },
    {
        "subreddit": "news",
        "sentence": "Put a picture in the museum of bigotry or something but fuck having that out in the street."
    },
    {
        "subreddit": "news",
        "sentence": "Ya that’s sad"
    },
    {
        "subreddit": "news",
        "sentence": "I can see why the dad was worried but there was better ways to handle it"
    },
    {
        "subreddit": "news",
        "sentence": "Some ppl are so deathly allergic that just the smell can send them into shock"
    },
    {
        "subreddit": "news",
        "sentence": "But if that’s the case you’d tell them when you buy the ticket and tell the flight attendant and politely tell the people around you"
    },
    {
        "subreddit": "news",
        "sentence": "If it were me I’d bring snacks with me for the ppl right around me to munch on instead of peanuts"
    },
    {
        "subreddit": "news",
        "sentence": "I’d say “would you be so kind as to exchange your peanuts for these cashews” (or whatever… make it a better snack, bigger bag, nicer snack.) Might cost you $50 or so but it would be worth it for your child’s health"
    },
    {
        "subreddit": "news",
        "sentence": "I’m sure most ppl would be pretty good either way it."
    },
    {
        "subreddit": "news",
        "sentence": "You guys think this is bad, wait till you try in build a pier in Taiwan while China is shooting at it."
    },
    {
        "subreddit": "news",
        "sentence": "What's with F-35's and wacky incidents lately.\n\nRemember that time they just straight up find couldn't one of them?"
    },
    {
        "subreddit": "news",
        "sentence": "If a tree falls on Milli Vanili in the woods, does someone else make a noise?"
    },
    {
        "subreddit": "news",
        "sentence": "*Pier*iodic damage you say?"
    },
    {
        "subreddit": "news",
        "sentence": "Landing craft."
    },
    {
        "subreddit": "news",
        "sentence": "*in America"
    },
    {
        "subreddit": "news",
        "sentence": "People that fall for this common sales tactic\n\n\nhttps://www.consumerreports.org/cars/buying-a-car/beat-four-square-and-other-car-dealership-sales-tactics-a7590220303/"
    },
    {
        "subreddit": "news",
        "sentence": "He will be a inch shorter than the day before"
    },
    {
        "subreddit": "news",
        "sentence": "Ah, the man who criticizes everything, unless it is successful and then takes credit."
    },
    {
        "subreddit": "news",
        "sentence": "TSA also doesn’t necessarily know where you are going as you pass through"
    },
    {
        "subreddit": "news",
        "sentence": "Perhaps you are going to a country just as gun crazy as ‘Merica."
    },
    {
        "subreddit": "news",
        "sentence": "This cost X per person This cost X per person....add it all up this cost $3,000 per person"
    },
    {
        "subreddit": "news",
        "sentence": "This one issue doesn't sum up the problem....Its the myriad of things costing $1 dollar per a person thats adding up to kill us alll."
    },
    {
        "subreddit": "news",
        "sentence": "Pretty vague on the circumstances of this dramatic crime"
    },
    {
        "subreddit": "news",
        "sentence": "And over only two rounds that were loose in the bag"
    },
    {
        "subreddit": "news",
        "sentence": "..."
    },
    {
        "subreddit": "news",
        "sentence": "they make a pill for that..."
    },
    {
        "subreddit": "news",
        "sentence": "Oh no, the useless distraction has fallen apart?"
    },
    {
        "subreddit": "news",
        "sentence": "And if that’s a thing that happens to you on the regular for whatever reason I dunno maybe get a fishing magnet or something.\n\nOr just check your bag if you have a medical condition that causes you to drop ammo everywhere and you’re planning on traveling internationally"
    },
    {
        "subreddit": "news",
        "sentence": "Spy balloons 🎈pay off."
    },
    {
        "subreddit": "news",
        "sentence": "Redditors crying about being broke while simultaneously crying about cheap airlines designed to allow for low-income fliers, name a more iconic duo."
    },
    {
        "subreddit": "news",
        "sentence": "I'm sure if you were on the scene everything would have worked out so much better!"
    },
    {
        "subreddit": "news",
        "sentence": "Being an enemy of the United States violent insurrectionist leaves me no pity for him"
    },
    {
        "subreddit": "news",
        "sentence": "Did it really serve any purpose beyond being a PR stunt by Biden."
    },
    {
        "subreddit": "news",
        "sentence": "Hating people you don't know because they belong to a group they didn't opt to join is ugly whatever form it takes."
    },
    {
        "subreddit": "news",
        "sentence": "What would your solution have been tough guy?"
    },
    {
        "subreddit": "news",
        "sentence": "He should have tried to extort a Supreme Court justice"
    },
    {
        "subreddit": "news",
        "sentence": "That's been a very fruitful endeavor for friends of Thomas and Alito."
    },
    {
        "subreddit": "news",
        "sentence": "I'd bet this is only the stuff we know about, that there's likely years of abusing the public that's been swept under."
    },
    {
        "subreddit": "news",
        "sentence": "Didn't this pier cost the American taxpayers something like 19 Million dollars just a few weeks ago?"
    },
    {
        "subreddit": "news",
        "sentence": "Too much CCG time."
    },
    {
        "subreddit": "news",
        "sentence": "People act like flying spirit is bad or for poor people"
    },
    {
        "subreddit": "news",
        "sentence": "Sometimes it's the best option"
    },
    {
        "subreddit": "news",
        "sentence": "My home airport is either spirit or frontier for direct flights"
    },
    {
        "subreddit": "news",
        "sentence": "You can take a united/american/delta but you'll have a connection at a hub"
    },
    {
        "subreddit": "news",
        "sentence": "I'll take a 2 hour spirit flight over a united flight that's 6 hours because there's a connection at a hub."
    },
    {
        "subreddit": "news",
        "sentence": "Why did the dying pilot not get the joke? It flew right over his head."
    },
    {
        "subreddit": "news",
        "sentence": "I don’t know"
    },
    {
        "subreddit": "news",
        "sentence": "In this day and age, facts have no bearing any more."
    },
    {
        "subreddit": "news",
        "sentence": "Just don’t comment while at work or they will dock your pay."
    },
    {
        "subreddit": "news",
        "sentence": "So what you're saying is that defense spending hasn't kept up with inflation?  /s"
    },
    {
        "subreddit": "news",
        "sentence": "Went sky diving before and we literally paid for something similar\n\nWe figured the altitude gain wouldn't matter if the parachutes failed 😂"
    },
    {
        "subreddit": "news",
        "sentence": "But all the courts/judges ARE favoring him as it is"
    },
    {
        "subreddit": "news",
        "sentence": "ANY OTHER DEFENDANT would be in jail for violating the gag order as many times as he did in his trials"
    },
    {
        "subreddit": "news",
        "sentence": "The judges didn’t bc he was President and could be again"
    },
    {
        "subreddit": "news",
        "sentence": "He is getting different treatment, but it’s better treatment not worse"
    },
    {
        "subreddit": "news",
        "sentence": "🤷🏼‍♀️"
    },
    {
        "subreddit": "news",
        "sentence": "What is the point of this"
    },
    {
        "subreddit": "news",
        "sentence": "They should have used absorbent materials, thus obviating the need for a pier at all."
    },
    {
        "subreddit": "news",
        "sentence": "Work for a nonprofit who got hit some time ago (not badly, thank goodness)"
    },
    {
        "subreddit": "news",
        "sentence": "From what I understand, it's almost always money and they'd usually prefer to tailor things to get paid vs having wasted their time"
    },
    {
        "subreddit": "news",
        "sentence": "If you don't have sensitive data for them to sell, there's not much motive to really rake you over the coals."
    },
    {
        "subreddit": "news",
        "sentence": "\"it's heritage\""
    },
    {
        "subreddit": "news",
        "sentence": "I'm off work early and killing time, can you send some links on the kkk/prohibition connection? Did they think fewer (Italian/Irish/Catholic) immigrants would come to the US if alcohol was illegal?\nMy idea of the \"modern\" kkk is rednecks drinking beer by a bonfire so curious where you're going with that"
    },
    {
        "subreddit": "news",
        "sentence": "Comments like yours will be studied by anthropologists of the future in regards to the Palestinian Genocide."
    },
    {
        "subreddit": "news",
        "sentence": "Good to know"
    },
    {
        "subreddit": "news",
        "sentence": "If it were me or my kid I'd definitely prep with a mask and long sleeves/gloves rather than ask the world to avoid nuts in all onboard snacks.\n\nThe general public isn't even likely to check labels and mistakes are too inevitable to trust the public for their safety."
    },
    {
        "subreddit": "news",
        "sentence": "Even so, Sully Sullenberger pulled it off"
    },
    {
        "subreddit": "news",
        "sentence": "Experienced pilot=hope."
    },
    {
        "subreddit": "news",
        "sentence": "She asked each party months and months ago when they’d be reasonably ready for trial"
    },
    {
        "subreddit": "news",
        "sentence": "At that time the govt said rn and Trump’s lawyers said not til Aug/24"
    },
    {
        "subreddit": "news",
        "sentence": "So instead of compromising and saying how ab June/24 or even giving in to Trump’s outlandish Aug/24 request she simply said “I’m not scheduling it”"
    },
    {
        "subreddit": "news",
        "sentence": "🤷🏼‍♀️🤷🏼‍♀️🤷🏼‍♀️🤷🏼‍♀️"
    },
    {
        "subreddit": "news",
        "sentence": "Remember, these same people were outraged over Brittany Griner"
    },
    {
        "subreddit": "news",
        "sentence": "They are only upset when someone on their “team” is in trouble."
    },
    {
        "subreddit": "news",
        "sentence": "Good use of money for a bunch of death cult individuals"
    },
    {
        "subreddit": "news",
        "sentence": "If you want to see another interesting oops in Albuquerque involving the Air Force Google"
    },
    {
        "subreddit": "news",
        "sentence": "\" May 1957 Mesa del Sol accidental dropped\""
    },
    {
        "subreddit": "news",
        "sentence": "Did you read it? How would it cover a seismic survey"
    },
    {
        "subreddit": "news",
        "sentence": "Anyone nearby knows those are going on, and there is no reason they need \"cover\""
    },
    {
        "subreddit": "news",
        "sentence": "Israel is already actively developing the Gaza Marine"
    },
    {
        "subreddit": "news",
        "sentence": "They awarded approval last year publicly."
    },
    {
        "subreddit": "news",
        "sentence": "Note that \"external entities\" isn't exclusive to the supernatural"
    },
    {
        "subreddit": "news",
        "sentence": "The blame-diversion can just as easily be directed to any human outgroup, which will enhance ingroup cohesion."
    },
    {
        "subreddit": "news",
        "sentence": "He’s the one hiding under 20 innocents"
    },
    {
        "subreddit": "news",
        "sentence": "First of all, not guns and ammo"
    },
    {
        "subreddit": "news",
        "sentence": "Just ammo"
    },
    {
        "subreddit": "news",
        "sentence": "And secondly, you yourself said it’s to stop a spike in crime"
    },
    {
        "subreddit": "news",
        "sentence": "Which this guy did not contribute to and did not attempt to contribute too"
    },
    {
        "subreddit": "news",
        "sentence": "This has nothing to do with gun culture"
    },
    {
        "subreddit": "news",
        "sentence": "Anyone can see the absurdity in the sentence for what this particular person did"
    },
    {
        "subreddit": "news",
        "sentence": "Even the government itself that passes the law, which is clear from this story."
    },
    {
        "subreddit": "news",
        "sentence": "She won’t stand by the law in any other matter in this case, but here, here she is a stickler for the rules?  SMH 🤦🏼‍♀️"
    },
    {
        "subreddit": "news",
        "sentence": "That depends entirely on the speed and orientation of the aircraft"
    },
    {
        "subreddit": "news",
        "sentence": "With a stalled engine, they can usually slow the aircraft and safely eject."
    },
    {
        "subreddit": "news",
        "sentence": "Unfortunately it sounds like he did this about 59 miles too soon lol"
    },
    {
        "subreddit": "news",
        "sentence": "I grew-up in this county (Okaloosa) in the 80s"
    },
    {
        "subreddit": "news",
        "sentence": "It was great at the time, loved living there"
    },
    {
        "subreddit": "news",
        "sentence": "Not even interested in visiting the area now, though"
    },
    {
        "subreddit": "news",
        "sentence": "Really sucks."
    },
    {
        "subreddit": "news",
        "sentence": "Its Islamophobic to call Hamas terrorists? OK buddy"
    },
    {
        "subreddit": "news",
        "sentence": "You've more than proven mine."
    },
    {
        "subreddit": "news",
        "sentence": "Good, send some money to America"
    },
    {
        "subreddit": "news",
        "sentence": "Ah man i have a buddy that flew choppers in the marines  he even flew marine one once has pictures with the president at the time"
    },
    {
        "subreddit": "news",
        "sentence": "he said that shit was super dangerous, sounded even more dangerous then flying a plane"
    },
    {
        "subreddit": "news",
        "sentence": "Im to understand theres Lot can go wrong on a helicopter"
    },
    {
        "subreddit": "news",
        "sentence": "“Omg, um, next time don’t help me” the stabbing victim was heard muttering to the police before he slipped into his coma"
    },
    {
        "subreddit": "news",
        "sentence": "🙄🙄"
    },
    {
        "subreddit": "news",
        "sentence": "I know the problem, it ain’t got no gas in it"
    },
    {
        "subreddit": "news",
        "sentence": "'Till tomorrow"
    },
    {
        "subreddit": "news",
        "sentence": "Oh, so the pilot possibly said \"We are going to land at Montego Bay\"\n\nAnd the flight attendant thought the pilot said \"We are going to land *in* Montego Bay\".\n\nHmm, just one little word makes a big difference."
    },
    {
        "subreddit": "news",
        "sentence": "It’s so obviously a genocide at this point"
    },
    {
        "subreddit": "news",
        "sentence": "Every single human rights agency that has investigated has said so"
    },
    {
        "subreddit": "news",
        "sentence": "Children starving to death"
    },
    {
        "subreddit": "news",
        "sentence": "Men with guns will always be able to get food, but the children?  Shameful and evil."
    },
    {
        "subreddit": "news",
        "sentence": "Why wait?"
    },
    {
        "subreddit": "news",
        "sentence": "What does she think this is, fucking “Mortal Kombat?”  \n\nIsrael has fucking murdered dozens of innocent Palestinians for each of their own fallen, and for what? The flippancy with which she—and the rest of the 1%—dismiss the pain and immeasurable human suffering disgusts me"
    },
    {
        "subreddit": "news",
        "sentence": "She and the rest of them are abominable."
    },
    {
        "subreddit": "news",
        "sentence": "I remember when cnn was thinking this guy had a shot at being president"
    },
    {
        "subreddit": "news",
        "sentence": "Jesus Christ"
    },
    {
        "subreddit": "news",
        "sentence": "Ummm, many of the jan 6th insurrectionists who have been convicted and sentenced were done so on federal charges"
    },
    {
        "subreddit": "news",
        "sentence": "And trump has openly bragged about pardoning them so….\n\nAs for it being an admission of guilt, what tf does he or his followers care? They think any punishments levied against them is somehow a democrat conspiracy or something and therefore illegitimate"
    },
    {
        "subreddit": "news",
        "sentence": "They live in a different (false) reality"
    },
    {
        "subreddit": "news",
        "sentence": "I would need a lot more missiles"
    },
    {
        "subreddit": "news",
        "sentence": "Damn was supposed to last till the end of the unit that built its deployment so it would then be the rollover units problem."
    },
    {
        "subreddit": "news",
        "sentence": "The F-35 is the most advanced thing that has ever left gods green earth"
    },
    {
        "subreddit": "news",
        "sentence": "The specifics of “why” is classified."
    },
    {
        "subreddit": "news",
        "sentence": "Start building for Lockheed Martin."
    },
    {
        "subreddit": "news",
        "sentence": "your washes will go up too."
    },
    {
        "subreddit": "news",
        "sentence": "She didn't do Trump any favors because the sh\\*t he says is so unhinged, he would be better off gagged."
    },
    {
        "subreddit": "news",
        "sentence": "McDonald's broke them on appeal I believe"
    },
    {
        "subreddit": "news",
        "sentence": "Because the justice system sucks."
    },
    {
        "subreddit": "news",
        "sentence": "I’ve not, and you’re not the first person to tell me this"
    },
    {
        "subreddit": "news",
        "sentence": "The house passes laws"
    },
    {
        "subreddit": "news",
        "sentence": "Congress funded the F-35"
    },
    {
        "subreddit": "news",
        "sentence": "Your congressional representatives constantly bitch about raising the federal minimum wage"
    },
    {
        "subreddit": "news",
        "sentence": "Minimum wage has increased 0% since 2009 at $7.25"
    },
    {
        "subreddit": "news",
        "sentence": "The dollar had an average inflation rate of 2.42% per year between 2009 and 2022, producing a cumulative price increase of 36.41%"
    },
    {
        "subreddit": "news",
        "sentence": "Defense spending has increased 8.2% from 705b to 857.9b"
    },
    {
        "subreddit": "news",
        "sentence": "Try to keep up, I said nothing about the president"
    },
    {
        "subreddit": "news",
        "sentence": "You’re fellow American’s are struggling and you’re making excuses for Lockheed Martin, they’ll be fine."
    },
    {
        "subreddit": "news",
        "sentence": "It doesn't apply. \nShe's the only actual sovereign citizen anywhere. \nOnly a super majority of the Senate can do anything about her. \nWhich if pigs fly will happen. \nShe's permanent."
    },
    {
        "subreddit": "news",
        "sentence": "Yes, when the f-22 was being designed and produced the technology was considered too advanced to export"
    },
    {
        "subreddit": "news",
        "sentence": "Now the technology is a bit older and not as sensitive anymore, so there’s not as much of a reason to not exporting it"
    },
    {
        "subreddit": "news",
        "sentence": "But it’s out of production so you can’t really export it anyway.\n\nTo better answer your question of why is the F-35 being exported but not the F-22, it just comes down to timing"
    },
    {
        "subreddit": "news",
        "sentence": "The F-22 and stealth technology was just too new to be exported, but now the technology has matured enough that even though the F-35 is more advanced, it’s not as much of a leap in technology and the US feels comfortable exporting it."
    },
    {
        "subreddit": "news",
        "sentence": "This is the reason why we all come together after a natural disaster"
    },
    {
        "subreddit": "news",
        "sentence": "It was an act of nature rather than an act of man (though acts of man/lack of actions can change the outcome of the disaster)."
    },
    {
        "subreddit": "news",
        "sentence": "Perhaps if Biden loses, Dems will actually move left not just in rhetoric"
    },
    {
        "subreddit": "news",
        "sentence": "If they win, nothing changes and the genocide continues"
    },
    {
        "subreddit": "news",
        "sentence": "Not American btw"
    },
    {
        "subreddit": "news",
        "sentence": "the cost was the R&D"
    },
    {
        "subreddit": "news",
        "sentence": "Where’s the original data come from? China?"
    },
    {
        "subreddit": "news",
        "sentence": "Im sorry i dont live on here..."
    },
    {
        "subreddit": "news",
        "sentence": "There are no snacks on a spirit flight"
    },
    {
        "subreddit": "news",
        "sentence": "You think you're getting snacks on the liferaft?"
    },
    {
        "subreddit": "news",
        "sentence": "Killers gonna kill."
    },
    {
        "subreddit": "news",
        "sentence": ">The drop in China’s March CO2 emissions came not only from a drop in coal use, but also due to flat oil demand and a 22 per cent drop in cement production, an 8 per cent drop in steel production, and despite a 14 per cent rise in gas consumption, which remains a minor part of China’s energy mix.\n\nSo the drop mainly comes from the construction industry slowing down from the insane housing speculation"
    },
    {
        "subreddit": "news",
        "sentence": "The stupid guy in the buffalo cape"
    },
    {
        "subreddit": "news",
        "sentence": "Nothing violent and he got a a third of this guy's sentence"
    },
    {
        "subreddit": "news",
        "sentence": "There was two guys featured in the insurectionist next door that had 18 months again just being there"
    },
    {
        "subreddit": "news",
        "sentence": "I know no one cares about that on here but reddit is constantly going on about over sentencing yet because they hate these people its okay."
    },
    {
        "subreddit": "news",
        "sentence": "Yeah it’s the same old story, republicans say what the Dems act on"
    },
    {
        "subreddit": "news",
        "sentence": "One side writes “finish them” and the other supplies the bombs"
    },
    {
        "subreddit": "news",
        "sentence": "Which is actually worse? I hold them both accountable."
    },
    {
        "subreddit": "news",
        "sentence": "It was a reference to how most police officers get away with crimes or are not held accountable when brought to trial"
    },
    {
        "subreddit": "news",
        "sentence": "Either that or they retire/keep their pension without being held accountable"
    },
    {
        "subreddit": "news",
        "sentence": "Thanks for keeping up."
    },
    {
        "subreddit": "news",
        "sentence": "Half the population is below average due to the definition of average (median) but not necessarily half the passengers"
    },
    {
        "subreddit": "news",
        "sentence": "There are other potential variables to consider since the passengers are a small subset of the population."
    },
    {
        "subreddit": "news",
        "sentence": "Yes basically"
    },
    {
        "subreddit": "news",
        "sentence": "Went from nuanced to ham fisted to squeeze out a few more seasons, imo."
    },
    {
        "subreddit": "news",
        "sentence": "Now get the other NYPD criminals."
    },
    {
        "subreddit": "news",
        "sentence": "Didn’t know spirit airlines offered a landing as part of the flight"
    },
    {
        "subreddit": "news",
        "sentence": "He's convicted and lost his appeal wtf are you talking about?"
    },
    {
        "subreddit": "news",
        "sentence": "Last time I was shopping, I googled how to deal with car salesman"
    },
    {
        "subreddit": "news",
        "sentence": "I will never go to a dealership without calling and getting an out the door price again"
    },
    {
        "subreddit": "news",
        "sentence": "I showed up test drove the vehicle and the salesman barley said a word the whole time"
    },
    {
        "subreddit": "news",
        "sentence": "No haggling, no evil finance guy and no last minute “dealership fees”"
    },
    {
        "subreddit": "news",
        "sentence": "Pshh.."
    },
    {
        "subreddit": "news",
        "sentence": "I'll have you know I graduated top of my class at the Navy seals recon marsoc ranger jump school!\n\nOh wait"
    },
    {
        "subreddit": "news",
        "sentence": "No"
    },
    {
        "subreddit": "news",
        "sentence": "I was a never deployed reserve engineer officer"
    },
    {
        "subreddit": "news",
        "sentence": "And then XO and BN S3 for a tradoc unit"
    },
    {
        "subreddit": "news",
        "sentence": "Respect mah authoriatyyyy.\n\n/s"
    },
    {
        "subreddit": "news",
        "sentence": "Did you go to school in Florida?"
    },
    {
        "subreddit": "news",
        "sentence": "Because it's a stealth plane"
    },
    {
        "subreddit": "news",
        "sentence": "If you have a way to detect its location, then your enemy does"
    },
    {
        "subreddit": "news",
        "sentence": "I'm sure you could have the plane send a signal but the guy whose job it is to do that ejected."
    },
    {
        "subreddit": "news",
        "sentence": "I believe my point was the first sentence."
    },
    {
        "subreddit": "news",
        "sentence": "Yeah, well all thepier expert pier engineers just show up to make a floating.point"
    },
    {
        "subreddit": "news",
        "sentence": "I flew the F-16 for 6 years"
    },
    {
        "subreddit": "news",
        "sentence": "The F-16 is by far the better dog fighter"
    },
    {
        "subreddit": "news",
        "sentence": "However the F-16 will never make it to the merge"
    },
    {
        "subreddit": "news",
        "sentence": "You can’t fight what you never see until it’s too late"
    },
    {
        "subreddit": "news",
        "sentence": "Dogfighting, while it is the sport of kings, is dead in a real war."
    },
    {
        "subreddit": "news",
        "sentence": "Israel is the only country in the world which is openly hostile and literally doing ethnic cleansing on top of war crimes but as long as Uncle Sam is ok, you can do whatever you want"
    },
    {
        "subreddit": "news",
        "sentence": "I never see a US President putting his reelection campaign for  someone who is openly against him and campaigned with trump to defeat him."
    },
    {
        "subreddit": "news",
        "sentence": "I was taught in school in the 90s that most slaves didn't want to be freed, so when they were, which wasn't legal because Lincoln wasn't the President of the Confederacy, most of them wanted to stay because they were so well taken care of"
    },
    {
        "subreddit": "news",
        "sentence": "And that they weren't beat or anything because if they were your property, why would you damage your own property?\n\nI didn't go to a very good school"
    },
    {
        "subreddit": "news",
        "sentence": "Not sure why I'm being downvoted I'm saying the same thing as you lol"
    },
    {
        "subreddit": "news",
        "sentence": "The problem is not aid delivery, aid delivery is easy, its that israel, who's wholly dependent on the United States, has closed the gates and bombs attempts to get food in."
    },
    {
        "subreddit": "news",
        "sentence": "Manhunter was far superior to the later film version, titled Red Dragon"
    },
    {
        "subreddit": "news",
        "sentence": "Yes, I know the scene"
    },
    {
        "subreddit": "news",
        "sentence": "Unforgettable."
    },
    {
        "subreddit": "news",
        "sentence": "No shit"
    },
    {
        "subreddit": "news",
        "sentence": "What's your point?  Do you not understand what the term \"most cases\" means?"
    },
    {
        "subreddit": "news",
        "sentence": "Do you mean Israeli radicals stop the trucks and destroy the food? Because that's far more common than what you're describing."
    },
    {
        "subreddit": "news",
        "sentence": "Why did they even have to build that if Israel was willing to get aid to the Palestinians?  Seems to me that they don’t want the aid getting in"
    },
    {
        "subreddit": "news",
        "sentence": "🤷🏼‍♀️"
    },
    {
        "subreddit": "news",
        "sentence": "He personally reduced the population of the town by 0.3%."
    }
]