[
    {
        "subreddit": "politics",
        "sentence": "Aileen \"Cannonball Through the Constitution\" did her job? Somebody had a talk with her."
    },
    {
        "subreddit": "politics",
        "sentence": "It's about as true as what qAnon cultists want to believe.\n\ni.e., a complete lie, stoking baseless fears because the Republican party only has fear as its driving force"
    },
    {
        "subreddit": "politics",
        "sentence": "That's also why they are fully behind arming everyone to irrational degrees: so much personal gun ownership is fear-based."
    },
    {
        "subreddit": "politics",
        "sentence": "I don't think that's true at all"
    },
    {
        "subreddit": "politics",
        "sentence": "Never Trump is due to him being an insurrectionist and no respect for the constitution"
    },
    {
        "subreddit": "politics",
        "sentence": "Those are important to that group"
    },
    {
        "subreddit": "politics",
        "sentence": "Most of the Senate are made up of just these types."
    },
    {
        "subreddit": "politics",
        "sentence": "One of the best standup bits ever"
    },
    {
        "subreddit": "politics",
        "sentence": "At that point it wouldn't matter"
    },
    {
        "subreddit": "politics",
        "sentence": "If convicted, the judge can sentence whatever he wants within reason / guidelines"
    },
    {
        "subreddit": "politics",
        "sentence": "Doesn't matter if he contradicts himself or not"
    },
    {
        "subreddit": "politics",
        "sentence": "Judgement has been issued"
    },
    {
        "subreddit": "politics",
        "sentence": "Public opinion of him might tank, but judges aren't really supposed to be political"
    },
    {
        "subreddit": "politics",
        "sentence": "Same as the judge who let the rapist Brock Turner off easy because he was rich and friends with his family"
    },
    {
        "subreddit": "politics",
        "sentence": "Sure it looked like shit, but the justice system isn't designed to care."
    },
    {
        "subreddit": "politics",
        "sentence": "You might as well give up trying to defeat President Trump!  He already has the Nov"
    },
    {
        "subreddit": "politics",
        "sentence": "Election won!  It's a done deal!"
    },
    {
        "subreddit": "politics",
        "sentence": "> The polls are against Biden because I think they keep repeating the landline strategy to get the results that they want.\n\nI actually got called for a poll on my cell phone a few months back"
    },
    {
        "subreddit": "politics",
        "sentence": "I decided to participate and they asked me about a million questions as to what tobacco products I use"
    },
    {
        "subreddit": "politics",
        "sentence": "I use none and instead of asking if I used any at the start I had to say no to a ton of things I didn't even know existed"
    },
    {
        "subreddit": "politics",
        "sentence": "Started to feel like a weird marketing thing to inform me of the varied world of tobacco"
    },
    {
        "subreddit": "politics",
        "sentence": "Anyway, they finally asked 'what political party I identify as'"
    },
    {
        "subreddit": "politics",
        "sentence": "I say none and before I could even clarify that I while I don't belong to any party but that I vote Democrat they hung up"
    },
    {
        "subreddit": "politics",
        "sentence": "No 'thanks for you time' let alone a 'goodbye'"
    },
    {
        "subreddit": "politics",
        "sentence": "It felt really like they were trying to juice whatever poll they were trying to conduct and when they didn't get the answer they wanted about party affiliation the call was 'disconnected' so that I could just be fully excluded from their metric."
    },
    {
        "subreddit": "politics",
        "sentence": "Free on Amazon Video and Roku."
    },
    {
        "subreddit": "politics",
        "sentence": "Based on past odds, 2/3rds of the people who try to assault/murder him unprovoked first"
    },
    {
        "subreddit": "politics",
        "sentence": "Its vastly different from Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "Only when they step on other wealthy people or rock the boat for them"
    },
    {
        "subreddit": "politics",
        "sentence": "Madoff went to prison because he took rich people's money"
    },
    {
        "subreddit": "politics",
        "sentence": "Holmes is going to prison because Theranos makes the industry look bad, same with Shrkreli: he said the quiet part out loud and drew negative attention to the pharma industry.\n\nThe few other cases are when they cheat on taxes but don't hire smart enough people to do it the right way."
    },
    {
        "subreddit": "politics",
        "sentence": "Ironically, this is how many of these MAGA idiots actually perceive themselves"
    },
    {
        "subreddit": "politics",
        "sentence": "This badass attitude that can't be messed with"
    },
    {
        "subreddit": "politics",
        "sentence": "They create this fantasy picture of themselves, and play out the part with props to bolster up their own self esteem.\n\nThey kind of missed the part where the guy was psychotic and a loser who can't handle being alienated from society."
    },
    {
        "subreddit": "politics",
        "sentence": "This socialism....is it in the room with us right now?"
    },
    {
        "subreddit": "politics",
        "sentence": "Never been one quite like this tho"
    },
    {
        "subreddit": "politics",
        "sentence": "And no link"
    },
    {
        "subreddit": "politics",
        "sentence": "I get that it's a lose-lose on your end"
    },
    {
        "subreddit": "politics",
        "sentence": "Probably better to just play dumb and not actually link this \"article\" (read: \"YouTube video\") than put it up here for public scrutiny"
    },
    {
        "subreddit": "politics",
        "sentence": "You know, since it's undoubtedly laughable"
    },
    {
        "subreddit": "politics",
        "sentence": "Not credible"
    },
    {
        "subreddit": "politics",
        "sentence": "Laughable"
    },
    {
        "subreddit": "politics",
        "sentence": "The opposite"
    },
    {
        "subreddit": "politics",
        "sentence": "Oh forget it, it's not like you actually have even the most remote semblance of some far-off idea of intellectual curiosity"
    },
    {
        "subreddit": "politics",
        "sentence": "Let's talk about how smart I sound."
    },
    {
        "subreddit": "politics",
        "sentence": "Unfortunately  this is one of the biggest issues in (especially large) democratic systems"
    },
    {
        "subreddit": "politics",
        "sentence": "Guaranteeing people the right to choose allows them to choose against their own interest, which a significant portion will inevitably do"
    },
    {
        "subreddit": "politics",
        "sentence": "Combined with the people who actually want to intentionally misuse power for their own benefit they form a sizable voting block and can \"democratically\" do whatever they please as an effective tyranny"
    },
    {
        "subreddit": "politics",
        "sentence": "Restrictions on public participation are similarly difficult to implement in a \"free\" system because allowing the government to determine who can participate in politics/public discourse etc"
    },
    {
        "subreddit": "politics",
        "sentence": "allows them at the same time to determine who can't participate"
    },
    {
        "subreddit": "politics",
        "sentence": "As a hypothetical, the prohibition on traitors holding certain offices seems good and reasonable but it also allows the government to restrict a person from office by declaring them a traitor"
    },
    {
        "subreddit": "politics",
        "sentence": "If this hypothetical government even once finds itself in the hands of people who would declare, say, a rival political party or some \"troublesome\" minorities as traitors then it's all over.\n\nIn this way both guaranteeing and restricting freedom of participation are merely stopgaps on a government's inevitable slide towards authoritarianism."
    },
    {
        "subreddit": "politics",
        "sentence": "It's crazy how low the standards are for lawyers-- and that includes prosecutors and judges"
    },
    {
        "subreddit": "politics",
        "sentence": "Absolute joke of a field."
    },
    {
        "subreddit": "politics",
        "sentence": "He won't, because he doesn't have the want"
    },
    {
        "subreddit": "politics",
        "sentence": "Has nothing to do with will"
    },
    {
        "subreddit": "politics",
        "sentence": "It's not that he's chickenshit"
    },
    {
        "subreddit": "politics",
        "sentence": "It's not because other democrats would be against it or that it'd be challenged.\n\nGenerically, for the most part, all of the leaders of political power in America agree on most high level ideas"
    },
    {
        "subreddit": "politics",
        "sentence": "Even the supreme court which is currently making decisions one party dislikes, generally is in lock step with most of American politics.\n\nBiden won't stuff the supreme court because the DNC uses the heritage foundation for ideas just as much as the GOP and neither party has an invested interest in stuffing the court st this time"
    },
    {
        "subreddit": "politics",
        "sentence": "With that said the democrats are at least courting the idea and have been since Trump left office"
    },
    {
        "subreddit": "politics",
        "sentence": "Biden has not nor has he ever been a proponent of radical changing systems to deny the GOP a fascist pivot for the country.\n\nLiberals in their effort to preserve liberty for everyone will ensure fascists take every liberty available."
    },
    {
        "subreddit": "politics",
        "sentence": "This submission has been automatically removed because it comes from a domain that is deemed not appropriate/off-topic for /r/politics\n\n[More information can be found here](http://www.reddit.com/r/politics/wiki/filtereddomains#wiki_other_inappropriate_content)\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "> He made the speech more about @JoeBiden non future than the graduates who are the future.\n\nReal rich coming from the same guy who publicly made Memorial Day all about himself and his grievances."
    },
    {
        "subreddit": "politics",
        "sentence": "Weird that you brought that one up"
    },
    {
        "subreddit": "politics",
        "sentence": "You must not have watched the trial huh?"
    },
    {
        "subreddit": "politics",
        "sentence": "Ew gross"
    },
    {
        "subreddit": "politics",
        "sentence": "Hahaha, no"
    },
    {
        "subreddit": "politics",
        "sentence": "They know Trump will be president and they stay away out of fear"
    },
    {
        "subreddit": "politics",
        "sentence": "(/s - see stock market talking point)"
    },
    {
        "subreddit": "politics",
        "sentence": "We can't end slavery - who's going to pick the cotton?"
    },
    {
        "subreddit": "politics",
        "sentence": "Trump only needs to encounter this Judge who jailed immediately a woman after she [laughed](https://www.youtube.com/watch?v=xyTzpSw6GVg&t=63s) at victims family in court,"
    },
    {
        "subreddit": "politics",
        "sentence": "Sacking the king.."
    },
    {
        "subreddit": "politics",
        "sentence": "bold move Cotton let's see if it plays off for em."
    },
    {
        "subreddit": "politics",
        "sentence": "They counting the votes, like we don't live in 1800 anymore, online.\n\nIt's also just insane democrats dont permanently push the physical event to before any and all deadlines: They know a lot if republicans are literal fascists."
    },
    {
        "subreddit": "politics",
        "sentence": "But is it? If the evidence was there for a guilty verdict and the judge says “don’t ignore the evidence” doesn’t that “virtually require conviction”? \n\nThis Cobb dude is no Trump fan"
    },
    {
        "subreddit": "politics",
        "sentence": "Zoroastrian already existed back then"
    },
    {
        "subreddit": "politics",
        "sentence": "Ahura Mazda was also a single god."
    },
    {
        "subreddit": "politics",
        "sentence": "As a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others"
    },
    {
        "subreddit": "politics",
        "sentence": "Debate/discuss/argue the merits of ideas, don't attack people"
    },
    {
        "subreddit": "politics",
        "sentence": "Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban"
    },
    {
        "subreddit": "politics",
        "sentence": "If you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "Based on the movies, I might actually enjoy eating in a restaurant owned by a gangster.\n\nFrom experience, I don't like eating in a restaurant with any MAGA jackass in the building."
    },
    {
        "subreddit": "politics",
        "sentence": "Weird and sad way of thinking"
    },
    {
        "subreddit": "politics",
        "sentence": "Politicians serve the people, not the other way around."
    },
    {
        "subreddit": "politics",
        "sentence": "The bar is too low."
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah if you cant find integrity in the GOP where can ya find it? /s"
    },
    {
        "subreddit": "politics",
        "sentence": "It actually does"
    },
    {
        "subreddit": "politics",
        "sentence": "Back then there were so many popular gods and people picked and chose and create their own pantheons they liked"
    },
    {
        "subreddit": "politics",
        "sentence": "So this Abrahamic god is the one that said to not worship any other god except him"
    },
    {
        "subreddit": "politics",
        "sentence": "It's actually never specified that the other gods don't exist, just that they should not be worshipped, or that they're \"false\" gods."
    },
    {
        "subreddit": "politics",
        "sentence": "Can't wait for the twisted logic they'll use in their decision that Shitzinpantz - and only Shitzinpantz - is immune from prosecution for *anything* he did while President, whether an official act or not."
    },
    {
        "subreddit": "politics",
        "sentence": "Doesn't matter"
    },
    {
        "subreddit": "politics",
        "sentence": "He'll just ramp up the propaganda, and let the media carry his message for him     \n     \n...the same media, who are shitting themselves, scared that their click bait golden goose might be going to jail, leaving them to re-learn how to report on actual fucking news"
    },
    {
        "subreddit": "politics",
        "sentence": "“Election at Bernie’s”"
    },
    {
        "subreddit": "politics",
        "sentence": "There’s a clause in the US constitution that says if a presidential candidate and VP candidate are from the same state, that state can’t cast its electoral votes for them"
    },
    {
        "subreddit": "politics",
        "sentence": "So Florida’s electoral votes wouldn’t count for a Trump/Rubio ticket unless one of them moves out beforehand."
    },
    {
        "subreddit": "politics",
        "sentence": "You’re murdering bastards hiding behind well Trump is over there, that’s why"
    },
    {
        "subreddit": "politics",
        "sentence": "Yep"
    },
    {
        "subreddit": "politics",
        "sentence": "It should have something like 2,000 reps by now."
    },
    {
        "subreddit": "politics",
        "sentence": "No you’re so right, just shutting up and accepting the genocide is the best course of action"
    },
    {
        "subreddit": "politics",
        "sentence": "That’s what the Palestinians need"
    },
    {
        "subreddit": "politics",
        "sentence": "Why is this uppity woman making such a stink about war crimes, genocide, and famine? Doesn’t she know that the best thing for the Palestinians is to bow her head to Biden and shut up? \n\nDo you hear yourself?"
    },
    {
        "subreddit": "politics",
        "sentence": "This is by design"
    },
    {
        "subreddit": "politics",
        "sentence": "In the Senate, land has more power than people."
    },
    {
        "subreddit": "politics",
        "sentence": "All you have to do to outrage a Trumpanzee is say…..Barbie….quickly followed by Taylor Swift, the finish with DEI"
    },
    {
        "subreddit": "politics",
        "sentence": "Mouth foaming ensues."
    },
    {
        "subreddit": "politics",
        "sentence": "Put a Mccorkle in it, she's done."
    },
    {
        "subreddit": "politics",
        "sentence": "Those migrants are fleeing to seek  permanent  safe  home  that  they  not  get  on thier  country  but  the  real  question  here  why  UK authorities  creating  unlawful  policy  that  hurting  million of migrants  different  images  even  videos  showed a man being put in a van by immigration enforcement officials, and another being led out of his house in handcuffs"
    },
    {
        "subreddit": "politics",
        "sentence": "eople are very frightened enough  in thier  own country  ?  so  why  even  UK  government  doing  unlawful things  to those  people  that  just  seeking  refuge ?"
    },
    {
        "subreddit": "politics",
        "sentence": "Or is arrested, killed in self defense, or tasers her own crotch in a right wing putch."
    },
    {
        "subreddit": "politics",
        "sentence": "> If conservatives become convinced that they cannot win democratically, they will not abandon conservatism"
    },
    {
        "subreddit": "politics",
        "sentence": "They will reject democracy.\n\n—David Frum"
    },
    {
        "subreddit": "politics",
        "sentence": "Bernie endorsed Hillary"
    },
    {
        "subreddit": "politics",
        "sentence": "That argument was disproven in 2015, but Bernie Bros kept trying it"
    },
    {
        "subreddit": "politics",
        "sentence": "Check your sources."
    },
    {
        "subreddit": "politics",
        "sentence": "I doubt they'll remember or care 4 years from now"
    },
    {
        "subreddit": "politics",
        "sentence": "But I do think that other people will probably make their way through the primaries instead"
    },
    {
        "subreddit": "politics",
        "sentence": "If Trump loses, I could see a real fracture happening soon in the GOP, and likely it'll become multiple factions vying for power."
    },
    {
        "subreddit": "politics",
        "sentence": "Such a little school shooter wannabe rat, that little cretin Rittenhouse"
    },
    {
        "subreddit": "politics",
        "sentence": "Wonder if Vegas will take bets on how many people he'll kill in 2025."
    },
    {
        "subreddit": "politics",
        "sentence": "it would be a real shame if people started doing viole*t direct action towards their local fascist enablers, and Very Soon"
    },
    {
        "subreddit": "politics",
        "sentence": "At no point did I say NATO should invade Israel"
    },
    {
        "subreddit": "politics",
        "sentence": "\"But surely he'd never throw **ME** under the bus...\""
    },
    {
        "subreddit": "politics",
        "sentence": "Did she at least make over 100k working for those pathetic Nazis? Probably not, same thing Nazis did to their rank and file"
    },
    {
        "subreddit": "politics",
        "sentence": "Why? Because the extremism they fomented now threatened their own positions"
    },
    {
        "subreddit": "politics",
        "sentence": "These trump people are the worst sort of people on the planet"
    },
    {
        "subreddit": "politics",
        "sentence": "Know why? They were raised and born in the most rich nation on earth but still turned out to be the biggest bigoted morons the species have ever seen"
    },
    {
        "subreddit": "politics",
        "sentence": "This statement means nothing to them, no embarrassment or shame"
    },
    {
        "subreddit": "politics",
        "sentence": "Just bunkering into the idea they need to band together and break into your house and execute you for not supporting trump"
    },
    {
        "subreddit": "politics",
        "sentence": "They've been training over these 4 years and have nothing to lose because they have no soul and no way out of the mind fuck they put themselves into."
    },
    {
        "subreddit": "politics",
        "sentence": "Iran might have a nuclear weapon"
    },
    {
        "subreddit": "politics",
        "sentence": "Or two even"
    },
    {
        "subreddit": "politics",
        "sentence": "In a way trusting Russia to not use nukes seems easier than Iran"
    },
    {
        "subreddit": "politics",
        "sentence": "But I can't explain why exactly"
    },
    {
        "subreddit": "politics",
        "sentence": "Dude, that link had SOOO many ads & popups I couldn't read the damn article (blocked & partially cut off)"
    },
    {
        "subreddit": "politics",
        "sentence": "I don't think it ever stopped loading lol\n\n[Here's a betrer link, CNN](https://www.cnn.com/2024/05/28/politics/jenna-ellis-colorado-law-license-suspended-2020-election/index.html)"
    },
    {
        "subreddit": "politics",
        "sentence": "Just because you don’t care about dead and starving children, doesn’t mean that no one cares."
    },
    {
        "subreddit": "politics",
        "sentence": "You must not be able to remember before Obamacare"
    },
    {
        "subreddit": "politics",
        "sentence": "I went from having no insurance and walking on a broken ankle until it healed wrong to 30 dollar a month insurance"
    },
    {
        "subreddit": "politics",
        "sentence": "I went to the Dr for the first time in my life after birth after obamacare"
    },
    {
        "subreddit": "politics",
        "sentence": "It isn't perfect but it's saved millions of lives"
    },
    {
        "subreddit": "politics",
        "sentence": "You're either very young or very naive to let perfect be the enemy to progress like you're doing"
    },
    {
        "subreddit": "politics",
        "sentence": "I'd caution you to stop watching tik toks"
    },
    {
        "subreddit": "politics",
        "sentence": "While I have good reason to be skeptical of any justice served out for Trump, I don’t have the same pessimism as you.\n\nFor me, the most compelling reason to think they proved the case is that Micheal Cohen admitted his wrong doing and got 4 years"
    },
    {
        "subreddit": "politics",
        "sentence": "He has never wavered from the fact that he broke the law, at the direct request of Trump, AND the paper trail of payments confirms both his admission of guilt, and Trumps guilt.\n\nI don’t think there’s a single doubt that Stormy got paid off"
    },
    {
        "subreddit": "politics",
        "sentence": "She had the literal receipts from the checks and there is no plausible explanation for her being paid $130k right before the election by Trumps lawyer, except that she was a hooker with a story to tell….which she’s told the jury"
    },
    {
        "subreddit": "politics",
        "sentence": "The other thing I’ll say, is that from what I’ve gleaned from people who reported on the case and were in court that things like Stormy’s testimony resonated with the jury"
    },
    {
        "subreddit": "politics",
        "sentence": "They laughed when she made quips or clapbacks against the defense and they apparently paid intense attention when Cohen was talking"
    },
    {
        "subreddit": "politics",
        "sentence": "I’m struggling to see how a jury member could look at the criminal fraud conspiracy of Trump and cohen, and the separate them to say Cohen is guilty Trump isn’t"
    },
    {
        "subreddit": "politics",
        "sentence": "A final thing is that the jury wasn’t sequestered, meaning they’ve likely seen or heard about his shananigans outside the court and in fake Twitter"
    },
    {
        "subreddit": "politics",
        "sentence": "I know we can only guess as to how it’s actually gone done and what jurors will think but I don’t see how much of a defense was presented in the face of a convicted co conspirator saying he did it and the woman in question confirming it"
    },
    {
        "subreddit": "politics",
        "sentence": "I just don’t see how the shaggy defense (wasn’t me) is going to work here."
    },
    {
        "subreddit": "politics",
        "sentence": "i already said this once in this thread, but my 'grading by art quality' middle school art teacher set me up for this really well.\n\nhe shattered my confidence in my ability to produce art"
    },
    {
        "subreddit": "politics",
        "sentence": "i wound up creating a lot of graphic design work for work now, and i look up every rule and guideline"
    },
    {
        "subreddit": "politics",
        "sentence": "if i ever have to make an artistic decision i look up the 'correct' way,  and follow the cookbook"
    },
    {
        "subreddit": "politics",
        "sentence": "i don't think i produce anything inspiring, but when you're just trying to communicate information efficiently in a visually appealing manner that's not a problem.\n\n(i appreciate that one of the few students he taught that ended up doing 'art' professionally took absolutely nothing from him but revulsion"
    },
    {
        "subreddit": "politics",
        "sentence": "a fitting legacy.)"
    },
    {
        "subreddit": "politics",
        "sentence": "Wasn't she the one who was back on Twitter spreading disinformation within 24 hours of her sentencing where she cried in front of the judge and said she thought she was doing the right thing?"
    },
    {
        "subreddit": "politics",
        "sentence": "So she helped him, got paid, and now will live a high life from book sales and tv spots"
    },
    {
        "subreddit": "politics",
        "sentence": "But ya we are really winning, sure."
    },
    {
        "subreddit": "politics",
        "sentence": "Or to always carry a sharpie, so lines can move to match your statements..."
    },
    {
        "subreddit": "politics",
        "sentence": "She gonna be selling cell phones out of a strip mall until she gets her license back."
    },
    {
        "subreddit": "politics",
        "sentence": ">If he says Trump is a lying, scamming, whoring, betraying piece of crap who am I to argue?\n\nAll it takes it a basic level of intelligence, a moral compass, and a desire to know the truth to arrive at that conclusion"
    },
    {
        "subreddit": "politics",
        "sentence": "The really sad thing is that ~35% of the population will never understand that."
    },
    {
        "subreddit": "politics",
        "sentence": "It’s almost like the IDF makes no effort to help the innocent civilians or to keep them out of harms way."
    },
    {
        "subreddit": "politics",
        "sentence": "Just to be clear.\n\nThis is **Trump complaining about the way the entire US justice system works**, where the defense makes their final argument *before* the prosecution."
    },
    {
        "subreddit": "politics",
        "sentence": "I live in Arizona"
    },
    {
        "subreddit": "politics",
        "sentence": "Biden had already won a majority of primary votes before we even got a chance to vote"
    },
    {
        "subreddit": "politics",
        "sentence": "My primary vote meant nothing."
    },
    {
        "subreddit": "politics",
        "sentence": "She got these people because she was the not-Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "It's not like her policy agenda was different than the rest of the GOP."
    },
    {
        "subreddit": "politics",
        "sentence": "I’m a very placid guy usually, take a bit to get me really riled up, but this judge I swear to god…"
    },
    {
        "subreddit": "politics",
        "sentence": "So we’ve gone from a two state solution to invading Israel with a NATO coalition? I was asking for realistic solutions."
    },
    {
        "subreddit": "politics",
        "sentence": "But did she write it down? Does she write anything?"
    },
    {
        "subreddit": "politics",
        "sentence": "Trump added those not Biden"
    },
    {
        "subreddit": "politics",
        "sentence": "And yes I wish Biden got rid of them, he didn't cause them, and not making their removal his top priority"
    },
    {
        "subreddit": "politics",
        "sentence": "Is reasonable considering all the other good Biden has done"
    },
    {
        "subreddit": "politics",
        "sentence": "And the fact companies often don't lower prices even when taxes or tariffs are cut, so at this point it's likely a cat out of the bag situation and it's simply do we want companies making more money, or the government? \n\nYes there is context and nuance"
    },
    {
        "subreddit": "politics",
        "sentence": "Just about anytime someone says there's no nuance they're trying to push an agenda"
    },
    {
        "subreddit": "politics",
        "sentence": "Yes I'm advocating for Biden"
    },
    {
        "subreddit": "politics",
        "sentence": "He's done a fine job unlike his competition"
    },
    {
        "subreddit": "politics",
        "sentence": "And I don't think we need someone who should be convicted of treason in the white house"
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah climate change is out of control right now"
    },
    {
        "subreddit": "politics",
        "sentence": "Trump definitely won't help that though."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes we wouldn’t want to piss off Israel, our “greatest ally” while we send them BILLIONS in weapons to brutalize more Palestinian children.\n\nYou must think America is so weak if you don’t think that we could condition our aid to Israel to be in accordance with international law AND US law"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s the bare minimum.\n\nAlso stop strawmanning leftists"
    },
    {
        "subreddit": "politics",
        "sentence": "If Biden actually showed some backbone, like Reagan did, by putting strong conditions on the weapons we send them, most progressives and leftists would be happy"
    },
    {
        "subreddit": "politics",
        "sentence": "Israel continues to commit war crimes and genocide and you really think the US is so powerless to stop it when WE are the main ones FUNDING IT?"
    },
    {
        "subreddit": "politics",
        "sentence": "that's all he's ever done politically"
    },
    {
        "subreddit": "politics",
        "sentence": "he did the same with the evangelical nutsacks."
    },
    {
        "subreddit": "politics",
        "sentence": "How money money you make has nothing to do with social security eligibility"
    },
    {
        "subreddit": "politics",
        "sentence": "These are the only two requirements:\n\nYou're eligible if:\n\nYou're 62 or older\n\nYou've worked and paid Social Security taxes for 10 years or more"
    },
    {
        "subreddit": "politics",
        "sentence": "From what I read he might be disbar for that"
    },
    {
        "subreddit": "politics",
        "sentence": "Think of the adult children!"
    },
    {
        "subreddit": "politics",
        "sentence": "No one cares about the Israel mess and Abortion is a knock against Biden? Nah homie, you couldn't be more wrong, Abortion is the only thing that might save him."
    },
    {
        "subreddit": "politics",
        "sentence": "> It's the Press's damn job.\n\n**NO,** IT'S NOT"
    },
    {
        "subreddit": "politics",
        "sentence": "It's the responsibility of each and every citizen.\n\nGranted, the \"Press\" should be required,but not trusted (excluding Fox News, of course) to provide facts and information to help an informed electorate to make decisions."
    },
    {
        "subreddit": "politics",
        "sentence": "Hi `zylstrar`"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank you for participating in /r/Politics"
    },
    {
        "subreddit": "politics",
        "sentence": "However, your submission has been removed for the following reason:\n\n* Off Topic \n\nThis submission was previously submitted, reviewed by the moderation team, and then removed for the stated reason"
    },
    {
        "subreddit": "politics",
        "sentence": "You can review our [submission rules here](https://www.reddit.com/r/politics/wiki/index#wiki_submission_rules) for more information regarding this removal"
    },
    {
        "subreddit": "politics",
        "sentence": "Searches for prior submissions will fail since they were removed.\n\nI'm a bot and sometimes I make mistakes"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any questions about this removal, please feel free to [message the moderators.](https://www.reddit.com/message/compose?to=/r/politics&subject=Question regarding the removal of this submission by /u/zylstrar&message=I have a question regarding the removal of this [submission.](https://www.reddit.com/r/politics/comments/1d36bkz/spying_hacking_and_intimidation_israels_nineyear/\\))"
    },
    {
        "subreddit": "politics",
        "sentence": ">Why not permanently?\n\nSo that if Trump wins the election she'll be able to do it again in 4 years."
    },
    {
        "subreddit": "politics",
        "sentence": "Only documentary these people need is the Bible /s"
    },
    {
        "subreddit": "politics",
        "sentence": "it would be great to see him talk about the business plot to bring down FDR"
    },
    {
        "subreddit": "politics",
        "sentence": "even though Biden represents a much smaller threat to business than FDR, it seems like they are still colluding to take Biden down"
    },
    {
        "subreddit": "politics",
        "sentence": "all these price increases?"
    },
    {
        "subreddit": "politics",
        "sentence": "As a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others"
    },
    {
        "subreddit": "politics",
        "sentence": "Debate/discuss/argue the merits of ideas, don't attack people"
    },
    {
        "subreddit": "politics",
        "sentence": "Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban"
    },
    {
        "subreddit": "politics",
        "sentence": "If you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "The number of shit bag politicians in Texas is astounding"
    },
    {
        "subreddit": "politics",
        "sentence": "The fact that Ken Paxton is still anywhere near public office has convinced me Texas politics lead the country in corrupt bullshit."
    },
    {
        "subreddit": "politics",
        "sentence": "4 nazis and a centrist sit at a table.."
    },
    {
        "subreddit": "politics",
        "sentence": "Ok, I get you now"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s all the Palestinian’s fault! \n\nRespectfully, If you believe that then you are of a simple mind"
    },
    {
        "subreddit": "politics",
        "sentence": "The only way forward is for Israel to acknowledge that it too has done wrong and then to start a dialogue in good faith that will lead to a just peace"
    },
    {
        "subreddit": "politics",
        "sentence": "Maybe not immediately but in time, the Israelis and Palestinians can become good neighbours and live side by side to each others mutual benefit"
    },
    {
        "subreddit": "politics",
        "sentence": "Look here, these two guys have already started \n\nhttps://www.reddit.com/r/Palestine/s/DKvJj8hhVL"
    },
    {
        "subreddit": "politics",
        "sentence": "You just heard about it."
    },
    {
        "subreddit": "politics",
        "sentence": "Imagine that 🤦🏻‍♂️"
    },
    {
        "subreddit": "politics",
        "sentence": "That's sure a funny way of saying Trump's new deal will cost the US over 110 billion in lost revenue."
    },
    {
        "subreddit": "politics",
        "sentence": "all through middle school i had the same art teach who fuckin roasted all my art"
    },
    {
        "subreddit": "politics",
        "sentence": "graded based on quality of work/reproduction"
    },
    {
        "subreddit": "politics",
        "sentence": "i went from loving the process to hating it"
    },
    {
        "subreddit": "politics",
        "sentence": "after 2 years i was just phoning it in cuz i knew a C or worse was inbound.\n\nturns out i had a vision impairment"
    },
    {
        "subreddit": "politics",
        "sentence": "i got it corrected a year or two later and now my hands go where i direct them!  my handwriting isn't shit! i can draw a circle! i can see depth!\n\nfuck that guy.\n\n...i admit, there has been an upside"
    },
    {
        "subreddit": "politics",
        "sentence": "i do a lot of map and poster design for work, and i don't trust myself at all"
    },
    {
        "subreddit": "politics",
        "sentence": "i follow ALL THE RULES when it comes to presenting data, and while my work isn't inspiring, it communicates clearly and is easy to look at."
    },
    {
        "subreddit": "politics",
        "sentence": "Trump's innaguaration speech preview.\n\n\"Ask not whaawhhaaa, your countrary can do for you, but what you can do for me"
    },
    {
        "subreddit": "politics",
        "sentence": "Speaking of me, everyone in the country came up to me, tears in their eyes, and said, president Trump, that's what they call me, president trump"
    },
    {
        "subreddit": "politics",
        "sentence": "Can you believe it?  Calling me president"
    },
    {
        "subreddit": "politics",
        "sentence": "What idiots would actually elect me president?  Must be that corrupt Joe and his family"
    },
    {
        "subreddit": "politics",
        "sentence": "But anyways, line up by your designated colors for processing\"\n\nSure, not as pithy as some presidents, but it can't help but bring a tear to your eye."
    },
    {
        "subreddit": "politics",
        "sentence": "I think his Catholic faith has a lot to do with it."
    },
    {
        "subreddit": "politics",
        "sentence": "“Other security issues” being the far right anti-Palestinian Israelis destroying the aid, while the IDF stands around and does nothing"
    },
    {
        "subreddit": "politics",
        "sentence": "so if this is true just one of these people need to get it recorded"
    },
    {
        "subreddit": "politics",
        "sentence": "the supreme court said only direct quid pro quo is illegal"
    },
    {
        "subreddit": "politics",
        "sentence": "so I don't see how this isn't the most direct thing"
    },
    {
        "subreddit": "politics",
        "sentence": "“ENCORE!” The people scream! Hoping she spontaneously combusts."
    },
    {
        "subreddit": "politics",
        "sentence": "Lmao…DooDoo Donnie is so done."
    },
    {
        "subreddit": "politics",
        "sentence": "We need the long form birth certificate to weed out all these rogue Kenyans."
    },
    {
        "subreddit": "politics",
        "sentence": "Why should they?"
    },
    {
        "subreddit": "politics",
        "sentence": "Why was it on rails"
    },
    {
        "subreddit": "politics",
        "sentence": "Why was it on rails"
    },
    {
        "subreddit": "politics",
        "sentence": "At least Homer's boss realized giving his workers tartar sauce made them better workers."
    },
    {
        "subreddit": "politics",
        "sentence": "Dude it’s the comment section of Reddit"
    },
    {
        "subreddit": "politics",
        "sentence": "If this is your source of factual information then you shouldn’t be surprised when things don’t pan out the way they say"
    },
    {
        "subreddit": "politics",
        "sentence": "I preface most of my speculation with things like “I’m not a lawyer “ or “I think…”.\n\nSome people enjoy speculating and making theories and discussing things that they may not know everything about"
    },
    {
        "subreddit": "politics",
        "sentence": "I enjoy learning about the law and politics and I try to apply the tiny bits of knowledge I glean from reliable sources and apply them to the shit that is happening in the world"
    },
    {
        "subreddit": "politics",
        "sentence": "I’m usually wrong, but I enjoy it and a lot of the time I learn just a little bit more from it"
    },
    {
        "subreddit": "politics",
        "sentence": "Please don’t take my theories, or anyone else’s that you aren’t 100% sure that the person making them is qualified, as fact or gospel."
    },
    {
        "subreddit": "politics",
        "sentence": "So there are many who identify as either liberal or conservative"
    },
    {
        "subreddit": "politics",
        "sentence": "Of those who do, how many actually believe every conservative or liberal tenent?  Most have their own privately held beliefs, things which they are learning more about, and hopes for the future."
    },
    {
        "subreddit": "politics",
        "sentence": "Musk isn't a natural-born US citizen"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank fuck for that."
    },
    {
        "subreddit": "politics",
        "sentence": "Don't forget to get husbands so they can know how to vote."
    },
    {
        "subreddit": "politics",
        "sentence": "I was low-key hoping for a Bioshock: Infinite reference here."
    },
    {
        "subreddit": "politics",
        "sentence": "And lastly, she was granted some consideration for having to sit next to Rudy G in the courtroom and gargle his noxious farts all day."
    },
    {
        "subreddit": "politics",
        "sentence": "Seems the US voters are going full on brain dead mode"
    },
    {
        "subreddit": "politics",
        "sentence": "After voting for the party that supported a fascist coup, they're getting ready to elect the guy who lead this coup - a criminal and an autocrat who's primary reason for running is to avoid going to jail.\n\n\nTrump's intentions here are painfully obvious and to say Democrats somehow need to make voters even more aware only means you're trying to deflect responsibility from the voters"
    },
    {
        "subreddit": "politics",
        "sentence": "Democracy only works if elections are used to punish politicians for their poor choices"
    },
    {
        "subreddit": "politics",
        "sentence": "If the voters refuse to do this, becoming an autocracy is only a matter of time."
    },
    {
        "subreddit": "politics",
        "sentence": "Wtf"
    },
    {
        "subreddit": "politics",
        "sentence": "And people still vote for him"
    },
    {
        "subreddit": "politics",
        "sentence": "It's crazy"
    },
    {
        "subreddit": "politics",
        "sentence": "America is built on the blood and sweat of immigrants...\n\nThe smart ones became white collar professionals.\n\nThe hard working ones provide labor at minimum wage.\n\nBut when the American Dream (tm) collapses....who will pick up the pieces?"
    },
    {
        "subreddit": "politics",
        "sentence": "I guess the argument would be that this would pull in some of the Latino voting population..? But I don't know if it would be enough to counter what he would lose when some of his rabidly racist white base refuse to vote because the running mate isn't white..."
    },
    {
        "subreddit": "politics",
        "sentence": "I doubt it, don't hear much great about Truman"
    },
    {
        "subreddit": "politics",
        "sentence": "although he was the last incumbent president to regain a trifecfa"
    },
    {
        "subreddit": "politics",
        "sentence": "Biden could be the next one 70 years later if abortion really strikes down Republicans"
    },
    {
        "subreddit": "politics",
        "sentence": "His wife's in a coma"
    },
    {
        "subreddit": "politics",
        "sentence": "Even if you for some reason believe the stuff, it just seems like such an exhausting existence"
    },
    {
        "subreddit": "politics",
        "sentence": "Being mad all the time for no reason."
    },
    {
        "subreddit": "politics",
        "sentence": "[This is the Jeffrey Clark who came up with the plan to overturn the 2020 election.](https://en.wikipedia.org/wiki/Jeffrey_Clark)\n\nHe is a traitor to the USA!"
    },
    {
        "subreddit": "politics",
        "sentence": "I'm still convinced this trial will do nothing.\nFound guilty with a slap on the wrist at best."
    },
    {
        "subreddit": "politics",
        "sentence": "It's almost July"
    },
    {
        "subreddit": "politics",
        "sentence": "Soon stores will be putting out their Christmas 2025 seasonal merchandise."
    },
    {
        "subreddit": "politics",
        "sentence": "Build a wall around Gilead."
    },
    {
        "subreddit": "politics",
        "sentence": "Why do you answer everything with a question?"
    },
    {
        "subreddit": "politics",
        "sentence": "It's transparent"
    },
    {
        "subreddit": "politics",
        "sentence": "She has been following orders"
    },
    {
        "subreddit": "politics",
        "sentence": "Nothing more"
    },
    {
        "subreddit": "politics",
        "sentence": "Delay delay delay."
    },
    {
        "subreddit": "politics",
        "sentence": "And if they had watched the movie, they would have seen half of it was about a man wanting to become more important than the woman, which should have been something they could really empathize with."
    },
    {
        "subreddit": "politics",
        "sentence": "I think if you’re suspended for 6 months and a day you need to apply to get it back after the time passes and can be rejected"
    },
    {
        "subreddit": "politics",
        "sentence": "There's also reports of ammunition and explosives in that camp."
    },
    {
        "subreddit": "politics",
        "sentence": "Joe Biden giving out American money to non American people like it grows on trees."
    },
    {
        "subreddit": "politics",
        "sentence": "It's not propaganda"
    },
    {
        "subreddit": "politics",
        "sentence": "There are a lot of people that will vote to end this republic on the grounds that they want to feel like a winner."
    },
    {
        "subreddit": "politics",
        "sentence": "Will he follow that mantra for himself now or after he loses the election?  He certainly doesn’t seem to be loving it."
    },
    {
        "subreddit": "politics",
        "sentence": "My Dearest Bella,\n\nIt is with heavy heart and an unbeknownst premonition of dread that I pen this letter, to urge you not to vote FOR THAT MOTHERFUCKER!\n\nYours lovingly\n\nKen"
    },
    {
        "subreddit": "politics",
        "sentence": "RFK is smart"
    },
    {
        "subreddit": "politics",
        "sentence": "He’s basically positioning himself as the backup guy"
    },
    {
        "subreddit": "politics",
        "sentence": "Just in case"
    },
    {
        "subreddit": "politics",
        "sentence": "Biden kept tariffs on $300 billion which Trump originally passed and then added some more"
    },
    {
        "subreddit": "politics",
        "sentence": "So everything you said about Trump necessarily applies to Biden.\n\nThere is no context and there is no nuance which makes your argument make sense"
    },
    {
        "subreddit": "politics",
        "sentence": "You just want to advocate for Biden"
    },
    {
        "subreddit": "politics",
        "sentence": "Ridiculous that you can try to justify such high tariffs on clean energy when climate change is out of control."
    },
    {
        "subreddit": "politics",
        "sentence": "Aw shucks"
    },
    {
        "subreddit": "politics",
        "sentence": "Well it's the only thing I care to discuss with someone...like you.."
    },
    {
        "subreddit": "politics",
        "sentence": "so answer or kindly see your way out?"
    },
    {
        "subreddit": "politics",
        "sentence": "As Churchill said: America always does the right thing - after it’s exhausted every other option"
    },
    {
        "subreddit": "politics",
        "sentence": "Let’s hope they’ve belatedly reached the point of Trump exhaustion."
    },
    {
        "subreddit": "politics",
        "sentence": "Only option is he knew it all and committed a felony or he was conned and duped by those working for him"
    },
    {
        "subreddit": "politics",
        "sentence": "Not a great look either way really for a presidential candidate."
    },
    {
        "subreddit": "politics",
        "sentence": "Will trump be alive to give all these orders"
    },
    {
        "subreddit": "politics",
        "sentence": "Ingrid was born a Mengele, her father Josef impregnated the the blond Nazi nurse Hildegard in the eugenics lab called 'Lebensborn' in 1942...\n\nhttps://en.wikipedia.org/wiki/Lebensborn"
    },
    {
        "subreddit": "politics",
        "sentence": "Hmm"
    },
    {
        "subreddit": "politics",
        "sentence": "There’s not many celebs that I know of that “stand up in favor of facism”"
    },
    {
        "subreddit": "politics",
        "sentence": "Who are you referring to? \n\nIn any case, I bet they were shitbags to begin with."
    },
    {
        "subreddit": "politics",
        "sentence": "It seems that most people who are arguing loudly for these protest votes are ones whose lives won't be harmed by a trump victory - straight, white, privileged people who would rather sit on their hands than actually prevent harm to the people they allegedly support."
    },
    {
        "subreddit": "politics",
        "sentence": "“The secretary must be notified of nomination convention schedule changes 18 months in advance..”"
    },
    {
        "subreddit": "politics",
        "sentence": "The Satanic Temple?"
    },
    {
        "subreddit": "politics",
        "sentence": "Me, quite plainly: I wasn’t implying that\n\nYou, repeatedly: you keep implying that\n\nEDIT: how can I “kindly respond or see myself out” when you’ve blocked me"
    },
    {
        "subreddit": "politics",
        "sentence": "SMH"
    },
    {
        "subreddit": "politics",
        "sentence": "Disingenuous from start to finish."
    },
    {
        "subreddit": "politics",
        "sentence": "Good news Cheeto doesn’t appear on the primary ballot because the paper work wasn’t submitted."
    },
    {
        "subreddit": "politics",
        "sentence": "A cool breeze on a hot day causes MAGA outrage."
    },
    {
        "subreddit": "politics",
        "sentence": "butthole sun, won't you come\n\nand wash away the rain\n\n\nChris Cornell was so"
    },
    {
        "subreddit": "politics",
        "sentence": "close."
    },
    {
        "subreddit": "politics",
        "sentence": "Activists such as these should find the nearest tree, go up to it and apologise to it."
    },
    {
        "subreddit": "politics",
        "sentence": "Can we at least help evacuate people? \n\nI don’t think Israel is going to stop dropping bombs if the alternative is risking its own people"
    },
    {
        "subreddit": "politics",
        "sentence": "And they can’t predict secondary explosions like in this past tragedy."
    },
    {
        "subreddit": "politics",
        "sentence": "Are u not making the argument that u can defeat Hamas militarily but not ideologically?"
    },
    {
        "subreddit": "politics",
        "sentence": "Because after 3 years treason will be cool again? Jenna ellis abused her power to try to undo our democracy, she shouldnt be a free woman let alone a practicing lawyer"
    },
    {
        "subreddit": "politics",
        "sentence": "There are more than two parties"
    },
    {
        "subreddit": "politics",
        "sentence": "This might genuinely be the first election on my lifetime where third party is the only viable response"
    },
    {
        "subreddit": "politics",
        "sentence": "Though I will caveat that I don't love Jill Stein, I think the Green Party are the only non-insane response to Trump/Biden."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm all for being an aggressive ideolog etc but just know you'll never convince anyone with that strategy"
    },
    {
        "subreddit": "politics",
        "sentence": "I just wanted to know how long Isreal should let hamas shoot rockets and rape their grandma's before they respond with military force? You obviously think they should have waited longer so please state how long and/or what they should have done in response instead"
    },
    {
        "subreddit": "politics",
        "sentence": "Perhaps a strongly written letter or complaints on reddit might have worked?"
    },
    {
        "subreddit": "politics",
        "sentence": "Their protest vote is one of selfish virtue signaling"
    },
    {
        "subreddit": "politics",
        "sentence": "It's essentially the trolley problem, and they can loudly proclaim that their inaction didn't contribute to even more suffering, even though it did"
    },
    {
        "subreddit": "politics",
        "sentence": "Quote: \"Former U.S. Department of Justice Assistant Attorney General Jeff Clark criticized Burns for \"pumping the Brandeis students\" with political views.\"\n\nHate to be the one to burst your bubble Jeff, but uni students are already politically aware and don't need your permission to be spoken to"
    },
    {
        "subreddit": "politics",
        "sentence": "Pull your head outta your ass."
    },
    {
        "subreddit": "politics",
        "sentence": "Why doesn't Biden tell Netanyahu to allow more aid trucks into Gaza from Israel?\n\nIs he that weak of a leader that he is scared of prime minister from a ally country?"
    },
    {
        "subreddit": "politics",
        "sentence": "This is still the most baffling difference between the US and other western nations to me"
    },
    {
        "subreddit": "politics",
        "sentence": "In the US, you have no chance to get elected if you don’t point out (and in many cases lie) that you’re a devout Christian"
    },
    {
        "subreddit": "politics",
        "sentence": "If you publicly state that you’re an atheist, your career is over.\n\nIn countries like the UK and most of Europe, it’s the other way around"
    },
    {
        "subreddit": "politics",
        "sentence": "If you’re religious, you do what the rest of the population does: Keep it to yourself because it’s considered private"
    },
    {
        "subreddit": "politics",
        "sentence": "If a politician would publicly talk about religion and their belief (especially in an election cycle), they might get ridiculed and people would question whether they’re fit for office"
    },
    {
        "subreddit": "politics",
        "sentence": "Religion is just not a part of public politics"
    },
    {
        "subreddit": "politics",
        "sentence": "For some people (mainly old folks), it’s just a community activity they attend."
    },
    {
        "subreddit": "politics",
        "sentence": "So he shouldn’t be judged for doing what he literally said was evil, because he must have thought it was ok, based on the fact that he did it?"
    },
    {
        "subreddit": "politics",
        "sentence": "Why would we blame ourselves for a choice that the Biden Administration made? It seems he is more interested in aiding and abetting Israel than he is in saving American \"democracy.\"  If Biden announced tomorrow that he'd start executing a single minority group and then Trump announced  he'd execute all the minority groups would you say you still need to vote for Biden? Whats the line in the sand where you wont vote for the lesser of two evils"
    },
    {
        "subreddit": "politics",
        "sentence": "Obviously its not thousands of innocent people dying and being starved to death while your taxpayer dollars provide the weapons."
    },
    {
        "subreddit": "politics",
        "sentence": "Jeez, there isn't even one single issue I can find to agree on in the Texas GOP platform"
    },
    {
        "subreddit": "politics",
        "sentence": "These people are freakin' aliens"
    },
    {
        "subreddit": "politics",
        "sentence": "I don't know how it's possible for people to be so different and removed from reality"
    },
    {
        "subreddit": "politics",
        "sentence": "Most of it is just culture war bullshit or Christofascism."
    },
    {
        "subreddit": "politics",
        "sentence": "Think it was in 2016 where DeNiro actually compared Trump to his character in that movie."
    },
    {
        "subreddit": "politics",
        "sentence": "Sounds like something Don forced him to say"
    },
    {
        "subreddit": "politics",
        "sentence": "Kind of like calling Costello as a witness"
    },
    {
        "subreddit": "politics",
        "sentence": "Blanche knows better, but the client is clearly calling the shots, and his checks cleared thanks to the GOP."
    },
    {
        "subreddit": "politics",
        "sentence": "I think \"he enslaved people\" would be more impactful that \"he owned enslaved people.\"  The former has his action be \"enslaving\", while the latter makes his action be \"owning\"."
    },
    {
        "subreddit": "politics",
        "sentence": "Right wing extremists will just come back with a vengeance"
    },
    {
        "subreddit": "politics",
        "sentence": "None of them receive close to a proper punishment"
    },
    {
        "subreddit": "politics",
        "sentence": "Add to that the number of fucks that expect to get pardoned by the next right wing leader, and the writing is on the walls"
    },
    {
        "subreddit": "politics",
        "sentence": "They're not even afraid to break the law, to end democracy"
    },
    {
        "subreddit": "politics",
        "sentence": "Why would they be? The punishment is barely anything."
    },
    {
        "subreddit": "politics",
        "sentence": "I assume it was Cleopatra Jones"
    },
    {
        "subreddit": "politics",
        "sentence": "I'm pretty sure the far left want Trump to win"
    },
    {
        "subreddit": "politics",
        "sentence": "At least in my group of (semi-ex) left wing friends, they seem pretty determined to see Biden lose no matter what"
    },
    {
        "subreddit": "politics",
        "sentence": "The only good thing, is most never registered to vote in either 2016 or 2020's election"
    },
    {
        "subreddit": "politics",
        "sentence": "At a wider level, many are just so far down the rabbit hole of misinformation and lies, they're as far gone as the right was in 2015/2016, and they're only going to get worse"
    },
    {
        "subreddit": "politics",
        "sentence": "I mean hell, just look at the misinformation and out right lies they're spreading about this conflict"
    },
    {
        "subreddit": "politics",
        "sentence": "Even the explosion at the refugee camp is a perfect example."
    },
    {
        "subreddit": "politics",
        "sentence": "RFK was originally running as a democrat"
    },
    {
        "subreddit": "politics",
        "sentence": "You’re absolutely correct that he’s a staunch liberal and hates Trump."
    },
    {
        "subreddit": "politics",
        "sentence": "Was anyone suggesting that this would move any needle?\n\nAt best, I would think it could add more motion behind any narrative that may be trying to be made."
    },
    {
        "subreddit": "politics",
        "sentence": "I mean you can be pro-child killing and pretend you’re gobbling up a big dollop of moral superiority if you want at least I’m not waxing lyrical in delusion to justify thousands of dead innocents"
    },
    {
        "subreddit": "politics",
        "sentence": "Kyle Rittenhouse"
    },
    {
        "subreddit": "politics",
        "sentence": "Out of those plenty of cases, how many of those didn't involve a rich person defrauding investors/richer people?"
    },
    {
        "subreddit": "politics",
        "sentence": "It's almost like the people who are saying these things aren't saying them in good faith."
    },
    {
        "subreddit": "politics",
        "sentence": "Sorry for the downvotes, because you're absolutely right"
    },
    {
        "subreddit": "politics",
        "sentence": "Blaming voters when every day for months Biden makes another decision that further hurts his chances makes me feel insane"
    },
    {
        "subreddit": "politics",
        "sentence": "I'm like you, I'll vote for him"
    },
    {
        "subreddit": "politics",
        "sentence": "But it's his own choices over and over that have brought him here"
    },
    {
        "subreddit": "politics",
        "sentence": "A week or two ago he attacked The Hague"
    },
    {
        "subreddit": "politics",
        "sentence": "There is no action I can take between now and the election that would help or hurt anywhere near as much as his own damn decisions"
    },
    {
        "subreddit": "politics",
        "sentence": "He is the one with all the power here."
    },
    {
        "subreddit": "politics",
        "sentence": "100% this."
    },
    {
        "subreddit": "politics",
        "sentence": "She better start her OnlyFans while she’s still a naughty Congressmoron!"
    },
    {
        "subreddit": "politics",
        "sentence": "'supposedly'\n\nStill, what the actual eff..."
    },
    {
        "subreddit": "politics",
        "sentence": "He can call it whatever he wants, his *actions* of owning 100's of slaves showed he still thought of it as acceptable on some level.\n\nEDIT: Lmao he just blocked me"
    },
    {
        "subreddit": "politics",
        "sentence": "Most people don't understand what a \"precedent\" is"
    },
    {
        "subreddit": "politics",
        "sentence": "I mean, if people want to talk about \"twisting words,\" she's done far more than her fair share of twisting previous opinions to give the Fed more power than the opinions she cites give"
    },
    {
        "subreddit": "politics",
        "sentence": "But the angry people here won't go educate themselves on what those terms mean, or what the opinions she cites says"
    },
    {
        "subreddit": "politics",
        "sentence": "They might read 1 or 2 of her opinions and feel her arguments are valid when the rest of us know why they were overturned or she was in the dissent 🤷‍♂️"
    },
    {
        "subreddit": "politics",
        "sentence": "Thanks!"
    },
    {
        "subreddit": "politics",
        "sentence": "Ironically, DeNiro is, by all accounts, a pretty nice guy"
    },
    {
        "subreddit": "politics",
        "sentence": "he's actually probably the quintessential New Yorker"
    },
    {
        "subreddit": "politics",
        "sentence": "Gruff, and direct, but also pretty nice."
    },
    {
        "subreddit": "politics",
        "sentence": "Forget about witches, Santa Carla is overrun with vampires!"
    },
    {
        "subreddit": "politics",
        "sentence": "If someone remotely likes trump there’s probably a good chance the person lacks morals OR is stupid OR ignorant OR genuinely wants destruction"
    },
    {
        "subreddit": "politics",
        "sentence": "None of those are good."
    },
    {
        "subreddit": "politics",
        "sentence": "[I wish I were making it up ](https://www.snopes.com/fact-check/ivana-trump-grave-weeds/)"
    },
    {
        "subreddit": "politics",
        "sentence": "He's not wrong."
    },
    {
        "subreddit": "politics",
        "sentence": "Even Napoleon had his watergate. \n\n-Yogi Berra"
    },
    {
        "subreddit": "politics",
        "sentence": "That's because he's on some committee for safer vaccines with RFK"
    },
    {
        "subreddit": "politics",
        "sentence": "But over the years, DeNiro has made no secret of his rather liberal views."
    },
    {
        "subreddit": "politics",
        "sentence": "Complaints without suggestions I see."
    },
    {
        "subreddit": "politics",
        "sentence": "well since you're willing to admit you don't know the right answer to the question why not also consider that there isn't one? This is a war, sure it's a cycle of violence but group A should definitely consider the military strength of group B when dealing with them"
    },
    {
        "subreddit": "politics",
        "sentence": "Israel isn't going to just sit there and be rocket practice forever and we shouldn't expect them to be."
    },
    {
        "subreddit": "politics",
        "sentence": "See, that's the sad part of this whole shit show, my fellow lefties are \"Screw Biden, I'm not voting for him because of Palestine!\" without realizing that the right is even more pro Israel than we are (Hell, I'm sure Trump & Co would be more than happy to round up all the Palestinians in the US and ship them back to Gaza so they can be killed off by the Israelis as well, they don't give one shit what Israel does), a non vote for Biden or a vote for Trump might make stuff like that happen (at least Biden is trying to get the two sides to call a truce and blocking transfer of bombs and artillery shells to Israel)."
    },
    {
        "subreddit": "politics",
        "sentence": "Media companies have just decided to throw in the towel and allow Trump to be the eternal victim, therefore, they need to kiss his ass"
    },
    {
        "subreddit": "politics",
        "sentence": "Why? Because listening to him gripe over everything is ratings gold.."
    },
    {
        "subreddit": "politics",
        "sentence": "And, they know that if he wins that news companies are about to get more than simple threats from MAGA"
    },
    {
        "subreddit": "politics",
        "sentence": "MAGA gonna infiltrate and cause human casualties because Dear Leader was besmirched"
    },
    {
        "subreddit": "politics",
        "sentence": "Don't get it confused.."
    },
    {
        "subreddit": "politics",
        "sentence": "They cowardly decided to bend the knee to the monster they unleashed."
    },
    {
        "subreddit": "politics",
        "sentence": "Being a decent human being is a way of life, not a game."
    },
    {
        "subreddit": "politics",
        "sentence": "The fact I'm not sure if this is true or not is a problem.."
    },
    {
        "subreddit": "politics",
        "sentence": "Eff Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "If it moves even 1 or 2% of Republicans that's probably enough to hand Biden the WH."
    },
    {
        "subreddit": "politics",
        "sentence": "Onion.."
    },
    {
        "subreddit": "politics",
        "sentence": "Parody...."
    },
    {
        "subreddit": "politics",
        "sentence": "Perhaps more than making a point, I’m offering the broader view that there are instances where the good things people did should be remembered in spite of bad things they may have done, but the good has to outweigh the bad"
    },
    {
        "subreddit": "politics",
        "sentence": "There are statues of Thomas Jefferson, and I’d not support tearing them down simply because of his having fathered children by his slaves"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s *definitely* something we should discuss as a society, so I’m not saying he deserves a pass, but his greater contribution to American history is valuable enough to preserve and memorialize in spite of everything else.\n\nSo, I’m really just saying there may be arguments for keeping up statues of some bad actors from history, but I don’t believe the leaders of the Confederacy generally meet the threshold for deserving recognition in spite of the glaring flaws in their actions and beliefs."
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah just like when Thomas Jefferson applied today’s standards to his own life"
    },
    {
        "subreddit": "politics",
        "sentence": ">Throughout his entire life, Thomas Jefferson was publicly a consistent opponent of slavery"
    },
    {
        "subreddit": "politics",
        "sentence": "Calling it a “moral depravity”1 and a “hideous blot,”2 he believed that slavery presented the greatest threat to the survival of the new American nation.3 Jefferson also thought that slavery was contrary to the laws of nature, which decreed that everyone had a right to personal liberty.4\n\nhttps://www.monticello.org/thomas-jefferson/jefferson-slavery/jefferson-s-attitudes-toward-slavery/"
    },
    {
        "subreddit": "politics",
        "sentence": "I am well aware of what a Trump presidency means"
    },
    {
        "subreddit": "politics",
        "sentence": "Fascism in America"
    },
    {
        "subreddit": "politics",
        "sentence": "I am also aware of what a Biden second term means"
    },
    {
        "subreddit": "politics",
        "sentence": "A stay of execution at the federal level while executions at the state level continue, disillusionment and political disengagement increases in the democratic voting base and then we are right here again in 4 years but in an even worse position then we are now"
    },
    {
        "subreddit": "politics",
        "sentence": "The point people seem to not understand is that it didnt have to be this way and we could have demanded a different candidate.  Now you and others are asking people to vote in the name of some level of temporary self preservation"
    },
    {
        "subreddit": "politics",
        "sentence": "A vote that requires you to effectively condone the callous and disgusting nature of what the Biden admin has been doing since October 7th"
    },
    {
        "subreddit": "politics",
        "sentence": "For many that is not an easy choice to make, even if it is for you"
    },
    {
        "subreddit": "politics",
        "sentence": "If we can accept this level of depravity, what level wont we accept?"
    },
    {
        "subreddit": "politics",
        "sentence": "For once I understood a reference!"
    },
    {
        "subreddit": "politics",
        "sentence": "And it's worth exactly as much as yours, and as much as De Niro's"
    },
    {
        "subreddit": "politics",
        "sentence": "Celebrities aren't special and neither are their opinions"
    },
    {
        "subreddit": "politics",
        "sentence": "They're just people, and an actor saying the same thing we're all already thinking isn't noteworthy or deserving of a headline."
    },
    {
        "subreddit": "politics",
        "sentence": "Dems let their celebrities mock them at their own events"
    },
    {
        "subreddit": "politics",
        "sentence": "Republicans let their celebrities verbally fellate them at their own events.\n\nBig difference"
    },
    {
        "subreddit": "politics",
        "sentence": "One of the Bushes at the white house correspondence dinner may be an exception...but can't remember which one."
    },
    {
        "subreddit": "politics",
        "sentence": "I gotta say"
    },
    {
        "subreddit": "politics",
        "sentence": "I really hate her."
    },
    {
        "subreddit": "politics",
        "sentence": "Convicted felon, Donald Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "Rapist, Donald Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "Failed businessman, Donald Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "Traitor, Donald Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "So many titles!"
    },
    {
        "subreddit": "politics",
        "sentence": "So finally the cloak comes off"
    },
    {
        "subreddit": "politics",
        "sentence": "She’s even worse that the baboon"
    },
    {
        "subreddit": "politics",
        "sentence": "She belongs in the same cell as him"
    },
    {
        "subreddit": "politics",
        "sentence": "They deserve to make a love child"
    },
    {
        "subreddit": "politics",
        "sentence": "They won’t blame themselves"
    },
    {
        "subreddit": "politics",
        "sentence": "They will blame democrats for not putting forth a better candidate"
    },
    {
        "subreddit": "politics",
        "sentence": "They are willing to kill people for the selfish reason of passing their own purity test."
    },
    {
        "subreddit": "politics",
        "sentence": "This is a significant development"
    },
    {
        "subreddit": "politics",
        "sentence": "Legal accountability is important for maintaining trust in the system."
    },
    {
        "subreddit": "politics",
        "sentence": "Abe Fortas resigned because either Nixon pressured him with legal action or because Dems in Congress would have voted to impeach him"
    },
    {
        "subreddit": "politics",
        "sentence": "we aren't really sure which one AFAIK"
    },
    {
        "subreddit": "politics",
        "sentence": "but either way it was for less than what Clarence did"
    },
    {
        "subreddit": "politics",
        "sentence": "As for the letter they signed, they sided with the Republicans and declined to have their leader meet with a senate committee"
    },
    {
        "subreddit": "politics",
        "sentence": "They then lied and said all 9 justices follow an ethics code they clearly don't"
    },
    {
        "subreddit": "politics",
        "sentence": "Unless of course all those bribes were just a \"misunderstanding\""
    },
    {
        "subreddit": "politics",
        "sentence": "Really they even used the word \"clarification\" which does necessitate a misunderstanding"
    },
    {
        "subreddit": "politics",
        "sentence": "You see now that the rules have been clarified we won't repeat this misunderstanding where we accept lavish vacations, 300,000 motor coaches, and sell off our property but still live in it"
    },
    {
        "subreddit": "politics",
        "sentence": "Oh and all to people with business before the court"
    },
    {
        "subreddit": "politics",
        "sentence": "That was all just a misunderstanding that needed a \"clarification\"."
    },
    {
        "subreddit": "politics",
        "sentence": "True, I was moreso commenting on the disinformation bubble since he shares some of his own."
    },
    {
        "subreddit": "politics",
        "sentence": ">Or they were just bad people\n\nThere you go judging people by today's standards again."
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah he says he wants safer vaccines but specifically mentions his son with Autism anytime he makes a vaccine comment."
    },
    {
        "subreddit": "politics",
        "sentence": "Your submission `Who is the gay man Libertarians chose as their Presidential nominee over Trump?` was automatically removed because `queerty.com` is not on our [approved domains list](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "r/politics has a number of conditions that domains must adhere to in order to be approved as an acceptable source"
    },
    {
        "subreddit": "politics",
        "sentence": "Domains must:\n\n* Be notable, as defined by our [**domain notability guidelines**](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "Notable domains will consist of news organizations, research organizations, political advocacy groups, governmental agencies / bodies, and political parties"
    },
    {
        "subreddit": "politics",
        "sentence": "* Contain articles, videos or sound-clips relevant to current US politics\n* Contain original content that has not been stolen or rehosted from another source"
    },
    {
        "subreddit": "politics",
        "sentence": "* Be accessible at least once **without** paying for a subscription or completing a survey"
    },
    {
        "subreddit": "politics",
        "sentence": "If you believe that you have a domain that is eligible for our approved domains list, please use the link at the end of this message to submit it to us"
    },
    {
        "subreddit": "politics",
        "sentence": "However please note that if you submit spam or rule breaking content to us via the form, we will match the domain against this submission and may take action against your account"
    },
    {
        "subreddit": "politics",
        "sentence": "If you submit a spam domain via the form, your account may be reported to the site administrators"
    },
    {
        "subreddit": "politics",
        "sentence": "To submit a domain for approval [use this form](https://goo.gl/forms/lRQikA1rI0bVbKCl1) and follow the instructions provided\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "They should put this shit next to Osama out in the middle of nowhere!"
    },
    {
        "subreddit": "politics",
        "sentence": "I’m IN one of those Midwest States and think it’s BS"
    },
    {
        "subreddit": "politics",
        "sentence": "Of course I’m in the minority."
    },
    {
        "subreddit": "politics",
        "sentence": "If Israel wanted all of Palestine dead, they all would be already"
    },
    {
        "subreddit": "politics",
        "sentence": "They have the means opportunity and are already being accused of genocide so if they wanted genocide why not just do it? Even of you use the fake hamas numbers, 30k is nowhere near \"everybody\" now answer my question ty."
    },
    {
        "subreddit": "politics",
        "sentence": "and they would still abstain from voting bc “biDeN bAd” as if Trump wouldn’t be a 10 million times worse for the cause, and quite literally the entire country"
    },
    {
        "subreddit": "politics",
        "sentence": "Problem is, it's cities vs countryside"
    },
    {
        "subreddit": "politics",
        "sentence": "How do you divorce that?"
    },
    {
        "subreddit": "politics",
        "sentence": "This is unfortunately overly optimistic"
    },
    {
        "subreddit": "politics",
        "sentence": "The number of young people who identify as liberal is only a few percentage points higher than previous generations.\n\nIn addition previous generations have consistently become more conservative (a few percentage points per decade) as they age"
    },
    {
        "subreddit": "politics",
        "sentence": "This latter effect has historically balanced out the dying off of older conservatives. \n\nEvery young generation is more liberal than conservative"
    },
    {
        "subreddit": "politics",
        "sentence": "This youngest one is only slightly more than previous.\n\nRepublicans will add one or two socially liberal issues to their platform if necessary"
    },
    {
        "subreddit": "politics",
        "sentence": "They won’t just let themselves die"
    },
    {
        "subreddit": "politics",
        "sentence": "Of course them moving a bit to the left would be a good sign but they would still be far right from where they were 50 years ago"
    },
    {
        "subreddit": "politics",
        "sentence": "Unfortunately, these people are immune to rational thought."
    },
    {
        "subreddit": "politics",
        "sentence": "Yea but think of their billionaire real estate buddies who are losing money because companies can downsize the space they need to lease due for remote work!"
    },
    {
        "subreddit": "politics",
        "sentence": "Except no, because the actual situations were quite different."
    },
    {
        "subreddit": "politics",
        "sentence": "Not being married or pregnant doesn’t fuck me up unlike not getting my health taken care of."
    },
    {
        "subreddit": "politics",
        "sentence": "Or they were just bad people who admitted they were doing monstrous things while they continued to do them.\n\nIt’s not different standards, the ethics never changed, it’s just what they were able to get away with."
    },
    {
        "subreddit": "politics",
        "sentence": "Your submission `Libertarians select gay presidential candidate` was automatically removed because `windycitytimes.com` is not on our [approved domains list](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "r/politics has a number of conditions that domains must adhere to in order to be approved as an acceptable source"
    },
    {
        "subreddit": "politics",
        "sentence": "Domains must:\n\n* Be notable, as defined by our [**domain notability guidelines**](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "Notable domains will consist of news organizations, research organizations, political advocacy groups, governmental agencies / bodies, and political parties"
    },
    {
        "subreddit": "politics",
        "sentence": "* Contain articles, videos or sound-clips relevant to current US politics\n* Contain original content that has not been stolen or rehosted from another source"
    },
    {
        "subreddit": "politics",
        "sentence": "* Be accessible at least once **without** paying for a subscription or completing a survey"
    },
    {
        "subreddit": "politics",
        "sentence": "If you believe that you have a domain that is eligible for our approved domains list, please use the link at the end of this message to submit it to us"
    },
    {
        "subreddit": "politics",
        "sentence": "However please note that if you submit spam or rule breaking content to us via the form, we will match the domain against this submission and may take action against your account"
    },
    {
        "subreddit": "politics",
        "sentence": "If you submit a spam domain via the form, your account may be reported to the site administrators"
    },
    {
        "subreddit": "politics",
        "sentence": "To submit a domain for approval [use this form](https://goo.gl/forms/lRQikA1rI0bVbKCl1) and follow the instructions provided\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "Which, reminder, the problem was not paying because she reached out"
    },
    {
        "subreddit": "politics",
        "sentence": "It was not reporting the in kind campaign contribution and falsifying business records"
    },
    {
        "subreddit": "politics",
        "sentence": "If he paid, documented it properly, and reported it, he wouldn't be in this scenario"
    },
    {
        "subreddit": "politics",
        "sentence": "Could we then do that for the Senate?"
    },
    {
        "subreddit": "politics",
        "sentence": "Jon Stewart passionately calling out republicans barely got enough attention from the press to get something done"
    },
    {
        "subreddit": "politics",
        "sentence": "Most of that attention was through social media\n\nIt's not like the press is going out their way to highlight popular people if it doesn't help Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "Jon is probably just as much of a social icon as DeNiro, and both are beloved New Yorkers."
    },
    {
        "subreddit": "politics",
        "sentence": "Most defendants don't have possible judges that want to suck their dick"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s not strange, it’s a fact"
    },
    {
        "subreddit": "politics",
        "sentence": "You can look into itz; they have a lot of the same strange conspiracy beliefs"
    },
    {
        "subreddit": "politics",
        "sentence": "My wife has helped Bob with many events including a few dinners raising funds for RFK jr"
    },
    {
        "subreddit": "politics",
        "sentence": "Bob knows that  RFK isn’t going to be on the ticket"
    },
    {
        "subreddit": "politics",
        "sentence": "Plus he doesn’t have a chance of winning and believes Trump is FAR worse for America than any other option"
    },
    {
        "subreddit": "politics",
        "sentence": "Unfortunately, Bob is a bit of a whacko, but he’s an extremely nice man"
    },
    {
        "subreddit": "politics",
        "sentence": "I met him once, he told me to call him Bob and thanked me for paying him some compliments"
    },
    {
        "subreddit": "politics",
        "sentence": "He tells everyone to call him Bob"
    },
    {
        "subreddit": "politics",
        "sentence": "I was absolutely star struck"
    },
    {
        "subreddit": "politics",
        "sentence": "He remembers everyone’s name and is known as a good tipper in the city."
    },
    {
        "subreddit": "politics",
        "sentence": "*atronaut meme*"
    },
    {
        "subreddit": "politics",
        "sentence": "A majority of the signers of the Declaration of Independence and nearly half of the delegates to the Constitutional Convention owned slaves"
    },
    {
        "subreddit": "politics",
        "sentence": "So they knew it was wrong, but didn't feel strongly enough about it to emancipate their slaves?\n\nThat's having different standards."
    },
    {
        "subreddit": "politics",
        "sentence": "Lifetime disbarment by CO would simply mean lifetime disbarment *in CO*"
    },
    {
        "subreddit": "politics",
        "sentence": "There's mechanism to make that 50 separate and autonomous, geographically-dependent, instances of permanent, or even temporary, disbarment."
    },
    {
        "subreddit": "politics",
        "sentence": "Would honestly be better to arrange a few accidents"
    },
    {
        "subreddit": "politics",
        "sentence": "For claiming to know the courts better than anybody, he sure doesn’t know anything about the court system."
    },
    {
        "subreddit": "politics",
        "sentence": "Literally been hearing that it's in its death throes since Bush won in 2000, and yet here we are."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm about 90% certain the worm is doing most of the talking these days.\n \nI am *not* indicating that RFK disagrees with anything the worm has to say."
    },
    {
        "subreddit": "politics",
        "sentence": ">It is very likely that that bomb is going to kill children.\n\nNot necessarily"
    },
    {
        "subreddit": "politics",
        "sentence": "And again, this is war"
    },
    {
        "subreddit": "politics",
        "sentence": "Casualties r a tragic consequence of war, and this war was started and perpetuatef by Hamas.\n\n>The horrors perpetuated by Hamas do not negate that.\n\nThey perpetuate it.\n\n>And let's be real, there's no destroying Hamas in this way"
    },
    {
        "subreddit": "politics",
        "sentence": "If you cut off the head, two more will grow in its place.\n\nBy that reasoning, the allies shouldn't have bothered fighting the Nazis, yet denazification happened after they were defeated militarily and their leadership brought to justice."
    },
    {
        "subreddit": "politics",
        "sentence": "My question:  Why doesn't she just post the videos of her sucking tRump's dick to explain her \"rulings?\"  Once they're in public domain, he (tRump) has no more leverage."
    },
    {
        "subreddit": "politics",
        "sentence": "If only I could get that in my life"
    },
    {
        "subreddit": "politics",
        "sentence": "I would commit so many crimes, not be held accountable, and then go retire in an underground bunker to wait for the end."
    },
    {
        "subreddit": "politics",
        "sentence": "Rob Schneider is....The Campaign Consultant"
    },
    {
        "subreddit": "politics",
        "sentence": "Israel is resisting genocide"
    },
    {
        "subreddit": "politics",
        "sentence": "Gaza elected the people who are now responsible for killing them"
    },
    {
        "subreddit": "politics",
        "sentence": "So yea"
    },
    {
        "subreddit": "politics",
        "sentence": "It sucks but be ok with genocide on yourself or try to kill the enemy."
    },
    {
        "subreddit": "politics",
        "sentence": "Nobodies perfect."
    },
    {
        "subreddit": "politics",
        "sentence": "Voting for Bill Clinton gave us the crime bill,  the repeal of glass-steagall, dont ask dont tell, and welfare to work"
    },
    {
        "subreddit": "politics",
        "sentence": "Voting for Obama didnt change a ton from the Bush era in terms of the worst policies (Patriot Act, Wars abroad)"
    },
    {
        "subreddit": "politics",
        "sentence": "Obama also signed a bill that bailed out banks but offered no protections to millions of homeowners who ended up losing their homes"
    },
    {
        "subreddit": "politics",
        "sentence": "He also signed a republican healthcare bill that no republicans voted for.  Neither Clinton nor Obama did anything to delegitimize the republican party and sought out bipartisanship at every turn, even when they didn't need to"
    },
    {
        "subreddit": "politics",
        "sentence": "Neither moved the country further to the left"
    },
    {
        "subreddit": "politics",
        "sentence": "Nor did either establish democratic momentum"
    },
    {
        "subreddit": "politics",
        "sentence": "Instead they created an environment where the republicans flourished.  Now we have Joe Biden doing the same thing, dissipating any possible momentum for increasing the democratic voting base in the face of an emboldened and constantly rightward marching republican party.  If you dont see that then I don't know what to tell you."
    },
    {
        "subreddit": "politics",
        "sentence": "> On the one hand, none of us deserves to be remembered only for the worst thing we’ve ever done, and the same goes for historical figures, too.\n\nThere are many historical and living figures who deserve to only be remembered for their atrocities.\n \nMaybe I'm missing the point you're trying to make."
    },
    {
        "subreddit": "politics",
        "sentence": "Hmm I still want to downvote you"
    },
    {
        "subreddit": "politics",
        "sentence": "I have only grown more liberal as I've gotten older"
    },
    {
        "subreddit": "politics",
        "sentence": "The Republicans have become a party of Christian nationalism."
    },
    {
        "subreddit": "politics",
        "sentence": "Hi `External-Recipe-1936`"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank you for participating in /r/Politics"
    },
    {
        "subreddit": "politics",
        "sentence": "However, your submission has been removed for the following reason:\n\n* Already Submitted: This article has been submitted to /r/politics _within_ the last three days, and has been removed for violating [that submission rule](https://www.reddit.com/r/politics/wiki/index#wiki_do_not_resubmit_.22already_submitted.22_content) however you can see that thread here: https://redd.it/1d2px6s\n\nI'm a bot and sometimes I make mistakes"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any questions about this removal, please feel free to [message the moderators.](https://www.reddit.com/message/compose?to=/r/politics&subject=Question regarding the removal of this submission by /u/External-Recipe-1936&message=I have a question regarding the removal of this [submission.](https://www.reddit.com/r/politics/comments/1d35rvp/biden_campaign_sends_allies_de_niro_and_first/\\))"
    },
    {
        "subreddit": "politics",
        "sentence": "She has to mean Finish Hamas, the terrorist organization"
    },
    {
        "subreddit": "politics",
        "sentence": "We all see that, right? \n\nPoor word choice on her part, but writing on missiles is about as old as missiles."
    },
    {
        "subreddit": "politics",
        "sentence": "Now we know that using celebrities for your campaign is just a stunt"
    },
    {
        "subreddit": "politics",
        "sentence": "Good thing Trump doesn't resort to such low ball attempts to attract voters."
    },
    {
        "subreddit": "politics",
        "sentence": "> the moral conclusion that they will not vote for Biden\n\nThe ‘moral conclusion’ to aid a dictatorship."
    },
    {
        "subreddit": "politics",
        "sentence": "Give Homer Simpson some fucking credit here."
    },
    {
        "subreddit": "politics",
        "sentence": "Your submission `Blackstone CEO Steve Schwarzman Confirms Support for Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "The boss of the globally recognizable investment management company confirmed his support for Donald Trump in light of the upcoming US presidential election` was automatically removed because `gamblingnews.com` is not on our [approved domains list](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "r/politics has a number of conditions that domains must adhere to in order to be approved as an acceptable source"
    },
    {
        "subreddit": "politics",
        "sentence": "Domains must:\n\n* Be notable, as defined by our [**domain notability guidelines**](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "Notable domains will consist of news organizations, research organizations, political advocacy groups, governmental agencies / bodies, and political parties"
    },
    {
        "subreddit": "politics",
        "sentence": "* Contain articles, videos or sound-clips relevant to current US politics\n* Contain original content that has not been stolen or rehosted from another source"
    },
    {
        "subreddit": "politics",
        "sentence": "* Be accessible at least once **without** paying for a subscription or completing a survey"
    },
    {
        "subreddit": "politics",
        "sentence": "If you believe that you have a domain that is eligible for our approved domains list, please use the link at the end of this message to submit it to us"
    },
    {
        "subreddit": "politics",
        "sentence": "However please note that if you submit spam or rule breaking content to us via the form, we will match the domain against this submission and may take action against your account"
    },
    {
        "subreddit": "politics",
        "sentence": "If you submit a spam domain via the form, your account may be reported to the site administrators"
    },
    {
        "subreddit": "politics",
        "sentence": "To submit a domain for approval [use this form](https://goo.gl/forms/lRQikA1rI0bVbKCl1) and follow the instructions provided\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "With Trump in office the US would be a huge fire sale."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes, whatever happened to all the tough guy conservative talk about protecting your wife and family?   Oh yeah, silly me.."
    },
    {
        "subreddit": "politics",
        "sentence": "It's all just bullshit lip service from cowards scared of shadows and boogeymen."
    },
    {
        "subreddit": "politics",
        "sentence": "As a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others"
    },
    {
        "subreddit": "politics",
        "sentence": "Debate/discuss/argue the merits of ideas, don't attack people"
    },
    {
        "subreddit": "politics",
        "sentence": "Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban"
    },
    {
        "subreddit": "politics",
        "sentence": "If you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "I have"
    },
    {
        "subreddit": "politics",
        "sentence": "I just can see the current situation as a morally grey shitty choice with baggage, or a literal Hitler in its infancy administration that'll put an end to American democracy and so much more"
    },
    {
        "subreddit": "politics",
        "sentence": "With a cohort of figures on the ingroup of this administration that have openly talked about the positives of my euthanasia and the brutalization of my loved ones and peers"
    },
    {
        "subreddit": "politics",
        "sentence": "An administration that will hand over the keys to a Christian-Fascist hell that've have openly published their intents.\n\nYou're caught up with the name and label and ignoring clear and present danger"
    },
    {
        "subreddit": "politics",
        "sentence": "And for what? Just to be a contrarian? I don't see the justification"
    },
    {
        "subreddit": "politics",
        "sentence": "And as a progressive, I find it verging on disgusting."
    },
    {
        "subreddit": "politics",
        "sentence": "I hear he really liked animals and banned vivisection of them..."
    },
    {
        "subreddit": "politics",
        "sentence": "Agreed"
    },
    {
        "subreddit": "politics",
        "sentence": "War is bad."
    },
    {
        "subreddit": "politics",
        "sentence": "I mean, because Abbott prioritizes businesses over people because people are expendable"
    },
    {
        "subreddit": "politics",
        "sentence": "If you check how many large political donating businesses are out you can count on one hand"
    },
    {
        "subreddit": "politics",
        "sentence": "He's backed away from that and now just says he wants safer vaccines, which always seemed like a euphemism to avoid discussing prior wrong beliefs for a problem that wasn't really a problem."
    },
    {
        "subreddit": "politics",
        "sentence": "Licensing boards rarely bar people for life"
    },
    {
        "subreddit": "politics",
        "sentence": "A suspension is pretty heafty.\n\nNot being able to work your profession for 3 years is not without consequence"
    },
    {
        "subreddit": "politics",
        "sentence": "Lawyers, like doctors spend a shit ton of money just to be able to practice/do there job."
    },
    {
        "subreddit": "politics",
        "sentence": "Didnt read the article but if there are witches in monterey, they sure know how to keep it beautiful and also SF and LA must be demon spawn hell holes"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s not a great look."
    },
    {
        "subreddit": "politics",
        "sentence": "Username checks out"
    },
    {
        "subreddit": "politics",
        "sentence": "Uhh… who gives evidence in a trial is not semantics"
    },
    {
        "subreddit": "politics",
        "sentence": "This is law 101."
    },
    {
        "subreddit": "politics",
        "sentence": "> every good faith certificate shall specifically state the exact timing, method and substance of the conferral conducted and up to 200 words of the opposing party's position on the issue at their discretion.\n\nSo all Trump's lawyers have to do is not reply and then the prosecution will never have a written statement of the party's position to attach and can never file a motion."
    },
    {
        "subreddit": "politics",
        "sentence": "Your submission `'He will never leave': Robert De Niro uses platform to caution against Trump` was automatically removed because `youtu.be` is not on our [approved domains list](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "r/politics has a number of conditions that domains must adhere to in order to be approved as an acceptable source"
    },
    {
        "subreddit": "politics",
        "sentence": "Domains must:\n\n* Be notable, as defined by our [**domain notability guidelines**](https://www.reddit.com/r/politics/wiki/approveddomainslist)"
    },
    {
        "subreddit": "politics",
        "sentence": "Notable domains will consist of news organizations, research organizations, political advocacy groups, governmental agencies / bodies, and political parties"
    },
    {
        "subreddit": "politics",
        "sentence": "* Contain articles, videos or sound-clips relevant to current US politics\n* Contain original content that has not been stolen or rehosted from another source"
    },
    {
        "subreddit": "politics",
        "sentence": "* Be accessible at least once **without** paying for a subscription or completing a survey"
    },
    {
        "subreddit": "politics",
        "sentence": "If you believe that you have a domain that is eligible for our approved domains list, please use the link at the end of this message to submit it to us"
    },
    {
        "subreddit": "politics",
        "sentence": "However please note that if you submit spam or rule breaking content to us via the form, we will match the domain against this submission and may take action against your account"
    },
    {
        "subreddit": "politics",
        "sentence": "If you submit a spam domain via the form, your account may be reported to the site administrators"
    },
    {
        "subreddit": "politics",
        "sentence": "To submit a domain for approval [use this form](https://goo.gl/forms/lRQikA1rI0bVbKCl1) and follow the instructions provided\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "> Why does everyone think that Palestine will be better off with trump?\n\nThey don’t"
    },
    {
        "subreddit": "politics",
        "sentence": "They just hate the guy who’s doing the thing"
    },
    {
        "subreddit": "politics",
        "sentence": "If it were PoopyPants, they’d be hating him for it"
    },
    {
        "subreddit": "politics",
        "sentence": "Only he would give them a lot more reasons."
    },
    {
        "subreddit": "politics",
        "sentence": "…This in a state where absurdly oversized hats indicating same-sex preferences are worn openly and proudly."
    },
    {
        "subreddit": "politics",
        "sentence": "wonder if they will show up to the verdict and sentencing?\n\nThat would be super weird when they don't."
    },
    {
        "subreddit": "politics",
        "sentence": "I wonder why"
    },
    {
        "subreddit": "politics",
        "sentence": "Nonsense"
    },
    {
        "subreddit": "politics",
        "sentence": "He said you cant imprison someone based upon the testimony of someone like Michael cohen"
    },
    {
        "subreddit": "politics",
        "sentence": "That is not a threat"
    },
    {
        "subreddit": "politics",
        "sentence": "That’s an appeal to the lack of veracity of Mr"
    },
    {
        "subreddit": "politics",
        "sentence": "Cohen, an admitted perjurer"
    },
    {
        "subreddit": "politics",
        "sentence": "Mr"
    },
    {
        "subreddit": "politics",
        "sentence": "Cohen screwed up so much he lost his law license"
    },
    {
        "subreddit": "politics",
        "sentence": "I would agree with him if the only evidence was Mr"
    },
    {
        "subreddit": "politics",
        "sentence": "Cohen’s testimony"
    },
    {
        "subreddit": "politics",
        "sentence": "I didnt follow this case very much because i dont find it important or interesting"
    },
    {
        "subreddit": "politics",
        "sentence": "Regardless if he gets convicted, Trump will win against Biden unless something substantial changes"
    },
    {
        "subreddit": "politics",
        "sentence": "I doubt Trump would get jail for this alleged crime"
    },
    {
        "subreddit": "politics",
        "sentence": "Lying about a campaign donation with someone with zero criminal history does not seem particularly egregious."
    },
    {
        "subreddit": "politics",
        "sentence": "In a sane world, slavery would be considered cruel and unusual, but several of the ways states execute people are basically torture, so nobody seems to care about cruel and unusual punishment."
    },
    {
        "subreddit": "politics",
        "sentence": "Not different standards, just worse behavior and less accountability"
    },
    {
        "subreddit": "politics",
        "sentence": "Look at their writings and you can see the “founding fathers” knew slavery was evil, they admitted it over and over.\n\n>Throughout his entire life, Thomas Jefferson was publicly a consistent opponent of slavery"
    },
    {
        "subreddit": "politics",
        "sentence": "Calling it a “moral depravity”1 and a “hideous blot,”2 he believed that slavery presented the greatest threat to the survival of the new American nation.3 Jefferson also thought that slavery was contrary to the laws of nature, which decreed that everyone had a right to personal liberty.4\n\nhttps://www.monticello.org/thomas-jefferson/jefferson-slavery/jefferson-s-attitudes-toward-slavery/"
    },
    {
        "subreddit": "politics",
        "sentence": "To be fair, Hamas are brutal terrorists"
    },
    {
        "subreddit": "politics",
        "sentence": "Let’s not let a light-arms chain reaction get in the way of bringing them the justice they so very much deserve."
    },
    {
        "subreddit": "politics",
        "sentence": "yup.\n\nIt looks awfully like he’s decided the voting numbers are pro-genocide."
    },
    {
        "subreddit": "politics",
        "sentence": "Is she trying to be a character for the next mortal combat? The governor?"
    },
    {
        "subreddit": "politics",
        "sentence": "Hey guys when you actually do some work you can talk."
    },
    {
        "subreddit": "politics",
        "sentence": "Well, doh!  If she were to be gagged, how could she suck his dick?"
    },
    {
        "subreddit": "politics",
        "sentence": "So many that to the un-trained eye, they would look absolutely deliberate."
    },
    {
        "subreddit": "politics",
        "sentence": "[FAFO](https://i.imgur.com/uHkXKeR.png)"
    },
    {
        "subreddit": "politics",
        "sentence": "While also accepting responsibility for her own actions"
    },
    {
        "subreddit": "politics",
        "sentence": "It's a decent [apology](https://www.coloradosupremecourt.com/PDF/2402%20STIPULATION%20TO%20DISCIPLINE%20PURSUANT%20TO%20C.R.C.P.%20242.19.pdf) imo:\n\n> In doing so I wish to express my deep remorse and to acknowledge the harm my misconduct caused.\n\n> When facts or evidence comes to light that bears upon our own conduct, it is right for the honest lawyer to take accountability for our actions"
    },
    {
        "subreddit": "politics",
        "sentence": "That is what I am doing\n\n> I am choosing to take responsibility for my actions and my association with the harm caused to the nation.."
    },
    {
        "subreddit": "politics",
        "sentence": "I was wrong to be involved"
    },
    {
        "subreddit": "politics",
        "sentence": "This is infuriating."
    },
    {
        "subreddit": "politics",
        "sentence": "They would have already burned through the jury pool and then a meaningful percentage of the population of NY if your rule was real."
    },
    {
        "subreddit": "politics",
        "sentence": "He invented the Ken Burns effect? https://en.wikipedia.org/wiki/Ken_Burns_effect"
    },
    {
        "subreddit": "politics",
        "sentence": "Clown is not the right characterization"
    },
    {
        "subreddit": "politics",
        "sentence": "Trump is a criminal, an insurrectionist and a fascist wannabe dictator, he is dangerous to the US and the world."
    },
    {
        "subreddit": "politics",
        "sentence": "Politico has become such hot garbage"
    },
    {
        "subreddit": "politics",
        "sentence": "Maybe they always have been, but they get worse with each passing election cycle."
    },
    {
        "subreddit": "politics",
        "sentence": "*insert Simpsons HA-HA gif here*"
    },
    {
        "subreddit": "politics",
        "sentence": "The choice is wider than a binary ‘do nothing’ vs ‘kill everybody.’\n\nBut ‘kill everybody’ is what people like Netanyahu want"
    },
    {
        "subreddit": "politics",
        "sentence": "And people like PoopyPants."
    },
    {
        "subreddit": "politics",
        "sentence": "I'll believe it when he's actually in jail"
    },
    {
        "subreddit": "politics",
        "sentence": "he has shown how pathetic the criminal justice system has been"
    },
    {
        "subreddit": "politics",
        "sentence": "ITT: People realizing that professional associations typically exist to protect their members and are extremely reticent to meaningfully punish them"
    },
    {
        "subreddit": "politics",
        "sentence": "I'm a liberal, I would have cut Israel off years ago."
    },
    {
        "subreddit": "politics",
        "sentence": "Actually, they are accessories after the fact."
    },
    {
        "subreddit": "politics",
        "sentence": "Lmao that’s what trump is on trial for New York for having sex with a porn star and covering it up while his wife milenia was pregnant with baron"
    },
    {
        "subreddit": "politics",
        "sentence": "Of the two candidates one goes to church on Sunday while the other golfs"
    },
    {
        "subreddit": "politics",
        "sentence": "You can’t speak about family values when the  Republican candidate has raped women and fucked porn stars while being married"
    },
    {
        "subreddit": "politics",
        "sentence": "The party of family values, meet the Trumps"
    },
    {
        "subreddit": "politics",
        "sentence": "Can’t wait for the McDonald’s monument! Too bad it’s not Carls Jr"
    },
    {
        "subreddit": "politics",
        "sentence": "though"
    },
    {
        "subreddit": "politics",
        "sentence": "Carls Jr"
    },
    {
        "subreddit": "politics",
        "sentence": "would probably pay him every time he says their name."
    },
    {
        "subreddit": "politics",
        "sentence": "When are they going to decide Trump’s immunity?"
    },
    {
        "subreddit": "politics",
        "sentence": "> When the choice is him or Trump it’s pretty easy to vote for him.\n\nBut he’s making it as hard as he can.\n\nThat’s bad for everyone.\n\nHe is the only viable choice, and it will be him or fascism, but it’s harder to cheer for him, almost  every day."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes, but (and not that this is comforting) fascists do tend to burn through most of their enemies all at once"
    },
    {
        "subreddit": "politics",
        "sentence": "All the groups you mentioned would likely be their first targets."
    },
    {
        "subreddit": "politics",
        "sentence": "Fully agree"
    },
    {
        "subreddit": "politics",
        "sentence": "I just want to note, though, that what seems to have occurred here was that the DOJ filed what is called an “ex parte” application (i.e., an emergency motion) that require less notice to the other side than a regular motion"
    },
    {
        "subreddit": "politics",
        "sentence": "It also appears that Judge Cannon was basically saying, “you did not even try to formally work this issue out before you blitzed the defendant in a way that would have denied his right to respond"
    },
    {
        "subreddit": "politics",
        "sentence": "That was not cool of you"
    },
    {
        "subreddit": "politics",
        "sentence": "You may try again.”\n\nSo, as much as I wish she’d try to harder to at least appear more impartial, this is pretty common judge-speak in response to these kinds of motion (at least where I practice)."
    },
    {
        "subreddit": "politics",
        "sentence": "He's just mad that more people show up for DeNiro, than show up for him"
    },
    {
        "subreddit": "politics",
        "sentence": "And who wouldn't?  DeNiro is a charming, creative, successful, and talented actor"
    },
    {
        "subreddit": "politics",
        "sentence": "Trump is stupid and smelly, whose only successful venture was a knock off reality show that was just as unimaginative as he is."
    },
    {
        "subreddit": "politics",
        "sentence": "Roe V Wade was overturned"
    },
    {
        "subreddit": "politics",
        "sentence": "That alone would be considered going off the rails"
    },
    {
        "subreddit": "politics",
        "sentence": "Now we have a supreme court justice who flies Maga flags voting on a fascist's immunity"
    },
    {
        "subreddit": "politics",
        "sentence": "So yes in many ways it has become an issue."
    },
    {
        "subreddit": "politics",
        "sentence": "> at all costs.\n\nWhat Netanyahu always wanted.\n\n> Some people here seem upset by this.\n\nYeah"
    },
    {
        "subreddit": "politics",
        "sentence": "What’s a few thousand children and babies? What’s a little genocide between friends?\n\nAs long as the right people are getting slaughtered, right? The people of the qualifying nationality."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm talking about your regular day to day people saying it, neighbors, coworkers, random people sharing their thoughts online, it's something everyone agrees and anyone who says otherwise is met with a weird look as if they're being sarcastic   \n\nIt's not just those who scream death to america and want to murder innocents for their governments doing, it's regular ass people it's just common knowledge"
    },
    {
        "subreddit": "politics",
        "sentence": "He has no idea what it’s like to be treated like everyone else"
    },
    {
        "subreddit": "politics",
        "sentence": "He’s such a whiner."
    },
    {
        "subreddit": "politics",
        "sentence": "They didn’t do shit after the Republican revolution, after the stolen 2000 election, were asleep at the wheel during Operation Redmap, actively propped Trump up as their ideal opponent in 2016"
    },
    {
        "subreddit": "politics",
        "sentence": "They’ve been and remain criminally negligent at best in the face of fascism."
    },
    {
        "subreddit": "politics",
        "sentence": "Actually, if Trump is convicted, that means we can finally stop caring because a felon can not be elected to office."
    },
    {
        "subreddit": "politics",
        "sentence": "Shoot her out of a cannon already."
    },
    {
        "subreddit": "politics",
        "sentence": "Gore *did win in 2000* tho"
    },
    {
        "subreddit": "politics",
        "sentence": "No you don't and it absolutely is not"
    },
    {
        "subreddit": "politics",
        "sentence": "Fucking chode."
    },
    {
        "subreddit": "politics",
        "sentence": "Who is Dan Borgino ?\n\nBelieve it or not, a former US Secret Service agent and more proof the USSS needs to take another look at their psychological testing methods of new hires :)"
    },
    {
        "subreddit": "politics",
        "sentence": "Don't even think about showing them a picture of a man in a dress."
    },
    {
        "subreddit": "politics",
        "sentence": "I read it was the Libertarians that invited other candidates? Not the candidate’s request or bribe as I saw some comments mention"
    },
    {
        "subreddit": "politics",
        "sentence": "If it was the campaign’s idea, you really have to question why they would think it was remotely a good idea… I want to say anyone with an understanding of the party could have predicted the outcome"
    },
    {
        "subreddit": "politics",
        "sentence": "So was it:\n\n1"
    },
    {
        "subreddit": "politics",
        "sentence": "A crazy panicked attempt by a desperate campaign \n2"
    },
    {
        "subreddit": "politics",
        "sentence": "Or did they somehow think they had control of that party somehow?"
    },
    {
        "subreddit": "politics",
        "sentence": "Welp"
    },
    {
        "subreddit": "politics",
        "sentence": "Appears hes judt more dofrct and open about thr soliciting than modt presidents I guess."
    },
    {
        "subreddit": "politics",
        "sentence": "The modern state of Israel was established in 1948"
    },
    {
        "subreddit": "politics",
        "sentence": "Not sure how you can say that presidents have supported it for 100 years, unless you're posting from the future."
    },
    {
        "subreddit": "politics",
        "sentence": "Considering every example of intentional voter fraud recently has been by republicans, they were probably going to do *that* too"
    },
    {
        "subreddit": "politics",
        "sentence": "On average so far 1 in 10 primary Democrat voters have voted uncommitted largely on this issue so I don't get how you can claim no one cares about this.\n\nEdit: Grammer fix"
    },
    {
        "subreddit": "politics",
        "sentence": "So what every politician does?  They are all for sale, for the max donation"
    },
    {
        "subreddit": "politics",
        "sentence": "25K or so"
    },
    {
        "subreddit": "politics",
        "sentence": "Outrage from MAGA's?  That's unusual."
    },
    {
        "subreddit": "politics",
        "sentence": "It is very likely that that bomb is going to kill children.\n\nThe horrors perpetuated by Hamas do not negate that.\n\nAnd let's be real, there's no destroying Hamas in this way"
    },
    {
        "subreddit": "politics",
        "sentence": "If you cut off the head, two more will grow in its place."
    },
    {
        "subreddit": "politics",
        "sentence": "It is definitely a threat to the jurors life, it is a deliberate attempt to remind them how fucking crazy Trump supporters are"
    },
    {
        "subreddit": "politics",
        "sentence": "These people threaten death thousands of times a day to everyone who tries to hold Trump to account"
    },
    {
        "subreddit": "politics",
        "sentence": "These are the same people who send death threats to the parents of children killed in school shootings for making guns look bad."
    },
    {
        "subreddit": "politics",
        "sentence": "I don't know, neither of my parents have any of his qualifications or credentials, and they haven't figured it out.\n\nMaybe if I can get them to direct a movie or two..."
    },
    {
        "subreddit": "politics",
        "sentence": "In an interview on MSNBC earlier today, he said (paraphrasing here) \"you know I should be doing interviews on Fox"
    },
    {
        "subreddit": "politics",
        "sentence": "Thats really where I should be doing interviews, but they won't have me on their network and aren't interested in listen to the truth.\" \n\nThats the network that does need him to the most"
    },
    {
        "subreddit": "politics",
        "sentence": "No doubts."
    },
    {
        "subreddit": "politics",
        "sentence": "Jack smith has been around doing crazy things while she essentially just got her position"
    },
    {
        "subreddit": "politics",
        "sentence": "She’s not the right fit for this case"
    },
    {
        "subreddit": "politics",
        "sentence": "Simply put."
    },
    {
        "subreddit": "politics",
        "sentence": "It should be the judges job to make sure he’s in fucking prison."
    },
    {
        "subreddit": "politics",
        "sentence": "Would love to know things about those voters backgrounds like education levels; public, home school, or religious k-12 education; age range; media consumption, and religious affiliation."
    },
    {
        "subreddit": "politics",
        "sentence": "She is just going to get some cushy job, where she probably doesn't even have to show up, for 3 years and then she's going to get her law license back, and then she's going to go right back to being the lawyer for a crime family."
    },
    {
        "subreddit": "politics",
        "sentence": "No political appointments for judges, for a start"
    },
    {
        "subreddit": "politics",
        "sentence": "And no lifetime appointments, ever.\n\nThey’re both wrecking balls for democracy."
    },
    {
        "subreddit": "politics",
        "sentence": "Because he would have had to make sworn testimony under oath"
    },
    {
        "subreddit": "politics",
        "sentence": "He wanted the ability to appeal directly to the jury without all those pesky things like truth or evidence that would unfairly prejudice the jury against him."
    },
    {
        "subreddit": "politics",
        "sentence": "> Biden or trump?\n\nImperfect or vile."
    },
    {
        "subreddit": "politics",
        "sentence": "They aren't cancelling the convention"
    },
    {
        "subreddit": "politics",
        "sentence": "Just voting early to get Biden on the ballot."
    },
    {
        "subreddit": "politics",
        "sentence": "Fact is outrage is the default Maga state of mind and that’s all they do"
    },
    {
        "subreddit": "politics",
        "sentence": "Just think of it, do they any of policy agenda at all? Ken Burns us very smart and they’re not."
    },
    {
        "subreddit": "politics",
        "sentence": "The Truth hurts MAGA harder than you would think."
    },
    {
        "subreddit": "politics",
        "sentence": "My kid still believes in the Easter bunny doesn't make it true,  you can't pop the bubble they live in with out violent tendency from them"
    },
    {
        "subreddit": "politics",
        "sentence": "Literally had it happen just this memorial day"
    },
    {
        "subreddit": "politics",
        "sentence": "Had a fine convo with brother and step dad then...brothers father in law decided to get loud to stop me and then got violent when I didn't"
    },
    {
        "subreddit": "politics",
        "sentence": "Oh well, others saw it for what it is but ultimately they circled wagons and blamed me for calling him out for attitude of discussion"
    },
    {
        "subreddit": "politics",
        "sentence": "They see it but they won't let go because then they are wrong and that is just a line too far."
    },
    {
        "subreddit": "politics",
        "sentence": "Hamas perpetrated the worst genocide of Jews since the Holocaust"
    },
    {
        "subreddit": "politics",
        "sentence": "They openly vow to repeat it endlessly"
    },
    {
        "subreddit": "politics",
        "sentence": "They want the complete destruction of the Jewish state and to murder all Jews worldwide"
    },
    {
        "subreddit": "politics",
        "sentence": "They r *still* holding over a hundred hostages, many subjected to sexual assault"
    },
    {
        "subreddit": "politics",
        "sentence": "They could end this war rn if they released the hostages and surrendered, but instead they repeatedly choose to put their own citizenry in the firing line, steal humanitarian aid from starving citizens, and hiding like cowards in tunnels.\n\nI'm ok with what she wrote because Hamas needs to be finished off."
    },
    {
        "subreddit": "politics",
        "sentence": "Tim Kaine is very popular"
    },
    {
        "subreddit": "politics",
        "sentence": "This guy has no chance."
    },
    {
        "subreddit": "politics",
        "sentence": "Exactly! It's disheartening to see how the standards are often just for show, leaving much to be desired in terms of actual practice."
    },
    {
        "subreddit": "politics",
        "sentence": "And here I thought the GOP just wanted to take us back to the ~1950s…but apparently they want to take us ***ALL*** the way back to the ~1600s."
    },
    {
        "subreddit": "politics",
        "sentence": "entire country is falling to pieces but starting from the top down, corruption and greed were victorious, an entire middle class got relegated, and the so called american experiment could be dead by november if people don't vote"
    },
    {
        "subreddit": "politics",
        "sentence": "not the best."
    },
    {
        "subreddit": "politics",
        "sentence": "I keep seeing there \"smith is master mind, here is how he can remove this judge, he is laying a trap\""
    },
    {
        "subreddit": "politics",
        "sentence": "The more I see these statements more I can convinced this is equivalent to \"here is how Bernie can still win\""
    },
    {
        "subreddit": "politics",
        "sentence": "I will believe it when I see it."
    },
    {
        "subreddit": "politics",
        "sentence": "Libraries too"
    },
    {
        "subreddit": "politics",
        "sentence": "Please go Taxi Driver...."
    },
    {
        "subreddit": "politics",
        "sentence": "So it’s a thin and fast-moving red line.\n\nStill"
    },
    {
        "subreddit": "politics",
        "sentence": "Vote.\n\nIt’s either him or fascism and degradation."
    },
    {
        "subreddit": "politics",
        "sentence": "“Once people bond with the leader, they may be inclined to dismiss any evidence that conflicts with his claims, or overlook contradictions in his messages"
    },
    {
        "subreddit": "politics",
        "sentence": "They believe him because they believe in him"
    },
    {
        "subreddit": "politics",
        "sentence": "Or, in an interesting twist, they know he is lying, but they decide that they don’t care: better him than his enemy (who, as they have been taught to believe, lies even more)"
    },
    {
        "subreddit": "politics",
        "sentence": "And some people actually approve of all the lying, seeing it as rule-breaking by a rogue they adore.”"
    },
    {
        "subreddit": "politics",
        "sentence": "I sure do"
    },
    {
        "subreddit": "politics",
        "sentence": "Leaders that make those big decisions are not representing the will of the people"
    },
    {
        "subreddit": "politics",
        "sentence": "Unfortunately Israel and the US are doing the same right now."
    },
    {
        "subreddit": "politics",
        "sentence": "I don't have the resources and frankly, I self exiled"
    },
    {
        "subreddit": "politics",
        "sentence": "I can't be involved with the situation in America.\n\nAfter all I did, to watch some Orange Asshole and his pseudo religious cult burn it all down in a fucking apocalyptic speed run, forgive me, but I just can't be there.\n\nI take the failure of the Military and Veteran community squarely on my own shoulders also"
    },
    {
        "subreddit": "politics",
        "sentence": "We are fucking up"
    },
    {
        "subreddit": "politics",
        "sentence": "It is directly our charge to secure and safeguard Freedom, the Constition, and the American Way for all within our STILL GREAT NATION."
    },
    {
        "subreddit": "politics",
        "sentence": "It's a great speech: https://www.youtube.com/watch?v=9n1OqPzIKH4"
    },
    {
        "subreddit": "politics",
        "sentence": "Thanks"
    },
    {
        "subreddit": "politics",
        "sentence": "You sound really smart."
    },
    {
        "subreddit": "politics",
        "sentence": "A lot of people believe we're in a recession and that Donald Trump's presidency was actually good"
    },
    {
        "subreddit": "politics",
        "sentence": "It's not about reality, it's about the picture you paint of it."
    },
    {
        "subreddit": "politics",
        "sentence": ">This could take a significant moment away from Biden and the Democratic party as the official nomination at convention is historically met with fanfare and celebration, but Biden will become the official nominee virtually, perhaps without the typical pomp and circumstance.\n\nLike...who cares? He's the incumbent"
    },
    {
        "subreddit": "politics",
        "sentence": "There's no \"significant moment\" to be had, and it certainly doesn't warrant any \"fanfare and celebration\"."
    },
    {
        "subreddit": "politics",
        "sentence": "This is why it’s important to think super long-term.\n\nNo, voting straight blue this election probably won’t get us the supermajority we need to pass important things.\n\nVoting straight blue over and over and over for a couple of decades, though, will"
    },
    {
        "subreddit": "politics",
        "sentence": "Get more people to vote blue"
    },
    {
        "subreddit": "politics",
        "sentence": "Keep doing it.\n\nDon’t just *give up* and vote red to “try something different for a change.” That’ll be the very last time you’re ever allowed to vote, unless you’re straight as a 2x4, pale as milk, a man, and you plan on voting for republicans every single time."
    },
    {
        "subreddit": "politics",
        "sentence": "she's married to one, they'd have to listen to pillow talk"
    },
    {
        "subreddit": "politics",
        "sentence": "Because we've given rural midwest \"real\" America complete control over everything"
    },
    {
        "subreddit": "politics",
        "sentence": "They still whine about how they aren't being heard"
    },
    {
        "subreddit": "politics",
        "sentence": "I think for a time these states were fine to let the coasts do their thing, mostly"
    },
    {
        "subreddit": "politics",
        "sentence": "Roe pretty much obliterated that though"
    },
    {
        "subreddit": "politics",
        "sentence": "Now they want to control what we do in CA and NY"
    },
    {
        "subreddit": "politics",
        "sentence": "Which is hilarious because they hate outsiders telling *them* how to live"
    },
    {
        "subreddit": "politics",
        "sentence": "~10 states with less population combined than CA get 10X senate representation"
    },
    {
        "subreddit": "politics",
        "sentence": "Tyranny of the minority."
    },
    {
        "subreddit": "politics",
        "sentence": "Yea, we're the ones not informed."
    },
    {
        "subreddit": "politics",
        "sentence": "Lol"
    },
    {
        "subreddit": "politics",
        "sentence": "So…Dancing With the Stars?"
    },
    {
        "subreddit": "politics",
        "sentence": "Because you have to avoid the actual evidence presented, the checks, the written down plan by Dons accountant, the other witnesses testimony supporting the presented evidence"
    },
    {
        "subreddit": "politics",
        "sentence": "So, instead of focusing on that, they have better focus on Michael Cohen."
    },
    {
        "subreddit": "politics",
        "sentence": "👍 i see them both as decoys - to muddle things up"
    },
    {
        "subreddit": "politics",
        "sentence": "Status quo keepers b/c the super-rich like things the way they are"
    },
    {
        "subreddit": "politics",
        "sentence": "Pure distraction."
    },
    {
        "subreddit": "politics",
        "sentence": "Oh I’m voting, but my registered party won’t be getting my vote…"
    },
    {
        "subreddit": "politics",
        "sentence": "I was so wrong on who I thought she was character wise"
    },
    {
        "subreddit": "politics",
        "sentence": "I was oh so wrong."
    },
    {
        "subreddit": "politics",
        "sentence": "You’re a furry saying all this?"
    },
    {
        "subreddit": "politics",
        "sentence": "How can we know the virtual vote was secure, and not generated by some AI?"
    },
    {
        "subreddit": "politics",
        "sentence": "Wtf, she only wanted to speak with the manager"
    },
    {
        "subreddit": "politics",
        "sentence": "If your election didn’t come out the way you ordered, wouldn’t you want to have a word with the manager!?"
    },
    {
        "subreddit": "politics",
        "sentence": "How much thinking does it really take for you to flip that burger ???"
    },
    {
        "subreddit": "politics",
        "sentence": ">Because even in the 1700s slavery was an extremely divisive issue.\n\n\"Divisive issue\" back then and morally repugnant today.\n\nSo yeah, different standards."
    },
    {
        "subreddit": "politics",
        "sentence": "They are addicted to the “rush” from their perpetual “state of outrage.”"
    },
    {
        "subreddit": "politics",
        "sentence": "The Senate represents the state within the federal government, the House represents the given district's citizens"
    },
    {
        "subreddit": "politics",
        "sentence": "We vote for our senators, but there has never been population-based representation within the Senate"
    },
    {
        "subreddit": "politics",
        "sentence": "If you want population-based representation, look to the House of Representatives."
    },
    {
        "subreddit": "politics",
        "sentence": "Few months ago I heard her on Bible radio using her status as a lawyer to say the 14th amendment should be repealed entirely."
    },
    {
        "subreddit": "politics",
        "sentence": "In this case it'll be pretty immediate, though"
    },
    {
        "subreddit": "politics",
        "sentence": "Mass reductions in labor markets tend to have really fast turnaround -- especially for industries which are powered by (im)migrant labor"
    },
    {
        "subreddit": "politics",
        "sentence": "Fresh meat goes bad within days, crops need to be harvested seasonally"
    },
    {
        "subreddit": "politics",
        "sentence": "People will very quickly realize there's a lack of meat in their grocery stores and unharvested fruit will be rotting on the ground again.\n\nWatch as the wealthy have their vacations ruined as vacation hot spots lose a huge huge portion of their work force"
    },
    {
        "subreddit": "politics",
        "sentence": "Seriously, towns like Aspen and Vail CAN NOT FUNCTION without undocumented immigrants.\n\nSupply chains will break down overnight"
    },
    {
        "subreddit": "politics",
        "sentence": "Logistics will be destroyed"
    },
    {
        "subreddit": "politics",
        "sentence": "Construction will come to a halt.\n\nUndocumented immigrants are *vital* parts of our economy, and we literally can't function day-to-day without them"
    },
    {
        "subreddit": "politics",
        "sentence": "It would take years to recover -- to either coax them back after we realize how bad we fucked up, or to readjust with domestic after probably one of the greatest supply shocks in US history."
    },
    {
        "subreddit": "politics",
        "sentence": "Attorneys don’t give evidence"
    },
    {
        "subreddit": "politics",
        "sentence": "Witnesses do."
    },
    {
        "subreddit": "politics",
        "sentence": "she's literally working with the defense"
    },
    {
        "subreddit": "politics",
        "sentence": "it's astonishing that the system can fail so easily"
    },
    {
        "subreddit": "politics",
        "sentence": "this american mirage is falling to pieces."
    },
    {
        "subreddit": "politics",
        "sentence": "Not sure you understand how the Republican Party works… Corruption and idiocy are prized"
    },
    {
        "subreddit": "politics",
        "sentence": "Granted, she committed a cardinal sin in (eventually) criticizing Trump, but she’ll find political work if she wants it or a plum spot at a rightwing law firm."
    },
    {
        "subreddit": "politics",
        "sentence": "That’s what I’m saying"
    },
    {
        "subreddit": "politics",
        "sentence": "I think I accidentally sparked major MAGA outrage this morning when I was putting on my socks."
    },
    {
        "subreddit": "politics",
        "sentence": "Ah ok 🤓"
    },
    {
        "subreddit": "politics",
        "sentence": "What do you mean by that? Because even in the 1700s slavery was an extremely divisive issue"
    },
    {
        "subreddit": "politics",
        "sentence": "Do you actually know anything about it?"
    },
    {
        "subreddit": "politics",
        "sentence": "He's done ads for Biden and was there officially on behalf of the Biden campaign so that would be really strange."
    },
    {
        "subreddit": "politics",
        "sentence": "You have to keep the people scared of something."
    },
    {
        "subreddit": "politics",
        "sentence": "She is such a piece of… work."
    },
    {
        "subreddit": "politics",
        "sentence": "If you really want the least possible harm to innocents make sure to vote fore the people that have tried to send aid and get Israel and Hamas to agree to a cease fire"
    },
    {
        "subreddit": "politics",
        "sentence": "Do not help the party that supports killing every one in Gaza.\n\nRepublican Tim Walberg said Gaza should be dealt with like Hiroshima and Nagasaki.\n\nRepublican Nikki Haley writes Finish Them on bomb being sent.\n\nRepublican Lindsey Graham says to give them the bombs they need to end the war after comparing the war to us nuking Japan over Pearl Harbor and how it's the same situation."
    },
    {
        "subreddit": "politics",
        "sentence": "Given that a decent chunk of the world is better off compared to America, I'll be happy to take that one-way ticket..."
    },
    {
        "subreddit": "politics",
        "sentence": "Well, this is the problem with liberals and centrists.  It's all talk but no spine and a lot of naivety \n\n\nSay what you will about Sanders, he wouldn't be putting up with this shit"
    },
    {
        "subreddit": "politics",
        "sentence": "ONLY 3 YEARS? WHAT THE FUCK?"
    },
    {
        "subreddit": "politics",
        "sentence": "Typically military combatants dying in the line of duty aren't classified under the category of attrocities"
    },
    {
        "subreddit": "politics",
        "sentence": "Same reason no one talks about the American civilar war troop deaths as an attrocity"
    },
    {
        "subreddit": "politics",
        "sentence": "Many times the number of civilian women and children have been killed by israel, and MORE civilians overall have been killed in Gaza vs Ukraine in less than a year versus 3 years"
    },
    {
        "subreddit": "politics",
        "sentence": "Whats happened in Ukraine is tragic and horrible but you can argue that whats happened in Gaza IS a worse attrocity, doubly so if you consider the famine mass destruction of the majority of homes etc"
    },
    {
        "subreddit": "politics",
        "sentence": "With regards to Sudan, that is also an attrocity"
    },
    {
        "subreddit": "politics",
        "sentence": "But the people in Sudan arent trapped in Sudan and being surveilled 24/7 by drones and having bombs constantly dropped on them as they move from place to place over a tiny area of land."
    },
    {
        "subreddit": "politics",
        "sentence": "You're posting great info all around this thread, thank you for sharing and informing us"
    },
    {
        "subreddit": "politics",
        "sentence": "So knowing that the bomb is going to hit civilians, why are you okay with what she wrote on it?"
    },
    {
        "subreddit": "politics",
        "sentence": "Hope she gives the $1,000 to her ex-husband and kids for humiliating them after choosing that bi-swaggering, badge waving neo-Hoover Strzok"
    },
    {
        "subreddit": "politics",
        "sentence": "She betrayed her family and also betrayed her Constitutional Oath to up hold the laws of the United States"
    },
    {
        "subreddit": "politics",
        "sentence": "Two married FBI bureaucrats having and affair, lying to their spouses, families, kids, co-workers, lying to investigators and plotting against The President of The United States “We’ll stop him.”  These are people you align with, celebrate…really?"
    },
    {
        "subreddit": "politics",
        "sentence": "Who specifically is catching strays? Obviously people working honest jobs in the furniture industry don't deserve to be maligned, but no one else is mentioned by name in the article other than Robinson which makes this a worthless critique IMHO.\n\nGiven all the problems in the world, ask yourself what this article is trying to call attention to and why: is the real story here that you happened to take an impersonal slight personally, or that a specific public figure is running for higher office and deserves additional scrutiny?"
    },
    {
        "subreddit": "politics",
        "sentence": "The general population."
    },
    {
        "subreddit": "politics",
        "sentence": "I’m a poll worker in Nevada during early voting and am disheartened by the number of young people voting Republican."
    },
    {
        "subreddit": "politics",
        "sentence": "Thumb woman"
    },
    {
        "subreddit": "politics",
        "sentence": "It will be because of Israel.  That's one area where he can act, he can't on inflation"
    },
    {
        "subreddit": "politics",
        "sentence": "And this race will be determined on the margin. \n\n\nIf there was no inflation, Biden would be up 20 points against Trump."
    },
    {
        "subreddit": "politics",
        "sentence": "This is his [reason](https://thehill.com/homenews/campaign/4689771-rfk-jr-confederate-statue-removal/) for wanting to preserve the legacy of the Confederate: \"I just have a visceral reaction against destroying history"
    },
    {
        "subreddit": "politics",
        "sentence": "I don’t like it"
    },
    {
        "subreddit": "politics",
        "sentence": "I think we should celebrate who we are.” He also said he thinks the United States should celebrate the good qualities “of everybody.”"
    },
    {
        "subreddit": "politics",
        "sentence": "Dons words have no redeeming value."
    },
    {
        "subreddit": "politics",
        "sentence": "Jones?"
    },
    {
        "subreddit": "politics",
        "sentence": "What do you mean by “the masses”?"
    },
    {
        "subreddit": "politics",
        "sentence": "Cool, so if we lose, own that loss.  Own the strategy.  Don't go blaming the left or young voters like in 2016.  If you play the wrong strategy and lose, it's on you (the dems, not you specifically)"
    },
    {
        "subreddit": "politics",
        "sentence": "it's a permit more than a fine"
    },
    {
        "subreddit": "politics",
        "sentence": "Nooo, don’t do that 🥤🥤🥤"
    },
    {
        "subreddit": "politics",
        "sentence": "The offences he's charged with in NY state apparently only have a 1-in-10 incarceration rate, so it's not likely he'll get actual prison time, and if he did, it would probably get reduced on appeal.\n\nAlso, the problem of putting a former POTUS into prison is huge, whether you like him or not"
    },
    {
        "subreddit": "politics",
        "sentence": "He'd need to be essentially in a solitary confinement section surrounded by Secret Service protection, with the prison guard protecting the Secret Service.\n\nSo it's more likely he'd get some sort of home detention.\n\nBut yes, I'm sure there are a lot of his own people that aren't wishing for his death but will read his obituary with great pleasure."
    },
    {
        "subreddit": "politics",
        "sentence": "Picture being such a snowflake that a doll or movie makes you all out enraged."
    },
    {
        "subreddit": "politics",
        "sentence": "What do you think bombs are for?"
    },
    {
        "subreddit": "politics",
        "sentence": "Clearly, it was still acceptable to the masses."
    },
    {
        "subreddit": "politics",
        "sentence": "The pissing stone"
    },
    {
        "subreddit": "politics",
        "sentence": "Uh yeah me too which is why it’s strange you felt I needed a recap when I didn’t need the other post in the first place"
    },
    {
        "subreddit": "politics",
        "sentence": "But whatevs see ya"
    },
    {
        "subreddit": "politics",
        "sentence": "If it was Biden supporters pulling a January 6th"
    },
    {
        "subreddit": "politics",
        "sentence": "You would have similar replies"
    },
    {
        "subreddit": "politics",
        "sentence": "January 6th was not a day to be celebrated"
    },
    {
        "subreddit": "politics",
        "sentence": "And if you think otherwise you need to open a dang history textbook."
    },
    {
        "subreddit": "politics",
        "sentence": "Ooooh chilling"
    },
    {
        "subreddit": "politics",
        "sentence": "All MAGA has is outrage, I’ve never heard a concise and/or detailed explanation, plan or even basic common decency from any supporter."
    },
    {
        "subreddit": "politics",
        "sentence": "never go full hitler"
    },
    {
        "subreddit": "politics",
        "sentence": "As a non American can someone explain to me how appointing a Judge who then handles your case is not a conflict of interest? I am truly baffled by this case."
    },
    {
        "subreddit": "politics",
        "sentence": "While true, we also have people like Obama, who were relatively unknown before his campaign, who rise up quickly, and can invigorate the party.\n\nOne problem I have seen though is some parties give too many people the chance to stake a claim, and it can be overwhelming"
    },
    {
        "subreddit": "politics",
        "sentence": "2016 was pretty ridiculous with the number of dem candidates"
    },
    {
        "subreddit": "politics",
        "sentence": "All of them had the right, some of them abundantly qualified, but the DNC didn't have to give them all a platform for so long."
    },
    {
        "subreddit": "politics",
        "sentence": "One is busy with any number of personal trainers, secret service agents or healthily hefty males with bodies that help her forget what she had to do for the money, and the other is just like him and fully occupied with her own interests and concerns."
    },
    {
        "subreddit": "politics",
        "sentence": "Buddy if you want the US to stop celebrating certain founding fathers because they owned slaves, you're not going to have any founding fathers left to celebrate."
    },
    {
        "subreddit": "politics",
        "sentence": "Hi `zaft11`"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank you for participating in /r/Politics"
    },
    {
        "subreddit": "politics",
        "sentence": "However, your submission has been removed for the following reason:\n\n* Already Submitted: This article has been submitted to /r/politics _within_ the last three days, and has been removed for violating [that submission rule](https://www.reddit.com/r/politics/wiki/index#wiki_do_not_resubmit_.22already_submitted.22_content) however you can see that thread here: https://redd.it/1d330j7\n\nI'm a bot and sometimes I make mistakes"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any questions about this removal, please feel free to [message the moderators.](https://www.reddit.com/message/compose?to=/r/politics&subject=Question regarding the removal of this submission by /u/zaft11&message=I have a question regarding the removal of this [submission.](https://www.reddit.com/r/politics/comments/1d35caj/rfk_jr_says_he_opposes_removing_confederate/\\))"
    },
    {
        "subreddit": "politics",
        "sentence": "They’re going to get that mistrial, however it will be due to a hung jury"
    },
    {
        "subreddit": "politics",
        "sentence": "There’s going to be at least one MAGA nut who will prevent the jury from reaching a unanimous vote on any of the charges"
    },
    {
        "subreddit": "politics",
        "sentence": "Given that the prosecution did not ask to consider lesser charges (misdemeanors) and that a new trial would be a year or more away, it’s likely that the prosecutors would not proceed"
    },
    {
        "subreddit": "politics",
        "sentence": "This means that Trump used his cult-like following to commit a felony that would have sent any other person to prison"
    },
    {
        "subreddit": "politics",
        "sentence": "That said, this is no different than OJ (who committed a double murder) going free"
    },
    {
        "subreddit": "politics",
        "sentence": "The rich and famous in the US are virtually untouchable."
    },
    {
        "subreddit": "politics",
        "sentence": "Conservatives already have guns, all your doing is disarming minority and lgbtq individuals."
    },
    {
        "subreddit": "politics",
        "sentence": "As a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others"
    },
    {
        "subreddit": "politics",
        "sentence": "Debate/discuss/argue the merits of ideas, don't attack people"
    },
    {
        "subreddit": "politics",
        "sentence": "Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban"
    },
    {
        "subreddit": "politics",
        "sentence": "If you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "Thing is, when you don't want to listen to people about Genocide, they will stop listening to anything you might have to say.  \n\n\nYou can't care about what is going on right now and not go insane from our inaction.  The only remedy is disconnecting the news and activism.\n\n\nWe are literally fostering an environment that discourages political and civic activism.  That it's so normal to so many users on this sub is depressing"
    },
    {
        "subreddit": "politics",
        "sentence": "> Hate to break it to you but Israel doesn't care about the hostages.\n\nBibi and his gang of jackasses obviously don’t care … but Israel absolutely cares"
    },
    {
        "subreddit": "politics",
        "sentence": "I’m sure you know the difference."
    },
    {
        "subreddit": "politics",
        "sentence": "Don’t worry, they will blame Biden even out of office"
    },
    {
        "subreddit": "politics",
        "sentence": "Tell Mariah Carey"
    },
    {
        "subreddit": "politics",
        "sentence": "What an absolute ghoul."
    },
    {
        "subreddit": "politics",
        "sentence": "They took our sexy candy"
    },
    {
        "subreddit": "politics",
        "sentence": "We must destroy democracy as retribution"
    },
    {
        "subreddit": "politics",
        "sentence": "So spaketh Tucker the fucker"
    },
    {
        "subreddit": "politics",
        "sentence": "As far as I am concerned, Biden is doing his best to provide humanitarian aid to the Palestinians"
    },
    {
        "subreddit": "politics",
        "sentence": "Anyone who wants to criticize that project because it isn’t going 100% smoothly can suck it"
    },
    {
        "subreddit": "politics",
        "sentence": "He has done more than anyone else around the world to make sure food and supplies go to the Palestinians."
    },
    {
        "subreddit": "politics",
        "sentence": "Why is there only one photo of Judge Aileen Cannon?"
    },
    {
        "subreddit": "politics",
        "sentence": "He says vaccines cause autism and supports the whack job RFK jr."
    },
    {
        "subreddit": "politics",
        "sentence": "Thats not surprising considering we stopped expanding the house"
    },
    {
        "subreddit": "politics",
        "sentence": "It was originally intended to add a seat per a set number of citizens in a state."
    },
    {
        "subreddit": "politics",
        "sentence": "Because its bs, conservatives love Trump and if they don't, they hate the left more."
    },
    {
        "subreddit": "politics",
        "sentence": "The GOP minority can only win through fear and intimidation."
    },
    {
        "subreddit": "politics",
        "sentence": "You need to learn your history if you don’t understand that lots of people knew slavery was wrong then too"
    },
    {
        "subreddit": "politics",
        "sentence": "If that was true, then sign me up"
    },
    {
        "subreddit": "politics",
        "sentence": "I'd love to be a wizard."
    },
    {
        "subreddit": "politics",
        "sentence": "The quality of the evidence is dependent on who is providing it and whether they believe what they are saying or not, just like the evidence the prosecution has provided"
    },
    {
        "subreddit": "politics",
        "sentence": "That's within the oath they took"
    },
    {
        "subreddit": "politics",
        "sentence": "The defense can't suggest that the evidence Cohen gave is wrong yet theirs is right and expect the jury to have to take their assertions at face value."
    },
    {
        "subreddit": "politics",
        "sentence": "We won’t forget"
    },
    {
        "subreddit": "politics",
        "sentence": "You mean like saying Rafah was a red line so people wouldn't be up in arms a few months ago, and now that we are here, there is no red line."
    },
    {
        "subreddit": "politics",
        "sentence": "> This is like if you shot someone and since you were in jail you missed a day of work so your employer suspended you even though you aren't proven guilty of a crime yet.\n\nIt's nothing like that, she *was* found guilty of a crime because she pled guilty to the crime.\n\nIf you pled guilty to shooting someone (murder/aggravated assault) then your employer certainly has a very good cause to fire you, just like the bar has very good cause to disbar her when she pled guilty to a felony.\n\nI don't think she necessarily needs to disbarred for life, but 3 years is basically a vacation she'll spend fucking around in GOP circles until she gets her law license back in time to mess with the 2028 election."
    },
    {
        "subreddit": "politics",
        "sentence": "People need to stop judging historical figures by today's standards."
    },
    {
        "subreddit": "politics",
        "sentence": "I agree, but it's worth noting that this will be the 5th time (out of 8) since Ohio passed this new deadline in 2010 that a major party convention was scheduled after the new deadline"
    },
    {
        "subreddit": "politics",
        "sentence": "In 2012 and 2020 both parties scheduled their conventions after the deadline, and the Ohio legislature made exceptions for both parties each time"
    },
    {
        "subreddit": "politics",
        "sentence": "Republican 2012 convention (Aug 27-Aug30)  \nDemocratic 2012 convention (Sep 4 - Sep 6)  \nRepublican 2020 convention (Aug 24-Aug27)  \nDemocratic 2020 convention (Aug 17-Aug 20)\n\nThe big question is if the Ohio GOP will be able to find some reasoning to not accept the DNC nominating virtually"
    },
    {
        "subreddit": "politics",
        "sentence": "Ohio's Senate President has already made it clear that [“Republicans in both the House and the Senate aren’t going to vote for a stand-alone Biden bill.”](https://www.nbcnews.com/politics/2024-election/ohio-lawmakers-are-odds-effort-ensure-biden-appears-november-ballot-rcna151369)"
    },
    {
        "subreddit": "politics",
        "sentence": "I wasn’t implying that, and I’m no strategist, but there are several acres of middle ground between no response and the 35,000+ dead Palestinians, over 55% being women and children by UN estimates."
    },
    {
        "subreddit": "politics",
        "sentence": "The longer they wait for a trial to be completed, the higher the chance of him getting elected again, and trying out the “presidential immunity” thing again"
    },
    {
        "subreddit": "politics",
        "sentence": "No matter what, if justice isn’t served quickly, everything gets a lot messier."
    },
    {
        "subreddit": "politics",
        "sentence": "The pomp around electors meeting to cast their votes is also ceremonial."
    },
    {
        "subreddit": "politics",
        "sentence": "I hope they didn’t pull her fart snorkeling license"
    },
    {
        "subreddit": "politics",
        "sentence": "The lady needs to make living."
    },
    {
        "subreddit": "politics",
        "sentence": "Solve problems is not what he actually did"
    },
    {
        "subreddit": "politics",
        "sentence": "Help his friends in high places is closer to reality."
    },
    {
        "subreddit": "politics",
        "sentence": "He’s a RFK supporter."
    },
    {
        "subreddit": "politics",
        "sentence": "Maybe it'll be better if we take that energy and collectively focus it on young people and protesters and hope we can deflate any civic activism they ever had.  Then they will be quiet and we can just carry on not worrying about it /s"
    },
    {
        "subreddit": "politics",
        "sentence": "Fox News is for fascists by fascists."
    },
    {
        "subreddit": "politics",
        "sentence": "I don’t think they’re aiming to influence the jury"
    },
    {
        "subreddit": "politics",
        "sentence": "Just like he’s not when he bad mouths judges, prosecutors, and witnesses in foront of crowds, cheering or boo-ing as the case mey be.\n\nAs you say, there’s plenty of evidence for the jury to reach their verdict."
    },
    {
        "subreddit": "politics",
        "sentence": "> Let's be real.\n\n*begins to speculate*"
    },
    {
        "subreddit": "politics",
        "sentence": "He’s a RFK supporter."
    },
    {
        "subreddit": "politics",
        "sentence": "Again, read [the article I linked above.](https://www.msnbc.com/the-reidout/reidout-blog/alabamaivf-sex-aoc-alexandria-ocasio-cortez-rcna141033) They're religious so obviously making women subservient is a big part of what they want, but it goes beyond that"
    },
    {
        "subreddit": "politics",
        "sentence": "They are actually quite open about what they want:\n\n> \"It seems to me that a good place to start would be a feminist movement against the pill, & for.."
    },
    {
        "subreddit": "politics",
        "sentence": "returning the consequentiality to sex.\"\n\n> Conservatives have to lead the way in restoring sex to its true purpose, & ending recreational sex & senseless use of birth control pills.\n\n> Right-wing activist Christopher Rufo added his two cents, writing on X last week: “‘Recreational sex’ is a large part of the reason we have so many single-mother households” and that “the point of sex is to create children.”\n\n> Last year, Hadley Manning of the right-wing Independent Women’s Forum bemoaned how contraception has created a “culture of cheap sex that has created mass confusion, pain and regret.”\n\n> Controversial conservative faith leader Joshua Butler wrote last year that birth control “intentionally denies a fruitfulness that points forward to the future hope of the kingdom” and that sex while using contraceptives makes participants “unable to bear witness to the work of the Spirit in creation and redemption.”\n\nThey're religious so by definition they're all horrible hypocrites who will no doubt engage in all the sex they want, but they are not at all shy about wanting to push this nonsense on everyone else"
    },
    {
        "subreddit": "politics",
        "sentence": "Honestly I think it's naive to think they only want to control women"
    },
    {
        "subreddit": "politics",
        "sentence": "They want to control *everyone*, men included."
    },
    {
        "subreddit": "politics",
        "sentence": "> I never knew it was against the law for a politician to pay for someone's silence, even if the story is damaging to the politician during an election cycle.\n\nThat’s actually not one of the charges"
    },
    {
        "subreddit": "politics",
        "sentence": "The crime is illegally hiding a campaign expense as a business expense and/or an attorney retainer"
    },
    {
        "subreddit": "politics",
        "sentence": "*It works like this:*\n\nThe dollars in your wallet automatically become \"rent\" when you hand them to your landlord for your next month’s stay on their property … just like Trump’s dollars automatically become campaign finance when he used them to help his election chances"
    },
    {
        "subreddit": "politics",
        "sentence": "(People misunderstand and think Trump is accused of taking money from a \"campaign account.\" He’s not.)  \n\nHis lawyers tried to explain Trump was hiding the expense from his family (not voters) like candidate John Edwards in ‘07, but unlike Edwards who paid the year before an election to hide a recent affair, Trump’s payment was to hide a 10yr old hookup that he only decided to hide less than 2 weeks before his election"
    },
    {
        "subreddit": "politics",
        "sentence": "And then multiple witnesses in Trump’s own circle confirmed Trump was trying to hide the story from voters, and did not care what his family discovered after the election was over."
    },
    {
        "subreddit": "politics",
        "sentence": "I love his burn but Bob also thinks vaccines cause Autism."
    },
    {
        "subreddit": "politics",
        "sentence": "It's also why I cannot understand this jury system"
    },
    {
        "subreddit": "politics",
        "sentence": "The lawyers can say anything they want and just have to adda whitdrawn at the end"
    },
    {
        "subreddit": "politics",
        "sentence": "The jury won't magically unhear it."
    },
    {
        "subreddit": "politics",
        "sentence": "There is nothing funnier than “who cares about celebrities😭” coming from the party literally screaming and crying about Taylor Swift making and imaginary statement in their minds"
    },
    {
        "subreddit": "politics",
        "sentence": "Also the same dummies who are supporting an actual D-list clown"
    },
    {
        "subreddit": "politics",
        "sentence": "Same ones who prayed to Kid Rock when he came out in support of Trump, same ones who are throwing hissy fits about Deniro now."
    },
    {
        "subreddit": "politics",
        "sentence": "Hopefully the majority of voters know dictator wannabe Trump is a narcissist and a prolific liar."
    },
    {
        "subreddit": "politics",
        "sentence": "Same"
    },
    {
        "subreddit": "politics",
        "sentence": "I have never seen anything like this before either"
    },
    {
        "subreddit": "politics",
        "sentence": "That’s why I say fascism has already taken root in the USA"
    },
    {
        "subreddit": "politics",
        "sentence": "It isn’t a future risk, it is here"
    },
    {
        "subreddit": "politics",
        "sentence": "The ironic thing about all this is the GOP fanatically supports the 2A movement, and vice versa"
    },
    {
        "subreddit": "politics",
        "sentence": "The fascist wing of the GOP is working hard to suppress   peaceful forms of dissent, and the 2A wing of the GOP is working hard to enable violent forms of dissent"
    },
    {
        "subreddit": "politics",
        "sentence": "This isn’t going to end well for either"
    },
    {
        "subreddit": "politics",
        "sentence": "If Trump takes office and suppresses dissent, as he promises to do, some frustrated jackass will take a pot shot at one of Trump’s officials"
    },
    {
        "subreddit": "politics",
        "sentence": "When that happens Trump will expand the martial law he imposed on day one and personal gun ownership in the USA will come to a sudden end"
    },
    {
        "subreddit": "politics",
        "sentence": "This is as predictable as sunrise and sunset, but all I hear from the 2A world is how Biden wants to take their guns away."
    },
    {
        "subreddit": "politics",
        "sentence": "It's also perfomative on the part of Biden"
    },
    {
        "subreddit": "politics",
        "sentence": "As we can see in Rafah, Israel has no problem using smaller or different US munitions to inflict casulties on Palestinians."
    },
    {
        "subreddit": "politics",
        "sentence": "On the one hand, none of us deserves to be remembered only for the worst thing we’ve ever done, and the same goes for historical figures, too.\n\nOn the other hand, we’re talking about being actively involved in insurrection against your country on the grounds of wanting to keep slaves for, at best, economic reasons, but more likely just plain old horrible racism"
    },
    {
        "subreddit": "politics",
        "sentence": "People who are happy to kill their countrymen to continue brutally oppressing brown people to make their plantations more profitable would have to do an awful lot of good to be worthy of being remembered favorably by the country they tore in half"
    },
    {
        "subreddit": "politics",
        "sentence": "Frankly, none of the Confederate leaders really strike me as having made up for their actions"
    },
    {
        "subreddit": "politics",
        "sentence": "Our simply forgetting them is probably the kindest thing they deserve."
    },
    {
        "subreddit": "politics",
        "sentence": "They don't, they say it will only be a little worse"
    },
    {
        "subreddit": "politics",
        "sentence": "Obviously not paying any attention to what him and other republicans have said"
    },
    {
        "subreddit": "politics",
        "sentence": "Their entire argument comes down to the fact that they can't control their lives so will punish the dems for not giving them the choice they want"
    },
    {
        "subreddit": "politics",
        "sentence": "Because they will not be made to do another thing they don't agree with and vote for a lesser evil.\n\nThey are just throwing a fit like a toddler."
    },
    {
        "subreddit": "politics",
        "sentence": "That's just slavery with extra steps."
    },
    {
        "subreddit": "politics",
        "sentence": "While true, the GOP is more than happy to let this narrative that it was dems spearheading the CO movement"
    },
    {
        "subreddit": "politics",
        "sentence": "I have yet to see a single republican, MAGA or otherwise, know, or acknowledge, that it was republicans who pushed for his removal in the state.\n\nObviously the dems didn't interfere, but they weren't behind it."
    },
    {
        "subreddit": "politics",
        "sentence": "It's like the philosopher who thinks it is always immoral to lie being asked by a Nazi if they're hiding and housing Jewish refugees to protect them from persecution"
    },
    {
        "subreddit": "politics",
        "sentence": "(according to lore) He did still have his injuries from the crusifiction after re-animating, so being blown to bits would logically incapicitate him no matter what."
    },
    {
        "subreddit": "politics",
        "sentence": "Trump doesn’t have to be the mastermind of a plan"
    },
    {
        "subreddit": "politics",
        "sentence": "His M.O"
    },
    {
        "subreddit": "politics",
        "sentence": "is to hire someone more competent to think up a scheme, send them off to do the dirty work, and try to claim plausible deniability while also live-streaming the scheme on Twitter.\n\nI don’t think we should ever settle on “Trump’s not even smart enough to do the crime”"
    },
    {
        "subreddit": "politics",
        "sentence": "He has enough money to find people to be smart for him (well, smarter)."
    },
    {
        "subreddit": "politics",
        "sentence": "Don't care"
    },
    {
        "subreddit": "politics",
        "sentence": "He's not going to be President."
    },
    {
        "subreddit": "politics",
        "sentence": "You need to read about the Weimar republic and the role of liberals and conservatives in facilitating Hitlers rise to power"
    },
    {
        "subreddit": "politics",
        "sentence": "Or maybe about apartheid South Africa"
    },
    {
        "subreddit": "politics",
        "sentence": "Or maybe about any multitude of topics that liberals (not progressives/leftists/socialists) were on the wrong side of history on but pretended not to be after the fact."
    },
    {
        "subreddit": "politics",
        "sentence": "Your submission Elon Musk claims alien identity, links human brain function to AI purpose was automatically removed because livemint.com is not appropriate for our [approved domains list](https://www.reddit.com/r/politics/wiki/approveddomainslist).\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "Desantis is pretty unimaginative, so I imagine he'll just get his legislature to make laws which get him what the GOP want anyways while making sure none of it is transparent so they can claim plausible deniability, even though everyone knows they're full of shit."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes they can"
    },
    {
        "subreddit": "politics",
        "sentence": "It's within their borders."
    },
    {
        "subreddit": "politics",
        "sentence": "she was technically an accessory and not a principal in the lawsuits"
    },
    {
        "subreddit": "politics",
        "sentence": "Total disbarment as an accessory sets a nasty precedent that should probably be there anyway, but Colorado doesn’t like to rock the boat."
    },
    {
        "subreddit": "politics",
        "sentence": "Little Marco is stuck in 2016."
    },
    {
        "subreddit": "politics",
        "sentence": "She seemed quite sure of herself - quite smug, in fact - whenever she appeared on tv, Bill Maher's show comes to mind."
    },
    {
        "subreddit": "politics",
        "sentence": "I feel you"
    },
    {
        "subreddit": "politics",
        "sentence": "I sucked at pottery in art school"
    },
    {
        "subreddit": "politics",
        "sentence": "I could never center the damned thing on the wheel"
    },
    {
        "subreddit": "politics",
        "sentence": "Luckily I was good at slab and sculpting, so I squeaked by."
    },
    {
        "subreddit": "politics",
        "sentence": "Why wouldn’t they? Republicans are always trying to get celebrities but most don’t like them"
    },
    {
        "subreddit": "politics",
        "sentence": "They use a famous song and get hit with a cease and desist"
    },
    {
        "subreddit": "politics",
        "sentence": "They try to get someone famous to speak and end up with kid rock at best"
    },
    {
        "subreddit": "politics",
        "sentence": "So why not stick it to them by getting someone not only very famous, but very famous among republicans?\n\nOh they will all act like they hate DeNiro but they love his movies and acting"
    },
    {
        "subreddit": "politics",
        "sentence": "Has to piss them off that every celebrity they love thinks they’re crazy."
    },
    {
        "subreddit": "politics",
        "sentence": "You keep on telling yourself that buddy.\n\nI have seen /r/Politics do this across many different elections now lol"
    },
    {
        "subreddit": "politics",
        "sentence": "It is one of the biggest echo chambers on Reddit, and there is always a solid month after an election of people genuinely confused at the result because this sub told them Dems are a sure thing."
    },
    {
        "subreddit": "politics",
        "sentence": "I can see it not being unusual, I'm saying it isn't standard procedure, and when it's a request for the judge to take a specific action, there is no need to confer"
    },
    {
        "subreddit": "politics",
        "sentence": "Conferring would be if there is some sort of reason to hash out details, or request something from the other side"
    },
    {
        "subreddit": "politics",
        "sentence": "Neither of which is necessary in a motion for a gag order."
    },
    {
        "subreddit": "politics",
        "sentence": "If we don't make these deals other countries like Russia, China and Iran will instead"
    },
    {
        "subreddit": "politics",
        "sentence": "Then it would be those counties that influenced them"
    },
    {
        "subreddit": "politics",
        "sentence": "Until all countries are run by people that want to get along and not start wars it is necessary to try and make sure that counties that have claimed or acted as enemies are not the ones influencing them"
    },
    {
        "subreddit": "politics",
        "sentence": "With us influencing them the hope is to push them towards agreements on things like nukes and rules in war.\n\nThe problem is war has been made to be profitable"
    },
    {
        "subreddit": "politics",
        "sentence": "And way too many people in power see it as the best way to get what they want"
    },
    {
        "subreddit": "politics",
        "sentence": "They fight to keep the wars going so they can keep selling their weapons"
    },
    {
        "subreddit": "politics",
        "sentence": "Until we get these people out of government the people like Biden that have tried to what he can to convince Israel to be more careful about civilians, and the ones that would try and do more to stop it, will be hindered."
    },
    {
        "subreddit": "politics",
        "sentence": "In your opinion how long should Israel go without responding to attacks from hamas so the cycle ends?"
    },
    {
        "subreddit": "politics",
        "sentence": "This is disgusting"
    },
    {
        "subreddit": "politics",
        "sentence": "Corrupt scumbag of a judge."
    },
    {
        "subreddit": "politics",
        "sentence": "It did actually pass as evidence! The case was dropped, but the picture was admitted as evidence"
    },
    {
        "subreddit": "politics",
        "sentence": "Holy shit do I know more about this than you? Isn’t this your whole thing?"
    },
    {
        "subreddit": "politics",
        "sentence": "No one cares about this"
    },
    {
        "subreddit": "politics",
        "sentence": "The top two negatives against Biden are the economy and abortion"
    },
    {
        "subreddit": "politics",
        "sentence": "Part of the abortion issue is most likely conservatives who voted for Biden in 2020 because Trump was so horrible but don't like his pro choice stance, but part of it is people who blame Biden for the overturning of Roe since it happened during his presidency and they don't understand how government works."
    },
    {
        "subreddit": "politics",
        "sentence": "No, the judge and the attorneys determine what counts as evidence and enter it as such"
    },
    {
        "subreddit": "politics",
        "sentence": "The behavior of the attorneys is not evidence of anything in any legal sense."
    },
    {
        "subreddit": "politics",
        "sentence": "I think the process of seeing how much of a liar Trump is was the good thing ."
    },
    {
        "subreddit": "politics",
        "sentence": "the verdict is secondary."
    },
    {
        "subreddit": "politics",
        "sentence": "in my humble opinion \n\nBen"
    },
    {
        "subreddit": "politics",
        "sentence": "Is he trying to get sympathy so the jury feels sorry for Trump and aiming for jury nullification?"
    },
    {
        "subreddit": "politics",
        "sentence": "Silly Billy, they only yeet you from the profession if you improperly use money from a trust account"
    },
    {
        "subreddit": "politics",
        "sentence": "Literally you could murder someone and they’d be like yeahhhhhhh but the trust account looked good so…three months suspension!"
    },
    {
        "subreddit": "politics",
        "sentence": "Holy shit"
    },
    {
        "subreddit": "politics",
        "sentence": "They’re saying you could opt to *not post anything at all*"
    },
    {
        "subreddit": "politics",
        "sentence": "That was the joke"
    },
    {
        "subreddit": "politics",
        "sentence": "Do"
    },
    {
        "subreddit": "politics",
        "sentence": "You"
    },
    {
        "subreddit": "politics",
        "sentence": "Under"
    },
    {
        "subreddit": "politics",
        "sentence": "Stand?"
    },
    {
        "subreddit": "politics",
        "sentence": "They should judge the things said in defense only by the quality of the evidence which supports those assertions"
    },
    {
        "subreddit": "politics",
        "sentence": "Again, this is their *oath*."
    },
    {
        "subreddit": "politics",
        "sentence": "I don't live in the district but I can't see why anyone would vote for Herrera"
    },
    {
        "subreddit": "politics",
        "sentence": "His platform is basically to do whatever Trump tells him and guns, so he'd be another Lauren Boebert type.\n\nObviously it was catnip for the always-online far right types (he was campaigning with Matt Gaetz a few days ago), but I can't imagine the people of that district care about nothing more than the Second Amendment and stroking Trump's ego."
    },
    {
        "subreddit": "politics",
        "sentence": "1"
    },
    {
        "subreddit": "politics",
        "sentence": "Sure but much of the Hamas leadership group is outside of Gaza"
    },
    {
        "subreddit": "politics",
        "sentence": "Specifically in Jordan, Qatar and Lebanon, among others"
    },
    {
        "subreddit": "politics",
        "sentence": "There are leaders on the group but the people in charge of the brainwashing aren't in Gaza"
    },
    {
        "subreddit": "politics",
        "sentence": "So what is the end goal with the barrage on Gaza? Further, those giving teenagers guns aren't major leaders but minor group leaders throughout the region"
    },
    {
        "subreddit": "politics",
        "sentence": "Killing all of them is akin to eliminating Hamas.\n\n2"
    },
    {
        "subreddit": "politics",
        "sentence": "Right but if those tunnels run all throughout residential buildings then those become terrorist targets"
    },
    {
        "subreddit": "politics",
        "sentence": "If Hamas doesn't care about Palestinians than every building could hold weapons are thus becomes terrorist infrastructure"
    },
    {
        "subreddit": "politics",
        "sentence": "Again, that means leveling Gaza"
    },
    {
        "subreddit": "politics",
        "sentence": "I don't support completely destroying the entire country"
    },
    {
        "subreddit": "politics",
        "sentence": "Do you?\n\nA ground invasion in close quarters combat would result in even higher civilian casualties"
    },
    {
        "subreddit": "politics",
        "sentence": "You say you don't want all Palestinians dead but I ask you, what percentage of civilians killed is acceptable for trying to eliminate Hamas in Gaza? At what point would it be unacceptable? And is it unacceptable to kill civilians and aid workers who have no possible military significance?"
    },
    {
        "subreddit": "politics",
        "sentence": "https://www.salon.com/2022/07/21/theyre-coming-for-contraception-195-vote-against-right-to-birth-control-condoms/"
    },
    {
        "subreddit": "politics",
        "sentence": "And if trump wins, the only thing preventing him from withdrawing the US from NATO is the NDAA that was passed last year"
    },
    {
        "subreddit": "politics",
        "sentence": "But if Democrats lose too many seats in Congress, then the US would likely end up withdrawing, encouraging Putin to go wild."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes!"
    },
    {
        "subreddit": "politics",
        "sentence": "Your words in god's ear!"
    },
    {
        "subreddit": "politics",
        "sentence": "If any state needs to smoke some reefer and chill the fuck out, it’s Florida…"
    },
    {
        "subreddit": "politics",
        "sentence": "Because jurors take an oath not to do that, for one!"
    },
    {
        "subreddit": "politics",
        "sentence": "Yes, I understand that"
    },
    {
        "subreddit": "politics",
        "sentence": "It is wholly inappropriate to determine guilt based off of the attorney’s behavior"
    },
    {
        "subreddit": "politics",
        "sentence": "It is a fundamental violation of the juror’s oath."
    },
    {
        "subreddit": "politics",
        "sentence": "Just another moderate poser"
    },
    {
        "subreddit": "politics",
        "sentence": "Hope to see her crocodile tears in November."
    },
    {
        "subreddit": "politics",
        "sentence": "Was the person guilty of the crime, in your opinion?"
    },
    {
        "subreddit": "politics",
        "sentence": "Shit, in England you’d get 3 years for being mean to your PA"
    },
    {
        "subreddit": "politics",
        "sentence": "You get disbarred for travelling on a train without a ticket.\n\nFortunately I don’t think we’ve had any cases for attempted coup"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank you"
    },
    {
        "subreddit": "politics",
        "sentence": "*So* many people misuse this."
    },
    {
        "subreddit": "politics",
        "sentence": "Hate to break it to you but Israel doesn't care about the hostages"
    },
    {
        "subreddit": "politics",
        "sentence": "Look up the Hannibal Directive."
    },
    {
        "subreddit": "politics",
        "sentence": "Or jury nullification"
    },
    {
        "subreddit": "politics",
        "sentence": "That moment when you can't even tell reality apart from a Monty Python skit"
    },
    {
        "subreddit": "politics",
        "sentence": "\"O Lord, bless this thy hand grenade, that with it thou mayst blow thy enemies to tiny bits, in thy mercy.\""
    },
    {
        "subreddit": "politics",
        "sentence": "I know it is petty but totally agree."
    },
    {
        "subreddit": "politics",
        "sentence": "I think it’s funnier that they explained it…"
    },
    {
        "subreddit": "politics",
        "sentence": "She got up and walked out of his confirmation hearing because all the senators were being so MEAN and NASTY and actually questioning him! I think it’s a dual narcissist relationship."
    },
    {
        "subreddit": "politics",
        "sentence": "Man, I honestly don’t envy these guys"
    },
    {
        "subreddit": "politics",
        "sentence": "They all went to school for this stuff and are totally aware of the incalculable damage this shit show is doing to US foreign policy.\nGetting a lot harder to argue that Israel doesn’t own the US government"
    },
    {
        "subreddit": "politics",
        "sentence": "And to those who will inevitably say that’s “unfair/antisemitism/blood libel” I ask you this in complete honesty.\nWould the US tolerate this out of the UK? You know, the “Mother Country?” You know goddamned well that we wouldn’t…"
    },
    {
        "subreddit": "politics",
        "sentence": "Nixon, famous non-Democrat, was president when Saigon fell and had been for a while."
    },
    {
        "subreddit": "politics",
        "sentence": "He lost to E"
    },
    {
        "subreddit": "politics",
        "sentence": "Jean Carroll and will probably lose all the cases (e.g"
    },
    {
        "subreddit": "politics",
        "sentence": "Georgia, Florida, and Washington, D.C.)."
    },
    {
        "subreddit": "politics",
        "sentence": "Hi `Ok-Sweet-8495`"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank you for participating in /r/Politics"
    },
    {
        "subreddit": "politics",
        "sentence": "However, your submission has been removed for the following reason:\n\n* Already Submitted: This article has been submitted to /r/politics _within_ the last three days, and has been removed for violating [that submission rule](https://www.reddit.com/r/politics/wiki/index#wiki_do_not_resubmit_.22already_submitted.22_content) however you can see that thread here: https://redd.it/1d2ye6l\n\nI'm a bot and sometimes I make mistakes"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any questions about this removal, please feel free to [message the moderators.](https://www.reddit.com/message/compose?to=/r/politics&subject=Question regarding the removal of this submission by /u/Ok-Sweet-8495&message=I have a question regarding the removal of this [submission.](https://www.reddit.com/r/politics/comments/1d353vm/the_alitos_the_neighborhood_clash_and_the/\\))"
    },
    {
        "subreddit": "politics",
        "sentence": "Yes, that's why I said a link to the Twitter post wouldn't cut it, so I used the approved domain article"
    },
    {
        "subreddit": "politics",
        "sentence": "Simple to understand."
    },
    {
        "subreddit": "politics",
        "sentence": "Another Trumpers life ruined because of Donny boy."
    },
    {
        "subreddit": "politics",
        "sentence": "This is pretty devestating for her as she will be unable to work to undermine the integrity of this election, and will now have to wait a full 4 years to get another chance at undermining an election."
    },
    {
        "subreddit": "politics",
        "sentence": "This submission source is likely to have a soft paywall"
    },
    {
        "subreddit": "politics",
        "sentence": "If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\""
    },
    {
        "subreddit": "politics",
        "sentence": "[More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "As a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others"
    },
    {
        "subreddit": "politics",
        "sentence": "Debate/discuss/argue the merits of ideas, don't attack people"
    },
    {
        "subreddit": "politics",
        "sentence": "Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban"
    },
    {
        "subreddit": "politics",
        "sentence": "If you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "Hey I like your username!"
    },
    {
        "subreddit": "politics",
        "sentence": "Wrong"
    },
    {
        "subreddit": "politics",
        "sentence": "By definition, pictures certainly can be and have been evidence in courts of law"
    },
    {
        "subreddit": "politics",
        "sentence": "I’d say rare Truman W but I just know some smug /r/presidents guy is gonna show up and tell me about 3 policies he passed that I really agree with to this day."
    },
    {
        "subreddit": "politics",
        "sentence": "I really enjoyed his broadcasts, for more then a decade"
    },
    {
        "subreddit": "politics",
        "sentence": "I was astounded when he was suddenly gone"
    },
    {
        "subreddit": "politics",
        "sentence": "Then I learned what he is really like, so disappointed that I liked him before."
    },
    {
        "subreddit": "politics",
        "sentence": "So how did you register to vote?"
    },
    {
        "subreddit": "politics",
        "sentence": "We cant destroy ideology of oppressed people with violence but there is plenty you can do with a nation state occupying them that creates actively perpetuates that ideology"
    },
    {
        "subreddit": "politics",
        "sentence": "Cut off aid for Israel first, sanctions and extraditions for US settlers (and US sex offenders hiding in Israel bc why not)"
    },
    {
        "subreddit": "politics",
        "sentence": "After that if Israel still doesn't play ball start a NATO mission if needed"
    },
    {
        "subreddit": "politics",
        "sentence": "Or the US can use some of the other nation building moves over the years we have done."
    },
    {
        "subreddit": "politics",
        "sentence": "A literal picture without explanation or context is not evidence."
    },
    {
        "subreddit": "politics",
        "sentence": "Do you believe that Judge Cannon is a fair and impartial judge?"
    },
    {
        "subreddit": "politics",
        "sentence": "> She had sought financial damages of at least $1,000\n\n$1000? Should be millions considering what these two were put through."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes"
    },
    {
        "subreddit": "politics",
        "sentence": "Which is irrelevant to what the other person said"
    },
    {
        "subreddit": "politics",
        "sentence": "They said you don’t have to post any article, which you somehow misunderstood and then posted a link to the rules lmfao"
    },
    {
        "subreddit": "politics",
        "sentence": "Beto lost because he was a shitty candidate"
    },
    {
        "subreddit": "politics",
        "sentence": "That's the only way you could lose to a man who said Uvalde \"Could have been worse\" just a few months earlier."
    },
    {
        "subreddit": "politics",
        "sentence": "I don’t want to be the pessimistic one here but I’m not letting the balloons go until I read what the jury actually comes back with"
    },
    {
        "subreddit": "politics",
        "sentence": "I’ve watched this guy get bailed out by person after person"
    },
    {
        "subreddit": "politics",
        "sentence": "Even when I fully thought people would do the right thing, there was always someone who helped him dodge consequences."
    },
    {
        "subreddit": "politics",
        "sentence": "It was like 1/3 or something odds for her"
    },
    {
        "subreddit": "politics",
        "sentence": "I suggest George Washington Carver Bridge"
    },
    {
        "subreddit": "politics",
        "sentence": "Carver and Lincoln also share another connection: Carver is one of the few people to receive a monument after death, an honor previously only given to presidents"
    },
    {
        "subreddit": "politics",
        "sentence": "After Carver's death, President Franklin D"
    },
    {
        "subreddit": "politics",
        "sentence": "Roosevelt signed legislation to grant Carver his own monument"
    },
    {
        "subreddit": "politics",
        "sentence": "Carver was an agricultural scientist and inventor who developed hundreds of products using peanuts, soybeans, and sweet potatoes"
    },
    {
        "subreddit": "politics",
        "sentence": "He was also a prominent Black scientist in the early 20th century, and presidents consulted with him."
    },
    {
        "subreddit": "politics",
        "sentence": "Military contractors categorically “don’t count” lmao."
    },
    {
        "subreddit": "politics",
        "sentence": "Clowns can be occasionally funny or at worst eat some kids in Maine."
    },
    {
        "subreddit": "politics",
        "sentence": "Stupid MAGAts are always outraged.I saw that Burns interview"
    },
    {
        "subreddit": "politics",
        "sentence": "He is fantastic.\n\nPeople with any platform, need to speak up.Traitor Trash Trump is menace to Democracy and the world"
    },
    {
        "subreddit": "politics",
        "sentence": "So many more need to do this"
    },
    {
        "subreddit": "politics",
        "sentence": "He is spot on"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s not scary to call this national embarrassment what he is!"
    },
    {
        "subreddit": "politics",
        "sentence": "What? You replied to a link to approved domains"
    },
    {
        "subreddit": "politics",
        "sentence": "Then we should do that, but won't."
    },
    {
        "subreddit": "politics",
        "sentence": "She shreds our laws into bits."
    },
    {
        "subreddit": "politics",
        "sentence": "It is difficult to find the proportionality sometimes"
    },
    {
        "subreddit": "politics",
        "sentence": "There are clear, empirically demonstrated disparities in sentencing within the US justice system which favours wealthy people and favours white people over poorer citizens and non-white citizens.\n\nThere also seems to be a pattern of when a wealthy white American does actually receive a significant sentence, it is in cases where the victims were wealthier white Americans."
    },
    {
        "subreddit": "politics",
        "sentence": "In a different state.\n\nI'm not defending her but the law is very strict about jurisdictions."
    },
    {
        "subreddit": "politics",
        "sentence": "Damn already? Season starts earlier and earlier every year."
    },
    {
        "subreddit": "politics",
        "sentence": "Republicans already did it.\n\nWhen the ICC agreed to go ahead and investigate war crimes in Afghanistan Republicans froze assets and put travel bans on the law clerks, prosecutors and investigators involved."
    },
    {
        "subreddit": "politics",
        "sentence": "Something something time, don't do the crime."
    },
    {
        "subreddit": "politics",
        "sentence": "Talk about saying the quiet part out loud, sheesh"
    },
    {
        "subreddit": "politics",
        "sentence": "Reminds me of [this Onion News video.](https://m.youtube.com/watch?v=84phU8of02U)"
    },
    {
        "subreddit": "politics",
        "sentence": "\"You mean a mistrial?\""
    },
    {
        "subreddit": "politics",
        "sentence": "What? How is that at all relevant to what I replied to?"
    },
    {
        "subreddit": "politics",
        "sentence": "> Yeah but other states that were hit still have power.\n\nVery rude of those tornados to not spread out more to more evenly destroy power lines."
    },
    {
        "subreddit": "politics",
        "sentence": "I guess it didn't pan out for republicans."
    },
    {
        "subreddit": "politics",
        "sentence": "I’ve played so much fallout lately that the pic looked like the wasteland"
    },
    {
        "subreddit": "politics",
        "sentence": "> We could absolutely put a stop to the fighting if it was in our interests.\n\nNope"
    },
    {
        "subreddit": "politics",
        "sentence": "No one will ever be able to stop Hamas from fighting unless they are eliminated"
    },
    {
        "subreddit": "politics",
        "sentence": "And you’re certainly not going to make Israel go back to Oct 6 until the hostages are all accounted for."
    },
    {
        "subreddit": "politics",
        "sentence": "Israel has several land routes open for aid entry into the Gaza Strip where aid moves in almost every day, pending rocket attacks or other security issues that prevent safe crossings."
    },
    {
        "subreddit": "politics",
        "sentence": "I hear you, but I am also familiar with how classification security works in the USA"
    },
    {
        "subreddit": "politics",
        "sentence": "The movie action/drama you portray is not how it is done"
    },
    {
        "subreddit": "politics",
        "sentence": "Misplaced documents happen all the time"
    },
    {
        "subreddit": "politics",
        "sentence": "The government’s interest is yo get them back"
    },
    {
        "subreddit": "politics",
        "sentence": "In general, that happens quickest when the person in possession of the documents returns them voluntarily"
    },
    {
        "subreddit": "politics",
        "sentence": "So the initial contact would be very low key"
    },
    {
        "subreddit": "politics",
        "sentence": "A security officer would call or visit with a polite knock on the door"
    },
    {
        "subreddit": "politics",
        "sentence": "After a short chat if you help them find the documents there would be no penalty other than perhaps showing up for a security refresher"
    },
    {
        "subreddit": "politics",
        "sentence": "This is well known in the classified world PRECISELY BECAUSE it is the most effective way to get the documents back"
    },
    {
        "subreddit": "politics",
        "sentence": "The incentives are to cooperate"
    },
    {
        "subreddit": "politics",
        "sentence": "If you read the espionage act you’ll see that this has been the policy for a long time"
    },
    {
        "subreddit": "politics",
        "sentence": "Having classified material is not illegal per-se"
    },
    {
        "subreddit": "politics",
        "sentence": "It only becomes illegal when there is intent to block the government from protecting those secrets, or worse, use them for personal gain."
    },
    {
        "subreddit": "politics",
        "sentence": "I wonder how many or what percentage of people actually vote according to who an other politician endorses..?\n\nI certainly don’t,  it I don’t trust politicians at all."
    },
    {
        "subreddit": "politics",
        "sentence": "Magats"
    },
    {
        "subreddit": "politics",
        "sentence": "> for something she hasn't been found guilty of yet \n\nWrong, she plead guilty in October 2023"
    },
    {
        "subreddit": "politics",
        "sentence": "She was sentenced to five years of probation, $5,000 in restitution and 100 hours of community service."
    },
    {
        "subreddit": "politics",
        "sentence": "Not necessarily"
    },
    {
        "subreddit": "politics",
        "sentence": "The Republican Party is dwindling"
    },
    {
        "subreddit": "politics",
        "sentence": "The younger generations lean further left than any prior generation, and the older conservative generations are starting to die off.\n\nThe turmoil we see is caused by a shrinking conservative majority trying to maintain power as they become a minority group.\n\nThis could be the last time in the foreseeable future that the Republican Party has any chance of winning the presidency"
    },
    {
        "subreddit": "politics",
        "sentence": "If they lose, this could be the end of the Republican Party as we know it"
    },
    {
        "subreddit": "politics",
        "sentence": "If they win, we might see them tear down democracy to keep control.\n\nIf we can make it through this year without a Trump victory, we may see the situation finally stabilize"
    },
    {
        "subreddit": "politics",
        "sentence": "MAGAs will still exist, but they won’t have enough political power to make further headway with their agenda, and their numbers will continue to diminish until they’re gone."
    },
    {
        "subreddit": "politics",
        "sentence": "That’s pretty fucking good"
    },
    {
        "subreddit": "politics",
        "sentence": "Too much good stuff on Netflix."
    },
    {
        "subreddit": "politics",
        "sentence": "What a world we live in"
    },
    {
        "subreddit": "politics",
        "sentence": "A Supreme Court Justice getting into a sign battle with their neighbor, and not having one ounce of shame."
    },
    {
        "subreddit": "politics",
        "sentence": "“Were you there? If not, then you have no evidence” \n\n-you, elsewhere in this thread."
    },
    {
        "subreddit": "politics",
        "sentence": "Doing their best to stop ballot access to left wing parties"
    },
    {
        "subreddit": "politics",
        "sentence": "Fascist behavior."
    },
    {
        "subreddit": "politics",
        "sentence": "The interesting part to me is how he and his zombies see this as another \"f you\" to his opponents"
    },
    {
        "subreddit": "politics",
        "sentence": "They think he's being tough, when all he is doing is confirming what the sane among us have known for years, which is that he has the emotional development of a cranky toddler who would rather throw a tantrum than follow basic manners."
    },
    {
        "subreddit": "politics",
        "sentence": "50% of the population of Gaza are children.\n\nPro-life my balls."
    },
    {
        "subreddit": "politics",
        "sentence": "Nope, twitter post wasn't going to cut it, and it's hilarious that liberal news won't report anything related to Stein."
    },
    {
        "subreddit": "politics",
        "sentence": "Biden needs to appoint at least 2, let’s not shoot for something we most likely will not get."
    },
    {
        "subreddit": "politics",
        "sentence": "Facts just seem to really upset liberals"
    },
    {
        "subreddit": "politics",
        "sentence": "So Biden tomorrow says he won't send any more weapons at all"
    },
    {
        "subreddit": "politics",
        "sentence": "Then what will happen? Republicans will throw a fit (like they did over him trying to pause shipments)"
    },
    {
        "subreddit": "politics",
        "sentence": "If he wins that fight then Israel has nothing to loose from us and can just kill who ever they want"
    },
    {
        "subreddit": "politics",
        "sentence": "If on top of that another country like China wanted to send weapons instead supporting a real genocide it would further destroy any influence the U.S"
    },
    {
        "subreddit": "politics",
        "sentence": "has there."
    },
    {
        "subreddit": "politics",
        "sentence": "Well he did do a documentary on Jazz"
    },
    {
        "subreddit": "politics",
        "sentence": "You know, the devils music according to MAGA"
    },
    {
        "subreddit": "politics",
        "sentence": "Outrage is their primary form of recreation."
    },
    {
        "subreddit": "politics",
        "sentence": "“May you have PEACE” was a death threat/wish as in “rest in peace”"
    },
    {
        "subreddit": "politics",
        "sentence": "So we're just going to forget about the democrats.Claiming the election was stolen in two thousand sixteen and maxim waters telling everyone to attack republicans?"
    },
    {
        "subreddit": "politics",
        "sentence": "What? This comment is absolutely crazy."
    },
    {
        "subreddit": "politics",
        "sentence": "Get better material"
    },
    {
        "subreddit": "politics",
        "sentence": "Donnies Truth Social is in total all caps despiration mode"
    },
    {
        "subreddit": "politics",
        "sentence": "Funniedt thing is that he whines about not being “allowed” to answer for himself when he of course refused to testify when offered"
    },
    {
        "subreddit": "politics",
        "sentence": "Let’s make Trump a two time loser"
    },
    {
        "subreddit": "politics",
        "sentence": "Vote Blue💙"
    },
    {
        "subreddit": "politics",
        "sentence": "Surely this is sarcasm"
    },
    {
        "subreddit": "politics",
        "sentence": "Lol, Ivanka and Jared got their bag, they don't need him anymore"
    },
    {
        "subreddit": "politics",
        "sentence": "He's probably weirdly proud of the way they used him to get what they wanted and then ignored him, it's what he would've done to them."
    },
    {
        "subreddit": "politics",
        "sentence": "Well, to the “outraged,” your God King says all this stuff and you cheer it.\nWe are showing you “respect” by taking you at your word.\nIf you don’t like being called fascists, stop cheering fascism."
    },
    {
        "subreddit": "politics",
        "sentence": "Wow, a xenophobic GOP electing an person of Asian decent, oh the irony."
    },
    {
        "subreddit": "politics",
        "sentence": "Think how a family feels when one of their own is gunned down by police after they just called 911 to get some help.\n\nTrump has had it so cushy all his life, he doesn't recognize Reality."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm sure the fact that he has received more money from AIPAC during that time than any other politician has *nothing* to do with that..."
    },
    {
        "subreddit": "politics",
        "sentence": "This submission has been automatically removed because it comes from a domain that has been filtered for rehosted content"
    },
    {
        "subreddit": "politics",
        "sentence": "[More information can be found here](http://www.reddit.com/r/politics/wiki/filtereddomains#wiki_rehosted_content)\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "I agree with you"
    },
    {
        "subreddit": "politics",
        "sentence": "I don’t think naming any public building or infrastructure after a person is a good idea"
    },
    {
        "subreddit": "politics",
        "sentence": "I just think that once a name is established it should only be changed if there something really egregious in the person’s history, relative to their time"
    },
    {
        "subreddit": "politics",
        "sentence": "I’ll admit that I hadn’t considered that this is actually a new bridge though, so it’s a good opportunity for a new name."
    },
    {
        "subreddit": "politics",
        "sentence": "Uh wait just a second"
    },
    {
        "subreddit": "politics",
        "sentence": "Are you saying only first hand evidence is evidence? Bc if that’s the case then we have no evidence for any historical events pre-1900!"
    },
    {
        "subreddit": "politics",
        "sentence": "Sec"
    },
    {
        "subreddit": "politics",
        "sentence": "Blinken publicly supporting congressional action against the ICC and then quietly walking it back with Kirby in a press briefing is so dumb! \n\nLoudly undermine the value of international rule based order he spent all last year swearing to protect and then  quietly walk it back"
    },
    {
        "subreddit": "politics",
        "sentence": "He wins neither side over with these stances"
    },
    {
        "subreddit": "politics",
        "sentence": "He looks inept and weak"
    },
    {
        "subreddit": "politics",
        "sentence": "The stance last week wins him no leverage over Netanyahu"
    },
    {
        "subreddit": "politics",
        "sentence": "And then walking it back doesn't restore the credibility that he's trying to protect Gazans."
    },
    {
        "subreddit": "politics",
        "sentence": "5"
    },
    {
        "subreddit": "politics",
        "sentence": ">Who do you think that bomb is going to hit?\n\nHamas and unfortunately civilians they hide behind.\n\n>Sure, I would like Hamas taken out"
    },
    {
        "subreddit": "politics",
        "sentence": "But not at the expense of 13,000 children\n\nTell that to Hamas"
    },
    {
        "subreddit": "politics",
        "sentence": "They could end the war this instant by releasing the hostages and surrendering.\n\n>If the bombs were actually only hitting Hamas, there wouldn't be a problem.\n\nNo shit, but this is a war"
    },
    {
        "subreddit": "politics",
        "sentence": "I failed art in middle school"
    },
    {
        "subreddit": "politics",
        "sentence": "You have to actively work at it"
    },
    {
        "subreddit": "politics",
        "sentence": "Trust me."
    },
    {
        "subreddit": "politics",
        "sentence": "The point isn't breaking a law or some laws, it's about trying to destroy the entirety of law itself that our country is based on"
    },
    {
        "subreddit": "politics",
        "sentence": "That deserves the harshest, most severe punishment that our legal system can give, up to and absolutely including death"
    },
    {
        "subreddit": "politics",
        "sentence": "It's treason"
    },
    {
        "subreddit": "politics",
        "sentence": "There's no fucking comparison"
    },
    {
        "subreddit": "politics",
        "sentence": "At all"
    },
    {
        "subreddit": "politics",
        "sentence": "Whatsoever."
    },
    {
        "subreddit": "politics",
        "sentence": "Right? Like \"the house is burning down, the proper recourse is to steep this fire in room temperature air!\""
    },
    {
        "subreddit": "politics",
        "sentence": "The US military is literally towing the broken dock to Ashkelon for repairs"
    },
    {
        "subreddit": "politics",
        "sentence": "If they can conduct repairs there they can surely land supplies there too"
    },
    {
        "subreddit": "politics",
        "sentence": "Ashkelon is no more than 25 miles from the location of this dock, so it’s a trivial amount of distance."
    },
    {
        "subreddit": "politics",
        "sentence": "They kind of are"
    },
    {
        "subreddit": "politics",
        "sentence": "She got suspended from work for something she hasn't been found guilty of yet in the robust court of criminal law."
    },
    {
        "subreddit": "politics",
        "sentence": "Interesting"
    },
    {
        "subreddit": "politics",
        "sentence": "I hadn’t considered that."
    },
    {
        "subreddit": "politics",
        "sentence": "Alito and Thomas will be emboldened"
    },
    {
        "subreddit": "politics",
        "sentence": "Anyone who knows their personality type knows that the criticism has them seething inside with \"oh yeah? I'll give you something to cry about!\"\n\nThey're going into no holds barred mode."
    },
    {
        "subreddit": "politics",
        "sentence": "Breaking News: The DNC does whatever they want all the time so why would this time be any different"
    },
    {
        "subreddit": "politics",
        "sentence": "IMO Bernie got robbed in two different primaries..."
    },
    {
        "subreddit": "politics",
        "sentence": "And her jail time?\n\nWhen does that begin?\n\nHow many years?"
    },
    {
        "subreddit": "politics",
        "sentence": "They won't actually be deported"
    },
    {
        "subreddit": "politics",
        "sentence": "Some will be slave labor, some will be executed, some sex slaves."
    },
    {
        "subreddit": "politics",
        "sentence": "They were conservative slave owners who wanted to keep their slaves, yes.\n\n>  If you believe mainstream media and them claiming who the kkk endorses then I really pity you\n\nSorry, the former leader of the KKK endorses Donald Trump"
    },
    {
        "subreddit": "politics",
        "sentence": "But sure, the ~mainstream media~ always lies when it makes conservatives look bad."
    },
    {
        "subreddit": "politics",
        "sentence": "What the f*ck does she care about history?   \n\nConsequences, now, or nothing matters and nothing changes."
    },
    {
        "subreddit": "politics",
        "sentence": "hey conservative gays, remember all those times we tried warning you that conservatives are still monsters that fucking hate you and the second they get rid of us they'll come after you?"
    },
    {
        "subreddit": "politics",
        "sentence": "hamas shot their own hospital and lied"
    },
    {
        "subreddit": "politics",
        "sentence": "They multiplied the reports of infant deaths"
    },
    {
        "subreddit": "politics",
        "sentence": "Lets say hypothetically Kirby is telling the truth, it would play out exactly as we are seeing"
    },
    {
        "subreddit": "politics",
        "sentence": "There are consequences for him lying"
    },
    {
        "subreddit": "politics",
        "sentence": "There are no consequences for the media to lie, except a bump in revenue.\n\nedit: [This just in.](https://www.reddit.com/r/worldnews/s/1FeRr4XGxX) I'm sure Hamas wouldn't hide under innocent civilians *AGAIN* would they!? /s The genocidal sex slaving hamas regime will always use neutral zones as launch pads for attacks, and they need to be defeated."
    },
    {
        "subreddit": "politics",
        "sentence": "Not sure you can compare these two things"
    },
    {
        "subreddit": "politics",
        "sentence": "I would say no"
    },
    {
        "subreddit": "politics",
        "sentence": "He tried to cover up things to get elected and was making campaign contributions and here he would get bribed… but maybe I am wrong about it"
    },
    {
        "subreddit": "politics",
        "sentence": "No, it means that when you literally say that the DNC didn’t have a role in it and it was plain voting, that’s dishonest"
    },
    {
        "subreddit": "politics",
        "sentence": "your reply is basically one big “nuh uh” without actually addressing the points"
    },
    {
        "subreddit": "politics",
        "sentence": "Clinton didn’t even show up in the rust belt"
    },
    {
        "subreddit": "politics",
        "sentence": "Democrats absolutely gave up on the 50 state initiative that Dean pushed"
    },
    {
        "subreddit": "politics",
        "sentence": "There was a freaking “it’s her turn” slogan"
    },
    {
        "subreddit": "politics",
        "sentence": "I’m not pushing some “economic anxiety was the root of Trump” nonsense, but to act like the Democrat abandonment of the union type voters they had before among a lot of other massive blunders plays no role in Trumps election is equally nonsense."
    },
    {
        "subreddit": "politics",
        "sentence": "Think the justice system has issues? Welcome to BLM."
    },
    {
        "subreddit": "politics",
        "sentence": "America."
    },
    {
        "subreddit": "politics",
        "sentence": "can you just do the right thing for once"
    },
    {
        "subreddit": "politics",
        "sentence": "love, the rest of the world"
    },
    {
        "subreddit": "politics",
        "sentence": "And little Mermaids of color, named Ariel."
    },
    {
        "subreddit": "politics",
        "sentence": "The standards should be higher."
    },
    {
        "subreddit": "politics",
        "sentence": "Does anyone believe MAGA knew who Ken Burns was before this week? They hate PBS, so their only exposure to him was probably watching the Civil War doc in their middle school history class."
    },
    {
        "subreddit": "politics",
        "sentence": "Far and away my favorite meme of the last ten years"
    },
    {
        "subreddit": "politics",
        "sentence": "It just hits so good"
    },
    {
        "subreddit": "politics",
        "sentence": "Crazy how Americans want someone who has dementia and literally forgets his own name to have access to the country’s nuclear codes"
    },
    {
        "subreddit": "politics",
        "sentence": "Pathetic"
    },
    {
        "subreddit": "politics",
        "sentence": "And poor conservatives get less punishment."
    },
    {
        "subreddit": "politics",
        "sentence": "And business insider"
    },
    {
        "subreddit": "politics",
        "sentence": "And almost all of it is editorials"
    },
    {
        "subreddit": "politics",
        "sentence": "I swear people on this site don’t give a hoot about sources or anything"
    },
    {
        "subreddit": "politics",
        "sentence": "\"If anyone slaps you on the right cheek, turn to them and bomb the shit out of them\""
    },
    {
        "subreddit": "politics",
        "sentence": "However, it's important to note that the justice system isn't entirely broken"
    },
    {
        "subreddit": "politics",
        "sentence": "There are plenty of cases where wealthy individuals face significant consequences for their actions."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm voting for Robert de Niro for 2024 president 🇺🇲"
    },
    {
        "subreddit": "politics",
        "sentence": "And what if your family disagrees with you? You going to force them to vote your way?"
    },
    {
        "subreddit": "politics",
        "sentence": "Hi `0Ring-0`"
    },
    {
        "subreddit": "politics",
        "sentence": "Thank you for participating in /r/Politics"
    },
    {
        "subreddit": "politics",
        "sentence": "However, your submission has been removed for the following reason:\n\n* Already Submitted: This article has been submitted to /r/politics _within_ the last three days, and has been removed for violating [that submission rule](https://www.reddit.com/r/politics/wiki/index#wiki_do_not_resubmit_.22already_submitted.22_content) however you can see that thread here: https://redd.it/1d32pyd\n\nI'm a bot and sometimes I make mistakes"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any questions about this removal, please feel free to [message the moderators.](https://www.reddit.com/message/compose?to=/r/politics&subject=Question regarding the removal of this submission by /u/0Ring-0&message=I have a question regarding the removal of this [submission.](https://www.reddit.com/r/politics/comments/1d34rs3/ken_burns_rare_trump_warning_sparks_maga_outrage/\\))"
    },
    {
        "subreddit": "politics",
        "sentence": "And as far as the statues go, they simply want to keep history in place.So we don't forget the mistakes we made in the past"
    },
    {
        "subreddit": "politics",
        "sentence": "The liberals are simply trying to tear the statues down Trying to make it look like they're not part of it."
    },
    {
        "subreddit": "politics",
        "sentence": "I can't blame her there"
    },
    {
        "subreddit": "politics",
        "sentence": "Politics is a stupid game to be playing for a family with as much money as the Trumps are supposed to have."
    },
    {
        "subreddit": "politics",
        "sentence": "I mean"
    },
    {
        "subreddit": "politics",
        "sentence": "Christianity is still used to make decisions about the laws in our country REGARDLESS if science contradicts it"
    },
    {
        "subreddit": "politics",
        "sentence": "The day people like this become automatically disqualified could only exist in a society where we stop taking religion seriously or allowing it to have anything to do our government"
    },
    {
        "subreddit": "politics",
        "sentence": "Freedom of religion should always be allowed"
    },
    {
        "subreddit": "politics",
        "sentence": "But it should be a personal choice and never something used in shaping laws or policies in our government"
    },
    {
        "subreddit": "politics",
        "sentence": "Period"
    },
    {
        "subreddit": "politics",
        "sentence": "Trump clearly watched The Civil War, as he quoted it recently at Gettysburg with his brilliant \"Never Fight Uphill, Me Boys\", which is destined to rival Lincoln's \"Four score and seven years ago\" as the most important words ever spoken on that hallowed ground"
    },
    {
        "subreddit": "politics",
        "sentence": "/S, as apparently that is necessary."
    },
    {
        "subreddit": "politics",
        "sentence": "Second this, purely out of jaded pessimism from the past decade"
    },
    {
        "subreddit": "politics",
        "sentence": "But even if he sees the inside of a prison cell, I feel like this country will find a way to disappoint me."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm gonna be honest, until trump is in jail none of this matters"
    },
    {
        "subreddit": "politics",
        "sentence": "I take her as more of a catcher."
    },
    {
        "subreddit": "politics",
        "sentence": "I follow her on Twitter.\n\nShe's in complete denial about the whole thing"
    },
    {
        "subreddit": "politics",
        "sentence": "She doesn't believe she was convicted of a felony, despite pleading guilty to one, because she's got some deferral arrangement with the DA whereby the charges are dropped after 3 years (not sure how that will work out if she's convicted on the Arizona charges)"
    },
    {
        "subreddit": "politics",
        "sentence": "She's been shunned by MAGA for flipping on Trump in GA and then endorsing DeSantis, and she's still facing the previously-mentioned AZ charges, so her career as a lawyer is probably over even if she manages to get her license back after the suspension.\n\nIt never ceases to amaze me what these kooks are willing to sacrifice for a few months of infamy and a brief stint as a Fox News contributor."
    },
    {
        "subreddit": "politics",
        "sentence": "Bar Association protects the guild and gives attorney slap on the wrist"
    },
    {
        "subreddit": "politics",
        "sentence": "This should have been permanent removal of license, but the Bar Association really only cares if steal rich peoples money"
    },
    {
        "subreddit": "politics",
        "sentence": "Otherwise it looks out after its own"
    },
    {
        "subreddit": "politics",
        "sentence": "A good example of why the regulation of lawyers needs to be done by non-lawyers self-regulation is always a terrible idea."
    },
    {
        "subreddit": "politics",
        "sentence": "Other than vote, and making sure others vote, the only thing you can do is make a plan for when they start coming for you"
    },
    {
        "subreddit": "politics",
        "sentence": "And if he wins, they'll be coming for everybody that he doesn't like/feels slighted by/is educated/is a potential threat to his new regime"
    },
    {
        "subreddit": "politics",
        "sentence": "He is a big fan of Hitler, so I imagine a lot of his playbook, and he's BFF with Putin so he'll have some of his plays too.\n\nI truly believe he'll execute the Supreme Court a short time after he's elected"
    },
    {
        "subreddit": "politics",
        "sentence": "They're a threat to his power, and after the election they'll either have ruled that the President is above the law or that ruling will still be on hold"
    },
    {
        "subreddit": "politics",
        "sentence": "He'll do it and get away with it"
    },
    {
        "subreddit": "politics",
        "sentence": "He'll have help from Russia, and most likely China too"
    },
    {
        "subreddit": "politics",
        "sentence": "They will greatly benefit from a destroyed US"
    },
    {
        "subreddit": "politics",
        "sentence": "Assassinations and arrests aplenty.\n\nRemember, the Secret Service was doing shady shit during Jan 6, Pence was scared to go with them"
    },
    {
        "subreddit": "politics",
        "sentence": "They deleted a bunch of emails and texts"
    },
    {
        "subreddit": "politics",
        "sentence": "A bunch of them are supportive of him, and will help him kill his rivals"
    },
    {
        "subreddit": "politics",
        "sentence": "Think of the corrupt Praetorian guards of Rome.\n\nIf he wins it will get bad"
    },
    {
        "subreddit": "politics",
        "sentence": "So, if you do not have one, buy a gun, and learn how to use it"
    },
    {
        "subreddit": "politics",
        "sentence": "So when they come for you, you can at least try to protect yourself and your family."
    },
    {
        "subreddit": "politics",
        "sentence": "Aw, you still believe our electorate isn't filled with mouth-breathing rocks."
    },
    {
        "subreddit": "politics",
        "sentence": "Fingers crossed 🤞🏼"
    },
    {
        "subreddit": "politics",
        "sentence": "Just theorizing because I'm not an expert but is this maybe a jurisdiction issue? I could see the Colorado bar only ruling on infractions in Colorado."
    },
    {
        "subreddit": "politics",
        "sentence": "How? Just saying it doesn’t make it so"
    },
    {
        "subreddit": "politics",
        "sentence": "This submission source is likely to have a soft paywall"
    },
    {
        "subreddit": "politics",
        "sentence": "If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\""
    },
    {
        "subreddit": "politics",
        "sentence": "[More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "As a reminder, this subreddit [is for civil discussion.](/r/politics/wiki/index#wiki_be_civil)\n\nIn general, be courteous to others"
    },
    {
        "subreddit": "politics",
        "sentence": "Debate/discuss/argue the merits of ideas, don't attack people"
    },
    {
        "subreddit": "politics",
        "sentence": "Personal insults, shill or troll accusations, hate speech, any suggestion or support of harm, violence, or death, and other rule violations can result in a permanent ban"
    },
    {
        "subreddit": "politics",
        "sentence": "If you see comments in violation of our rules, please report them.\n\n For those who have questions regarding any media outlets being posted on this subreddit, please click [here](https://www.reddit.com/r/politics/wiki/approveddomainslist) to review our details as to our approved domains list and outlet criteria.\n \n We are actively looking for new moderators"
    },
    {
        "subreddit": "politics",
        "sentence": "If you have any interest in helping to make this subreddit a place for quality discussion, please fill out [this form](https://docs.google.com/forms/d/1y2swHD0KXFhStGFjW6k54r9iuMjzcFqDIVwuvdLBjSA).\n \n\n***\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    },
    {
        "subreddit": "politics",
        "sentence": "No they were slave owners who wanted to keep their slaves"
    },
    {
        "subreddit": "politics",
        "sentence": "They created the k k to keep the freed slaves in line"
    },
    {
        "subreddit": "politics",
        "sentence": "If you believe mainstream media and them claiming who the kkk endorses then I really pity you"
    },
    {
        "subreddit": "politics",
        "sentence": "When the ICC warrants were released, Republican Senators decided to score some points during a hearing by asking Anthony Blinkin, Joe Biden's Secretary of State, whether he would enforce sanctions if Congress passed them"
    },
    {
        "subreddit": "politics",
        "sentence": "And Blinkin gave a milquetoast \"I will make every effort to work with lawmakers in whatever course of action they choose.\"  \n  \nThis got reported as \"Biden administration supports sanctioning the ICC.\"  \n  \nThe 20s are fun"
    },
    {
        "subreddit": "politics",
        "sentence": "Right?"
    },
    {
        "subreddit": "politics",
        "sentence": "That sounds like rectal cancer with extra steps."
    },
    {
        "subreddit": "politics",
        "sentence": "How about the bidet treatment?  It would be like water boarding."
    },
    {
        "subreddit": "politics",
        "sentence": "In Colorado, suspension requires a petition and reinstatement investigation and hearing"
    },
    {
        "subreddit": "politics",
        "sentence": "That has to be signed off on by the Office of Attorney Regulation Counsel, the hearing judge/board, and can be appealed to the SCoCO"
    },
    {
        "subreddit": "politics",
        "sentence": "There’s no formal process beyond that"
    },
    {
        "subreddit": "politics",
        "sentence": "But the Office of Attorney Regulation Counsel will be setting up a kind of probation outline"
    },
    {
        "subreddit": "politics",
        "sentence": "And the standard is that the petitioner has to *prove* with “clear and convincing evidence” that they’ve rehabilitated and made restitution for their misconduct, including meeting their probationary requirements"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s a fairly high bar and I know of several lawyers who failed their first petition"
    },
    {
        "subreddit": "politics",
        "sentence": "You can only file the petition every 2 years"
    },
    {
        "subreddit": "politics",
        "sentence": "Should suspension continue for more than five years"
    },
    {
        "subreddit": "politics",
        "sentence": "Then she’d be required to retake and pass the bar exam before being able to file petitions"
    },
    {
        "subreddit": "politics",
        "sentence": "So if she fails on her first petition, she’d automatically fall to 5 years and have to do the full bar approval process before being able to file subsequent petitions"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s definitely not automatic even if she wins her 3 year petition, and she’ll have a ton more hoops to jump, if she doesn’t win her first petition."
    },
    {
        "subreddit": "politics",
        "sentence": "He said it in a 2016’commencement speech as well."
    },
    {
        "subreddit": "politics",
        "sentence": "If you want to read the details, [CREW's complaint to the FEC last May](https://www.citizensforethics.org/wp-content/uploads/2023/05/WalkerComplaint-FINAL.pdf) is extremely detailed"
    },
    {
        "subreddit": "politics",
        "sentence": "There might be some bizzaro loophole about how that money could be legitimately parked with HR Talent until it was transferred to the campaign to pay back loans by the candidate (thanks, Ted Cruz !) after the election"
    },
    {
        "subreddit": "politics",
        "sentence": "But it looks more like a simple way to steal the money from that donor, George Santos style.\n\nTo my knowledge, though, there hasn't been a peep from the FEC about it in a year."
    },
    {
        "subreddit": "politics",
        "sentence": "No I do but I don't think doxxing is allowed."
    },
    {
        "subreddit": "politics",
        "sentence": "People who are letting Trump win, or worse, voting for him, over Biden's handling of Gaza are like pacificists who let their friends be murdered over defending them just to remain \"pure\""
    },
    {
        "subreddit": "politics",
        "sentence": "There's no respecting these people."
    },
    {
        "subreddit": "politics",
        "sentence": "Can we impeach her?"
    },
    {
        "subreddit": "politics",
        "sentence": "I remember that and respected him for that"
    },
    {
        "subreddit": "politics",
        "sentence": "While I didn’t agree with most of his politics, I watched his funeral and shed some tears for a true patriot."
    },
    {
        "subreddit": "politics",
        "sentence": "I’m not the opposition, if that was in any way unclear."
    },
    {
        "subreddit": "politics",
        "sentence": "Republicans support black death, brown death...most colors really"
    },
    {
        "subreddit": "politics",
        "sentence": "The civil war wasn’t  a conspiracy mutherfucker"
    },
    {
        "subreddit": "politics",
        "sentence": "I could say something snarky but it’s late and I’m tired"
    },
    {
        "subreddit": "politics",
        "sentence": "Robert F"
    },
    {
        "subreddit": "politics",
        "sentence": "Kennedy Jr"
    },
    {
        "subreddit": "politics",
        "sentence": "is mental and needs to STFU."
    },
    {
        "subreddit": "politics",
        "sentence": "If you felt this way you would be supporting progressive democrats as they can push actual change."
    },
    {
        "subreddit": "politics",
        "sentence": "Shit headline"
    },
    {
        "subreddit": "politics",
        "sentence": "It should read “Dems change procedure to deal with the petty crybaby republicans in Ohio.”"
    },
    {
        "subreddit": "politics",
        "sentence": "This is an acceptable answer."
    },
    {
        "subreddit": "politics",
        "sentence": "My spelling used to be so good then autocorrect showed up"
    },
    {
        "subreddit": "politics",
        "sentence": "Also as I get older I noticed more mistakes."
    },
    {
        "subreddit": "politics",
        "sentence": "Not even being facetious here - the way I've heard people comment on here, I actually thought that Biden was supporting sanctions on the ICC"
    },
    {
        "subreddit": "politics",
        "sentence": "Glad to hear that it isn't the case."
    },
    {
        "subreddit": "politics",
        "sentence": "So if MAGA \"mocks\" DeNerio it's a story? \n\nI can rifle through the internets and find people attacking newborn puppies.."
    },
    {
        "subreddit": "politics",
        "sentence": "Doesn't make it true or a legitimate source of news.\n\nBut when it is hard to report on I guess Fox just deferes to the soft brained mouth breathers on Truth Social."
    },
    {
        "subreddit": "politics",
        "sentence": ">So now when Smith goes to the appellate court\n\nThere have been multiple actions by Cannon that have elicited similar responses but I have seen no indication that Smith is doing any such thing"
    },
    {
        "subreddit": "politics",
        "sentence": "The safe bet is Smith will do nothing, Cannon will make another biased action, comments will say \"ah but now Smith has enough to go to the appellate court\", Smith takes no action, and then we repeat the cycle."
    },
    {
        "subreddit": "politics",
        "sentence": "Makes perfect sense! Hamas stores weapons out in the open near refugee shelters made of sheets and cardboard where they can be struck, not in their maze of tunnels! /s"
    },
    {
        "subreddit": "politics",
        "sentence": "Kill the heretics, fail to kill all the heretics."
    },
    {
        "subreddit": "politics",
        "sentence": "From what I'm reading here, Judge has basically made it a requirement to let defense drag their feet, per the part of the order mandating prosecution give the opposing party \"meaningful time to consider\"."
    },
    {
        "subreddit": "politics",
        "sentence": "No no no, it's ***y'all*** lives matter"
    },
    {
        "subreddit": "politics",
        "sentence": "https://youtu.be/E-TZtrJjW54?si=VRt3TpQ1Ls_K0bVu"
    },
    {
        "subreddit": "politics",
        "sentence": "I don't know about Colorado but some states require the ex-lawyer to apply for re-instatement if the suspension is longer than X number of months."
    },
    {
        "subreddit": "politics",
        "sentence": "Whether it is literal nukes or not, Trump has advocated for genocide.\n Biden is trying to navigate a thin line between competing constituents within his party and he may be failing but he is a far cry from Trump who wouldn’t mind and possibly encourages the slaughter of all Palestinians."
    },
    {
        "subreddit": "politics",
        "sentence": "> “Everything that has come out since has not proven that claim.”\n\nhow is the CO State Bar accepting this?  \"Everything that has come out since has further proven that I was engaged in a criminal conspiracy to overturn the election through false allegations of fraud.\"  That's what she should have said."
    },
    {
        "subreddit": "politics",
        "sentence": "The issue is when people who should be straight ticket D voters get left behind by the dem party for 40 years they become willing to listen to anyone who will promise them a better tomorrow"
    },
    {
        "subreddit": "politics",
        "sentence": "People can be stupid, but we can’t fault people for choosing to believe in something they think will improve their lives"
    },
    {
        "subreddit": "politics",
        "sentence": "That’s the wrong take away imo."
    },
    {
        "subreddit": "politics",
        "sentence": "Can we switch the national anthem from that stupid war song to Willie Guthrie please ?"
    },
    {
        "subreddit": "politics",
        "sentence": "oh no, i bet they stop supporting his content /s"
    },
    {
        "subreddit": "politics",
        "sentence": "Once you've had your license suspended for 3 years you're fucked"
    },
    {
        "subreddit": "politics",
        "sentence": "She won't be able to find real work anywhere"
    },
    {
        "subreddit": "politics",
        "sentence": "Stalin once asked: how many divisions does the Pope have?"
    },
    {
        "subreddit": "politics",
        "sentence": "The scariest thing Trump has done is shown just how many dumb and gullible people there are in this world."
    },
    {
        "subreddit": "politics",
        "sentence": "Jim Jones started as civil rights activist"
    },
    {
        "subreddit": "politics",
        "sentence": "It should be known"
    },
    {
        "subreddit": "politics",
        "sentence": "If only there was a much easier way to move life saving supplies like maybe roads or something"
    },
    {
        "subreddit": "politics",
        "sentence": "They must cost way more than $320 mil because otherwise we could just use them right /s"
    },
    {
        "subreddit": "politics",
        "sentence": "These independents/swing voters are bizarre people"
    },
    {
        "subreddit": "politics",
        "sentence": "I get that they existed years ago when GOP appeared more sane, but how on earth anyone considered reasonable can ponder at this point whether to choose Biden or Trump? It should be pretty straight forward choice if you aren’t full on MAGA or you have more than two brain cells, even if you aren’t specifically a fan of democrats or Biden."
    },
    {
        "subreddit": "politics",
        "sentence": "When you do something again, you can add the \"re\" as a prefix, as in \"redo\".\n\nFor that Trump flag, I suggest this change:\n\n\"Make America ReGret\""
    },
    {
        "subreddit": "politics",
        "sentence": "The people of Rifle, CO are fucked if she loses"
    },
    {
        "subreddit": "politics",
        "sentence": "Last thing they need is another unemployed boebert walking around causing mayhem."
    },
    {
        "subreddit": "politics",
        "sentence": "the son of a rich white billionaire ?"
    },
    {
        "subreddit": "politics",
        "sentence": "But you didn't say what that is"
    },
    {
        "subreddit": "politics",
        "sentence": "When someone is launching rockets at your civilians and then hiding behind civilians themselves, what is a proportionate and measured response?"
    },
    {
        "subreddit": "politics",
        "sentence": "“Always have an exit strategy” is my favorite line the whole show, so fucking funny"
    },
    {
        "subreddit": "politics",
        "sentence": "I think he may have been talking about Ashcroft, but who knows"
    },
    {
        "subreddit": "politics",
        "sentence": "I mean, Ashcroft was pretty dead, even when he was alive."
    },
    {
        "subreddit": "politics",
        "sentence": "I'm one of them"
    },
    {
        "subreddit": "politics",
        "sentence": "Woke up to the sirens around 6 AM this morning"
    },
    {
        "subreddit": "politics",
        "sentence": "Some time before 6:30 we lost power"
    },
    {
        "subreddit": "politics",
        "sentence": "It's now half past midnight and we still don't have power back and I'm worried about the food in my fridge."
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah that was fuckin dumb as hell"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s cause the popular vote would get us what we want, but we’re gerrymandered to the hilt"
    },
    {
        "subreddit": "politics",
        "sentence": "We've had storms where the anemometer breaks at 120+ off the coast and nobody loses power"
    },
    {
        "subreddit": "politics",
        "sentence": "30 miles inland itb still peaked over 100"
    },
    {
        "subreddit": "politics",
        "sentence": "I'm not saying severity of the weather isn't a factor, I'm saying the dispersion and decentralization everywhere else in America makes a huge difference."
    },
    {
        "subreddit": "politics",
        "sentence": "She has to win the primary first."
    },
    {
        "subreddit": "politics",
        "sentence": "Raises the question"
    },
    {
        "subreddit": "politics",
        "sentence": "Begging the question forces the responder into an answer"
    },
    {
        "subreddit": "politics",
        "sentence": "Like so:  \n\nIs this a *good* example of begging the question, or the *best* example?"
    },
    {
        "subreddit": "politics",
        "sentence": "The question to ask, 'Are Biden's poll numbers going to help Senate Democrats?'"
    },
    {
        "subreddit": "politics",
        "sentence": "He built the AK50, he can probably fix the Texas electric grid"
    },
    {
        "subreddit": "politics",
        "sentence": "Yes...let us also praise hitler for his good qualities as well...while we are at it...."
    },
    {
        "subreddit": "politics",
        "sentence": "Yes that is a terrible metric."
    },
    {
        "subreddit": "politics",
        "sentence": "Agree with you."
    },
    {
        "subreddit": "politics",
        "sentence": "Evil"
    },
    {
        "subreddit": "politics",
        "sentence": "why do you think the dem senate is so quiet?"
    },
    {
        "subreddit": "politics",
        "sentence": "Compared to Trump she still is"
    },
    {
        "subreddit": "politics",
        "sentence": "It's just a reflection of how wacky the GOP has become that she is now a moderate."
    },
    {
        "subreddit": "politics",
        "sentence": "It’s not AIPAC it’s that Biden is an intensely pro-Israel politician and has been for 45 years"
    },
    {
        "subreddit": "politics",
        "sentence": "Winding up in a criminal psychiatric ward isn't some free pass you still get treated like a prisoner but have the added bonus of being on a chemical cocktail. \n\n\nSome of those drugs they can put you on effectively makes you sedated or have bad side effects.\n\n\nImagine trump being around all the other funnies on the farm ranting and raving but then again some of his base belongs in those places as well."
    },
    {
        "subreddit": "politics",
        "sentence": "> vote this shit out\n\nYou understand that the problem here is the judge that Trump appointed? No amount of voting right now is going to get the Dems the numbers to impeach a Trump judge"
    },
    {
        "subreddit": "politics",
        "sentence": "The reason Trump is likely to be a felon by the end of the week (from a charge that originated with Mueller) is because people went to the polls and put people in charge that would prosecute him for his election interference (and also his mishandling of covid, in multiple ways)"
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah, we need to go again and keep those people in power so that these cases can continue, but no amount of voting is going to fix the Cannon problem."
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah:\n\n> Juror #2\n\n> Juror #2 is a man who works in investment banking and lives with his wife in New York"
    },
    {
        "subreddit": "politics",
        "sentence": "He said he follows Michael Cohen, Trump's former lawyer and a key witness in the case, on social media, as well as Trump's Truth Social posts"
    },
    {
        "subreddit": "politics",
        "sentence": "He said he pays attention to \"anything that might be able to move the markets I need to know about.\"\n\nMaybe he just follows them for potential impacts on the markets"
    },
    {
        "subreddit": "politics",
        "sentence": "Can’t image a true Trump supporter would follow Cohen."
    },
    {
        "subreddit": "politics",
        "sentence": "For how much is the question..."
    },
    {
        "subreddit": "politics",
        "sentence": "Wow..praising insurrectionists....seems Mr"
    },
    {
        "subreddit": "politics",
        "sentence": "Kennedy is coming out from center and definitely leaning right."
    },
    {
        "subreddit": "politics",
        "sentence": "I would you hot or cold...if your lukewarm I shall spue you out my mouth"
    },
    {
        "subreddit": "politics",
        "sentence": "Lmmmaaoooo"
    },
    {
        "subreddit": "politics",
        "sentence": "How did several dozens of individuals across state lines just so happen to orchestrate very similar plans with parallel claims to very coordinated social media & fringe 'entertainment' claims again?"
    },
    {
        "subreddit": "politics",
        "sentence": "Oh, but remember we need to include the time to wake him up"
    },
    {
        "subreddit": "politics",
        "sentence": "So, unless his hypnic jerk is to violate terms of a contract or something (which it very well may be), he might make it well past the 30 second mark."
    },
    {
        "subreddit": "politics",
        "sentence": "Yeah, Barron is Melania's only child, and she seems determined to keep him away from politics"
    },
    {
        "subreddit": "politics",
        "sentence": "CA is a big state"
    },
    {
        "subreddit": "politics",
        "sentence": "They've probably had witchcraft and a lot of weird things since the 1940s"
    },
    {
        "subreddit": "politics",
        "sentence": "He's very slow to catch on"
    },
    {
        "subreddit": "politics",
        "sentence": "But then, VA gets a lot of its money from government contracts, so a Conservative Republican who is against government should fit right in there.\n\n/s"
    },
    {
        "subreddit": "politics",
        "sentence": "Why?"
    },
    {
        "subreddit": "politics",
        "sentence": "Cool don't care"
    },
    {
        "subreddit": "politics",
        "sentence": "They could name it after Freddie Gray"
    },
    {
        "subreddit": "politics",
        "sentence": "I’m convinced they probably won’t vote for Trump\n\nI’m *not* convinced they’ll vote at all"
    },
    {
        "subreddit": "politics",
        "sentence": "Is she the pants steaming one or the overmedicated conspiracy nut one?"
    },
    {
        "subreddit": "politics",
        "sentence": "Having Trump as a client isn't the professional accomplishment that it may initially appear to be."
    },
    {
        "subreddit": "politics",
        "sentence": "In what way is dehumanising people by calling them cancer justified?"
    },
    {
        "subreddit": "politics",
        "sentence": "His documentary on the Dust Bowl influenced Interstellar."
    },
    {
        "subreddit": "politics",
        "sentence": "Judge Juan Merchan ripped into Donald Trump attorney Todd Blanche over his closing arguments during the former president’s hush-money trial Tuesday.\n\nBlanche told the jurors that Trump could be sent to prison if convicted, drawing the ire of the prosecution, as well as Merchan"
    },
    {
        "subreddit": "politics",
        "sentence": "Prosecutor Joshua Steinglass called Blanche’s comment a “blatant” and “inappropriate move” by the defense, and Merchan concurred.\n\n“I think that comment was outrageous, Mr"
    },
    {
        "subreddit": "politics",
        "sentence": "Blanche"
    },
    {
        "subreddit": "politics",
        "sentence": "You know as someone who has been a prosecutor that it’s simply not allowed, period"
    },
    {
        "subreddit": "politics",
        "sentence": "It’s hard to see how that was an accident,” Merchan said, once the jurors had been dismissed for lunch"
    },
    {
        "subreddit": "politics",
        "sentence": "Upon Steinglass’s request, Merchan agreed to give a curative instruction to the jury when they returned."
    },
    {
        "subreddit": "politics",
        "sentence": "At that price, I would had expected the pier to be built with self-repairing nanobots, not just a few platforms that can't even handle a storm."
    },
    {
        "subreddit": "politics",
        "sentence": "This submission source is likely to have a soft paywall"
    },
    {
        "subreddit": "politics",
        "sentence": "If this article is not behind a paywall please report this for “breaks r/politics rules -> custom -> \"incorrect flair\"\""
    },
    {
        "subreddit": "politics",
        "sentence": "[More information can be found here](https://www.reddit.com/r/politics/wiki/index/#wiki_paywalls)\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "politics",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/politics) if you have any questions or concerns.*"
    }
]