[
    {
        "subreddit": "science",
        "sentence": "I believe you can get some papers that are certified home-compostable"
    },
    {
        "subreddit": "science",
        "sentence": "These are typically string and tag tea bags, the advantage of string and tag being that the bag itself is generally folded rather than heat-sealed, so it needs far less plastic"
    },
    {
        "subreddit": "science",
        "sentence": "It can then slip through the home-compostable standards (albeit these standards are changing), but it will still have a small amount that doesn’t fully disappear.\n\nNot sure which country you’re in, but in the UK at least some homes presently have a food collection bin, which PLA teabags should go in or they can be put in a garden waste bin"
    },
    {
        "subreddit": "science",
        "sentence": "By 2026, all homes in England are expected to have a food waste collection, which is a good thing."
    },
    {
        "subreddit": "science",
        "sentence": "This is so dumb I can’t even get myself to write a rage post"
    },
    {
        "subreddit": "science",
        "sentence": "Thanks for that discussion"
    },
    {
        "subreddit": "science",
        "sentence": "I, like many people I think, can’t put used teabags into the recycling stream"
    },
    {
        "subreddit": "science",
        "sentence": "So I can either throw them into the trash, which is landfilled, or try to compost them with my coffee grounds and coffee filters"
    },
    {
        "subreddit": "science",
        "sentence": "But even PLA does not compost except in industrial composters, which are rare"
    },
    {
        "subreddit": "science",
        "sentence": "The key being temperature"
    },
    {
        "subreddit": "science",
        "sentence": "In the end, as I prefer the flavor of loose-leaf teas, I use a teapot or an in-cup filter"
    },
    {
        "subreddit": "science",
        "sentence": "Both work very well"
    },
    {
        "subreddit": "science",
        "sentence": "And there is far less packaging"
    },
    {
        "subreddit": "science",
        "sentence": "win/win"
    },
    {
        "subreddit": "science",
        "sentence": "My wife gets a variety of tisanes in bags"
    },
    {
        "subreddit": "science",
        "sentence": "Not much we can do there, as these are not available in loose form"
    },
    {
        "subreddit": "science",
        "sentence": "Oh well."
    },
    {
        "subreddit": "science",
        "sentence": "Take my non-existing award"
    },
    {
        "subreddit": "science",
        "sentence": "Yep if you are in severe pain there's no solution at all anymore"
    },
    {
        "subreddit": "science",
        "sentence": "I also feel like this was already known"
    },
    {
        "subreddit": "science",
        "sentence": "Ah yeah; sorry, I’d assume because you’d replied that you were OP, but you’re not - my bad"
    },
    {
        "subreddit": "science",
        "sentence": "For reference, this is the comment I was referring to: https://www.reddit.com/r/science/s/K3zL7ewD0k"
    },
    {
        "subreddit": "science",
        "sentence": "Definitely not"
    },
    {
        "subreddit": "science",
        "sentence": "Modern 120mm anti-tank rounds generate 10x that and still can't punch through certain types of armor."
    },
    {
        "subreddit": "science",
        "sentence": "Plastic in teabag paper has two main purposes; number one is to allow for two sheets of the paper to be heat-sealed together and form the teabag"
    },
    {
        "subreddit": "science",
        "sentence": "The second purpose is to provide wet tensile strength - without the plastic content, a 100% paper bag would fall apart when added to water"
    },
    {
        "subreddit": "science",
        "sentence": "The plastic was typically PP, it’d been used for decades and pretty much all machines in the UK had been developed to run with it - it was consistent and reliable, but oil-derived and thus non-renewable and had no suitable waste stream other than landfill"
    },
    {
        "subreddit": "science",
        "sentence": "After public concern, the industry identified and began developing PLA paper as the alternative to PP"
    },
    {
        "subreddit": "science",
        "sentence": "it had the advantage of being from a renewable source and could be industrially composted (essentially it needs certain temperature and moisture levels to degrade)"
    },
    {
        "subreddit": "science",
        "sentence": "The issue was that PLA paper was horribly inconsistent at the start, essentially being new to everyone - the paper manufacturers and the teabag manufacturers"
    },
    {
        "subreddit": "science",
        "sentence": "It took a lot of time and money to get it to where it is now, most companies have it running relatively well, but it will likely never run as well as PP, so it’s added cost in terms of the paper itself and in inefficiency, both of which the consumer is now carrying"
    },
    {
        "subreddit": "science",
        "sentence": "I’m not aware of any credible alternative to PLA paper being worked on at present - the major hurdle is requiring it to be thermo-sealed, so it essentially has to have some form of plastic, being that an oil-derived one or a bio-plastic like PLA."
    },
    {
        "subreddit": "science",
        "sentence": "A tank of what? Or, which tank?   \n  \nThere is so little thought behind these questions."
    },
    {
        "subreddit": "science",
        "sentence": "Its similar"
    },
    {
        "subreddit": "science",
        "sentence": "The problem is leafy greens aren’t cooked often and if they have bacteria films on their exterior washing does nothing so people get sick"
    },
    {
        "subreddit": "science",
        "sentence": "Washing does help though it just doesn’t prevent the problem entirely."
    },
    {
        "subreddit": "science",
        "sentence": "It is true that there are similarities in the psychosocial aspects of military and civilian life and workplaces, at least as far as frustration with limited value co-workers dragging the day down like a lazy contestant on 'Survivor' goes.\n\nPetty grievances are substantially less tolerable when real grieving is in process"
    },
    {
        "subreddit": "science",
        "sentence": "Along with every stinko play of the day that civilians try to deal with, most Veterans are in separation pain; with retirement like drift and stall, trying not to flat spin over the aloneness that is typically compounded by relocating"
    },
    {
        "subreddit": "science",
        "sentence": "Separation tends to manifest as pain in our human physiology and psyche"
    },
    {
        "subreddit": "science",
        "sentence": "Suddenly we\"re lonely in a crowd, with a blurry topology developing onto a picture that just doesn't look right"
    },
    {
        "subreddit": "science",
        "sentence": "The day becomes difficult to reconcile, especially when you aren't the average bear just showing up for a paycheck but living for a reasonable expectation of fulfillment by engagement and dedication.."
    },
    {
        "subreddit": "science",
        "sentence": "teamwork,  collaboration"
    },
    {
        "subreddit": "science",
        "sentence": "Things that are already difficult are more difficult while enduring separation"
    },
    {
        "subreddit": "science",
        "sentence": "Having observed them on return to our town from an early age, I believe the intensity dial is jigged for Veterans, who seem to experience this at a molecular level, in waves, like we feel our exhaustion at end of day.."
    },
    {
        "subreddit": "science",
        "sentence": "but with more tuning and detuning as they endure that lengthy decompression from Service"
    },
    {
        "subreddit": "science",
        "sentence": "There are injuries of separation to contend with, that like any considerable injury require at least a decade of hard work to bring to a point of resolution"
    },
    {
        "subreddit": "science",
        "sentence": "The least the rest of us can do is a little less whining in favor of a little cognizance of the bigger picture."
    },
    {
        "subreddit": "science",
        "sentence": "> allergies are going to become more common with climate change.\n\nHayfever intensity due to pollen, right? Like 10% by 2100"
    },
    {
        "subreddit": "science",
        "sentence": "Is a chicken smart to the worm?"
    },
    {
        "subreddit": "science",
        "sentence": "Have they actually done anything about it though? Or has the FDA just sat on their hands and pretended not to notice the millions of dollars worth of damages."
    },
    {
        "subreddit": "science",
        "sentence": "I mean muscle can take hits, so unless you hit their, apparently very small, brains then they'd probably keep trucking."
    },
    {
        "subreddit": "science",
        "sentence": "But can they bite through a tank"
    },
    {
        "subreddit": "science",
        "sentence": "For some reason that's where my brain is going"
    },
    {
        "subreddit": "science",
        "sentence": "Class isn't a thing"
    },
    {
        "subreddit": "science",
        "sentence": "Ranked phylogenies lead to insane conclusions with no effort at all"
    },
    {
        "subreddit": "science",
        "sentence": "You could make dinosaurs a kingdom and you'd run out of terms well before you got to _Gallus gallus_, beyond the the problems of implying equivalences where there aren't necessarily any"
    },
    {
        "subreddit": "science",
        "sentence": "Lizards are _lepidosauria_"
    },
    {
        "subreddit": "science",
        "sentence": "Reptile is roughly synonymous with _diapsida_, more or less the MRCA of _Gallus gallus_ and _Geochelone sulcata_ and all its descendants"
    },
    {
        "subreddit": "science",
        "sentence": "Extant  _lepidosauria_ would be the MRCA of _Iguana iguana_ and _Tuatara tuatara_ and all its descendants."
    },
    {
        "subreddit": "science",
        "sentence": "You know that it’s very hard for the people in actual severe pain to get them now right?"
    },
    {
        "subreddit": "science",
        "sentence": "Ha! I always know Sauna cant be trusted"
    },
    {
        "subreddit": "science",
        "sentence": "I'm sure the whole league makes a lot of money because Messi joined"
    },
    {
        "subreddit": "science",
        "sentence": "He's been pretty dominant"
    },
    {
        "subreddit": "science",
        "sentence": "If he stays healthy, he'll break records"
    },
    {
        "subreddit": "science",
        "sentence": "Attendance is up where he is playingany given match"
    },
    {
        "subreddit": "science",
        "sentence": "The team I support was in good shape attendance- wise"
    },
    {
        "subreddit": "science",
        "sentence": "It doesn't seem like there's a Messi bump"
    },
    {
        "subreddit": "science",
        "sentence": "But I have seen some kids in his kit"
    },
    {
        "subreddit": "science",
        "sentence": "A lot of folks root for greatness, especially in a league they don't follow"
    },
    {
        "subreddit": "science",
        "sentence": "That's fine"
    },
    {
        "subreddit": "science",
        "sentence": "And as much as I am amazed by athletic genius, I'd rather watch a competitive match"
    },
    {
        "subreddit": "science",
        "sentence": "It's certainly possible that the influx of money will translate to salary rules that are more competitive internationally and a stronger post-Messi MLS"
    },
    {
        "subreddit": "science",
        "sentence": "I hope so."
    },
    {
        "subreddit": "science",
        "sentence": "Remember the old saying:\n\n\"What do you call the person who graduated at the bottom of their class in med school?\"\n\n\"Doctor.\""
    },
    {
        "subreddit": "science",
        "sentence": "I think you have me confused with someone else"
    },
    {
        "subreddit": "science",
        "sentence": "You also said ‘much prefer paper teabags’."
    },
    {
        "subreddit": "science",
        "sentence": "So are birds."
    },
    {
        "subreddit": "science",
        "sentence": "It's actually made by the same factory, just repackaged/rebranded as their company's version."
    },
    {
        "subreddit": "science",
        "sentence": "Those are very encouraging numbers"
    },
    {
        "subreddit": "science",
        "sentence": "If only US medical companies can use data this instead of paying medical professionals to prescribe opiate products to increase their profits…"
    },
    {
        "subreddit": "science",
        "sentence": "“Behaved more like crocodiles”\n\nThe crocodiles in northern Queensland are smart enough to sneak up a river bank and ambush cattle from the dry land"
    },
    {
        "subreddit": "science",
        "sentence": "The cow either gets chomped on land and dragged into the water, or, runs into the water, and gets chomped in the water"
    },
    {
        "subreddit": "science",
        "sentence": "I wouldn’t say they’re overly dumb."
    },
    {
        "subreddit": "science",
        "sentence": "Me too.\n\n  \nPeople do lie to obtain advantages.\n\nRobot/Machines just aswer as they are programmed .."
    },
    {
        "subreddit": "science",
        "sentence": "or learn (ChatGPT)"
    },
    {
        "subreddit": "science",
        "sentence": "They have no will, so no taking advantage."
    },
    {
        "subreddit": "science",
        "sentence": "Yes, I had severe COVID twice (even though I was really careful, also fully vaccinated, because I knew about post COVID complications)"
    },
    {
        "subreddit": "science",
        "sentence": "I know about the brain fog, but I am also 50+ years old and know that the body starts to transition from young to older (e.g"
    },
    {
        "subreddit": "science",
        "sentence": "immune system becomes less effective).\n\nI will talk about it with my doctor even though the deteriorations are moderate but very noticeable to me"
    },
    {
        "subreddit": "science",
        "sentence": "Just last week I mentioned to my mother who was sitting beside me, that I think my driving has become worse, I find myself not that awake and sharp anymore."
    },
    {
        "subreddit": "science",
        "sentence": "A fellow from my area went to Peru to find himself and do guided trips on ayahuasca"
    },
    {
        "subreddit": "science",
        "sentence": "Developed psychosis, acquired a gun and fatally shot the shaman lady"
    },
    {
        "subreddit": "science",
        "sentence": "The villagers dragged him alive through the village before beating him to death.\n\nSo yeah, a hard no to that crap."
    },
    {
        "subreddit": "science",
        "sentence": "This is probably properly positioned in ACS central science"
    },
    {
        "subreddit": "science",
        "sentence": "It is roughly two tiers below anything that might reasonably be considered general interest outside of the chemistry community"
    },
    {
        "subreddit": "science",
        "sentence": "There are literally hundreds of papers doing transformations of similar scope and potential impact every week"
    },
    {
        "subreddit": "science",
        "sentence": "This work is not distinct from the crowd and I have no idea why it is being shared here."
    },
    {
        "subreddit": "science",
        "sentence": "Arvo r/science! Sharing the above study from our National Drug & Alcohol Research Centre researchers that has been published in the British Journal of Clinical Pharmacology: [Long-term prescribed opioid use after hospitalization or emergency department presentation among opioid naïve adults (2014–2020)—A population-based descriptive cohort study](https://bpspubs.onlinelibrary.wiley.com/doi/10.1111/bcp.16093)\n\nThe study investigated opioid initiation and long-term use after emergency department visits or hospitalisations across NSW by patient, admission and clinical characteristics"
    },
    {
        "subreddit": "science",
        "sentence": "The researchers found that from 2014 to 2020, overall opioid initiations decreased from 8.7% to 7.2%, and long-term opioid use decreased from 1.3% to 0.8%.\n\nThe study is the largest of its kind in Australia to date and suggests efforts to reduce opioid use post-hospitalisation have been successful."
    },
    {
        "subreddit": "science",
        "sentence": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science"
    },
    {
        "subreddit": "science",
        "sentence": "However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**"
    },
    {
        "subreddit": "science",
        "sentence": "Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise"
    },
    {
        "subreddit": "science",
        "sentence": "[Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/unsw  \nPermalink: https://www.unsw.edu.au/newsroom/news/2024/05/long-term-prescription-opioid-use-after-hospital-declining--stud?utm_source=reddit&utm_medium=social\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "So they stood still for extended periods of time like a statue and suddenly moved when they saw a prey?"
    },
    {
        "subreddit": "science",
        "sentence": "I really hate this argument, because the intended top speed changes based on when you refuel and burn fuel"
    },
    {
        "subreddit": "science",
        "sentence": "Fusion drives with a plasma thrust would achieve much higher thrust"
    },
    {
        "subreddit": "science",
        "sentence": "The only thing missing on the science is a good cooling system (gigawatt range ideal)"
    },
    {
        "subreddit": "science",
        "sentence": "If we just kept running ion drives we would have a much much higher top speed, and there are thousands of ion drives in space"
    },
    {
        "subreddit": "science",
        "sentence": "Please math."
    },
    {
        "subreddit": "science",
        "sentence": "There's problems beyond monetary"
    },
    {
        "subreddit": "science",
        "sentence": "Once I started becoming financially secure, I could start working on my deeper and more permanent issues"
    },
    {
        "subreddit": "science",
        "sentence": "I think it happened to me with salmon"
    },
    {
        "subreddit": "science",
        "sentence": "Doesn’t matter if it’s sushi or grilled to perfection"
    },
    {
        "subreddit": "science",
        "sentence": "I end up feeling nauseous or projectile vomiting"
    },
    {
        "subreddit": "science",
        "sentence": "I used to eat sushi damn near every day back in 2017."
    },
    {
        "subreddit": "science",
        "sentence": "Holy moly"
    },
    {
        "subreddit": "science",
        "sentence": "Sounds like more effort than preparing for surgery ..."
    },
    {
        "subreddit": "science",
        "sentence": "Even orgasm can be perceived as painful/negative/irritable if irritability level is extreamly high due to mental illness"
    },
    {
        "subreddit": "science",
        "sentence": "Same sensory expierience and totally different interpretation of it by the mind/brain."
    },
    {
        "subreddit": "science",
        "sentence": "I’m similar age but am not noticing major decline, even though obviously no one is getting younger"
    },
    {
        "subreddit": "science",
        "sentence": "I think only your doctor can diagnose correctly"
    },
    {
        "subreddit": "science",
        "sentence": "But I’m wondering if you had covid (several colleagues mentioned they feel like “brain fog” haven’t quite gone away) or if you are under unusual stress? I lost my dad last year and it took great toll on my mental state"
    },
    {
        "subreddit": "science",
        "sentence": "But I’m feeling better now"
    },
    {
        "subreddit": "science",
        "sentence": "Please talk to your doctor and take care of yourself."
    },
    {
        "subreddit": "science",
        "sentence": "Under my pediatrician’s supervision I added a powder additive to my kids formula bottle at around that age"
    },
    {
        "subreddit": "science",
        "sentence": "It contained peanut, shellfish, eggs, and other common food allergens"
    },
    {
        "subreddit": "science",
        "sentence": "I took this step because I wanted to avoid food allergies"
    },
    {
        "subreddit": "science",
        "sentence": "Because they run in my husband’s family"
    },
    {
        "subreddit": "science",
        "sentence": "So far 4 years later we haven’t had a problem"
    },
    {
        "subreddit": "science",
        "sentence": "He eats everything without issue."
    },
    {
        "subreddit": "science",
        "sentence": "As a T.rex, I am offended at these allegations and will be pursuing legal recourse unless these defamatory statements are retracted."
    },
    {
        "subreddit": "science",
        "sentence": "Every time I have psychosis I just go in the sauna and boom, I have psychosis in the sauna!!"
    },
    {
        "subreddit": "science",
        "sentence": "Brain size does not always correlate directly with intelligence"
    },
    {
        "subreddit": "science",
        "sentence": "While there is some relationship between brain size and cognitive abilities, it is not a straightforward or universal rule"
    },
    {
        "subreddit": "science",
        "sentence": "Here are a few key points to consider:\n\n1"
    },
    {
        "subreddit": "science",
        "sentence": "Brain-to-Body Ratio (Encephalization Quotient - EQ): This ratio considers brain size relative to body size"
    },
    {
        "subreddit": "science",
        "sentence": "Species with higher EQs, like humans, dolphins, and some primates, tend to exhibit higher cognitive abilities"
    },
    {
        "subreddit": "science",
        "sentence": "However, this is not the sole determinant of intelligence.\n\n\n2"
    },
    {
        "subreddit": "science",
        "sentence": "Neuronal Density and Brain Structure: The number of neurons and their organization are crucial"
    },
    {
        "subreddit": "science",
        "sentence": "For example, birds like crows and parrots have relatively small brains but high neuron densities, allowing them to perform complex tasks and exhibit behaviors indicative of high intelligence.\n\n\n3"
    },
    {
        "subreddit": "science",
        "sentence": "Brain Regions: The development of specific brain regions is more critical than overall brain size"
    },
    {
        "subreddit": "science",
        "sentence": "In humans, the prefrontal cortex, which is involved in decision-making, planning, and social behavior, is highly developed compared to other animals.\n\n\n4"
    },
    {
        "subreddit": "science",
        "sentence": "Functional Adaptations: Different species have evolved brain structures suited to their ecological needs"
    },
    {
        "subreddit": "science",
        "sentence": "For example, some animals have highly developed sensory or motor areas in the brain to aid in survival rather than generalized intelligence.\n\n\n5"
    },
    {
        "subreddit": "science",
        "sentence": "Human Intelligence: Humans have relatively large brains compared to body size, but more importantly, they have highly developed cerebral cortices that support advanced cognitive functions.\n\n\nIn summary, while there is some correlation between brain size and intelligence, it is not a definitive measure"
    },
    {
        "subreddit": "science",
        "sentence": "Factors such as neuronal density, brain structure, and the development of specific brain regions play significant roles in determining an animal's cognitive abilities."
    },
    {
        "subreddit": "science",
        "sentence": "What’s ‘pragmatic’ about letting Trump get away with crimes because he squatted in the WH?!"
    },
    {
        "subreddit": "science",
        "sentence": "Hopefully they're getting smaller because that's efficiency going up"
    },
    {
        "subreddit": "science",
        "sentence": "They are not.\nThey have no idea what’s actually happening"
    },
    {
        "subreddit": "science",
        "sentence": "They pop their foil hats on and pump trumpisms in to their ears and regurgitate what they’re fed."
    },
    {
        "subreddit": "science",
        "sentence": "Know.\nWe know they’re an existential threat."
    },
    {
        "subreddit": "science",
        "sentence": "Because they *are* an existential threat.\n\nSee: disbanding Congress and using the military to take control of the government."
    },
    {
        "subreddit": "science",
        "sentence": "> would maybe duplicate a bomb inside your skull going off.\n\nNot really, it's just going to fracture the tooth where there's some defect or damage for the crack to initiate"
    },
    {
        "subreddit": "science",
        "sentence": "It wouldn't be anything like a bomb going off."
    },
    {
        "subreddit": "science",
        "sentence": "You can't really talk about just force in that scenario"
    },
    {
        "subreddit": "science",
        "sentence": "In material failure you generally talk about pressure (force/area) not just force.\n\nIt's the difference between getting punched and getting stabbed"
    },
    {
        "subreddit": "science",
        "sentence": "The force is pretty similar, but the area the force is distributed over is substantially smaller with the knife.\n\n35kN is about the same amount of force a big American pickup truck has due to gravity"
    },
    {
        "subreddit": "science",
        "sentence": "Armour isn't going to do you much good regardless of if the material fails or not"
    },
    {
        "subreddit": "science",
        "sentence": "But no, any sort of man portable armour is going to get punched through."
    },
    {
        "subreddit": "science",
        "sentence": "We've underestimated the intelligence of birds."
    },
    {
        "subreddit": "science",
        "sentence": "Why wasn’t natural immunity part of the covid discussion?"
    },
    {
        "subreddit": "science",
        "sentence": "You would have been crucified for calling out the data like this just four years ago"
    },
    {
        "subreddit": "science",
        "sentence": "We started feeding our kid a 50/50 peanut butter/yogurt mix around four months"
    },
    {
        "subreddit": "science",
        "sentence": "He had started to reach for and show an interest in solid food"
    },
    {
        "subreddit": "science",
        "sentence": "Pediatrician said, see how he takes it"
    },
    {
        "subreddit": "science",
        "sentence": "He liked it, so we continued"
    },
    {
        "subreddit": "science",
        "sentence": "Still continued with breast milk as the primary, added avocado, broccoli, green beans, sweet potato, strawberries, blueberries, blackberries (sliced), eggs (omelet), toast with butter or hummus, sliced into thin graspable strips"
    },
    {
        "subreddit": "science",
        "sentence": "We just stay away from sugar and salt, but throw lots of onions and garlic at him"
    },
    {
        "subreddit": "science",
        "sentence": "Doing great at nine months"
    },
    {
        "subreddit": "science",
        "sentence": "Feeds himself for the most part, messily"
    },
    {
        "subreddit": "science",
        "sentence": "So.."
    },
    {
        "subreddit": "science",
        "sentence": "We shouldn't assume they were more like lizards than birds from brain cavity size?"
    },
    {
        "subreddit": "science",
        "sentence": "What was that?"
    },
    {
        "subreddit": "science",
        "sentence": "I can fit anything into a blender."
    },
    {
        "subreddit": "science",
        "sentence": "There really can’t be any medical or social advice based on science for stuff like this because to have real scientifically controlled experiments for this is unethical"
    },
    {
        "subreddit": "science",
        "sentence": "People wouldn’t do controlled tests for a bunch of children where the outcome can determine a health risk like allergies\n\nSo the best they can do is imply causation from correlation"
    },
    {
        "subreddit": "science",
        "sentence": "What if those kids who had peanut exposure earlier were given them *because* their parents noticed no negative effects?\n\nBy the way, I’m inclined to agree with the conclusion that exposure reduces allergy risk, but it’s not really because of a “scientific” basis"
    },
    {
        "subreddit": "science",
        "sentence": "It’s statistical correlation but they don’t do a controlled study nor do they do an experiment on the response mechanisms involved"
    },
    {
        "subreddit": "science",
        "sentence": "It’s basically an accredited strawpoll"
    },
    {
        "subreddit": "science",
        "sentence": "It's implied I meant modern reptiles"
    },
    {
        "subreddit": "science",
        "sentence": "Some birds are very smart"
    },
    {
        "subreddit": "science",
        "sentence": "THANK YOU"
    },
    {
        "subreddit": "science",
        "sentence": "Today i binged reddit all day at work, I think Ive been needing an educational rabbit hole"
    },
    {
        "subreddit": "science",
        "sentence": "I appreciate it."
    },
    {
        "subreddit": "science",
        "sentence": "Soon as self driving vehicles are reliable this won’t be an issue anymore."
    },
    {
        "subreddit": "science",
        "sentence": "I had no idea! Definitely gonna do some reading…"
    },
    {
        "subreddit": "science",
        "sentence": "Drinking + active > drinking + sedentary"
    },
    {
        "subreddit": "science",
        "sentence": "Lead did that too"
    },
    {
        "subreddit": "science",
        "sentence": "Jury’s still out on the exact toxicity of the plastics"
    },
    {
        "subreddit": "science",
        "sentence": "The ubiquity is a given at this point."
    },
    {
        "subreddit": "science",
        "sentence": "My mom’s early life smoking has probably at least affected her late life blood pressure and arthritis, taking years off her physically active life, if hopefully not her mentally active life.\n\nETA: not really sure how that interfaces with having had three babies."
    },
    {
        "subreddit": "science",
        "sentence": "If you'd like to fall down a multi-day rabbit hole on this topic and have an existential crisis about what it means to be you, you should definitely check these topics outs"
    },
    {
        "subreddit": "science",
        "sentence": "Cockroach nervous systems\n\n    Human gastrointestinal microbiomes\n\n    Corpus callosotomy patients"
    },
    {
        "subreddit": "science",
        "sentence": "The part of your nervous system that is deciding how to respond to this comment isn't the part of your nervous system that is actually going to type the response and those parts of your nervous system basically ignore eachother."
    },
    {
        "subreddit": "science",
        "sentence": "17.9 million.."
    },
    {
        "subreddit": "science",
        "sentence": "and 7900 Veterans lost, or 6 and change, depending on who you hear.."
    },
    {
        "subreddit": "science",
        "sentence": "and the saying since 2013 is \" 22 a day\".."
    },
    {
        "subreddit": "science",
        "sentence": "off duty being 4x the mortality of duty death, since 911"
    },
    {
        "subreddit": "science",
        "sentence": "That bell tolls hourly and is no longer going unheard.\nThis is why there is a formal accounting for the public now:  https://www.missionrollcall.org/post/state-of-veteran-suicide\nand\nhttps://dcas.dmdc.osd.mil/dcas/app/summaryData/deaths/byYearManner\nand\nhttps://www.statista.com/statistics/1009819/total-us-military-fatalities-in-american-wars-1775-present/\naaand:\nhttps://watson.brown.edu/costsofwar/costs/human/military"
    },
    {
        "subreddit": "science",
        "sentence": "Are we talking fig newtons?"
    },
    {
        "subreddit": "science",
        "sentence": "Where I am it's explicitly recommended to start before 6 months when they show interest in food"
    },
    {
        "subreddit": "science",
        "sentence": "The paste is simply mixed with puree or oats"
    },
    {
        "subreddit": "science",
        "sentence": "https://www.mayoclinic.org/healthy-lifestyle/infant-and-toddler-health/in-depth/healthy-baby/art-20046200\nMayo also says between 4 and 6 months"
    },
    {
        "subreddit": "science",
        "sentence": "One of the nice things about babies is they have no preconceived notions so if you say the food is yummy, they’ll give it a try"
    },
    {
        "subreddit": "science",
        "sentence": "Then they become toddlers and turn into right assholes about it, but it’s good while it lasts."
    },
    {
        "subreddit": "science",
        "sentence": "Every animal on earth right now is as evolved as each other"
    },
    {
        "subreddit": "science",
        "sentence": "They have just evolved for different purposes"
    },
    {
        "subreddit": "science",
        "sentence": "For most animals, there's no benefit to being smarter than a certain base level needed for survival so evolution doesn't necessarily go down the path of more intelligence."
    },
    {
        "subreddit": "science",
        "sentence": "This may help explain why now peanut allergies are so much more common than they were in the past."
    },
    {
        "subreddit": "science",
        "sentence": "Interesting"
    },
    {
        "subreddit": "science",
        "sentence": "Makes sense"
    },
    {
        "subreddit": "science",
        "sentence": "I remember reading something about brain neurons or whatever being in the intestines, and that being related to mental health"
    },
    {
        "subreddit": "science",
        "sentence": "One thing I wish i could time travel for is to see how far human understanding of the brain goes in the future."
    },
    {
        "subreddit": "science",
        "sentence": "Crocodiles are totally catching strays here\n\nRead this article about how some crocodiles use tools to hunt birds (luring them with sticks)\n\nSource:\n\nhttps://www.alligatorfarm.com/crocodiles-using-tools/#:~:text=28%20Jan%20Crocodiles%20using%20tools%3F&text=Using%20objects%20as%20hunting%20lures,building%20season%20of%20its%20prey."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah ok Big Sauna you ain’t fooling anyone under that trench coat"
    },
    {
        "subreddit": "science",
        "sentence": "intelligence is not about different \"levels\" of \"smart\""
    },
    {
        "subreddit": "science",
        "sentence": "it's about a hyper specialization on a specific mental tasks"
    },
    {
        "subreddit": "science",
        "sentence": "(memorization, pattern recognition, recall, etc)"
    },
    {
        "subreddit": "science",
        "sentence": "Ehhh IDK about that, really"
    },
    {
        "subreddit": "science",
        "sentence": "Honestly, paleontology goes back and forth on this issue every decade or so, and I'm of the opinion that you really *can't* look at brain size"
    },
    {
        "subreddit": "science",
        "sentence": "Look at animals like crows, who have fairly average sized brains, but are incredibly intelligent for their supposed brain-to-body ratio."
    },
    {
        "subreddit": "science",
        "sentence": "These headlines just keep getting better"
    },
    {
        "subreddit": "science",
        "sentence": "Until it is proven wrong again! With absolute certainty!"
    },
    {
        "subreddit": "science",
        "sentence": "Yes, but what about extra-terrestrial species?"
    },
    {
        "subreddit": "science",
        "sentence": "But did they raise their young, like birds? Did they have nests?"
    },
    {
        "subreddit": "science",
        "sentence": "I like my psychosis levels, dislike sauna"
    },
    {
        "subreddit": "science",
        "sentence": "What can you do.."
    },
    {
        "subreddit": "science",
        "sentence": "Very unlikely.\n\nMost of its volcanoes are extremely flat shield volcanoes, in the realm of tholeitic magmas so primitive I don't think we have it on Earth - these would require very hot mantle conditions to produce melt.\n\nEarth has tectonics and thus also the capability to produce calc-alkaline magmas, which begin to produce melt at much lower temperatures.\n\nVenus has volcanism, it's almost 100% certain it is active too"
    },
    {
        "subreddit": "science",
        "sentence": "But Earth is literally alive."
    },
    {
        "subreddit": "science",
        "sentence": "Yep, you’re right"
    },
    {
        "subreddit": "science",
        "sentence": "Should have mentioned fungi too."
    },
    {
        "subreddit": "science",
        "sentence": "No.."
    },
    {
        "subreddit": "science",
        "sentence": "well sort of, but still no"
    },
    {
        "subreddit": "science",
        "sentence": "Suffice to say that the peripheral nervous system has a negligible impact on intelligence"
    },
    {
        "subreddit": "science",
        "sentence": "You have \"brain cells\" spread throughout your body, you even have a \"second brain\" in your abdomen"
    },
    {
        "subreddit": "science",
        "sentence": "We have a lot to learn about intelligence as it pertains to you and me and we have even more to learn about intelligence as it pertains to other living things so the only real answer is that it's complicated.\n\nWe can however be fairly certain that T-Rex wasn't using a second brain any more than you or I because T-Rex has living relatives"
    },
    {
        "subreddit": "science",
        "sentence": "T-Rex was an ancient therapod"
    },
    {
        "subreddit": "science",
        "sentence": "Chickens, turkeys and ostriches are all modern therapods and they don't make use of a distributed nervous system for higher level thought anymore than you or I so it stands to reason that T-Rex wasn't either."
    },
    {
        "subreddit": "science",
        "sentence": "> she has been treating kids for over 30 years\n\nYeah that just means what she learned in med school is outdated, unless she regularly reads up on the latest research."
    },
    {
        "subreddit": "science",
        "sentence": "Sure, and their results are consistent with that"
    },
    {
        "subreddit": "science",
        "sentence": "But any gardener or farmer could have told them that"
    },
    {
        "subreddit": "science",
        "sentence": "I basically did this same experiment for my seventh-grade science project and got these results"
    },
    {
        "subreddit": "science",
        "sentence": "The language of the post and their paper makes it seem like they’re shining light on a dirty secret"
    },
    {
        "subreddit": "science",
        "sentence": "What’s frustrating is that testing teabags and other “compostable” products under actual composting conditions to see how long it takes them to break down would be fascinating research!"
    },
    {
        "subreddit": "science",
        "sentence": "wow dinosaurs!!"
    },
    {
        "subreddit": "science",
        "sentence": "Just want to add this somewhere visible because I DID NOT KNOW THIS until I had to deal with my dad who had dementia and didn't want to quit driving...\n\nIF YOU FEEL THAT SOMEONE SHOULDN'T HAVE A DRIVER'S LICENSE, YOU CAN (somehow, varies by state) REPORT THEM TO YOUR STATE/COUNTY DMV TO FORCE THE PERSON TO BE RE-TESTED BEFORE THEY CAN RENEW THEIR LICENSE"
    },
    {
        "subreddit": "science",
        "sentence": "I know it doesn't get them off the road immediately, but if you have no control over whether or not they drive, this is an option"
    },
    {
        "subreddit": "science",
        "sentence": "Just google your state plus \"report an unsafe driver\""
    },
    {
        "subreddit": "science",
        "sentence": "I can't guarantee all states have this option, but I know for a fact Missouri does."
    },
    {
        "subreddit": "science",
        "sentence": "Robots know more than humans and they dont lie"
    },
    {
        "subreddit": "science",
        "sentence": "They dont have an ego or greed getting in the way of everythingm\n\nIll trust the robot thank you very much."
    },
    {
        "subreddit": "science",
        "sentence": "Perhaps lower neuron density implies lower brain matter density, which could be more efficient for swimming if the brain matter is lighter per cubic unit? I would argue that they retained the same relative level of intelligence from prior to their evolution into marine mammals, but becoming aquatic changed what would make for better biological efficiencies in this area, so their brains expanded but maintained the same amount of matter over a larger space"
    },
    {
        "subreddit": "science",
        "sentence": "But that would just be my assumption based on the information the other person said, not something I've researched."
    },
    {
        "subreddit": "science",
        "sentence": "I feel like the point is that a lot of people think it means that if it goes to the dump or just gets littered on the ground that it will be fine because it's \"biodegradable.\" It's a phrase that can sell more product to people who are just trying to be conscious of the environment."
    },
    {
        "subreddit": "science",
        "sentence": "Smart: NO"
    },
    {
        "subreddit": "science",
        "sentence": "Extremely Fecking Legal: YES"
    },
    {
        "subreddit": "science",
        "sentence": "You seem to be hallucinating about what I'm saying."
    },
    {
        "subreddit": "science",
        "sentence": "OP reports 'greater gratitude and nature appreciation' from attending Ayahuesca retreats"
    },
    {
        "subreddit": "science",
        "sentence": "All I'm saying is that yes, I do get that from mindful time spent in nature, but no, taking psychedelics doesn't do that for me"
    },
    {
        "subreddit": "science",
        "sentence": "Hallucinating is something completely different"
    },
    {
        "subreddit": "science",
        "sentence": "I'm not trying to say that hallucinogens don't have value, simply that in this case, in my experience, the reported outcome has more to do with the time spent in nature than it does to the hallucinogen"
    },
    {
        "subreddit": "science",
        "sentence": "For other people that may be different, but that's how it is for me."
    },
    {
        "subreddit": "science",
        "sentence": "Lizards and Crocs are though, which is what they're being compared to."
    },
    {
        "subreddit": "science",
        "sentence": "Judging from your comment history you're lying"
    },
    {
        "subreddit": "science",
        "sentence": "Is it possible then they're like octopi where they have brain cells spread throughout the body?"
    },
    {
        "subreddit": "science",
        "sentence": "Hawks, kestrels, harriers, osprey, etc."
    },
    {
        "subreddit": "science",
        "sentence": "Dinosaurs are reptiles."
    },
    {
        "subreddit": "science",
        "sentence": "I see, cheers"
    },
    {
        "subreddit": "science",
        "sentence": "Well, take crows, for an example of a dinosaur smarter than a crocodile."
    },
    {
        "subreddit": "science",
        "sentence": "These animals were not cold blooded."
    },
    {
        "subreddit": "science",
        "sentence": "I imagine the other poster really wants to know whether that 35k Newtons of bite force could punch through armor.\n\nI know I do.\n\nI'm also curious about how resistant they would be to any sort of head trauma, like gunfire."
    },
    {
        "subreddit": "science",
        "sentence": "Because people thought avoidance and cleanliness = healthier"
    },
    {
        "subreddit": "science",
        "sentence": "It doesn’t"
    },
    {
        "subreddit": "science",
        "sentence": "Same reason why there’s a group of people obsessed with hand sanitizer and avoiding “germs” who are always getting sick"
    },
    {
        "subreddit": "science",
        "sentence": "They never gave their immune system a chance"
    },
    {
        "subreddit": "science",
        "sentence": "We seem to have a bunch of such advise still around regarding nutrition, at all stages of life."
    },
    {
        "subreddit": "science",
        "sentence": "They weren’t giant birds, but birds do have an ancestor with them in the form of coelurosauria or similar."
    },
    {
        "subreddit": "science",
        "sentence": "They *are* true reptiles --- they're in class Reptilia"
    },
    {
        "subreddit": "science",
        "sentence": "They are not true *lizards*.\n\nEDIT: Meanwhile, birds are in class Aves, which it seems like should probably be nested under Reptilia but isn't currently."
    },
    {
        "subreddit": "science",
        "sentence": "What modern raptors? \nDromaeosauridae Is an extinct clade."
    },
    {
        "subreddit": "science",
        "sentence": "The body has a weird ability to make you crave food that has the nutrients it needs"
    },
    {
        "subreddit": "science",
        "sentence": "It has been observed in small children wanting to eat lots of something unusual, like cod liver oil, that later turned out to have had a severe deficiency in a nutrient present in that food"
    },
    {
        "subreddit": "science",
        "sentence": "It does seem to me to be evolutionarily adaptive for the body to be able to drive an individual to seek out deficient nutrients, even if they don’t know or understand which nutrients they are seeking out.\n\nMaybe this happens indirectly where the developing fetus depletes the mothers reserves of a nutrient and her own body drives her to replenish the nutrient"
    },
    {
        "subreddit": "science",
        "sentence": "Or perhaps there is a hormonal component driven by the fetus directly."
    },
    {
        "subreddit": "science",
        "sentence": "> Crocodiles and dinosaurs share a common ancestry, same as pterasaurs\n\nI know you go on to say more, but that particular sentence doesn’t say much itself"
    },
    {
        "subreddit": "science",
        "sentence": "All living things share a common ancestry"
    },
    {
        "subreddit": "science",
        "sentence": "Dinosaurs are more closely related to crocodiles than they are to lizards.\n\nAll of those are true reptiles, though"
    },
    {
        "subreddit": "science",
        "sentence": "I take it you take “true reptiles” to mean eureptilia or similar"
    },
    {
        "subreddit": "science",
        "sentence": "It contains all modern reptiles, and this includes dinosaurs."
    },
    {
        "subreddit": "science",
        "sentence": "Thoughts just kind of bubble up in your brain and most of them aren't useful"
    },
    {
        "subreddit": "science",
        "sentence": "Your brain naturally suppresses those"
    },
    {
        "subreddit": "science",
        "sentence": "Like if you've seen or experienced something a thousand times, your brain reflexively skips over the process of actually experiencing it as if it were the first time"
    },
    {
        "subreddit": "science",
        "sentence": "It takes the shortcut of knowing or remembering instead"
    },
    {
        "subreddit": "science",
        "sentence": "Psychedelics turn down the damping effect and allow a lot more cross talk between parts of your brain"
    },
    {
        "subreddit": "science",
        "sentence": "This is why you see visual artifacts, and also where the sense of novelty in mundane things comes from"
    },
    {
        "subreddit": "science",
        "sentence": "Unless hiking makes you hallucinate, it's not the same thing as taking psychedelics"
    },
    {
        "subreddit": "science",
        "sentence": "Hiking might calm you down and help you contemplate stuff, it doesn't fundamentally alter the way thoughts travel in your skull.\n\nAlso psychedelics don't make you want to do psychedelics"
    },
    {
        "subreddit": "science",
        "sentence": "That seems to be one of your complaints, so on that front you're setting yourself up for disappointment."
    },
    {
        "subreddit": "science",
        "sentence": "Is there such thing as a tolerance to pathogens ? This is not admittedly an area I’m particular well versed in, but the idea of exposing kids to pathogens is to make their immune system more capable of dealing with said pathogen rather than making it tolerate it, the complete opposite.\n\nIn a sense it’s treating your immune system like a muscle, it’s better to routinely expose low dose effort such that if in the future there is a higher load your system is prepared and not overwhelmed, not dissimilar from periodic exercise in your muscles should you need to lift something heavy in the future, that’s pretty much the basis of vaccination and boosters (mutations not withstanding)"
    },
    {
        "subreddit": "science",
        "sentence": "You're on to something, and I'm going to close this tab on my browser."
    },
    {
        "subreddit": "science",
        "sentence": "Oddly, I knew somebody who never stuttered, but when they married a partner who stuttered, after a few years they picked up a stutter too, almost like it was an accent.  \n\n\nNever called attention to it, but always wondered how that worked."
    },
    {
        "subreddit": "science",
        "sentence": "That's not the people I'm talking about, they're a subset but it's bigger than that"
    },
    {
        "subreddit": "science",
        "sentence": "It's basically everyone except middle class white \"liberal\" westerners, who have invented whole new categories of bad behaviour and faux pas"
    },
    {
        "subreddit": "science",
        "sentence": "It's cultural domination and exclusion dressed up in the language of inclusion, because it's a declaration of *in group fashion* (it's a very new thing) that sets a tone; it says a channel of communication is open for those who can navigate our minefield, and everyone else is excluded on grounds of being immoral.\n\nSo the lower classes who value robustness and speaking casually are discouraged from communicating"
    },
    {
        "subreddit": "science",
        "sentence": "Religious people should leave their identity at the door, avoid anything about their values or culture or them as a human being"
    },
    {
        "subreddit": "science",
        "sentence": "People who speak English as a second language should express themselves very carefully, specially those whose mother tongue is steeped in gendered terms"
    },
    {
        "subreddit": "science",
        "sentence": "First generation immigrants are of course forgiven as long as they're being educated from a position of inferiority to Good People like us"
    },
    {
        "subreddit": "science",
        "sentence": "I don't like it, it feels performative and insincere"
    },
    {
        "subreddit": "science",
        "sentence": "And if everyone's doing it then you've got a sanctimonious community, it signals snakes.\n\nMaybe that's because I'm a Brit from a working class background so \"uwotm8?\" is the nose test for everything, so I see that and my internal monologue automatically goes:\n\n> Look at this bellend with an \"I'm not a transphobe\" disclaimer in their email signature, \"I'm a snob but not that kind of snob\"\n\nAnd yeah I see the irony there, but I'm also a bit of a sperg so find it hard to not apply cutting logic and want bluntness and honesty."
    },
    {
        "subreddit": "science",
        "sentence": "Bacteria is important but without fungi it would take years to break down things that even bacteria can't digest."
    },
    {
        "subreddit": "science",
        "sentence": "But what does that data really reveal, though? From what you said, I could interpret it as pets reducing the rate of mild to moderate allergies among children but simply not having an effect on severe allergies, thus kids with pets who had allergies were generally just the ones with severe allergies that weren't helped by having pets."
    },
    {
        "subreddit": "science",
        "sentence": "Can ya blame em? We tell them Santa's real but the internet doesn't"
    },
    {
        "subreddit": "science",
        "sentence": "Who's right?"
    },
    {
        "subreddit": "science",
        "sentence": "This doesn't make it any less terrifying"
    },
    {
        "subreddit": "science",
        "sentence": "Oh good, it's only as smart as one of the smartest reptiles"
    },
    {
        "subreddit": "science",
        "sentence": "Phew!"
    },
    {
        "subreddit": "science",
        "sentence": "I'm a soil scientist"
    },
    {
        "subreddit": "science",
        "sentence": "I teach soil science to undergraduates"
    },
    {
        "subreddit": "science",
        "sentence": "I can assure you, that is not what soil is"
    },
    {
        "subreddit": "science",
        "sentence": "Soil is a consolidated matrix of mineral and/or organic materials deposited through various processes over time that has undergone changes associated with weathering and biogeochemical processes"
    },
    {
        "subreddit": "science",
        "sentence": "It can contain either mineral or organic materials, but simply dumping them on the ground and mixing it up doesn't make it soil.\n\nCompost is a completely different material produced through human management of organic wastes to facilitate nutrient turnover"
    },
    {
        "subreddit": "science",
        "sentence": "It is only related to soil in that people will use it to augment the upper portion of soils to enhance plant growth"
    },
    {
        "subreddit": "science",
        "sentence": "It can incorporated *into* soil, but it isn't soil."
    },
    {
        "subreddit": "science",
        "sentence": "Have you ever tried to fool a cat? Now keep the brain the same size but increase it’s body size"
    },
    {
        "subreddit": "science",
        "sentence": "It will still be a very intuitive creature."
    },
    {
        "subreddit": "science",
        "sentence": "I can try to r/elihulk\n\nPLANET ATMOSPHERE DENSE"
    },
    {
        "subreddit": "science",
        "sentence": "MUCH PRESSURE TO WATER"
    },
    {
        "subreddit": "science",
        "sentence": "SMASH EXTRA PROTONS TO WATER"
    },
    {
        "subreddit": "science",
        "sentence": "MAKE NEW THING."
    },
    {
        "subreddit": "science",
        "sentence": "Its made by Bamba, TJ used their product and private labels it"
    },
    {
        "subreddit": "science",
        "sentence": "It’s exactly the same"
    },
    {
        "subreddit": "science",
        "sentence": "I even had Israeli people I met traveling try it and they were shocked that it’s the same."
    },
    {
        "subreddit": "science",
        "sentence": "A trend is all it is"
    },
    {
        "subreddit": "science",
        "sentence": "Doesn’t mean T"
    },
    {
        "subreddit": "science",
        "sentence": "rex was dumber than a bird."
    },
    {
        "subreddit": "science",
        "sentence": "Trader Joe’s sells it, it’s the exact same product, just private labeled."
    },
    {
        "subreddit": "science",
        "sentence": ">  \n  \nNot true"
    },
    {
        "subreddit": "science",
        "sentence": "Encephalization Quotient is a legitimate trend, though obviously not conclusive"
    },
    {
        "subreddit": "science",
        "sentence": "But there are a lot of other factors with evidentiary bases"
    },
    {
        "subreddit": "science",
        "sentence": "Read the article and dispute specific points rather than just making conclusions in the absence of evidence, which is contrary to any academic analysis."
    },
    {
        "subreddit": "science",
        "sentence": "I'm the context of wanting your kid to be able to eat peanuts, yes.\n\nBut you may not want your child to build an immune tolerance to a pathogen and let a virus just hang around until a serious infection was underway"
    },
    {
        "subreddit": "science",
        "sentence": "Essentially we can't just expose a kid to lots of potential pathogens and allergens and assume it will \"improve their immune system,\" as much as that seems like common sense with a basic understanding of how immunity works."
    },
    {
        "subreddit": "science",
        "sentence": "look at him having fancy worms and stuff"
    },
    {
        "subreddit": "science",
        "sentence": "I guess the timing of when to give infant this is the new info, but I thought it was a well known fact that in order to avoid allergies you should be exposed to as many things as possible pretty much as soon as possible as a kid"
    },
    {
        "subreddit": "science",
        "sentence": "It's these exposures that train our immune system."
    },
    {
        "subreddit": "science",
        "sentence": "If exposure therapy works for children, why doesn't it work when you're an adult? Why is the study limited to those ages? Is it all psychological and ignorance is bliss when you're a kid?"
    },
    {
        "subreddit": "science",
        "sentence": "I once spent two weeks with bees invading my house through the light fixtures\n\nThere's no way I could get horny with the sound of bees"
    },
    {
        "subreddit": "science",
        "sentence": "> I'm 50 and I don't remember a single child when I was in school that had to avoid even touching the stuff due to allergies"
    },
    {
        "subreddit": "science",
        "sentence": "Epipens were not available until the 1980's, and even then were extremely expensive.\n\nBefore that a kid with a severe allergy couldn't risk going to school because they would almost certainly be exposed and die.\n\nNow people with severe allergies have the medication they need to go out in public, so they are seen more often."
    },
    {
        "subreddit": "science",
        "sentence": "Above the trend line for reptiles but well below the trend lines for birds and mammals, so I guess it depends on what level of intelligence/brain size you expected."
    },
    {
        "subreddit": "science",
        "sentence": "I mean.."
    },
    {
        "subreddit": "science",
        "sentence": "most humans would trust google over most other humans.."
    },
    {
        "subreddit": "science",
        "sentence": "so not really surprising that a baby would trust a robot more (side note.."
    },
    {
        "subreddit": "science",
        "sentence": "how do you ask a 3y/o who it trusts more for info??)"
    },
    {
        "subreddit": "science",
        "sentence": "I wish I could say, but.."
    },
    {
        "subreddit": "science",
        "sentence": "???\n\nIt could be that small brains do have a downside"
    },
    {
        "subreddit": "science",
        "sentence": "It could be that it just takes more generations to evolve them"
    },
    {
        "subreddit": "science",
        "sentence": "Could be that maritime mammals have larger brains to deal with decompression.."
    },
    {
        "subreddit": "science",
        "sentence": "could be something else.\n\nHuman brain also decreased in size over the last 100 000 years, yet we aren't getting less smart."
    },
    {
        "subreddit": "science",
        "sentence": "Will Ferrell's character in Land of the Lost covered this topic nicely."
    },
    {
        "subreddit": "science",
        "sentence": "There are some glaring issues with this study"
    },
    {
        "subreddit": "science",
        "sentence": "From the discussion section:\n\n> Additionally, no researcher was present whilst parents guided their children through the study"
    },
    {
        "subreddit": "science",
        "sentence": "Although we provided an instruction video at the beginning of the study, this does not guarantee parents actual behaviour throughout the study"
    },
    {
        "subreddit": "science",
        "sentence": "To counteract this, we included questions at the end specifically asking about parents experience of completing the study online/autonomously"
    },
    {
        "subreddit": "science",
        "sentence": "The answers provided by the parents suggest the majority did not experience any issues.\n\nDoes this even test the children or is it actually picking up on something the parents are doing?"
    },
    {
        "subreddit": "science",
        "sentence": "Sorry, I meant in terms of the shape of the skull and its force, saying the skull was made to take that kind of chomping."
    },
    {
        "subreddit": "science",
        "sentence": "Tyrannosaurus Rex makes your average pitbull bite look like a chihuahua bite.\n\nThe maximum pitbull bite force is 1,300 Newtons, that's around three times stronger than your bite force"
    },
    {
        "subreddit": "science",
        "sentence": "A T-Rex's  bite force is **SEVENTY** times stronger than your bite force.\n\nThat means Tyrannosaurus rex had a bite force 23 times that of a pitbull.\n\nThe skull of an average T-Rex weighed 4 times more than an average piitbull at 200lbs (90.71kg).\n\nThe average adult T-Rex weighed as much as the largest Bull African elephants and they were such effective predators that their babies effectively wiped out small and medium sized predators in North America for millions of years.\n\nTyrannosaurus Rex might have been dumb but they were the dominant species in North America for a lot longer than we have been."
    },
    {
        "subreddit": "science",
        "sentence": "Why would anyone expect a giant, carnivorous dinosaur to be any smarter than a crocodile? That's exactly how smart I would expect them to be"
    },
    {
        "subreddit": "science",
        "sentence": "Crocodiles seem to be doing pretty good for themselves."
    },
    {
        "subreddit": "science",
        "sentence": "Especially if you consider a tooth evolved to withstand that bite, then not being able to, would maybe duplicate a bomb inside your skull going off"
    },
    {
        "subreddit": "science",
        "sentence": "Maybe their brains were also focusing on limb movement and bite control as much as force"
    },
    {
        "subreddit": "science",
        "sentence": "Couldn’t avoid that if we tried!"
    },
    {
        "subreddit": "science",
        "sentence": "Or you can be like my cousin who grew up eating peanut butter and became allergic at 15"
    },
    {
        "subreddit": "science",
        "sentence": "they're basically giant pitbull skulls, durable af"
    },
    {
        "subreddit": "science",
        "sentence": "This will be amazing for hearing directors while shooting concerts."
    },
    {
        "subreddit": "science",
        "sentence": "The terrible lizard probably behaved like other lizards? Thanks science, I can sleep better now!"
    },
    {
        "subreddit": "science",
        "sentence": "I'm going to guess it's more so actually, maybe even *significantly* more so."
    },
    {
        "subreddit": "science",
        "sentence": "We knew this years ago, did it with my daughter who is now 6"
    },
    {
        "subreddit": "science",
        "sentence": "You can do other allergens as well, it’s not new science."
    },
    {
        "subreddit": "science",
        "sentence": "Do you know why neuron density is favoured or not? Is it energetically taxing to have a smaller brain with high energy density as opposed to a larger brain ?"
    },
    {
        "subreddit": "science",
        "sentence": "How dependent is that on body temperature?\n\nWarm blooded vs Cold blooded and all."
    },
    {
        "subreddit": "science",
        "sentence": "Fair enough"
    },
    {
        "subreddit": "science",
        "sentence": "Can you please explain every word of that first sentence?"
    },
    {
        "subreddit": "science",
        "sentence": "Still think taco bell drive-thru can explain most of this"
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, I never thought if I was being chased by one that I could reason with it, so this changes nothing in my nightmares."
    },
    {
        "subreddit": "science",
        "sentence": "I compost tea bags all the time and can attest to this"
    },
    {
        "subreddit": "science",
        "sentence": "If I put it in the compost pile they are gone in a few months, if I put it in my high heat compost tumbler they are gone in a month"
    },
    {
        "subreddit": "science",
        "sentence": "If I feed them to my worms in my worm bins they last like a week"
    },
    {
        "subreddit": "science",
        "sentence": "Burying in the ground isn't an efficient way to test this, you are missing nitrogen, moisture, and maybe even a lot of the bacteria, fungus, and worms that compost piles host."
    },
    {
        "subreddit": "science",
        "sentence": "Not Trader Joe’s they only sell generic"
    },
    {
        "subreddit": "science",
        "sentence": "That’s not bamba it’s generic brand"
    },
    {
        "subreddit": "science",
        "sentence": "You might also get the added benefit of being inoculated against smallpox"
    },
    {
        "subreddit": "science",
        "sentence": "[not so] clever girlll"
    },
    {
        "subreddit": "science",
        "sentence": "I think micro- plastics are this generations lead, and it's just going to get worse because (unlike lead) no one is going to phase out the use of plastic"
    },
    {
        "subreddit": "science",
        "sentence": "Also (unlike lead) micro-plastics are EVERYWHERE - in the air, the water, the soil, our brains, our testicles - yikes!"
    },
    {
        "subreddit": "science",
        "sentence": "I've never understood why regular drivers licenses have no regular medical exam for adults"
    },
    {
        "subreddit": "science",
        "sentence": "I know that other jurisdictions are similar to where I live (Western Canada)"
    },
    {
        "subreddit": "science",
        "sentence": "Here, regular licenses have no medical examination even into senior ages"
    },
    {
        "subreddit": "science",
        "sentence": "Whereas professional licenses, from driving taxis to busses to cargo trucks, require somewhat regular medical examinations"
    },
    {
        "subreddit": "science",
        "sentence": "Ramping up in frequency as drivers approach their 70's"
    },
    {
        "subreddit": "science",
        "sentence": "Yet some dude can get their license in their teens, and not be forced to see a doctor proving they are medically able to drive for decades."
    },
    {
        "subreddit": "science",
        "sentence": "This is well-meaning and all, but it’s not like their kids don’t try to get them to plan for the inevitable"
    },
    {
        "subreddit": "science",
        "sentence": "There’s signs all along that they won’t be able to drive in the near future"
    },
    {
        "subreddit": "science",
        "sentence": "It’s willful ignorance"
    },
    {
        "subreddit": "science",
        "sentence": "If doctors had a test that could give them an estimate of how much longer they could drive for, they’d just refuse it"
    },
    {
        "subreddit": "science",
        "sentence": "Boomer car-brain is so advanced, it’s easier to imagine literally dying than hanging up the keys for good"
    },
    {
        "subreddit": "science",
        "sentence": "I mean, more seriously, the way we’ve built our society to be so hopelessly dependent on the car is a crime against humanity, and a systematic violation of disabled people’s basic human rights"
    },
    {
        "subreddit": "science",
        "sentence": "It is not hard to sympathize with them being more afraid of losing their independence than their impending death.\n\nIt would sure be nice if they didn’t spend their golden years fighting urbanist reform tooth and nail, though…"
    },
    {
        "subreddit": "science",
        "sentence": "Hm"
    },
    {
        "subreddit": "science",
        "sentence": "Wild"
    },
    {
        "subreddit": "science",
        "sentence": "My parents drink every day, they are in their eighties, they are also massively into hiking"
    },
    {
        "subreddit": "science",
        "sentence": "Hard to say what rule is the most dependable in predicting outcomes"
    },
    {
        "subreddit": "science",
        "sentence": "> Research has largely reported that dog exposure is associated with reduced allergic disease risk.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6003855/#:~:text=Dog%20introduction%20into%20the%20home%20appears%20to%20immediately%20introduce%20low,in%20large%20relative%20abundance%20shifts."
    },
    {
        "subreddit": "science",
        "sentence": "T-Rex chomps hard."
    },
    {
        "subreddit": "science",
        "sentence": "Except we've been told over and over that it's not size but density, specifically the wrinkles/folds in the gray matter, that determine intelligence"
    },
    {
        "subreddit": "science",
        "sentence": "But I'm probably wrong on that, because I, too, am not a neuroscientist."
    },
    {
        "subreddit": "science",
        "sentence": "Distant cousins not ancestor."
    },
    {
        "subreddit": "science",
        "sentence": "It has been repeatedly shown that children whose parents had allergy test performed on them at a young age and proceeds to have avoid said allergen, then to result in children to have more severe allergic reactions to those allergens"
    },
    {
        "subreddit": "science",
        "sentence": "Children are notoriously sensitive to many thing even up till age 5 to 7, but that's the point of repeated exposure"
    },
    {
        "subreddit": "science",
        "sentence": "Repeated exposure results in our immune system lessening its response.\n\nAvoid allergens their entire life is literally putting their child's immune system in a bubble."
    },
    {
        "subreddit": "science",
        "sentence": "Just needed another 20 years…"
    },
    {
        "subreddit": "science",
        "sentence": "Reddit has a subreddit on tea with excellent references to tea companies for loose tea and equipment"
    },
    {
        "subreddit": "science",
        "sentence": "Namely r/tea."
    },
    {
        "subreddit": "science",
        "sentence": "Alternate Title: Finns are generally mentally and physically fit"
    },
    {
        "subreddit": "science",
        "sentence": "Explain a bit more on the PP, why is it used, other than being cheap and stronger than pure paper and they didn’t realize yet all the negative impacts?"
    },
    {
        "subreddit": "science",
        "sentence": "I believe that the vast majority of T-rex teeth we find are intact.\n\nGiven that T-Rex didn't shed teeth like sharks and that they survived as a species longer than we have I think it's reasonable to assume their teeth withstood the force their jaws exerted quiet well."
    },
    {
        "subreddit": "science",
        "sentence": "That’s part of why their heads are so big, gives them structure behind their bite force"
    },
    {
        "subreddit": "science",
        "sentence": "A species wouldn’t last long if an overly hard bit broke their head."
    },
    {
        "subreddit": "science",
        "sentence": "Which is why I buy loose tea and brew in a small teapot or use a tea strainer if brewing in a cup."
    },
    {
        "subreddit": "science",
        "sentence": "Mmm thats still scary af"
    },
    {
        "subreddit": "science",
        "sentence": "> That involves a lot of variables.\n\nNam flashbacks to intro to fracture mechanics"
    },
    {
        "subreddit": "science",
        "sentence": "We should see evidence of lower rates of psychosis in areas where sauna use is prevalent — all things being equal.\n\n(I don’t think we do)"
    },
    {
        "subreddit": "science",
        "sentence": "We could definitely transition.  It would take a lot of work, but I think it is possible.  People have to start to grow their own food again, victory garden style, wherever possible.  Apartment rooftops need to be converted to growing areas.  More small farms, every freaking where.  Way more of the population has to be employed in food production, etc., etc.\n\n\n\nWe could do this, over time.  Unfortunately there is zero will and very little time. \n\n\nLots of people about to die in the coming decades, either way"
    },
    {
        "subreddit": "science",
        "sentence": "We lived well for a while, but it was at the expense of the future.  Industrial ag and fossil fuels allowed for a huge spectacular one time population boom, and some of us here today will witness the crash."
    },
    {
        "subreddit": "science",
        "sentence": "They have to keep the truth inconsistent so they can get more grant money to embezzle."
    },
    {
        "subreddit": "science",
        "sentence": "I think it has something to do with the ratio of body mass versus brain size"
    },
    {
        "subreddit": "science",
        "sentence": "I am in no way qualified to give that answer but there you go."
    },
    {
        "subreddit": "science",
        "sentence": "I think I know what you mean.."
    },
    {
        "subreddit": "science",
        "sentence": "I remember when I first took acid and hearing about ego death and how you'll know your real self and all this stuff and I was pretty nervous taking two tabs.."
    },
    {
        "subreddit": "science",
        "sentence": "even after a while after it started, I was still nervous/expectant of when it \"peaks\".."
    },
    {
        "subreddit": "science",
        "sentence": "It was just.."
    },
    {
        "subreddit": "science",
        "sentence": "the regular deep-introspection state? I mean yeah, it's not like I go there *super* often, but it wasnt something *UNIQUE* to acid"
    },
    {
        "subreddit": "science",
        "sentence": "(it just sorta automatically \"straps you into\" that state and leaves you there for a while, rather that the slow, \"active\" manual approach.\n\nA slightly similar, more relatable analogy is being more social and alcohol"
    },
    {
        "subreddit": "science",
        "sentence": "You can be perfectly sociable without booze"
    },
    {
        "subreddit": "science",
        "sentence": "Sometimes for some people, when not feeling up to it, a drink can grease the gears and get the ball rolling"
    },
    {
        "subreddit": "science",
        "sentence": "And for others.."
    },
    {
        "subreddit": "science",
        "sentence": "they seem to refuse to practice being social while sober, and use alcohol as a crutch"
    },
    {
        "subreddit": "science",
        "sentence": "Thinking they *need* to drink to be fun or engaging.\n\nI grew up being taught to appreciate and love nature, so I'm always up for a hike"
    },
    {
        "subreddit": "science",
        "sentence": "To take in nature and just be absorbed by it is wonderful.\n\nWhen my old roommates went hiking without me, I was bummed for not telling them of my willingness to go with them.."
    },
    {
        "subreddit": "science",
        "sentence": "that is, until I learned that the whole plan was to trip out while doing it in order to enjoy it :|"
    },
    {
        "subreddit": "science",
        "sentence": "If that were so, would that support the advice that I give parents as an early childhood educator? The advice being that if your child stutters, do not interrupt, try to speak for them, or reply based on context or body language"
    },
    {
        "subreddit": "science",
        "sentence": "Allow them time to get the whole idea out"
    },
    {
        "subreddit": "science",
        "sentence": "This research seems to suggest that it would be helpful to let a stutter \"work itself out\" so that the brain can get practice with timing cues?"
    },
    {
        "subreddit": "science",
        "sentence": "Don't expect those nobles to catch anything, they're full, course you can call them anytime you want, they never react."
    },
    {
        "subreddit": "science",
        "sentence": "How did they know \"aquodiium\" was the name of that species? (H4O^(2+))"
    },
    {
        "subreddit": "science",
        "sentence": "I met some lizards smarter than people."
    },
    {
        "subreddit": "science",
        "sentence": "Did you read the article?\n\n>The team found that their brain size had been overestimated - especially that of the forebrain - and thus neuron counts as well"
    },
    {
        "subreddit": "science",
        "sentence": "In addition, they show that neuron count estimates are not a reliable guide to intelligence.\n\n...\n\n>“Neuron counts are not good predictors of cognitive performance, and using them to predict intelligence in long-extinct species can lead to highly misleading interpretations,” added Dr Ornella Bertrand (Institut Català de Paleontologia Miquel Crusafont)."
    },
    {
        "subreddit": "science",
        "sentence": "Size of the brain has nothing to do with behavior"
    },
    {
        "subreddit": "science",
        "sentence": "This is pseudoscience."
    },
    {
        "subreddit": "science",
        "sentence": "I don’t see the need to colonize oceans but there’s truth in your statement"
    },
    {
        "subreddit": "science",
        "sentence": "Earth is the most practical place to terraform by far"
    },
    {
        "subreddit": "science",
        "sentence": "We are presently doing the inverse via anthropogenic climate change"
    },
    {
        "subreddit": "science",
        "sentence": "Even so, making earth habitable into the future is infinitely more practical."
    },
    {
        "subreddit": "science",
        "sentence": "Maybe your bulls but that doesn’t seem to be the general scientific consensus"
    },
    {
        "subreddit": "science",
        "sentence": "Maybe your bulls know you’re going to axe them one day so they dont like you."
    },
    {
        "subreddit": "science",
        "sentence": "Who are they to judge what’s unusual in my anus?"
    },
    {
        "subreddit": "science",
        "sentence": "that would work for me"
    },
    {
        "subreddit": "science",
        "sentence": "There is no shame in taking professional driving lessons from an instructor"
    },
    {
        "subreddit": "science",
        "sentence": "The one who I hired for my son teaches so many adults that moved from the city to the suburbs"
    },
    {
        "subreddit": "science",
        "sentence": "You may even get a better insurance rate if you take lessons."
    },
    {
        "subreddit": "science",
        "sentence": "Certainly fair, I was mostly thinking about how durable are their teeth and bones like ya you've got all that force, and sharp teeth, but.."
    },
    {
        "subreddit": "science",
        "sentence": "how much stronger is the structure behind the bite?"
    },
    {
        "subreddit": "science",
        "sentence": "Yeah right dude, at least for me"
    },
    {
        "subreddit": "science",
        "sentence": "Ever been to a Trader Joe’s?"
    },
    {
        "subreddit": "science",
        "sentence": "i think shellfish are different, my mom was a big lover of shrimp all her life and suddenly in her 40s she started having severe allergic reactions to it, it definitely wasn't lack of exposure"
    },
    {
        "subreddit": "science",
        "sentence": "This is such a white people problem"
    },
    {
        "subreddit": "science",
        "sentence": "In other cultures around the world, infants are generally fed all sorts of weird stuff, and nut allergies in adulthood are virtually unheard of."
    },
    {
        "subreddit": "science",
        "sentence": "i feel like I've been hearing this for 20 years, yet parents keep ignoring it and more and more peanut allergies are born"
    },
    {
        "subreddit": "science",
        "sentence": "mfs be taking bites out of trees"
    },
    {
        "subreddit": "science",
        "sentence": "Well we've seen what women on the internet do with dogs and horses...."
    },
    {
        "subreddit": "science",
        "sentence": "Weren’t they more like vultures, not crazy aggressive hunters"
    },
    {
        "subreddit": "science",
        "sentence": "I'm wondering as well..\n\nIs it gonna be like if I take an ice cube out of a fridge and it becomes water \n\nOr if I form diamond under high pressure where it becomes stable and not return to being a graphite."
    },
    {
        "subreddit": "science",
        "sentence": ">What could 35,000 newtons bite through\n\nThat involves a lot of variables.\n\nI'd rather just relate it to something you know if that's okay"
    },
    {
        "subreddit": "science",
        "sentence": "Humans have a bite force of around 500 Newtons \n\n    T-Rex had a bite force of around 35,000 Newtons.\n\n\nThink about how much force you can exert when biting into something as hard as you can with your back teeth.\n\nThen multiply that by **70** and imagine you have a mouth full of interlocking steak knives.\n\n~\n\nEDIT:  without doing any math I think it's reasonable to say that a T-rex would put less effort into biting a cow in half than you would put into biting a snickers bar in half."
    },
    {
        "subreddit": "science",
        "sentence": "Alright, you’ve convinced me!"
    },
    {
        "subreddit": "science",
        "sentence": "What kind of finding is this people have been doing ctab nucleotide extractions since the 1980s"
    },
    {
        "subreddit": "science",
        "sentence": "Then we're raising a bunch of rubes"
    },
    {
        "subreddit": "science",
        "sentence": "You know Thomas Kuhn’s theory of paradigm shifts? It’s his reflection of one single event in scientific history, when classical physics developed into general relativity"
    },
    {
        "subreddit": "science",
        "sentence": "Most of science, like Paleontology, are not even in the “normal science” mode, having coherent theories about the world"
    },
    {
        "subreddit": "science",
        "sentence": "This leaves scientist sitting around making clever stories all day that never are going to be verified"
    },
    {
        "subreddit": "science",
        "sentence": "You hear about it because journalists and people think it’s more interesting to hear those stories than about boring stuff that can be scientifically verified."
    },
    {
        "subreddit": "science",
        "sentence": "Crocodiles and dinosaurs share a common ancestry, same as pterasaurs"
    },
    {
        "subreddit": "science",
        "sentence": "They are all Archosaurs...they had a different ankle to true reptiles"
    },
    {
        "subreddit": "science",
        "sentence": "So modern day crocodiles are as removed from true reptiles as birds are today"
    },
    {
        "subreddit": "science",
        "sentence": "Take a look at the sheer amount of suchians in the fossil record"
    },
    {
        "subreddit": "science",
        "sentence": "There are some crazy crocs, hoofed, herbivorous, armadillo-like"
    },
    {
        "subreddit": "science",
        "sentence": "The mistake comes from the lack of diverse crocodiles around today, they just superficially look like water lizards"
    },
    {
        "subreddit": "science",
        "sentence": "Dammit, I read this first as T-Rex the singer"
    },
    {
        "subreddit": "science",
        "sentence": "I was like, that’s rude!"
    },
    {
        "subreddit": "science",
        "sentence": "Soil is the thin layer life exists in en masse. \n\n\n> soil1\n> /sɔɪl/\n>noun\n\n\n> the upper layer of earth in which plants grow, a black or dark brown material typically consisting of a mixture of organic remains, clay, and rock particles.\n\n\n\n\n\n\n> Soil is not dirt because dirt is a subset of soil"
    },
    {
        "subreddit": "science",
        "sentence": "Soil has dirt in it but contains additional components that are teeming with life and that make it possible for plants to thrive.\n\n\nhttps://www.thespruce.com/soil-vs-dirt-7089792"
    },
    {
        "subreddit": "science",
        "sentence": "Why?\n\nCrocodiles are incredibly intelligent"
    },
    {
        "subreddit": "science",
        "sentence": "They hunt in packs, use tools, remember complex patterns, engage in play, and even form social relationships with each other.\n\nI’m not going to ask one to write my thesis, but it’s still very clever as far as animals go."
    },
    {
        "subreddit": "science",
        "sentence": "You cant join if you are on SSRIs, but once you are in, they are prescribed freely"
    },
    {
        "subreddit": "science",
        "sentence": "What could 35,000 newtons bite through and how strong would their bones and teeth have to have been to accomplish it"
    },
    {
        "subreddit": "science",
        "sentence": "interesting"
    },
    {
        "subreddit": "science",
        "sentence": "hard for me to stay focused with so many different countries, percenteges, allergens in each paragraph haha"
    },
    {
        "subreddit": "science",
        "sentence": "Wonder why uk has the most? Possibly it says in the study, but it is quite long"
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, but their like living teddy bears.\n\n100 bucks says they think you faked it, just so they'd believe teddy bears were real in the past."
    },
    {
        "subreddit": "science",
        "sentence": "Meanwhile the average honeybee is much smarter than we give it credit for according to other research and they have TINY brains so..."
    },
    {
        "subreddit": "science",
        "sentence": "idk guys."
    },
    {
        "subreddit": "science",
        "sentence": "Jaw muscles mostly"
    },
    {
        "subreddit": "science",
        "sentence": "T-Rex had a bite force of 35,000 Newtons.\n\nThat's like putting your leg in a T-rex skull and having a female Asian Elephant stand on top.\n\nThey generated enormous forces with their teeth and most of the space in and around their skull was devoted to that task"
    },
    {
        "subreddit": "science",
        "sentence": "Your jaw muscles and your brain basically have the opposite ratio, you're all brains and no bite, T-Rex were all bite and no brains."
    },
    {
        "subreddit": "science",
        "sentence": "My wife ate peanut butter every day of her pregnancy and when breastfeeding"
    },
    {
        "subreddit": "science",
        "sentence": "At 6 months we gave my daughter a peanut puff"
    },
    {
        "subreddit": "science",
        "sentence": "Wheezing, hives, ER trip"
    },
    {
        "subreddit": "science",
        "sentence": "Brutal"
    },
    {
        "subreddit": "science",
        "sentence": "Stuff doesn't make a difference sometimes"
    },
    {
        "subreddit": "science",
        "sentence": "We truly don't understand this stuff well enough"
    },
    {
        "subreddit": "science",
        "sentence": "We recently tried OIT therapy for my daughter who is 3 now"
    },
    {
        "subreddit": "science",
        "sentence": "Instantly made her tongue numb"
    },
    {
        "subreddit": "science",
        "sentence": "Couldn't even trick my daughter into eating a bamba puff smaller than a pea"
    },
    {
        "subreddit": "science",
        "sentence": "She stopped eating any food we gave her after 3 days."
    },
    {
        "subreddit": "science",
        "sentence": "I do hate how on every article like this, people insist that they’d definitely be able to work out, sauna, eat better, etc if their lives weren’t stressful so they’d OBVIOUSLY be happier… as if there’s not a benefit to carving out time for self-care, especially when life is stressful"
    },
    {
        "subreddit": "science",
        "sentence": "I cared for obese folks and yes, some did seem slower than their fitter counterparts"
    },
    {
        "subreddit": "science",
        "sentence": "Obesity affects every single atom, cell and organ"
    },
    {
        "subreddit": "science",
        "sentence": "It’s devastating the damage it does to the body."
    },
    {
        "subreddit": "science",
        "sentence": "I love the old joke \"you know what we call a boosted immune system?  An auto-immune disorder.\""
    },
    {
        "subreddit": "science",
        "sentence": "Only one of the benefits of remote where it’s possible or reasonable"
    },
    {
        "subreddit": "science",
        "sentence": "It’s better for the environment, cheaper (gas at the very least), uses less of your physical energy and time"
    },
    {
        "subreddit": "science",
        "sentence": "The major pitfalls are communication is sometimes more difficult in terms of both technical aspects (lag causing interruptions, software failure, dialing in, hosting a meeting, etc) as well as some practical explicit communication aspects (body language, eye contact, giving presentations without having to switch computers)"
    },
    {
        "subreddit": "science",
        "sentence": "I’ve also heard the interesting point that aspects of communication, like your virtual background, office, things on the wall can also matter (and of course pausing video), although I’m not sure there is really a full understanding of how that works (I doubt many people have studied it, but I also haven’t looked)"
    },
    {
        "subreddit": "science",
        "sentence": "I personally think it is more difficult to be persuasive over video meetings"
    },
    {
        "subreddit": "science",
        "sentence": "But mainly that it’s related to the fact that you don’t get the same body language feedback, inherently"
    },
    {
        "subreddit": "science",
        "sentence": "Working remote is also great if you’re at high medical risk for one reason or another, like if you have a compromised immune system, it’s especially healthier for you in that way"
    },
    {
        "subreddit": "science",
        "sentence": "Remote work is, after all, somewhat more popular after COVID for exactly this reason"
    },
    {
        "subreddit": "science",
        "sentence": "A big downfall is it’s a little bit more difficult to use work as a casual social outlet in the same way that in-person workers pretty much universally do, at least from time to time"
    },
    {
        "subreddit": "science",
        "sentence": "So it adds to the onus and difficulty of making casual friends as an adult."
    },
    {
        "subreddit": "science",
        "sentence": "They acted more like crocs and lizards than.."
    },
    {
        "subreddit": "science",
        "sentence": "uhh.."
    },
    {
        "subreddit": "science",
        "sentence": "*checks empty notes* ...dinosaurs..?"
    },
    {
        "subreddit": "science",
        "sentence": "Soils differ a lot"
    },
    {
        "subreddit": "science",
        "sentence": "They can have high organic matter or low organic matter"
    },
    {
        "subreddit": "science",
        "sentence": "Compost is soil, so is clay, and so is a sandy beech"
    },
    {
        "subreddit": "science",
        "sentence": "Probably why nobody has this in south America, although we don’t consume peanut butter nearly as much, peanuts are wildly consumed and paçocas are an all age favourite!!! Much more peanut in a sitting than what you get in a pb&j"
    },
    {
        "subreddit": "science",
        "sentence": "No, it's a type of soil"
    },
    {
        "subreddit": "science",
        "sentence": "You can add different types of soil together and most soils have organic matter in them already"
    },
    {
        "subreddit": "science",
        "sentence": "Soil is just broken up things, one of those things can be food"
    },
    {
        "subreddit": "science",
        "sentence": "Thanks for the catch: *Elephants"
    },
    {
        "subreddit": "science",
        "sentence": "World health recommends no solid foods until 6 months so really the health advice for everyone is part of the problem.\n\n[https://www.who.int/news-room/fact-sheets/detail/infant-and-young-child-feeding](https://www.who.int/news-room/fact-sheets/detail/infant-and-young-child-feeding)\n\n&#x200B;\n\nI started to rub the food my wife and I ate onto my kids skin from like 2 months, started some solids at 4 months"
    },
    {
        "subreddit": "science",
        "sentence": "The advice however from WHO is 1/2 the problem and lack of exposure is then only amplified by everyone else(Kindergarten , schools, etc banning everything else)."
    },
    {
        "subreddit": "science",
        "sentence": "They don’t care"
    },
    {
        "subreddit": "science",
        "sentence": "They flat out do not care"
    },
    {
        "subreddit": "science",
        "sentence": "They’ll run kids over and drag them all the way to their driveways like meat crayons and never notice a thing"
    },
    {
        "subreddit": "science",
        "sentence": "And when they’re done figuring out hey will experience zero consequences, they’ll be back on the road.\n\nOld Americans suck"
    },
    {
        "subreddit": "science",
        "sentence": "Even the nice ones will definitely put themselves first.\n\nThey know they shouldn’t, they know they’re dangerous, and will just play the card to avoid any sacrifice."
    },
    {
        "subreddit": "science",
        "sentence": "New long-term fear unlocked: bringing shame to your entire species via future palaeontologists."
    },
    {
        "subreddit": "science",
        "sentence": "You can do everything right and things can still turn out wrong, live a life by that advice and you’ll sleep easier"
    },
    {
        "subreddit": "science",
        "sentence": "Is this only true of peanuts? \n\nHow about deeznuts?"
    },
    {
        "subreddit": "science",
        "sentence": "That sounds like an improvement to me"
    },
    {
        "subreddit": "science",
        "sentence": "Well, we should trust science, yet know that this sort of thing happens"
    },
    {
        "subreddit": "science",
        "sentence": "This means that we should be honest that certain sciences struggle to generate consistent and long lasting advice"
    },
    {
        "subreddit": "science",
        "sentence": "Healthy behavior and nutrition science doesn’t have a great track record"
    },
    {
        "subreddit": "science",
        "sentence": "The science of health and nutrition of the 1940s, 80s and 2020s are quite different"
    },
    {
        "subreddit": "science",
        "sentence": "2060 will look back on the advice of today and see mistakes and quackery, just as we do today for prior generations. \n\nOther fields of study have much better results and don’t have this sort of poor record"
    },
    {
        "subreddit": "science",
        "sentence": "It isn’t the spirit of scientific inquiry to deny errors and weakness of studies when they exist; and this field is rife with them."
    },
    {
        "subreddit": "science",
        "sentence": "Both Target and Trader Joe's sell Bamba"
    },
    {
        "subreddit": "science",
        "sentence": ">Elements are incredibly intelligent\n\nEhhhh the noble ones might come intelligent but it's just their accent."
    },
    {
        "subreddit": "science",
        "sentence": "Pigeons are super intelligent"
    },
    {
        "subreddit": "science",
        "sentence": "Not to mention size is important Elements are incredibly intelligent possibly smarter than chimps but their brain to body mass is very small"
    },
    {
        "subreddit": "science",
        "sentence": "So having an overall larger brain is a big factor and if they share the neuron density with living dinosaurs (birds) then they’d be very smart\n\nEdit: *Elephants"
    },
    {
        "subreddit": "science",
        "sentence": "Yes as I said, allergists’ opinions can vary"
    },
    {
        "subreddit": "science",
        "sentence": "I certainly wouldn’t think this type of exposure treatment is for everyone and will depend on lifestyle"
    },
    {
        "subreddit": "science",
        "sentence": "Obviously like all treatments it doesn’t work for anyone, and not everyone will even have an allergy show up before that age"
    },
    {
        "subreddit": "science",
        "sentence": "But that doesn’t mean that it isn’t often recommended now when it is possible.\n\nChildren can be considered fully desensitized after a certain stage without requiring daily exposure doses"
    },
    {
        "subreddit": "science",
        "sentence": "Another description of part of this study describes this (“she’ll have one more test of eating a large amount of peanuts in the clinic (an oral challenge) to see if she reacts"
    },
    {
        "subreddit": "science",
        "sentence": "If she doesn’t, she’ll be considered fully desensitized to peanuts”)"
    },
    {
        "subreddit": "science",
        "sentence": "(Here: https://news.ubc.ca/2019/04/oral-immunotherapy-safe-for-preschool-aged-children-with-peanut-allergies/) \n\nMy niece’s allergist has her stick with a maintenance dose of a serving of peanuts at least every 2 weeks which has been a very minor thing to fit into her diet compared to the trade off of a lifetime allergy"
    },
    {
        "subreddit": "science",
        "sentence": "She has no reaction and loves peanut butter."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah but we don’t know if they share the same neuron density as other dinosaurs did."
    },
    {
        "subreddit": "science",
        "sentence": "you are remembering correctly"
    },
    {
        "subreddit": "science",
        "sentence": "It was soon after that advice, at some global paediatric conference, doctors were noticing even higher allergen rates, except for Israel"
    },
    {
        "subreddit": "science",
        "sentence": "One of their go-to kid snacks is [Bamba, a peanut puff, and they had no change in their allergen rates.](https://www.thetower.org/4427oc-how-a-popular-israeli-snack-changed-americas-understanding-of-peanut-allergies/)"
    },
    {
        "subreddit": "science",
        "sentence": "Read about something similar 20 years ago in regards to Israeli children."
    },
    {
        "subreddit": "science",
        "sentence": "\"The Hygiene Hypothesis.\""
    },
    {
        "subreddit": "science",
        "sentence": "While I wholeheartedly agree"
    },
    {
        "subreddit": "science",
        "sentence": "I *also* think there’s a good portion of people that would never do a nature retreat, but would definitely do ayahuesca."
    },
    {
        "subreddit": "science",
        "sentence": "Why is every study on this sub nowadays about dementia and psychosis?"
    },
    {
        "subreddit": "science",
        "sentence": ">Something like a crow is far more intelligent than might be expected based on its brain size, but it also has a lot of evolutionary pressures towards a smaller/lighter brain (to aid in ease of flight).\n\nAll mammals increased brain size over time, except for bats"
    },
    {
        "subreddit": "science",
        "sentence": "Bats evolved smaller brains.\n\nIn contrast marine mammals evolved bigger brains with lower neuron density."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah I gave my kid PB mixed with breastmilk starting at 6 months old"
    },
    {
        "subreddit": "science",
        "sentence": "Gave her different kinds of seafood when she was old enough to chew solids"
    },
    {
        "subreddit": "science",
        "sentence": "So far no allergies."
    },
    {
        "subreddit": "science",
        "sentence": "I don’t have eczema neither does anyone in my family or my husband’s"
    },
    {
        "subreddit": "science",
        "sentence": "But our daughter had eczema starting around 3-4 months old until she was around a year old"
    },
    {
        "subreddit": "science",
        "sentence": "We gave her PB around 6 months old but mixed with breastmilk so it wasn’t thick"
    },
    {
        "subreddit": "science",
        "sentence": "No idea why."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah that’s what I did with my daughter"
    },
    {
        "subreddit": "science",
        "sentence": "I mixed peanuts butter with my breastmilk so it wasn’t thick and globby."
    },
    {
        "subreddit": "science",
        "sentence": "This is still just speculation? Seems like it would be geologically similar to earth, just without the nice breathable atmosphere nor oceans"
    },
    {
        "subreddit": "science",
        "sentence": "Any simple recipes? I’m very not good at cooking and learning slowly"
    },
    {
        "subreddit": "science",
        "sentence": "Plant based often makes me feel good"
    },
    {
        "subreddit": "science",
        "sentence": "It's a bit more complex than that"
    },
    {
        "subreddit": "science",
        "sentence": "Allergies do depend on where you live in the world, but there are severe allergies everywhere"
    },
    {
        "subreddit": "science",
        "sentence": "They're just to different things in different parts of the world.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6021584/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6021584/)"
    },
    {
        "subreddit": "science",
        "sentence": "Your submission has been automatically removed because it is from a press release rehosting website and is therefore in violation of our [Submission Rules](https://www.reddit.com/r/science/wiki/rules)"
    },
    {
        "subreddit": "science",
        "sentence": "Please consider reposting and linking directly to the original source or a credible science journalism website"
    },
    {
        "subreddit": "science",
        "sentence": "If your submission is original content, please message the moderators for approval.\n\n---\n\nUser: u/famosoze  \nPermalink: https://www.news-medical.net/news/20240528/Research-reveals-loneliness-as-a-complex-interplay-of-social-impairments-oxytocin-and-illness.aspx\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "We don't have to get rid of those if we stop farming meat..."
    },
    {
        "subreddit": "science",
        "sentence": "you cuddle a cow :)"
    },
    {
        "subreddit": "science",
        "sentence": "Considering they were giant birds, this isn’t surprising at all"
    },
    {
        "subreddit": "science",
        "sentence": "I live in a country where peanuts are commonly eaten by themselves or as ingredients in a wide variety of processed food"
    },
    {
        "subreddit": "science",
        "sentence": "I have never met or heard of anyone with a peanut allergy."
    },
    {
        "subreddit": "science",
        "sentence": "> Somehow they've come to an expected value for trex and the actual brain measurements are on the low end of what they would expect.\n\nThe point is above the trend line, that would make it greater than expected, no?"
    },
    {
        "subreddit": "science",
        "sentence": "Fascinating! Love having the data to really support parents."
    },
    {
        "subreddit": "science",
        "sentence": "This"
    },
    {
        "subreddit": "science",
        "sentence": "There’s no way in hell my MIL should still have her license."
    },
    {
        "subreddit": "science",
        "sentence": "I think it's better for the child if it's started earlier but harder to complete based on what our allergist said"
    },
    {
        "subreddit": "science",
        "sentence": "They did have 7 drop out entirely and 20 who just \"never got retested\" for whatever reason in that study, and that was only 69 children, so you can see why an allergist might be hesitant.\n\nAnd they never \"complete\" the treatment"
    },
    {
        "subreddit": "science",
        "sentence": "They complete the clinical administration and approval to give it at home instead of in the clinic"
    },
    {
        "subreddit": "science",
        "sentence": "As it says in that article, they have to continue taking a pretty sizeable maintenance dose and are still technically allergic to peanuts."
    },
    {
        "subreddit": "science",
        "sentence": "Long winded way to say yes.\n\n\nI agree \n\n\n> consolidated matrix of materials deposited through various forms of transport (e.g"
    },
    {
        "subreddit": "science",
        "sentence": "alluvial, fluvial, colluvial, and aeolian processes) and chemically modified over time through weathering and decomposition.\n\n\nIs more detailed than\n\n\n> Mineral\n\n\nBut more words isn't always better"
    },
    {
        "subreddit": "science",
        "sentence": "Guess who is not having sex??? Male who are short, unattractive and broke"
    },
    {
        "subreddit": "science",
        "sentence": "Guess who is having more sex, male who are tall attractive charming and with money"
    },
    {
        "subreddit": "science",
        "sentence": "Guess who are female having sex with male who are tall attractive charming and with money"
    },
    {
        "subreddit": "science",
        "sentence": "Pretty much female having with with the 5% of men."
    },
    {
        "subreddit": "science",
        "sentence": "Says every scientist about other scientists they disagree with"
    },
    {
        "subreddit": "science",
        "sentence": "You can’t prove or disprove something like this with fossilized brain cases.\n\nEdit: keep in mind Elephants some of the most intelligent creatures on Earth have a low brain to body mass ratio https://en.m.wikipedia.org/wiki/Encephalization_quotient for reference theirs is 0.1 and marmosets are 2.7"
    },
    {
        "subreddit": "science",
        "sentence": "Crows have smaller brain to body mass ratio than apes yet are more intelligent showing more complex tool use(despite not having hands), problem solving, social structures, communication etc"
    },
    {
        "subreddit": "science",
        "sentence": "Saying they have the same brain ratio as a lizard yet not taking into account how much larger they are than lizards thus they are as smart as a lizard is just conjecture"
    },
    {
        "subreddit": "science",
        "sentence": "I mean the T Rex is more closely related to birds than lizards anyways, so I don’t see how anyone can make any definitive statements"
    },
    {
        "subreddit": "science",
        "sentence": "It depends on your job"
    },
    {
        "subreddit": "science",
        "sentence": "If you are on active duty and in certain jobs you can’t"
    },
    {
        "subreddit": "science",
        "sentence": "But, that’s a pretty specific jobs."
    },
    {
        "subreddit": "science",
        "sentence": "No"
    },
    {
        "subreddit": "science",
        "sentence": "Small arms."
    },
    {
        "subreddit": "science",
        "sentence": "There is a rough correlation between intelligence and brain size relative to body size"
    },
    {
        "subreddit": "science",
        "sentence": "There are a lot of outliers and exceptions, but it’s a decent way to guesstimate"
    },
    {
        "subreddit": "science",
        "sentence": "Something like a crow is far more intelligent than might be expected based on its brain size, but it also has a lot of evolutionary pressures towards a smaller/lighter brain (to aid in ease of flight)"
    },
    {
        "subreddit": "science",
        "sentence": "A t-Rex had no such pressures, and could have easily supported a larger brain"
    },
    {
        "subreddit": "science",
        "sentence": "Between that, the size of the brain versus body, and the hundreds of millions of years difference in evolution, it’s a good guess that the t-Rex wasn’t any smarter than your typical lizard/chicken."
    },
    {
        "subreddit": "science",
        "sentence": "You misunderstand"
    },
    {
        "subreddit": "science",
        "sentence": "Why are people with DUIs allowed to keep their license/vehicle? \n\nWhy do we give them a punchcard that says only on the third DUI are there any driving restrictions, and on the 10th is finally jail?"
    },
    {
        "subreddit": "science",
        "sentence": "I dont blame you, i saw him at walmart the other day, he proceeded to drop my pants, pointed at me while laughing and stole my bentley"
    },
    {
        "subreddit": "science",
        "sentence": "I have a peanut allergy and eczema and my son has eczema"
    },
    {
        "subreddit": "science",
        "sentence": "We asked out pediatrician how we should introduce allergens and she gave this spiel that we don't need to do anything special and \"she has been treating kids for over 30 years yada yada\""
    },
    {
        "subreddit": "science",
        "sentence": "We had to go through 4 different ones till we found one that wasn't incompetent  or actually showed up to work enough for us to communicate with them"
    },
    {
        "subreddit": "science",
        "sentence": "USA btw"
    },
    {
        "subreddit": "science",
        "sentence": "Research suggests that the mothers diet also plays a huge role in this"
    },
    {
        "subreddit": "science",
        "sentence": "Interesting tangential thought of my own: Could this be a reason for women craving weird foods when pregnant?"
    },
    {
        "subreddit": "science",
        "sentence": "Interesting! I guess allergist opinions vary on this, since this is what my niece did starting at 9 months and she doesn’t have any allergic symptoms now"
    },
    {
        "subreddit": "science",
        "sentence": "Their doctor said it should absolutely be started before age 1"
    },
    {
        "subreddit": "science",
        "sentence": "A recent paper reported that all the infants in a study who completed this type of protocol had at most a mild reaction to peanuts after, while 7% of the kids aged 1-5 doing the protocol still had more than a mild reaction afterward: https://news.ubc.ca/2022/06/peanut-allergy-treatment-safest-when-started-for-infants-under-12-months/#:~:te"
    },
    {
        "subreddit": "science",
        "sentence": "I just heard from a colleague whose sons friend went to the marines and he was told that 9 recruits from the marine boot camp killed themselves by suicide"
    },
    {
        "subreddit": "science",
        "sentence": "New generation of American kids who grew up with social media and video games are so weak & soft"
    },
    {
        "subreddit": "science",
        "sentence": "God damn"
    },
    {
        "subreddit": "science",
        "sentence": "The US military is doomed"
    },
    {
        "subreddit": "science",
        "sentence": "Standard in the military have decreased so much its ridiculous."
    },
    {
        "subreddit": "science",
        "sentence": "Obesity is like having legs, but choosing not to use them until they're significantly atrophied* (one could stretch an analogy for legs as willpower here).\n\nGLP-1 drugs are like giving that person a wheelchair"
    },
    {
        "subreddit": "science",
        "sentence": "It restores mobility, but doesn't fix the actual problem.\n\nObesity certainly wasn't and isn't irreversible, your own source proves that it is"
    },
    {
        "subreddit": "science",
        "sentence": "It's just not a popular option because it takes self-discipline and sacrificing certain pleasures"
    },
    {
        "subreddit": "science",
        "sentence": "Modern people just can't do that"
    },
    {
        "subreddit": "science",
        "sentence": "*Excepting genuine medical causes, but this is a much smaller % of the population than people seem to think."
    },
    {
        "subreddit": "science",
        "sentence": "As an adult"
    },
    {
        "subreddit": "science",
        "sentence": "When it comes to strangers or muppets"
    },
    {
        "subreddit": "science",
        "sentence": "Muppets will have my support for accurate information."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, chlorine based sanitizers like chlorinated TSP are kinda not great considering you need to thoroughly rinse them.."
    },
    {
        "subreddit": "science",
        "sentence": "But that rinse step is another opportunity for infection!"
    },
    {
        "subreddit": "science",
        "sentence": "And a lot of children over 6, and adults really."
    },
    {
        "subreddit": "science",
        "sentence": "You know how when we bake a cake we follow a recipe? We have to add the flour before the eggs (etc etc)? Well a robot is just like that"
    },
    {
        "subreddit": "science",
        "sentence": "A person has given them instructions to do this before that but lots and lots of this before thats"
    },
    {
        "subreddit": "science",
        "sentence": "So really a robot is just doing what a person says to do"
    },
    {
        "subreddit": "science",
        "sentence": "It's just a very very very complicated recipe.\n\nAt least that is how I explained programming to my kids."
    },
    {
        "subreddit": "science",
        "sentence": "Maybe the kids with peanut allergies then all just died and no one told the kids what happened."
    },
    {
        "subreddit": "science",
        "sentence": "Damn their hubris!"
    },
    {
        "subreddit": "science",
        "sentence": "The doctor told my mom to eat a spoonful of pb everytime she wasn’t feeling good while she was pregnant with me"
    },
    {
        "subreddit": "science",
        "sentence": "Possibly that had an effect on me having anaphylactic reactions"
    },
    {
        "subreddit": "science",
        "sentence": "My theory is the processed peanut snacks are causing it, but i have no scientific proof"
    },
    {
        "subreddit": "science",
        "sentence": "I notice in less “white” countries they don’t seem to have these allergies."
    },
    {
        "subreddit": "science",
        "sentence": "You misunderstood"
    },
    {
        "subreddit": "science",
        "sentence": "You aren't absolved of the DUI, but still get to keep your license."
    },
    {
        "subreddit": "science",
        "sentence": "I bet T-Rex was an ambush hunter"
    },
    {
        "subreddit": "science",
        "sentence": "That is why its front legs are so small"
    },
    {
        "subreddit": "science",
        "sentence": "It would lie in wait on its stomach, It has a roosting bone like a chicken"
    },
    {
        "subreddit": "science",
        "sentence": "Those huge back legs would drive it forwards sliding on its belly with its little arms not getting in the way"
    },
    {
        "subreddit": "science",
        "sentence": "A leg bite to an Apatosaurus could lead to a lethal infection"
    },
    {
        "subreddit": "science",
        "sentence": "T-rex would just have to sit back and wait for its meal"
    },
    {
        "subreddit": "science",
        "sentence": "That is what I see when I look at a T-Rex, an ambush predator"
    },
    {
        "subreddit": "science",
        "sentence": "I don't see it running around like an agile cat"
    },
    {
        "subreddit": "science",
        "sentence": "With a small brain as the article says that is probably all it could handle"
    },
    {
        "subreddit": "science",
        "sentence": "Chasing and stalking require intelligence."
    },
    {
        "subreddit": "science",
        "sentence": "grape juice is terrible nutritionally though"
    },
    {
        "subreddit": "science",
        "sentence": "i don't know why someone would want to feed that to a six month old."
    },
    {
        "subreddit": "science",
        "sentence": "And yet, allergen research out of Japan has linked certain pets with likelihood of certain allergies with strong correlation"
    },
    {
        "subreddit": "science",
        "sentence": "So does this mean that Velociraptors weren't as cunning as we thought? Or they totally still were cause modern raptors are?"
    },
    {
        "subreddit": "science",
        "sentence": "Do you really think we can sustain the current population levels without monoculture farming and synthetic fertilizers...?"
    },
    {
        "subreddit": "science",
        "sentence": "My kid picked up two of my allergies"
    },
    {
        "subreddit": "science",
        "sentence": "Thankfully, not the vast majority of them"
    },
    {
        "subreddit": "science",
        "sentence": "Its been conclusively shown for multiple years that cleanliness of environment or play has 0 impact on allergy development for childen"
    },
    {
        "subreddit": "science",
        "sentence": "I don't understand what you are arguing here"
    },
    {
        "subreddit": "science",
        "sentence": "Is it essentially that no one should trust medical professionals ever because they have recommended things at times and then later on changed those recommendations once new information was uncovered?"
    },
    {
        "subreddit": "science",
        "sentence": "To be clear, it's still an educated guess based on the best available evidence"
    },
    {
        "subreddit": "science",
        "sentence": "10 years from now, we may learn that peanut exposure is still a bad idea (i.e"
    },
    {
        "subreddit": "science",
        "sentence": "the benefits of some fewer number of people with mild allergies is outweighed by the number who may die due to severe allergies and increased likelihood of exposure)\n\nOr we may learn that it doesn't actually make much of a difference.\n\nAnd importantly for some of the people in this thread, that wouldn't render this advice bad or invalid."
    },
    {
        "subreddit": "science",
        "sentence": "Robots don't turn into terrifying rage giants"
    },
    {
        "subreddit": "science",
        "sentence": "More like crocs and lizards *than what?*"
    },
    {
        "subreddit": "science",
        "sentence": "It can, but it doesn't always"
    },
    {
        "subreddit": "science",
        "sentence": "Some allergies get substantially worse with repeated exposure, though many go away.\n\nFurther, it doesn't 'improve' the immune system in a general sense as much as it makes the immune system less likely to see peanut protein as a threat."
    },
    {
        "subreddit": "science",
        "sentence": "This is what I was taught on microbiology"
    },
    {
        "subreddit": "science",
        "sentence": "Can't we mitigate those sources of transmission?"
    },
    {
        "subreddit": "science",
        "sentence": "If they had either of those qualities, they wouldn’t be a danger to begin with."
    },
    {
        "subreddit": "science",
        "sentence": "Lead is definitely doing it to certain generations"
    },
    {
        "subreddit": "science",
        "sentence": "Post polio disease is a bit old now, but it did the same.\n\nCovid’s our generation’s leaded gas tho.\n\nWe really gonna need some train infrastructure."
    },
    {
        "subreddit": "science",
        "sentence": "No worse than the American food classic Peanut Butter and Grape jelly sandwich, staple of American childhoods for decades"
    },
    {
        "subreddit": "science",
        "sentence": "Just thinned out to baby safe consistency."
    },
    {
        "subreddit": "science",
        "sentence": "there was no asteroid....that extinction disaster was all their own work...their experiment went wrong!"
    },
    {
        "subreddit": "science",
        "sentence": "They did find that the last scientists were not as smart as previously claimed."
    },
    {
        "subreddit": "science",
        "sentence": "Taking a selfie while standing on a railway track?"
    },
    {
        "subreddit": "science",
        "sentence": "T-Rex isn't the ancestor of modern birds"
    },
    {
        "subreddit": "science",
        "sentence": "Their evolutionary divergence was earlier than T-Rex."
    },
    {
        "subreddit": "science",
        "sentence": "that was the advice from our doctor"
    },
    {
        "subreddit": "science",
        "sentence": "No peanut, no honey before 12 months."
    },
    {
        "subreddit": "science",
        "sentence": "My pediatrician gave us a list of foods to put into liquid form and feed in her bottle between 4 and 6 months, then gave us a list of things to mix with baby oatmeal from 6-9 months"
    },
    {
        "subreddit": "science",
        "sentence": "It included making a peanut butter paste with formula, early in the day in case there was a reaction that required medical care"
    },
    {
        "subreddit": "science",
        "sentence": "She said this was both to prevent allergies and also to test if any allergies were already there."
    },
    {
        "subreddit": "science",
        "sentence": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science"
    },
    {
        "subreddit": "science",
        "sentence": "However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**"
    },
    {
        "subreddit": "science",
        "sentence": "Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise"
    },
    {
        "subreddit": "science",
        "sentence": "[Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/grimisgreedy  \nPermalink: https://royalsocietypublishing.org/doi/10.1098/rspb.2024.0537\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "What do i do with this information?"
    },
    {
        "subreddit": "science",
        "sentence": "We asked our allergist about this, and that's not exactly how exposure therapy works, at least not for peanuts.\n\nYou can start it any time during childhood"
    },
    {
        "subreddit": "science",
        "sentence": "Our allergist wouldn't do it before 5 because he says he has incredibly low success rates with children who start early because the instructions are tough to follow with young children"
    },
    {
        "subreddit": "science",
        "sentence": "Even with older children, it has limited success because it's not fun.\n\nThe kid has to eat the food, and then they have to just sit there for a while (hence why it's hard for young children)"
    },
    {
        "subreddit": "science",
        "sentence": "But they can't sleep for a while after"
    },
    {
        "subreddit": "science",
        "sentence": "And they can't go to school for a while after"
    },
    {
        "subreddit": "science",
        "sentence": "They have to be watched by a parent or guardian in case of severe reaction"
    },
    {
        "subreddit": "science",
        "sentence": "Any physical activity increases risk of anaphylaxis"
    },
    {
        "subreddit": "science",
        "sentence": "Anaphylaxis might occur, and then you have to go to the hospital and do the whole shebang there.\n\nAnd the kid feels miserable"
    },
    {
        "subreddit": "science",
        "sentence": "Because they DO react, even if it's not severe.\n\nAfter a while, the body becomes less dramatic about its reactions, but it still never LIKES the food.\n\nAnd they have to do it daily for probably the rest of their lives to keep their reaction minimal.\n\nThe whole point of it isn't to erase the allergy"
    },
    {
        "subreddit": "science",
        "sentence": "That never goes away"
    },
    {
        "subreddit": "science",
        "sentence": "It's to minimize the chances of anaphylaxis upon exposure."
    },
    {
        "subreddit": "science",
        "sentence": "So they probably DIDN’T wear laser hats then?"
    },
    {
        "subreddit": "science",
        "sentence": "A brain the size of a walnut!"
    },
    {
        "subreddit": "science",
        "sentence": "Maybe OP is convinced functional immortality is right around the corner, and, by the same logic, is worried about his star sign."
    },
    {
        "subreddit": "science",
        "sentence": "Eat healthy food: get sick.\n\nEat garbage fast food: enjoy it, and get fat and then get sick.\n\nSeems like it’s all just good business for the medical industry."
    },
    {
        "subreddit": "science",
        "sentence": "Kinda terrifying to imagine something so dumb and large"
    },
    {
        "subreddit": "science",
        "sentence": "If the baby is breast-fed, and the mother is consuming peanut foods, then the baby is exposed second-hand, so to speak, through breast milk."
    },
    {
        "subreddit": "science",
        "sentence": "It's likely by the time they get much older AI will be the source of information for most"
    },
    {
        "subreddit": "science",
        "sentence": "Silibinin (INN), also known as silybin (both from Silybum, the generic name of the plant from which it is extracted), is the major active constituent of silymarin, a standardized extract of the milk thistle, containing a mixture of flavonolignans consisting of silibinin, isosilibinin, silychristin, silidianin, and others"
    },
    {
        "subreddit": "science",
        "sentence": "Silibinin itself is a mixture of two diastereomers, silybin A and silybin B, in approximately equimolar ratio.[1] Silibinin is used in pure forms as a medication, and more frequently as an active ingredient in milk thistle–derived herbal supplements"
    },
    {
        "subreddit": "science",
        "sentence": "- ripped from Wikipedia because I thought it sounded familiar"
    },
    {
        "subreddit": "science",
        "sentence": "Milk thistle just as I thought."
    },
    {
        "subreddit": "science",
        "sentence": "Indeed it can be a slippery slope."
    },
    {
        "subreddit": "science",
        "sentence": "I wish people understood this nuance"
    },
    {
        "subreddit": "science",
        "sentence": "It's led to so much judgment now when kids have allergies, as early introduction of allergens has been advised for about a decade now, so some people assume that parents with kids with allergies intentionally didn't listen to doctors and \"gave\" our kids allergies.\n\nUnfortunately, allergies can develop at any time, even after repeat exposures with no reaction"
    },
    {
        "subreddit": "science",
        "sentence": "My son ate peanut products for three months with no issue, then reacted one day"
    },
    {
        "subreddit": "science",
        "sentence": "Because he'd eaten no new foods, he had to go through a whole panel of blood tests to eliminate every single food he ate that day"
    },
    {
        "subreddit": "science",
        "sentence": "Sure enough, peanuts.\n\nI know people who've developed peanut and tree nut allergies as adults after eating them all the time for decades leading up to it."
    },
    {
        "subreddit": "science",
        "sentence": "It’s made to sell ads"
    },
    {
        "subreddit": "science",
        "sentence": "That a byproduct is letting you chat with your family its a happy accident"
    },
    {
        "subreddit": "science",
        "sentence": "Bruh i just said i dont get in the car with them"
    },
    {
        "subreddit": "science",
        "sentence": "I dont know what your agenda is here but its really weird."
    },
    {
        "subreddit": "science",
        "sentence": "No kidding"
    },
    {
        "subreddit": "science",
        "sentence": "Thomas J can’t see without his glasses!"
    },
    {
        "subreddit": "science",
        "sentence": "The kids could have just died from exposure at a young age"
    },
    {
        "subreddit": "science",
        "sentence": "Not exactly something people talk about so how would you know."
    },
    {
        "subreddit": "science",
        "sentence": "There is some good science that suggests obesity in mid life leads to cognitive decline in older people:\n\nhttps://www.cambridge.org/core/journals/proceedings-of-the-nutrition-society/article/relationship-between-obesity-and-cognitive-health-and-decline/8D58FA03B576F4E4A2AB18208930192B\n\nThere is also some science suggesting obesity can make you dumber in earlier life as well"
    },
    {
        "subreddit": "science",
        "sentence": "It is not so strong as the evidence linking obesity to heart disease or various cancers, but it is compelling."
    },
    {
        "subreddit": "science",
        "sentence": "That does it"
    },
    {
        "subreddit": "science",
        "sentence": "I grow much of my own lettuce, and that which I buy I will cook, Chinese-style."
    },
    {
        "subreddit": "science",
        "sentence": "What in the world was filling in the rest of their skulls if not the brain case? Those skulls are massive! And that thing is tiny!"
    },
    {
        "subreddit": "science",
        "sentence": "huh, i was diagnosed eczema as a baby and i don't have any food allergies"
    },
    {
        "subreddit": "science",
        "sentence": "it does seem like the whole area isn't talked about very much though"
    },
    {
        "subreddit": "science",
        "sentence": "A recent study found that they were one of the two leading sources - Very surprisingly to me, and I suspect many others"
    },
    {
        "subreddit": "science",
        "sentence": "It's certainly something."
    },
    {
        "subreddit": "science",
        "sentence": "Ahh gotcha yes that used to be a common practice, I believe the criteria is that if the baby can sit up unassisted they can begin solids"
    },
    {
        "subreddit": "science",
        "sentence": "Birds of the Corvidae family"
    },
    {
        "subreddit": "science",
        "sentence": "Crocodiles are pretty smart for reptiles"
    },
    {
        "subreddit": "science",
        "sentence": "But then again, they're reptiles."
    },
    {
        "subreddit": "science",
        "sentence": "> Composted material is soil,\n\nIt is not"
    },
    {
        "subreddit": "science",
        "sentence": "It's compost"
    },
    {
        "subreddit": "science",
        "sentence": "It can be added to soil, but it is not soil itself."
    },
    {
        "subreddit": "science",
        "sentence": "Tea ball for the win!"
    },
    {
        "subreddit": "science",
        "sentence": "Of course allergies are inherited."
    },
    {
        "subreddit": "science",
        "sentence": "> Soil is a mix of approximately 45% mineral, 5% organic matter, 20-30% water, and 20-30% air.\n\nNo"
    },
    {
        "subreddit": "science",
        "sentence": "There are many kinds of soils, some contain mostly organic materials, some mostly mineral, most somewhere in-between.\n\nCompost isn't soil, but it's not because it's mostly organic material"
    },
    {
        "subreddit": "science",
        "sentence": "It's because it's not part of a consolidated matrix of materials deposited through various forms of transport (e.g"
    },
    {
        "subreddit": "science",
        "sentence": "alluvial, fluvial, colluvial, and aeolian processes) and chemically modified over time through weathering and decomposition."
    },
    {
        "subreddit": "science",
        "sentence": "I'm American"
    },
    {
        "subreddit": "science",
        "sentence": "I hosted many foreign exchange students from Asia over the years, and they are always amazed when I first serve a green salad, ha ha"
    },
    {
        "subreddit": "science",
        "sentence": "They tell me they've never eaten raw lettuce!"
    },
    {
        "subreddit": "science",
        "sentence": "Plastic is practically non-recyclable too"
    },
    {
        "subreddit": "science",
        "sentence": "Guess who paid the most to advertise its recycleability to paint it as an environmentally sound product:  Surprise, oil companies (one in particular if I recall)."
    },
    {
        "subreddit": "science",
        "sentence": "Most produce like bell peppers is already zapped before reaching store shelves"
    },
    {
        "subreddit": "science",
        "sentence": "My understanding is that leafy greens can’t be zapped the way tomatoes and peppers can"
    },
    {
        "subreddit": "science",
        "sentence": "Not so sure either way."
    },
    {
        "subreddit": "science",
        "sentence": "Isn’t it more likely that had the same type of neurons as birds and was therefore more intelligent than a crocodile?"
    },
    {
        "subreddit": "science",
        "sentence": "Less than an owl, more than a pidgeon"
    },
    {
        "subreddit": "science",
        "sentence": "Belongs in r/fuckcars"
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, I believe that was the suggestion made by the study that this study is refuting"
    },
    {
        "subreddit": "science",
        "sentence": "I believe one of the authors of the that study suggesting T-rex was very intelligent, has made rebuttals to this current study, pointing out flaws."
    },
    {
        "subreddit": "science",
        "sentence": "Yep, it's an only open access publisher meaning you have to fork out 2000+ USD, It's chinese owned registered in Switzerland to pretend it's more reputable"
    },
    {
        "subreddit": "science",
        "sentence": "They have more special issues than regular issues (cause they engage a naive junior researcher as guest editor which in turn askes their contacts to publish in this special issue), they keep the peer review lax so it's basically a pay to publish system unless there is something reallly realllly bad"
    },
    {
        "subreddit": "science",
        "sentence": "Some universities don't count MDPI papers in their performance reviews of academics"
    },
    {
        "subreddit": "science",
        "sentence": "This specific paper for example has no real novelty, wouldn't be published in any serious journal.\nDoesn't mean sll MDPI papers are bad, but it raises a few eyebrows as to why it wasn't published in more reputable journals."
    },
    {
        "subreddit": "science",
        "sentence": "So did a lot of dinosaurs"
    },
    {
        "subreddit": "science",
        "sentence": "They were around approximately 165 million years."
    },
    {
        "subreddit": "science",
        "sentence": "Herds often include both cows & steers"
    },
    {
        "subreddit": "science",
        "sentence": "Unless it's a dairy farm, in which case they often sell off the males."
    },
    {
        "subreddit": "science",
        "sentence": "Well, that certainly is a bold claim."
    },
    {
        "subreddit": "science",
        "sentence": "My son was born in 2019 but my pediatrician still hust waves it off as most kids have eczema, or his wasn't the worst she's seen"
    },
    {
        "subreddit": "science",
        "sentence": "He wakes up from sleep scratching and sometimes his genitals are so inflamed he has to walk around semi-naked to get comfortable.\n\nI certainly think this needs to be put out there more especially with research showing allergies are going to become more common with climate change."
    },
    {
        "subreddit": "science",
        "sentence": "The whole concept of quantitative intelligence doesn’t even work that well with creatures that are alive today and can answer questions"
    },
    {
        "subreddit": "science",
        "sentence": "And you’re right; what matters is the T"
    },
    {
        "subreddit": "science",
        "sentence": "rex was huge, had a ridiculous bite force, and could probably smell its prey several kilometres away"
    },
    {
        "subreddit": "science",
        "sentence": "How smart was it?  Smart enough."
    },
    {
        "subreddit": "science",
        "sentence": "Especially Crows."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, I remember it being presented like relatively new advice when I had my baby in 2015, but I didn't realise until this thread exactly HOW new it was at that time!"
    },
    {
        "subreddit": "science",
        "sentence": "Dinosaurs were around for hundreds of millions of years"
    },
    {
        "subreddit": "science",
        "sentence": "Evolution doesn’t work towards some end goal, but allows changes based on environmental pressures."
    },
    {
        "subreddit": "science",
        "sentence": "My son was born in 2016 and had eczema - turns out he had a bunch of allergies including peanuts (he's outgrown them all except peanuts) but we had no idea about the link between eczema in babies and allergies until AFTER he'd reacted to peanuts and we saw a pediatric allergist"
    },
    {
        "subreddit": "science",
        "sentence": "I think the messaging has gotten a lot more clear in the last couple of years, thankfully, but I've still had to tell at least a few people about introducing allergens early."
    },
    {
        "subreddit": "science",
        "sentence": "100% agree, hopefully once autonomous vehicals are figured out we can completely restore that autonomy to the elderly at low cost"
    },
    {
        "subreddit": "science",
        "sentence": "It's crazy how little we know about it and how it might still have bacteria in It's atmosphere."
    },
    {
        "subreddit": "science",
        "sentence": "they did, but dinosaurs had tens of millions of years to get smarter than their reptile ancestors themselves, predation and social behaviors tend to select for intelligence through natural and sexual selection"
    },
    {
        "subreddit": "science",
        "sentence": "Lions, dolphins and apes are smarter than their prey."
    },
    {
        "subreddit": "science",
        "sentence": "I would imagine the bags labeled as compostable should not have PFAS? But yes generally tea bags aren’t that friendly to the environment."
    },
    {
        "subreddit": "science",
        "sentence": "Oh"
    },
    {
        "subreddit": "science",
        "sentence": "So nightmarishly horrifying beyond all comprehension, at least when not in a meat coma under clouds of flies."
    },
    {
        "subreddit": "science",
        "sentence": "My experience in the 80s and 90s was anything but sterile environments"
    },
    {
        "subreddit": "science",
        "sentence": "Not only were we encouraged to get outside and play in dirt, in the 80s and early 90s Pox Parties were still a thing, where parents would intentionally expose their kids to chicken pox."
    },
    {
        "subreddit": "science",
        "sentence": "Thanks, I love you!"
    },
    {
        "subreddit": "science",
        "sentence": "Birds have very small brains but high neuron density, making many of them very smart"
    },
    {
        "subreddit": "science",
        "sentence": "Since T-rex is their ancestor, it could be the same."
    },
    {
        "subreddit": "science",
        "sentence": "Could be both!\n\n\n  In lighter doses I find the experience sort of musical and insightful rather than a full exodus into the technicolored void.  \n\n\nHowever If you really want to f around and find out you may very well wind up being tortured and vivisected by a spiraling whirlwind of eyes and then sent into a spaceship for brain surgery.  Happened to me hehe.  \n\n\nI definitely am done with heroic doses of the stuff.  Its a wee bit much for the psyche.  Follow your heart and if ya do try it start small.  Assuming you're not flying to South America to do it heh."
    },
    {
        "subreddit": "science",
        "sentence": "I don't know if I get that right"
    },
    {
        "subreddit": "science",
        "sentence": "But if u feel uneasy being in a relationship with someone thats your right to get out of that relationship"
    },
    {
        "subreddit": "science",
        "sentence": "You can at the same time have sympathy with their struggles, u don't have  to of course.\nThat said: people with dependent behavior can have working relationships and work through their struggles at the same time (with or without therapy and therapy can help a lot most of the time)"
    },
    {
        "subreddit": "science",
        "sentence": "Butbthis is only if they have a supportive understanding partner"
    },
    {
        "subreddit": "science",
        "sentence": "And that obviously needs to be a consenting partnership otherwise it deepens both their burdens; the partners and the dependent persons burden"
    },
    {
        "subreddit": "science",
        "sentence": "It can be a very slippery slope."
    },
    {
        "subreddit": "science",
        "sentence": "Nuance is tough"
    },
    {
        "subreddit": "science",
        "sentence": "This is mildly infuriating"
    },
    {
        "subreddit": "science",
        "sentence": "My pediatrician didn't mention this at all and my son had horrible eczema from birth basically"
    },
    {
        "subreddit": "science",
        "sentence": "He has been allergic to every major group and so far has only outgrown dairy and eggs."
    },
    {
        "subreddit": "science",
        "sentence": "Let me introduce you to Ready, Set, Food"
    },
    {
        "subreddit": "science",
        "sentence": "Powdered doses that you can add to breast milk or formula, that incrementally increases exposure to common allergens. \n\n\nhttps://readysetfood.com/?gad_source=1&gclid=CjwKCAjwgdayBhBQEiwAXhMxtoRWZXH-nVk42CpJMW7W96-SQXTWd5q3ABCmE37_IshEcZk-umRvDRoCx7UQAvD_BwE"
    },
    {
        "subreddit": "science",
        "sentence": "I should really RTFA but this is reddit, we glue our pizza cheese here"
    },
    {
        "subreddit": "science",
        "sentence": "Different similar sorts of animals seem to tend to have brains proportional to their body size with what we'd consider their intelligence being greater when that ratio is tilted more brain-wise than typical for a crocodile or seed-eating bird or ungulate or what have you"
    },
    {
        "subreddit": "science",
        "sentence": "Somehow they've come to an expected value for trex and the actual brain measurements are on the low end of what they would expect"
    },
    {
        "subreddit": "science",
        "sentence": "It's kinda muddy"
    },
    {
        "subreddit": "science",
        "sentence": "On the one hand, I can imagine dumb trex, and other dumb dinos"
    },
    {
        "subreddit": "science",
        "sentence": "Just meat processing factories turning herbivores into energy"
    },
    {
        "subreddit": "science",
        "sentence": "It's an easy answer that might be right"
    },
    {
        "subreddit": "science",
        "sentence": "At the same time, there are mighty smart birds with tiny brains that do things they shouldn't be able to, by trex estimates"
    },
    {
        "subreddit": "science",
        "sentence": "So what's right - brain size dictates smarts or smarts defy brain size? \n\nThe anaconda still lives and it is dumb as bricks"
    },
    {
        "subreddit": "science",
        "sentence": "The crow lives and we should fear it"
    },
    {
        "subreddit": "science",
        "sentence": "Idk"
    },
    {
        "subreddit": "science",
        "sentence": "I don't know that I would buy any study that told me one way or the other about trex, or any other dinosaur, and imagined their intelligences"
    },
    {
        "subreddit": "science",
        "sentence": "I don't think we can know."
    },
    {
        "subreddit": "science",
        "sentence": "If we do that, we can say goodbye to 90%+ of our current population"
    },
    {
        "subreddit": "science",
        "sentence": "So thaaaat's not an option."
    },
    {
        "subreddit": "science",
        "sentence": "Beyond that, we(In the USA) have no robust support networks outside of immediate family/friends who can support them once they can't drive anymore"
    },
    {
        "subreddit": "science",
        "sentence": "Even if they're in modestly good health (not obese, heart problems, acute care needs) the problem most of the time is they can't get to the multitude of doctors appointments and to places for RX pick up etc"
    },
    {
        "subreddit": "science",
        "sentence": "Once they can't drive it's a life of support from siblings, or offspring/grand-offspring"
    },
    {
        "subreddit": "science",
        "sentence": "That or pay crazy money for ubers and taxi's everywhere if they've got the gumption to deal with that"
    },
    {
        "subreddit": "science",
        "sentence": "Medicare/medicade should have a solid well funded taxi/shuttle service for those who are no longer able to drive themselves, at no cost."
    },
    {
        "subreddit": "science",
        "sentence": "Land of the Lost, Will Farrell said Trexs have brains the size of a walnut"
    },
    {
        "subreddit": "science",
        "sentence": "Thats where I got the perception from at least."
    },
    {
        "subreddit": "science",
        "sentence": "I believe the research is saying consistent exposure up until the age of 5, not just a tip once off"
    },
    {
        "subreddit": "science",
        "sentence": "Maybe I’m stupid, but aren’t crow brains technically really small and considered one of the smartest animals? How could we possibly deduce from brain cavity if an animal is smart or not?"
    },
    {
        "subreddit": "science",
        "sentence": "Also be sure to drink red wine every day."
    },
    {
        "subreddit": "science",
        "sentence": "My post was specifically addressing its parent comment, about feeding babies anything but milk until 6 months."
    },
    {
        "subreddit": "science",
        "sentence": "Yep."
    },
    {
        "subreddit": "science",
        "sentence": "milwaukee did that all over"
    },
    {
        "subreddit": "science",
        "sentence": "It's terrible."
    },
    {
        "subreddit": "science",
        "sentence": "Here’s a fun fact"
    },
    {
        "subreddit": "science",
        "sentence": "My mom (clearly experiencing cognitive decline) failed the written driver’s license renewal 3 times"
    },
    {
        "subreddit": "science",
        "sentence": "The CA state DMV offers an online no fail version of the test for seniors"
    },
    {
        "subreddit": "science",
        "sentence": "So, she could take it until she passed"
    },
    {
        "subreddit": "science",
        "sentence": "She absolutely shouldn’t be driving anymore, but now feels empowered because “the DMV did the right thing and reinstated her license”"
    },
    {
        "subreddit": "science",
        "sentence": "I do not recall asserting that"
    },
    {
        "subreddit": "science",
        "sentence": "Most people are not subscribed to the AAP Newsletter nor are they exposed to much of that information, unless indirectly thru their child’s pediatrician"
    },
    {
        "subreddit": "science",
        "sentence": "I was speaking of advertisers and news, specifically in the United States, which nearly everyone is exposed to"
    },
    {
        "subreddit": "science",
        "sentence": "Food AND medicine is big business in America, unfortunately doctors, hospitals and healthcare conglomerates are lobbied the exact same way and even more transparently than politicians in this country"
    },
    {
        "subreddit": "science",
        "sentence": "Healthcare professionals and institutions can and have been bought by lobbyists and product representatives from the pharmaceutical companies"
    },
    {
        "subreddit": "science",
        "sentence": "See the completely manufactured opioid crisis in this country."
    },
    {
        "subreddit": "science",
        "sentence": "It should be noted that a basal style brain anatomy doesn't necessarily mean that the T"
    },
    {
        "subreddit": "science",
        "sentence": "Rex couldn't engage in complex behaviour or decision making.\n\nCrocodiles for example have excellent pattern recognition skills to aid in their ambush hunting tactics and are also capable of being trained to do basic commands."
    },
    {
        "subreddit": "science",
        "sentence": "Or blocking private investments."
    },
    {
        "subreddit": "science",
        "sentence": "Corvids and parrots small brains can have high cognition via high neuronal density - so it's seems like dinosaurs could be more intelligent than expected if they also had higher densities.\n\n> Corvids and some parrots are capable of cognitive feats comparable to those of great apes"
    },
    {
        "subreddit": "science",
        "sentence": "How do birds achieve impressive cognitive prowess with walnut-sized brains?...brains of songbirds and parrots contain very large numbers of neurons, at neuronal densities considerably exceeding those found in mammals"
    },
    {
        "subreddit": "science",
        "sentence": "Because these “extra” neurons are predominantly located in the forebrain, large parrots and corvids have the same or greater forebrain neuron counts as monkeys with much larger brains"
    },
    {
        "subreddit": "science",
        "sentence": "[ref](https://www.pnas.org/syndication/doi/10.1073/pnas.1517131113)"
    },
    {
        "subreddit": "science",
        "sentence": "They literally did give their kids peanuts, though."
    },
    {
        "subreddit": "science",
        "sentence": "Your local home brewer would correct you that they usually use StarSan and not bleach since any chlorine taste is the enemy of a tasty beer"
    },
    {
        "subreddit": "science",
        "sentence": "They would also correct you that sterilization is not something a home brewer cares about, and instead is focused on sanitization.\n\nLove, \nHome Brewer of 12 years"
    },
    {
        "subreddit": "science",
        "sentence": "I  remember my grandmother telling me she felt like she had \"dirt\" in her brain"
    },
    {
        "subreddit": "science",
        "sentence": "A physical sensation"
    },
    {
        "subreddit": "science",
        "sentence": "This was at a stage where she pretended to remember who I was."
    },
    {
        "subreddit": "science",
        "sentence": "Is mdpi known for this??"
    },
    {
        "subreddit": "science",
        "sentence": "they should start treating psychotics with sauna therapy\n\n\"hot and bothered\""
    },
    {
        "subreddit": "science",
        "sentence": "That sounds like just a long way of saying 'lives in the inner city'"
    },
    {
        "subreddit": "science",
        "sentence": "Interesting that this research has only been around since recent years"
    },
    {
        "subreddit": "science",
        "sentence": "I had my kids in the late 2010's, and by that point, the advice to expose your kids to peanut when they are starting solid food had already been around for a bit, so I assumed it was older advice."
    },
    {
        "subreddit": "science",
        "sentence": "I knew vegetables.were bad news"
    },
    {
        "subreddit": "science",
        "sentence": "Best avoided."
    },
    {
        "subreddit": "science",
        "sentence": "Your post has been removed because it is a repost of an [already submitted and popular story](https://www.reddit.com/r/science/comments/1cws3rd/single_brain_implant_gives_paralyzed_man/) and is therefore in violation of [Submission Rule #2c](https://www.reddit.com/r/science/wiki/rules/#wiki_c._reposts).\n\nIf your submission is scientific in nature and hasn't already been shared, consider reposting in our sister subreddit r/EverythingScience.\n\n_If you believe this removal to be unwarranted, or would like further clarification, please don't hesitate to [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fscience&subject=No%20summaries%20of%20summaries%2C%20rehosts%2C%20or%20reposts)._"
    },
    {
        "subreddit": "science",
        "sentence": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science"
    },
    {
        "subreddit": "science",
        "sentence": "However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**"
    },
    {
        "subreddit": "science",
        "sentence": "Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise"
    },
    {
        "subreddit": "science",
        "sentence": "[Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/nbcnews  \nPermalink: https://www.nbcnews.com/news/latino/bilingual-ai-brain-implant-spanish-english-stroke-patient-rcna154295\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "Hasn’t this been known for awhile? My kids are in their mid and late teens and when they were babies / toddlers our pediatrician told us to do this"
    },
    {
        "subreddit": "science",
        "sentence": "I just mentioned New York City since it has the most Jews in one city in the world"
    },
    {
        "subreddit": "science",
        "sentence": "So the American Association of Pediatrics, which until 2015 advised that young children avoid peanuts and other allergens, is a non-scientific marketing body? No"
    },
    {
        "subreddit": "science",
        "sentence": "Sometimes ‘science’ is premature, studies are poorly designed, conclusions are inaccurate"
    },
    {
        "subreddit": "science",
        "sentence": "I’m pretty sure “but public transportation doesn’t exist” is not a valid get out of DUI card with any police officer"
    },
    {
        "subreddit": "science",
        "sentence": "Do you think they care, if you’re being a danger on the roads?"
    },
    {
        "subreddit": "science",
        "sentence": "I am always fascinated by these fabulous descriptions of psychedelic trips! \n\nI have been using psilocybin for depression for 4 years"
    },
    {
        "subreddit": "science",
        "sentence": "My first time was a psychedelic dose (not heroic dose) and I just hated the experience"
    },
    {
        "subreddit": "science",
        "sentence": "It has solidly helped with my depression"
    },
    {
        "subreddit": "science",
        "sentence": "One of the things I discovered is that my depression has an element of physical disturbances"
    },
    {
        "subreddit": "science",
        "sentence": "It’s REALLY helps with rumination! \n\nI say all of this because I really want to try ayahuasca, but I’m kinda nervous that I’m going to hate it and so I’m hesitant"
    },
    {
        "subreddit": "science",
        "sentence": "I want the technicolor dream journey but I’m afraid I’ll be in hell."
    },
    {
        "subreddit": "science",
        "sentence": "Certain food, with certain ingredients, and excluding many ingredients.\n\nPeople running around feeding their kid JIFF aren't helping their kids."
    },
    {
        "subreddit": "science",
        "sentence": "Modern birds have had something like 66 million more years of evolution to get smarter."
    },
    {
        "subreddit": "science",
        "sentence": "Peanut allergies are still rare in the gen pop so your lack of exposing your children to peanut does not negate the evidence it just means your children were never predisposed to having peanut allergies which is awesome"
    },
    {
        "subreddit": "science",
        "sentence": "Those bastards were on the verge of cold fusion when the asteroid hit."
    },
    {
        "subreddit": "science",
        "sentence": "Is this because they are dead by thirteen?"
    },
    {
        "subreddit": "science",
        "sentence": "Well, yes, but no."
    },
    {
        "subreddit": "science",
        "sentence": "Is it even possible to measure cortical neurons from fossilized brains? Given that that's the current metric of how we define \"animal intelligence?\""
    },
    {
        "subreddit": "science",
        "sentence": "Reporting bias plays a part; I know a number of people who were at school with me in the 80s who swear that \"no-one at my school had food allergies\""
    },
    {
        "subreddit": "science",
        "sentence": "Yes, they did, Susan - I spent an afternoon in A&E instead of lessons with you because of them"
    },
    {
        "subreddit": "science",
        "sentence": "Interestingly, I was fed one of the foods that I'm allergic to (peas) from a very young age and didn't eat the other one (lentils) until I was 19, so expose doesn't seem to have played much of a part in my case"
    },
    {
        "subreddit": "science",
        "sentence": "Also interestingly, I'm not allergic to peanuts even though they're the same family as peas and I had no exposure to them as a child"
    },
    {
        "subreddit": "science",
        "sentence": "I don't like them much, but I can eat them."
    },
    {
        "subreddit": "science",
        "sentence": "If memory serves Israel has the lowest rate of peanut allergies in the world, anecdotally it was viewed that a common food called Bamba (puffed peanut snack) made out of peanuts was the reason"
    },
    {
        "subreddit": "science",
        "sentence": "Children would choose the bear.\n\n*\\*sad noises\\**"
    },
    {
        "subreddit": "science",
        "sentence": "Potentially both"
    },
    {
        "subreddit": "science",
        "sentence": "My husband has a handful of food allergies, none super severe (but that can change)"
    },
    {
        "subreddit": "science",
        "sentence": "Our pediatrician told us that allergies generally aren't considered inherited, but being *prone* to allergies can be"
    },
    {
        "subreddit": "science",
        "sentence": "Basically \"don't expect your kid to be allergic to tree nuts but don't be too surprised if they're allergic to *something* common.\""
    },
    {
        "subreddit": "science",
        "sentence": "One of the reasons I love Wikipedia so much is that to me it is like the embodiment of The Hitchhiker’s Guide To The Galaxy"
    },
    {
        "subreddit": "science",
        "sentence": "I never excelled in school"
    },
    {
        "subreddit": "science",
        "sentence": "I am not very good with the structure of learning but Wikipedia has allowed me to find information on numerous topics and interests that have lead me to deeper explorations of topics and helped to unlock a world that I thought I did not belong in.\n\nI am not an academic or researcher so my experience and utilization of Wikipedia is almost purely for knowledge for the sake of knowledge"
    },
    {
        "subreddit": "science",
        "sentence": "I understand that a big part of all levels of education is being about to source and present credible arguments using established sources but Wikipedia, to me, has been like a different avenue to an entire existence that I thought was inaccessible to me ( I was just never able to learn or write using the same methods that seemed to work well for my peers.) \n\nAll of this is to say that I understand why you still caution against using Wikipedia as a credible source and I wanted to defend it as a non traditional avenue of exploration for people who may have been left out by more traditional aspects of education.\n\nI find that is has tremendous utility and that the community is dedicated to the pursuit of approaching truth"
    },
    {
        "subreddit": "science",
        "sentence": "I use this phrase because while facts exist the modern era has shown that the pursuit of truth is a constant struggle inside and outside of science and academia"
    },
    {
        "subreddit": "science",
        "sentence": "And as knowledge constantly seeks to update itself so do people try to corrupt the pursuit and subvert understanding to cultivate power, which if you look at the discussion parts of Wikipedia you will find can be really volatile"
    },
    {
        "subreddit": "science",
        "sentence": "And since our culture puts so little value on the pursuit of knowledge and puts such a high premium and monetary hurdle on knowledge especially after high school to the point where it isn’t cost effective or popular to seek it Wikipedia has always provided me a mostly reliable avenue to free myself from the chains of common thought which generally seems to be steeped in tradition, assumption, bias, morality and mythology"
    },
    {
        "subreddit": "science",
        "sentence": "As someone who is forever scatterbrained I will always appreciate Wikipedia’s accessibility and commitment to annotation and perspective and knowledge."
    },
    {
        "subreddit": "science",
        "sentence": "I’m 40"
    },
    {
        "subreddit": "science",
        "sentence": "I was the only kid in the school with a peanut allergy"
    },
    {
        "subreddit": "science",
        "sentence": "I was also exposed to it lots as a small child"
    },
    {
        "subreddit": "science",
        "sentence": "My mum ate it the entire time she was pregnant with me"
    },
    {
        "subreddit": "science",
        "sentence": "They found out I was allergic when some peanut m&ms made me violently ill as a toddler.\nSo I guess I’m just the statistical baseline that would have ended up allergic no matter what"
    },
    {
        "subreddit": "science",
        "sentence": "Luckily my own kids don’t really have any food allergies."
    },
    {
        "subreddit": "science",
        "sentence": "Or if you do buy boxes of mixed greens, get them from hydroponic growers."
    },
    {
        "subreddit": "science",
        "sentence": "I think it’s more quick and easy just to eat something prepared quickly,  for the whole day"
    },
    {
        "subreddit": "science",
        "sentence": "When I sold a business that took up my whole day, I went into an eight month funk"
    },
    {
        "subreddit": "science",
        "sentence": "I would only eat when I was dizzy from not eating."
    },
    {
        "subreddit": "science",
        "sentence": "Uh"
    },
    {
        "subreddit": "science",
        "sentence": "We can get them at Target, here in Minnesota."
    },
    {
        "subreddit": "science",
        "sentence": "There it is"
    },
    {
        "subreddit": "science",
        "sentence": "The root of the problem."
    },
    {
        "subreddit": "science",
        "sentence": "Poisoned: The Dirty Truth About Your Food"
    },
    {
        "subreddit": "science",
        "sentence": "Yeah"
    },
    {
        "subreddit": "science",
        "sentence": "Unfortunately that advice was never based in science"
    },
    {
        "subreddit": "science",
        "sentence": "It was one dude making the recommendation and for some reason it spread like wildfire."
    },
    {
        "subreddit": "science",
        "sentence": "Zoning is a big issue for that too, there are no local bars in areas zoned for housing."
    },
    {
        "subreddit": "science",
        "sentence": "…my ADHD would find this very useful."
    },
    {
        "subreddit": "science",
        "sentence": "Agreed, we need to retest 16-25 year olds every single year as they are a *terrible* age group for accidents"
    },
    {
        "subreddit": "science",
        "sentence": "You have to get to 80 year olds before you match their accident statistics.\n\nOh, whoops, that's not what you meant, now was it?"
    },
    {
        "subreddit": "science",
        "sentence": "It depends on what you’re being exposed to"
    },
    {
        "subreddit": "science",
        "sentence": "Some things do boost your immune system and help develop it"
    },
    {
        "subreddit": "science",
        "sentence": "But other things can damage your immune system and other aspects of health and development.\n\nThat’s one reason the “Old Friends”hypothesis has become more widely accepted to explain allergies, as opposed to the hygiene hypothesis that doesn’t really account for more damaging exposures we’ve reduced through better hygiene."
    },
    {
        "subreddit": "science",
        "sentence": "Never lived in NYC, so I don't know what the local grocery situation is, but Wegmans carried it in upstate NY"
    },
    {
        "subreddit": "science",
        "sentence": "Looks like Target also has it available online and at some of their stores in NYC"
    },
    {
        "subreddit": "science",
        "sentence": "In Florida Walmart, Target and Publix all carry it."
    },
    {
        "subreddit": "science",
        "sentence": "The point of \"paper\" containers? Shipping weight & I believe production costs."
    },
    {
        "subreddit": "science",
        "sentence": "Your post has been removed because it is a repost of an [already submitted and popular story](https://www.reddit.com/r/science/comments/1czoicb/new_evidence_shows_that_drinking_unpasteurized/) and is therefore in violation of [Submission Rule #2c](https://www.reddit.com/r/science/wiki/rules/#wiki_c._reposts).\n\nIf your submission is scientific in nature and hasn't already been shared, consider reposting in our sister subreddit r/EverythingScience.\n\n_If you believe this removal to be unwarranted, or would like further clarification, please don't hesitate to [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fscience&subject=No%20summaries%20of%20summaries%2C%20rehosts%2C%20or%20reposts)._"
    },
    {
        "subreddit": "science",
        "sentence": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science"
    },
    {
        "subreddit": "science",
        "sentence": "However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**"
    },
    {
        "subreddit": "science",
        "sentence": "Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise"
    },
    {
        "subreddit": "science",
        "sentence": "[Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/burtzev  \nPermalink: https://www.nejm.org/doi/full/10.1056/NEJMc2405495?q\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "Now explain that to a five-year-old."
    },
    {
        "subreddit": "science",
        "sentence": "And I'd suggest it's only partially about how the tea is steeped - most big brands of tea in Ireland/UK don't even offer loose leaf"
    },
    {
        "subreddit": "science",
        "sentence": "There's very much a teabag culture, as you imply."
    },
    {
        "subreddit": "science",
        "sentence": "I'm 39 and I have one person my age that has a peanut allergy"
    },
    {
        "subreddit": "science",
        "sentence": "I remember always getting peanut butter when I was younger so I guess that helped"
    },
    {
        "subreddit": "science",
        "sentence": "I'm just answering your question"
    },
    {
        "subreddit": "science",
        "sentence": "Its relevance to the post aside."
    },
    {
        "subreddit": "science",
        "sentence": "It would take million of years of sustained mining at a scale millions of times larger than possible today to deplete Neptune or Uranus"
    },
    {
        "subreddit": "science",
        "sentence": "What are you on about?"
    },
    {
        "subreddit": "science",
        "sentence": "Eat what you want to eat and bugger off."
    },
    {
        "subreddit": "science",
        "sentence": "I didn’t say ‘oil’ I said ‘hydrogenated oil’, which was the heart health recommendation in the late 20th century"
    },
    {
        "subreddit": "science",
        "sentence": "This is now illegal it was shown to be so heart dangerous. \n\nNo idea how you thought I advocate for a 0 carb diet"
    },
    {
        "subreddit": "science",
        "sentence": "Also in the late 20th century ‘low fat’ options were seen as healthy, when the replacement calorie when fat was removed was sugar. \n\nAs for baby formula, again, completely disingenuous misrepresentation of my comment"
    },
    {
        "subreddit": "science",
        "sentence": "Baby formula was pushed as hygienic and superior to breast milk, and women were discouraged from breast feeding"
    },
    {
        "subreddit": "science",
        "sentence": "This was part of a general trend of sterility and hygiene in the mid-late 20th century that has since been generally reversed and seen as harmful."
    },
    {
        "subreddit": "science",
        "sentence": "It seems like a lot of people just barely have the cognitive ability to drive"
    },
    {
        "subreddit": "science",
        "sentence": "It doesn't surprise me that just a slight cognitive decline would cross the line into incompetency."
    },
    {
        "subreddit": "science",
        "sentence": "it's open access"
    },
    {
        "subreddit": "science",
        "sentence": "they included babies with allergic reactions, and the feedings were scheduled, if that's what you meant."
    },
    {
        "subreddit": "science",
        "sentence": "I don't know if I read it right but someone mentioned them writing dissertations on some pretty complex stuff so idk up until now they were pretty clever."
    },
    {
        "subreddit": "science",
        "sentence": "My mom was a 1-2 pack a day smoker from the time she was a teenager until she found out She was pregnant with me at 30"
    },
    {
        "subreddit": "science",
        "sentence": "The good news is 10 years after she quit cold turkey on her own, her doctor said that her health had returned to as if she had never started smoking cigarettes"
    },
    {
        "subreddit": "science",
        "sentence": "Unfortunately, my mom still continued to smoke weed, do Coke and who knows what else to this day"
    },
    {
        "subreddit": "science",
        "sentence": "She’s in her early 70s"
    },
    {
        "subreddit": "science",
        "sentence": "We haven’t had communication for 10 years, after I was getting extremely concerned with her behavior and encouraged that she get an assessment from her doctor"
    },
    {
        "subreddit": "science",
        "sentence": "Both of my parents shouted me down and adamantly refused, and immediately returned to their behaviors exhibiting cognitive dysfunction"
    },
    {
        "subreddit": "science",
        "sentence": "Some days I wonder how they’re doing, even though I don’t really care."
    },
    {
        "subreddit": "science",
        "sentence": "Prime reason why I do not eat salad anymore, cooked veggies or not at all."
    },
    {
        "subreddit": "science",
        "sentence": "Do you remember the name of the documentary by chance?"
    },
    {
        "subreddit": "science",
        "sentence": "My father wont wear his hearing aids because he says they only pick up the background noise which he really has a horrible time filtering"
    },
    {
        "subreddit": "science",
        "sentence": "He just sits at family functions in his head,  i feel bad for him"
    },
    {
        "subreddit": "science",
        "sentence": "This would be amazing."
    },
    {
        "subreddit": "science",
        "sentence": "Also if your child is allergic to peanuts and you keep feeding them to it it wont make it to 13."
    },
    {
        "subreddit": "science",
        "sentence": "Nothing to explain there are unique chemicals in uranus its funny"
    },
    {
        "subreddit": "science",
        "sentence": "You can get similar results by fermenting bamboo in ________and waiting a bit"
    },
    {
        "subreddit": "science",
        "sentence": "More like DMT, but no $$$$$ air fare"
    },
    {
        "subreddit": "science",
        "sentence": "Never eat them."
    },
    {
        "subreddit": "science",
        "sentence": "Well, let me try:\n\n1"
    },
    {
        "subreddit": "science",
        "sentence": "Within the tested group 80% of participants were women, so it's hard to consider this sample as truly random"
    },
    {
        "subreddit": "science",
        "sentence": "This is controlled for within the paper but it's done AFTER initial correlations are recognized and not on the data itself\n\n2"
    },
    {
        "subreddit": "science",
        "sentence": "The title love addiction is assessed based on 6-item questionnaire taken from paper that has 45 citations"
    },
    {
        "subreddit": "science",
        "sentence": "No additional tools are used to recognize love addiction which is problematic for something that is considered not diagnosible\n\n3"
    },
    {
        "subreddit": "science",
        "sentence": "Initially fearful and preoccupied attachment styles have very similar correlations"
    },
    {
        "subreddit": "science",
        "sentence": "What is used to set them apart is self-esteem"
    },
    {
        "subreddit": "science",
        "sentence": "Self-esteem itself had the highest correlation"
    },
    {
        "subreddit": "science",
        "sentence": "And obviously people with low self esteem have fearful or preoccupied attachment style"
    },
    {
        "subreddit": "science",
        "sentence": "So even if we consider the data valid the conclusion is totally wrong"
    },
    {
        "subreddit": "science",
        "sentence": "Anecdotally, the reason is simply due to marketing"
    },
    {
        "subreddit": "science",
        "sentence": "You are advertised to with pseudoscience"
    },
    {
        "subreddit": "science",
        "sentence": "Advertising and stories on local news and even the evening news are hardly enough legitimacy for an individual to accept the claim that anything scientific or involving the scientific method was adhered to."
    },
    {
        "subreddit": "science",
        "sentence": "They didn’t “find” both of these studies are just speculations based off of models with different priors"
    },
    {
        "subreddit": "science",
        "sentence": "They have been extinct for 65 million years"
    },
    {
        "subreddit": "science",
        "sentence": "We only recently discovered that corvids are more intelligent than chimps despite their small brains, so there is a huge range of possibilities for T-Rex but a speculative study does not overrule a previous speculative study."
    },
    {
        "subreddit": "science",
        "sentence": "A lot of the \"bad advice\" you've mentioned isn't actually bad advice at all"
    },
    {
        "subreddit": "science",
        "sentence": "Many oils are lower in saturated fats, which means they are generally better for heart health and cholesterol"
    },
    {
        "subreddit": "science",
        "sentence": "Carbs are actually an essential part of a healthy diet and are crucial for brain function"
    },
    {
        "subreddit": "science",
        "sentence": "Baby formula has its flaws but is a perfectly fine source of nutrients for babies who cannot have breastmilk or for those who cannot or do not want to breastfeed"
    },
    {
        "subreddit": "science",
        "sentence": "I think you may want to reconsider the validity and the biases of the information you are consuming"
    },
    {
        "subreddit": "science",
        "sentence": "Part of science is questioning what you believe to be true, which is why studies are done that often disprove previous theories and question ways of doing things"
    },
    {
        "subreddit": "science",
        "sentence": "Science is always going to have contradictions and biases and as we move forward we are able to smooth out many of those contradictions and see and address those biases"
    },
    {
        "subreddit": "science",
        "sentence": "Nutrition is no different."
    },
    {
        "subreddit": "science",
        "sentence": "Several leaps of inductive reasoning from “size of the brain cavity” to “their behavior was like crocodiles and lizards”\n\nMy original questions was a bit of a misdirect since even if we had fossilized t-rex brains, it still wouldn’t tell us all that much about their behavior since we understand so little even about modern brains, much less ones from millions of years ago"
    },
    {
        "subreddit": "science",
        "sentence": "I stop 2 times a day."
    },
    {
        "subreddit": "science",
        "sentence": "Get a salad spinner"
    },
    {
        "subreddit": "science",
        "sentence": "It’s funny that you mention ice cream"
    },
    {
        "subreddit": "science",
        "sentence": "There’s actually been huge outbreaks of food borne illness related to ice cream."
    },
    {
        "subreddit": "science",
        "sentence": "There's actually a lot of developmental benefits to introducing food as early as 4 or 3 months.\n\nThat is, of course, assuming that the nutrition provided is beneficial as a supplement to the infants health"
    },
    {
        "subreddit": "science",
        "sentence": "However, official public health advice is written for the lowest common denominator, who can't be trusted to make positive dietary decisions for an infant- and so should exclusively breastfeed as long as possible.\n\nIt's a root cause to why so much parenting advice is contradictory- see also co-sleeping."
    },
    {
        "subreddit": "science",
        "sentence": "younger generations will also have access to rejuvantive medicine which will be a game changer with regards to aging"
    },
    {
        "subreddit": "science",
        "sentence": "No, in a study from earlier this year, they estimated evidence of intelligence largely on the size of the brain cavity relative to something (IDK), but this study argues that there needs to be more variables in account"
    },
    {
        "subreddit": "science",
        "sentence": "and mud"
    },
    {
        "subreddit": "science",
        "sentence": "lots of mud"
    },
    {
        "subreddit": "science",
        "sentence": "and so on"
    },
    {
        "subreddit": "science",
        "sentence": "Let kids play in the dirt!"
    },
    {
        "subreddit": "science",
        "sentence": "Birds are very intelligent not just corvids and parrots."
    },
    {
        "subreddit": "science",
        "sentence": "I watched a documentary about leafy greens production in Yuma and it’s nuts just how close it is to the cattle feedlot"
    },
    {
        "subreddit": "science",
        "sentence": "They’re right next to each other."
    },
    {
        "subreddit": "science",
        "sentence": "This would definitely be a great application for the hearing impaired"
    },
    {
        "subreddit": "science",
        "sentence": "I do think though that it would be used for more nefarious things."
    },
    {
        "subreddit": "science",
        "sentence": "I got a really nasty case of campylobacter from eating yu choy"
    },
    {
        "subreddit": "science",
        "sentence": "It was an awful 2 weeks"
    },
    {
        "subreddit": "science",
        "sentence": "I basically lived in the bathroom."
    },
    {
        "subreddit": "science",
        "sentence": "It's all those \"Never trust a Human\" messages on milk cartons."
    },
    {
        "subreddit": "science",
        "sentence": "Is this because they get more repetitions of information from their iPads and electronic devices than they do from humans until they start school?"
    },
    {
        "subreddit": "science",
        "sentence": "Yes, that’s a very important point"
    },
    {
        "subreddit": "science",
        "sentence": "We risk becoming the ideological imperialists otherwise"
    },
    {
        "subreddit": "science",
        "sentence": "If we forced older people to stop driving in America, we might finally see the resurgence of good affordable public transportation"
    },
    {
        "subreddit": "science",
        "sentence": "Since old people actually go and vote, however the ruling class wouldn't need it since they already have chauffeurs."
    },
    {
        "subreddit": "science",
        "sentence": "We need to surround a koala with trimmed eucalyptus leaves and nothing else, wait for it to expire and then recreate the perfect conditions for fossilisation so that future generations can know how god damn dumb these animals were\n\n“He died starving surrounded by food”"
    },
    {
        "subreddit": "science",
        "sentence": "This is decade-old news"
    },
    {
        "subreddit": "science",
        "sentence": "It won't be as bad for younger generations as it is going to be for Boomers because that generation was exposed to stupid high amounts of lead in the environment."
    },
    {
        "subreddit": "science",
        "sentence": "I don't know what data the model has been fed, but if it's observing timestamps, payload size, count, frequency--stuff that wireshark could tell you, it probably is"
    },
    {
        "subreddit": "science",
        "sentence": "It probably is because it seems to be educated with the unencrypted counterparts.\n\nThe info leak is either from a side-channel vulnerability, or the encryption algo is easily cracked."
    },
    {
        "subreddit": "science",
        "sentence": "Fit under the law, and no, they're not allowed to drive or work in civilised countries btw"
    },
    {
        "subreddit": "science",
        "sentence": "But that's another debate america do not seems to want to have.\nChina too btw"
    },
    {
        "subreddit": "science",
        "sentence": "It caused some problem when they decided to ban gaming for teens when a good portion of them are forced to work some time ago.\n\nAnd you know, under 18 could mean 16 or 17, but it can also means 10 or 5."
    },
    {
        "subreddit": "science",
        "sentence": "One example of this is that a bite from the Lonestar Tick can make people develop an allergy to red meat.\n\nhttps://www.vdh.virginia.gov/epidemiology/epidemiology-fact-sheets/acquired-red-meat-allergy"
    },
    {
        "subreddit": "science",
        "sentence": "Found that out already the hard way\n\nI thought the beans I got were fuzzy sugar peas or something that’s why I ate em"
    },
    {
        "subreddit": "science",
        "sentence": "Like a lot of these things the reported stomach issues from people newly starting Creatine subside for many after a short period of getting used to it"
    },
    {
        "subreddit": "science",
        "sentence": "Agree some people never do. \n\n\nI think it's well studied as a substance, almost everyone in sports takes it and it's generally considered extremely safe and well tolerated."
    },
    {
        "subreddit": "science",
        "sentence": "Depends on your country"
    },
    {
        "subreddit": "science",
        "sentence": "In Scandinavia it's very easily accessible for everyone"
    },
    {
        "subreddit": "science",
        "sentence": "Often apartmentbuildings will have a shared sauna you can book"
    },
    {
        "subreddit": "science",
        "sentence": "The public bathhouses have saunas"
    },
    {
        "subreddit": "science",
        "sentence": "The gyms have saunas"
    },
    {
        "subreddit": "science",
        "sentence": "And many houses have saunas."
    },
    {
        "subreddit": "science",
        "sentence": "You can lose a lot of your capability while still remaining lucid"
    },
    {
        "subreddit": "science",
        "sentence": "Everything just gets worse"
    },
    {
        "subreddit": "science",
        "sentence": "Memory, problem solving, observation, concentration"
    },
    {
        "subreddit": "science",
        "sentence": "Not enough to be considered a disorder, but you know you're less than you were."
    },
    {
        "subreddit": "science",
        "sentence": "This is what I assumed too"
    },
    {
        "subreddit": "science",
        "sentence": "That it's because it's perceived as being from a legitimate source because robots \"can't lie\""
    },
    {
        "subreddit": "science",
        "sentence": "People who are depressed often seek outlets that make them feek momentarily good, while also building up shame that reinforces the depression"
    },
    {
        "subreddit": "science",
        "sentence": "Porn/masterbation is an easily accessible source of both fleeting pleasure and extended shame."
    },
    {
        "subreddit": "science",
        "sentence": "Many types of beans cannot and should not be eaten raw, and it has nothing to do with food born illnesses"
    },
    {
        "subreddit": "science",
        "sentence": "A lot of beans have stuff inside them that will make you sick unless cooked to break it down."
    },
    {
        "subreddit": "science",
        "sentence": "Well.."
    },
    {
        "subreddit": "science",
        "sentence": "yes and no"
    },
    {
        "subreddit": "science",
        "sentence": "Having a pet for young children rises the chance of the kid not developing an allergy at all, but if children that grew up with pets develop an allergy it tends to be more severe"
    },
    {
        "subreddit": "science",
        "sentence": "That was actually the conclusion of the same studies, but the second aspect doesn't make it into the headlines."
    },
    {
        "subreddit": "science",
        "sentence": "Ok,  but most children under 6 don't backpack for fun  and wouldn't learn that most random people are nice, especially considering how \"stranger danger\" is still taught without nuance."
    },
    {
        "subreddit": "science",
        "sentence": "We'll all be long gone and dead by the time that happens anyway"
    },
    {
        "subreddit": "science",
        "sentence": "I'll enjoy them at my leisure."
    },
    {
        "subreddit": "science",
        "sentence": "Well, psychosis can try calling my secretary"
    },
    {
        "subreddit": "science",
        "sentence": "I'm busy."
    },
    {
        "subreddit": "science",
        "sentence": "Same"
    },
    {
        "subreddit": "science",
        "sentence": "I felt calm for the first time."
    },
    {
        "subreddit": "science",
        "sentence": "We don’t take away licenses even after accidents where elderly people are clearly not mentally fit to drive"
    },
    {
        "subreddit": "science",
        "sentence": "We do t do anything when we know so knowing sooner won’t help."
    },
    {
        "subreddit": "science",
        "sentence": "Thanks"
    },
    {
        "subreddit": "science",
        "sentence": "Not sure why I thought that then, even though it's somehow became true."
    },
    {
        "subreddit": "science",
        "sentence": "[We have discovered fossiled T-Rex brain cases and made casts of them](https://media.australian.museum/media/dd/images/Some_image.width-1600.85c8ee8.jpg)\n\nThe brain could be smaller, but it's definitely not any larger."
    },
    {
        "subreddit": "science",
        "sentence": "This doesn't appear to be true given current psychopharmacology research"
    },
    {
        "subreddit": "science",
        "sentence": "There is some evidence for an increased risk in suicidality for adolescents in the first month or so of starting SSRIs, but outside of that, suicidality overall appears to decrease as a result of these medications"
    },
    {
        "subreddit": "science",
        "sentence": "See ([1](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3353604/)) ([2](https://www.nature.com/articles/s41386-021-01179-z))"
    },
    {
        "subreddit": "science",
        "sentence": "This is new? I remember learning this in elementary school, and that was well over 30 years ago."
    },
    {
        "subreddit": "science",
        "sentence": "So I’d say ‘not very.’"
    },
    {
        "subreddit": "science",
        "sentence": "Look forward to the psychotic goblins born from where I live"
    },
    {
        "subreddit": "science",
        "sentence": "Tonnes of air pollution from people burning crap all the time"
    },
    {
        "subreddit": "science",
        "sentence": "Tonnes of noise pollution from people blasting music from their houses and cars on top of them screaming obscenities at each other."
    },
    {
        "subreddit": "science",
        "sentence": "It reduces likelihood, it doesn't eliminate it."
    },
    {
        "subreddit": "science",
        "sentence": "My son was born in 2014, and around that time they had just finished the first study"
    },
    {
        "subreddit": "science",
        "sentence": "They were confused as to why peanut allergy is basically unheard of in Asia"
    },
    {
        "subreddit": "science",
        "sentence": "They found that it's likely because we let babies teeth on puffed snacks, and peanut oil, peanut powder, etc are popular ingredients"
    },
    {
        "subreddit": "science",
        "sentence": "We also just feed babies mashed up versions of our own meals, instead of bland baby food, so they end up being less picky"
    },
    {
        "subreddit": "science",
        "sentence": "My son had 2 teeth at birth, and could push his chest off the ground during tummy time by about 3 weeks old"
    },
    {
        "subreddit": "science",
        "sentence": "He got his first mashed solid at 1 month (still mainly on formula/breast milk, but had 1 or 2 solid things to try every couple days, since he already had 2 teeth)"
    },
    {
        "subreddit": "science",
        "sentence": "One of the things he teethed on was puffed peanut treats"
    },
    {
        "subreddit": "science",
        "sentence": "No allergies or sensitivities to this day"
    },
    {
        "subreddit": "science",
        "sentence": "My grandma started me on some solid foods at 1 month old, and I also have no allergies or sensitivities, aside from a sensitivity to milk and eggs that developed when I was in university"
    },
    {
        "subreddit": "science",
        "sentence": "However, that milk sensitivity disappeared when I moved to Taiwan 12 years ago."
    },
    {
        "subreddit": "science",
        "sentence": "I didn't know a single kid who had a peanut allergy growing up in the 80's, and I moved around a bit"
    },
    {
        "subreddit": "science",
        "sentence": "Bee allergies were all the rage."
    },
    {
        "subreddit": "science",
        "sentence": "What about a potbelly pig?"
    },
    {
        "subreddit": "science",
        "sentence": "Nope"
    },
    {
        "subreddit": "science",
        "sentence": "They were branded and everything"
    },
    {
        "subreddit": "science",
        "sentence": "I even ordered them from the store for pickup during the pandemic - as soon as the little one was interested in nomming on things, we let her explore Bamba to try to head off peanut allergies."
    },
    {
        "subreddit": "science",
        "sentence": "“They were more like smart giant crocodiles, and that’s just as fascinating.”\n\nSo were they or were they not “smart”?"
    },
    {
        "subreddit": "science",
        "sentence": "Straight up not true at all"
    },
    {
        "subreddit": "science",
        "sentence": "They often do exposure therapy now with minuscule amounts after a reaction, with the idea that eventually it helps reduce reactions.\n\nThe exposure therapy is generally most successful though if started early (before age 1)."
    },
    {
        "subreddit": "science",
        "sentence": "I have to push against this politely and reiterate what some are saying, yes high density can be loud but it’s not nearly as loud as more spread out living is"
    },
    {
        "subreddit": "science",
        "sentence": "So many people are forced to live near very busy highways"
    },
    {
        "subreddit": "science",
        "sentence": "I’d rather live in a higher density area with the occasional car or delivery truck over constant cars driving past on a highway.\n\nI lived in Paris briefly and even though I lived in a high density area it was super quiet on my street and the streets around me and there were several parks in walking distance that were surprisingly VERY quiet"
    },
    {
        "subreddit": "science",
        "sentence": "And that was before the new mayor started pushing for less car traffic"
    },
    {
        "subreddit": "science",
        "sentence": "I’m not saying there weren’t areas of Paris that were noisy but it was way more quiet than you’d expect and that had a lot to do with there being everything you needed within a 10 minute walk, a grass-covered tram, and an underground metro stop a few minutes walk away."
    },
    {
        "subreddit": "science",
        "sentence": "If you’re starting out with a 6 month old baby as they recommend here, it would not be actual peanuts, but smooth peanut butter."
    },
    {
        "subreddit": "science",
        "sentence": "A ton"
    },
    {
        "subreddit": "science",
        "sentence": "The reason they figured it out was because in Israel, they were not given the advice to restrict peanuts"
    },
    {
        "subreddit": "science",
        "sentence": "And there, Bamba peanut butter puffs are a big first baby food"
    },
    {
        "subreddit": "science",
        "sentence": "Israelis in the UK had an explosion of peanut allergies, whereas the ones still in Israel, had no change."
    },
    {
        "subreddit": "science",
        "sentence": "I’m not sure that is true"
    },
    {
        "subreddit": "science",
        "sentence": "Most are rather intelligent."
    },
    {
        "subreddit": "science",
        "sentence": "No, a lot of recent research has suggested some theropod groups like Troodontids, dromeaosaurs (raptors), and Tyrannosaurs were relatively intelligent"
    },
    {
        "subreddit": "science",
        "sentence": "Even looking at modern theropods (birds), groups like corvids and parrots are amongst the most intelligent animals on the planet."
    },
    {
        "subreddit": "science",
        "sentence": "These modified noise-makers are so insane"
    },
    {
        "subreddit": "science",
        "sentence": "I really wish noise pollution would be taken seriously"
    },
    {
        "subreddit": "science",
        "sentence": "I live in a neighborhood with dozens of large apartment complexes, each with hundreds of units, and there are some nights some idiot comes tearing through with their loud vehicle at 2 or 3 am waking me and my household up"
    },
    {
        "subreddit": "science",
        "sentence": "I have members in my family who have insomnia and if that happened around them they’d just be up the rest of the night"
    },
    {
        "subreddit": "science",
        "sentence": "Not to mention the parents with babies, doctors and nurses who work long shifts just to be woken up an hour or so after falling asleep, etc"
    },
    {
        "subreddit": "science",
        "sentence": "It’s dangerous."
    },
    {
        "subreddit": "science",
        "sentence": "If you are super paranoid and want to try this, put your child in the car, drive to the local emergency and pay to park in the lot"
    },
    {
        "subreddit": "science",
        "sentence": "Then give it to them, if anything happens you’re already parked at the hospital."
    },
    {
        "subreddit": "science",
        "sentence": "i honestly thought thus was already a well known thing"
    },
    {
        "subreddit": "science",
        "sentence": "When you keep your house too clean, you deprive children’s immune system of germs which leave them untrained for more serious interactions with those germs later on"
    },
    {
        "subreddit": "science",
        "sentence": "Dogs in children’s homes offset this"
    },
    {
        "subreddit": "science",
        "sentence": "Cats to a lesser degree do as well."
    },
    {
        "subreddit": "science",
        "sentence": "This is interesting and confirms what doctors have been telling parents for over a decade, but as a parent of a kid with a peanut allergy, please don't lecture us about it as though we wanted our kids to have a life threatening allergy"
    },
    {
        "subreddit": "science",
        "sentence": "Thank you."
    },
    {
        "subreddit": "science",
        "sentence": "That makes more sense."
    },
    {
        "subreddit": "science",
        "sentence": "What buries it for you, however, is devoid of relevance"
    },
    {
        "subreddit": "science",
        "sentence": "It passed peer review"
    },
    {
        "subreddit": "science",
        "sentence": "Medical problems that are difficult to diagnose abound and you're unable to point out specific issues in the methodology to begin with."
    },
    {
        "subreddit": "science",
        "sentence": "Anecdotal, but I had the exact same experience when I shut off all my social media"
    },
    {
        "subreddit": "science",
        "sentence": "I didn’t realize how much it was affecting me until after, nor did I anticipate how easy it would be to let it go for good.\n\nReddit is my guilty pleasure as I still think this counts as social media… but I’m here anonymously to seek interesting discussions and fellow hobbyists of my own hobbies"
    },
    {
        "subreddit": "science",
        "sentence": "Not here comparing my life to other “friends”, wondering why I wasn’t invited to some outing after pictures get posted… ah shoot, insecurity is leaking again."
    },
    {
        "subreddit": "science",
        "sentence": "No, you’re mixing them with Carnotaurus."
    },
    {
        "subreddit": "science",
        "sentence": "Not the knock off one?"
    },
    {
        "subreddit": "science",
        "sentence": "I live in NYC and grew up eating it and only know one grocery that has it besides midwood and east wburg"
    },
    {
        "subreddit": "science",
        "sentence": ">But if you really want to go safe you just obliterate surface tension with microwaves and radiation and then not much will survive that.\n\n.."
    },
    {
        "subreddit": "science",
        "sentence": "Now I want a home food irradiator."
    },
    {
        "subreddit": "science",
        "sentence": "The whole reason I’m going after a County is bc I have no mortgages on my properties"
    },
    {
        "subreddit": "science",
        "sentence": "I self fund tort with HELOCS"
    },
    {
        "subreddit": "science",
        "sentence": "There is no covid vaccine"
    },
    {
        "subreddit": "science",
        "sentence": "I'm no expert or even have much knowledge on dinosaurs, but I thought it was common knowledge that as far as dinosaurs came, T-Rex were really not the sharpest tools in the shed?"
    },
    {
        "subreddit": "science",
        "sentence": "I mean, yeah? Except for corvids and parrots, birds are famously not smart."
    },
    {
        "subreddit": "science",
        "sentence": "Can science try to account for everything, or can we only account for how awesome *T"
    },
    {
        "subreddit": "science",
        "sentence": "rex* was?"
    },
    {
        "subreddit": "science",
        "sentence": "Go to the kosher aisle of your local supermarket, they'll probably have it there."
    },
    {
        "subreddit": "science",
        "sentence": "Turns out being exposed to things at a young age improves your immune system"
    },
    {
        "subreddit": "science",
        "sentence": "Well I’ll be"
    },
    {
        "subreddit": "science",
        "sentence": "Not Bambas, but we gave our 5 month old peanut butter and had same reaction.\n\nIt was demoralizing as we did all the “right” things like early exposure, breast milk, have a dog, no family history of allergies. \n\nWe are about to start OIT for him."
    },
    {
        "subreddit": "science",
        "sentence": "Can you expand on that?"
    },
    {
        "subreddit": "science",
        "sentence": "Allergy.."
    },
    {
        "subreddit": "science",
        "sentence": "Though I suppose that can turn into a choking hazard"
    },
    {
        "subreddit": "science",
        "sentence": "You have a point there"
    },
    {
        "subreddit": "science",
        "sentence": "Though, a lot of those drunks get a slap on the wrist and they're back, sometimes driving without a license"
    },
    {
        "subreddit": "science",
        "sentence": "The texting gets fines despite being crazy dangerous"
    },
    {
        "subreddit": "science",
        "sentence": "(Maybe that's just Canada though)."
    },
    {
        "subreddit": "science",
        "sentence": "I like to imagine that they just found a fossilized T-rex that died in such an extremely stupid way that it was necessary to reevaluate the intelligence of the entire species."
    },
    {
        "subreddit": "science",
        "sentence": "Exactly, and it said that, not \"a majority\""
    },
    {
        "subreddit": "science",
        "sentence": "They could in theory have titled it \"Over 90% of food-related illnesses not caused by leafy vegetables\", but that's not what they studied."
    },
    {
        "subreddit": "science",
        "sentence": "I loved peanuts until my adult life"
    },
    {
        "subreddit": "science",
        "sentence": "Now for some reason if I eat them, I get incredibly itchy for up to two weeks"
    },
    {
        "subreddit": "science",
        "sentence": "I miss them so much.."
    },
    {
        "subreddit": "science",
        "sentence": "There will be traces of either PP or PLA in your compost, you just can’t see it."
    },
    {
        "subreddit": "science",
        "sentence": "There was an earlier study that showed a dose dependent reduction in all cause mortality with sauna use, also in Finland"
    },
    {
        "subreddit": "science",
        "sentence": "The evidence is mounting strongly in favor of saunas."
    },
    {
        "subreddit": "science",
        "sentence": "Peanut butter cut with breast milk or formula is another great option for that early age!"
    },
    {
        "subreddit": "science",
        "sentence": "No one has ever claimed that PLA tea bags are home compostable, which this study has attempted to do"
    },
    {
        "subreddit": "science",
        "sentence": "It was never the intended waste channel"
    },
    {
        "subreddit": "science",
        "sentence": "PP teabags were done away with because consumers were outraged despite being mostly ignorant to why PP was present; consumers are similarly ignorant about PLA and unfortunately some companies (looking at PG) have taken advantage of that."
    },
    {
        "subreddit": "science",
        "sentence": "> 45% mineral, 5% organic matter, 20-30% water, and 20-30% air\n\n\nhttps://www.ctahr.hawaii.edu/mauisoil/a_comp.aspx"
    },
    {
        "subreddit": "science",
        "sentence": "Soil is a mix of approximately 45% mineral, 5% organic matter, 20-30% water, and 20-30% air.\n\n\nhttps://www.ctahr.hawaii.edu/mauisoil/a_comp.aspx\n\n\n\nCompost is nearly 100% organic material, water and air - almost no mineral component.\n\n\nThe mineral consists of stuff like rock dust.\n\n\nAs a person who composts and thinks that it can solve so many problems I am also aware it is possible to have too much compost in your soil."
    },
    {
        "subreddit": "science",
        "sentence": "I mean I’d say it’s accurate"
    },
    {
        "subreddit": "science",
        "sentence": "10% certainly *is* significant"
    },
    {
        "subreddit": "science",
        "sentence": "Wow a new flavor of antivax I have never seen before"
    },
    {
        "subreddit": "science",
        "sentence": "Pretty sure vaccines aren't the problem bud"
    },
    {
        "subreddit": "science",
        "sentence": "If that were the case 100% of vaccinated kids would have peanut allergies."
    },
    {
        "subreddit": "science",
        "sentence": "You’re tell me they weren’t writing dissertations on electron tunneling?"
    },
    {
        "subreddit": "science",
        "sentence": "We didn't give our kids any solids or a huge glob of peanut butter or anything"
    },
    {
        "subreddit": "science",
        "sentence": "We just put a bit on the tip of a chopstick and let them try it"
    },
    {
        "subreddit": "science",
        "sentence": "Neither kid seems to have peanut allergies a couple years later."
    },
    {
        "subreddit": "science",
        "sentence": "Same with cleaning too much."
    },
    {
        "subreddit": "science",
        "sentence": "Allergies are not all the same"
    },
    {
        "subreddit": "science",
        "sentence": "Studies have shown a significant genetic influence on the peanut allergy."
    },
    {
        "subreddit": "science",
        "sentence": "A big problem is that ‘biodegradable’ is a very ambiguous term and a lot of businesses are taking advantage of that in their marketing"
    },
    {
        "subreddit": "science",
        "sentence": "It really needs to be defined in law to stop green-washing, as evidently some companies (looking at PG) are too disingenuous and are taking advantage."
    },
    {
        "subreddit": "science",
        "sentence": "Would irradiating the lettuce make it safe from all the foodborne causing bacteria?"
    },
    {
        "subreddit": "science",
        "sentence": "old drivers aren't going to face the same consequences or be held to the same standards as drunk and distracted drivers"
    },
    {
        "subreddit": "science",
        "sentence": "a drunk driver will get their license revoked and possible prison time."
    },
    {
        "subreddit": "science",
        "sentence": "I've seen them at Target in the US"
    },
    {
        "subreddit": "science",
        "sentence": "Idk"
    },
    {
        "subreddit": "science",
        "sentence": "Cities are loud"
    },
    {
        "subreddit": "science",
        "sentence": "Densely populated areas are loud"
    },
    {
        "subreddit": "science",
        "sentence": "I grew up in a small village"
    },
    {
        "subreddit": "science",
        "sentence": "At night you couldnt hear anyone, just some cars in the distance"
    },
    {
        "subreddit": "science",
        "sentence": "I live in a city now"
    },
    {
        "subreddit": "science",
        "sentence": "I don't hear so many cars"
    },
    {
        "subreddit": "science",
        "sentence": "I do hear my neighbours through the walls, I hear people walking on the street and chatting and just being drunk, I hear fireworks (all year round) and so on..."
    },
    {
        "subreddit": "science",
        "sentence": "I was fine with windows 98 tbh."
    },
    {
        "subreddit": "science",
        "sentence": "How many people did they study and from where? This is not true."
    },
    {
        "subreddit": "science",
        "sentence": "no living organism has a mechanism in place to \"evolve\" a brand new thing that it's never had before based on its conditions"
    },
    {
        "subreddit": "science",
        "sentence": "It is purely random mutations"
    },
    {
        "subreddit": "science",
        "sentence": "Certain traits can go into hiding within the DNA and then come back later based on environmental stimulus but that is not the same thing."
    },
    {
        "subreddit": "science",
        "sentence": "Not to burst your bubble, but you won’t find a paper teabag that doesn’t have some form of plastic content."
    },
    {
        "subreddit": "science",
        "sentence": "Here's my plan"
    },
    {
        "subreddit": "science",
        "sentence": "Start having driving tests required every 5 years"
    },
    {
        "subreddit": "science",
        "sentence": "All that extra money to pay for driving tests be used for transportation for the elderly that lose their license to these types of factors."
    },
    {
        "subreddit": "science",
        "sentence": "I don't want corporations making decisions for me either, but I definitely want the government to"
    },
    {
        "subreddit": "science",
        "sentence": "The reality is, exposing young developing minds to screens and technology is detrimental to their future health and something needs to be done because parents either don't care or have enough wisdom (ofc not everyone is a paediatric psychologist which is understandable) to limit screen time."
    },
    {
        "subreddit": "science",
        "sentence": "Hmm"
    },
    {
        "subreddit": "science",
        "sentence": "I wonder if it’s important to chop or tear lettuce after you washed it rather than before? I always figured it was safer to chop up lettuce after I’ve washed it, but it is a lot easier to dry the lettuce in a salad spinner if I cut it up first and then wash it."
    },
    {
        "subreddit": "science",
        "sentence": "For those not willing to accept their fate: Signs of drug abuse stops after 5, 10, ~20 years"
    },
    {
        "subreddit": "science",
        "sentence": "Meaning if you stop being a functional alcoholic or weekend binge alcoholic by 30, most people can live out their final years like they normally would have"
    },
    {
        "subreddit": "science",
        "sentence": "Most of this is from [smoking](https://cdn2.hubspot.net/hub/153301/file-2677659645-png/ATimelineofHowYourBodyrepairs-green.png) but it's better safe than sorry.\n\ntl;dr: Conservatively stop drugs at your halfway life marker for when your family normally dies"
    },
    {
        "subreddit": "science",
        "sentence": "Do they all die at 65-70? Stop at 30"
    },
    {
        "subreddit": "science",
        "sentence": "90? Stop at 45"
    },
    {
        "subreddit": "science",
        "sentence": "https://www.cancer.org/cancer/risk-prevention/tobacco/benefits-of-quitting-smoking-over-time.html\n\nhttps://americanaddictioncenters.org/blog/long-take-reverse-alcohol-damage\n\nhttps://adf.org.au/insights/brain-recovery-after-aod/"
    },
    {
        "subreddit": "science",
        "sentence": ">Theres also the problem that most places in the US are absolutely not walkable, and you sure af dont provide services for people that cant drive either, which means these people have to get creative.\n\n\nI mean, they're not getting creative"
    },
    {
        "subreddit": "science",
        "sentence": "it's the opposite"
    },
    {
        "subreddit": "science",
        "sentence": "they're making the same choices they have their entire life despite the changes to their minds and capabilities"
    },
    {
        "subreddit": "science",
        "sentence": "that's the problem."
    },
    {
        "subreddit": "science",
        "sentence": "They just vibe around like cats, they never ate other animals, they just accidentally gave em extra lickings"
    },
    {
        "subreddit": "science",
        "sentence": "It doesn't matter how it behaves"
    },
    {
        "subreddit": "science",
        "sentence": "All that matters is it can easily mess my day up without much effort if it were still around"
    },
    {
        "subreddit": "science",
        "sentence": "Hell! Crocs are still very much around and we as humans still very much avoid them and keep those we must get close to in a form of enclosure"
    },
    {
        "subreddit": "science",
        "sentence": "So yeah the intelligence or lack thereof of a T-Rex isn't what should be taken into account."
    },
    {
        "subreddit": "science",
        "sentence": "\"fit\" in what way? 16 and 17 year olds are perfectly capable of understanding the laws and regulations they're subject to"
    },
    {
        "subreddit": "science",
        "sentence": "that's why they're allowed to work, drive, and consent to sex"
    },
    {
        "subreddit": "science",
        "sentence": "yet when it comes to voting, they're suddenly children."
    },
    {
        "subreddit": "science",
        "sentence": "By age there I could predict when my mom would lie to me"
    },
    {
        "subreddit": "science",
        "sentence": "I think by then we start to realize they can lie"
    },
    {
        "subreddit": "science",
        "sentence": "Idk about age 6"
    },
    {
        "subreddit": "science",
        "sentence": "Maybe we just give up on caring about it after being indoctrinated with school “obeying” behaviors."
    },
    {
        "subreddit": "science",
        "sentence": "Small town nearest to me is 5000 people and it’s not walkable at all"
    },
    {
        "subreddit": "science",
        "sentence": "No accommodation for pedestrians to get groceries."
    },
    {
        "subreddit": "science",
        "sentence": "Just my impressions from reading over the years"
    },
    {
        "subreddit": "science",
        "sentence": "Happy to be corrected"
    },
    {
        "subreddit": "science",
        "sentence": "Not trying to take away from the targeting of black people"
    },
    {
        "subreddit": "science",
        "sentence": "And of course redlining and other policies further locked black folks out of suburban expansion."
    },
    {
        "subreddit": "science",
        "sentence": "Factory farming of animals."
    },
    {
        "subreddit": "science",
        "sentence": "A get out of jail free card for drunk drivers"
    },
    {
        "subreddit": "science",
        "sentence": "The problem is not _wild_ animals, it's factory farmed animals whose feces either are intentionally sprayed on the crops or leak from their cesspool onto farmland."
    },
    {
        "subreddit": "science",
        "sentence": "what do you mean by blackest, most multi ethnic? for example East Orange in NJ is 85+% African American, so it's not very multi ethnic at all"
    },
    {
        "subreddit": "science",
        "sentence": "I love the cutlery that says compostable but we all know there’s plastic in them"
    },
    {
        "subreddit": "science",
        "sentence": "Simple solutions to complicated problems..."
    },
    {
        "subreddit": "science",
        "sentence": "So frustrating"
    },
    {
        "subreddit": "science",
        "sentence": "Recycling metals, glass and paper/cardboard is generally efficient and cost effective"
    },
    {
        "subreddit": "science",
        "sentence": "Recycling plastic, is difficult and often sucks."
    },
    {
        "subreddit": "science",
        "sentence": "So you're risking your life to avoid some hurt feelings?"
    },
    {
        "subreddit": "science",
        "sentence": "Does Finland have statistically significantly lower rates of schizophrenia than other places?"
    },
    {
        "subreddit": "science",
        "sentence": ".."
    },
    {
        "subreddit": "science",
        "sentence": "delivery trucks are loud though"
    },
    {
        "subreddit": "science",
        "sentence": "Have we discovered fossilized t-rex brains?"
    },
    {
        "subreddit": "science",
        "sentence": "Replying to FluxedEdge.."
    },
    {
        "subreddit": "science",
        "sentence": "Robots only do what humans tell it to do"
    },
    {
        "subreddit": "science",
        "sentence": "Humans code the robots"
    },
    {
        "subreddit": "science",
        "sentence": "So how do you justify trusting a robot?"
    },
    {
        "subreddit": "science",
        "sentence": "No - You can't give peanuts to children under One"
    },
    {
        "subreddit": "science",
        "sentence": "That's what this is all about.\n\nVaccines contain peanut oil - This early exposure is what's giving kids peanut allergies.\n\nThe fix is not to expose them to more peanuts from another source - it's to remove the exposure to peanuts via vaccine, which is the problem in the first place"
    },
    {
        "subreddit": "science",
        "sentence": "Just like any medical product, vaccines are not for everyone and carry risk of side effects and injury"
    },
    {
        "subreddit": "science",
        "sentence": "There are also contraindications for which certain people should not have any vaccines at all."
    },
    {
        "subreddit": "science",
        "sentence": "It's good to have concrete proof that social media use at the very least exacerbates depression and anxiety."
    },
    {
        "subreddit": "science",
        "sentence": "My child has (or had) a nut allergy"
    },
    {
        "subreddit": "science",
        "sentence": "We started oral immunotherapy , basically micro dosing peanuts in an attempt to get his immune system to adapt.\n\nHe can now eat a tsp and a half of peanut butter without reaction."
    },
    {
        "subreddit": "science",
        "sentence": "For those interested, here's an ongoing study in the US that is largely following in the footsteps of their work: https://www.foodallergy.org/resources/start-eating-early-diet-seed-initiative"
    },
    {
        "subreddit": "science",
        "sentence": "Any resources to take the kind of tests that help recognize where I'm at? I want to be able to test myself as I age as well."
    },
    {
        "subreddit": "science",
        "sentence": "What was the margin of error?"
    },
    {
        "subreddit": "science",
        "sentence": "I’d throw in some carpet dirt for extra immunity"
    },
    {
        "subreddit": "science",
        "sentence": "If it quacks like fascism..."
    },
    {
        "subreddit": "science",
        "sentence": "Yes! I came here to ask the same thing: am I completely misremembering that the prevailing wisdom about 20 years ago was to avoid peanuts for the first few years?\n\nI wonder how many more peanut  sensitivities that advice led to?"
    },
    {
        "subreddit": "science",
        "sentence": "In 2017 the AAP endorsed the guidelines from the National Institute of Allergies and Infectious Diseases determined by the LEAP trial: https://publications.aap.org/aapnews/news/12250 \n\nIntroducing between 4-6 months is only for infants at highest risk"
    },
    {
        "subreddit": "science",
        "sentence": "It’s fine to introduce allergens at six months for the second group (mild to moderate eczema) and at 6 months or later for those without eczema and allergies.\n\nPeanut pastes are made from mixing peanut butter with breastmilk, formula or milk to thin it out (because peanut butter on its own is too thick and an aspiration risk)."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, I think the prevailing wisdom was to avoid allergens because if they were allergic, an infant couldn't tell you that they were itchy or uncomfortable or in pain, so better to wait until they could tell you"
    },
    {
        "subreddit": "science",
        "sentence": "Turns out some allergies develop later and early exposure can mitigate or eliminate that risk."
    },
    {
        "subreddit": "science",
        "sentence": "I'm in my 40s and was already falling apart before covid"
    },
    {
        "subreddit": "science",
        "sentence": "4mo is a general \"you can start real food\" age."
    },
    {
        "subreddit": "science",
        "sentence": "Yep me too"
    },
    {
        "subreddit": "science",
        "sentence": "My allergic kid is 12 and luckily it's a \"mild\" allergy with full body hives."
    },
    {
        "subreddit": "science",
        "sentence": "Or just simple cholesterol"
    },
    {
        "subreddit": "science",
        "sentence": "Infants can be fed solid food earlier than 6 months if they can sit upright in a high chair without slumping, have lost the tongue thrust reflex, and are bringing their hands to mouth (which for most babies is gonna be close to 6 months anyhow)"
    },
    {
        "subreddit": "science",
        "sentence": "Their main food source should absolutely still be milk/formula though! \n\nThey do make allergen powders now that can be mixed into bottles for earlier exposure."
    },
    {
        "subreddit": "science",
        "sentence": "Right"
    },
    {
        "subreddit": "science",
        "sentence": "It probably seemed reasonable in 2009 to have kids avoid potentially deadly allergens at a young age"
    },
    {
        "subreddit": "science",
        "sentence": "In hindsight it doesn’t seem like it was good advice, but it’s hard without hindsight to determine which (if any) current mainstream medical advice is as incorrect as the ‘avoid allergens’ (or hydrogenated oils, or much of the food pyramid) advice of prior decades."
    },
    {
        "subreddit": "science",
        "sentence": "They all vote"
    },
    {
        "subreddit": "science",
        "sentence": "Enough to keep this problem going through essentially political intimidation"
    },
    {
        "subreddit": "science",
        "sentence": "Why not put that same power into pressuring the government(s) into developing public transportation?\n\nBecause its not about safety or even independence"
    },
    {
        "subreddit": "science",
        "sentence": "Its about selfishness"
    },
    {
        "subreddit": "science",
        "sentence": "They want their own car and thats that"
    },
    {
        "subreddit": "science",
        "sentence": "Everyone else be damned."
    },
    {
        "subreddit": "science",
        "sentence": ">There is chlorine in your tap water.\n\nSounds like you should just wash them in tap water, eh? That already has the right water to bleach ratio."
    },
    {
        "subreddit": "science",
        "sentence": "Right"
    },
    {
        "subreddit": "science",
        "sentence": "I recall that sanitation craze of the 80s from my own childhood"
    },
    {
        "subreddit": "science",
        "sentence": "Everything had to be sterile and bleached constantly"
    },
    {
        "subreddit": "science",
        "sentence": "And these were the mainstream medical and scientific bodies pushing this, it wasn’t fringe woowoo stuff"
    },
    {
        "subreddit": "science",
        "sentence": "It seems that nutrition and health was prone to error in their advice"
    },
    {
        "subreddit": "science",
        "sentence": "It’s hard, without hindsight, to know if we’re on stronger scientific grounds now than we were just 10+ years ago."
    },
    {
        "subreddit": "science",
        "sentence": "There is living with family and there is being entirely reliant on them for any interaction with the outside world"
    },
    {
        "subreddit": "science",
        "sentence": "It's also a major problem for childhood in car dependent America."
    },
    {
        "subreddit": "science",
        "sentence": "I feel like every article I read is just bait"
    },
    {
        "subreddit": "science",
        "sentence": "How is this new science?"
    },
    {
        "subreddit": "science",
        "sentence": "Same! Except I’m the mom that ate the Pb&j daily while pregnant and nursing"
    },
    {
        "subreddit": "science",
        "sentence": "My son is 24 and still allergic."
    },
    {
        "subreddit": "science",
        "sentence": "Given that most of the noise comes from traffic (either directly from cars or from the excessive construction that cars require), and denser cities with better public transport reduce the amount of traffic, it's pretty clear why denser population centers reduces noise overall, if done correctly.\n\nThe only number I've been able to find was in some news report talking about noise pollution in Toronto, but they put traffic as the source 60% of all noise"
    },
    {
        "subreddit": "science",
        "sentence": "I would wager this is an underestimate, as they probably aren't including road construction in this number"
    },
    {
        "subreddit": "science",
        "sentence": "Either way, if you can make a significant cut in 60% of your noise pollution, you'll still have lower overall volume even with increases in other sources."
    },
    {
        "subreddit": "science",
        "sentence": "women release more oxytocin"
    },
    {
        "subreddit": "science",
        "sentence": "They can start at about 4 months"
    },
    {
        "subreddit": "science",
        "sentence": "You took this in a whole off direction buddy"
    },
    {
        "subreddit": "science",
        "sentence": "Sounds like the nurse needs to up your meds"
    },
    {
        "subreddit": "science",
        "sentence": "Your post has been removed because it does not reference new peer-reviewed research and is therefore in violation of [Submission Rule #1](https://www.reddit.com/r/science/wiki/rules#wiki_1._directly_link_to_published_peer-reviewed_research_or_media_summary).\n\nIf your submission is scientific in nature, consider reposting in our sister subreddit /r/EverythingScience.\n\n_If you believe this removal to be unwarranted, or would like further clarification, please don't hesitate to [message the moderators.](https://www.reddit.com/message/compose?to=%2Fr%2Fscience&subject=Must%20be%20peer-reviewed%20research)._"
    },
    {
        "subreddit": "science",
        "sentence": "[Cloud seeding](https://en.wikipedia.org/wiki/Cloud_seeding) is a pretty common technology already."
    },
    {
        "subreddit": "science",
        "sentence": "I dont"
    },
    {
        "subreddit": "science",
        "sentence": "But it does get awkward trying not to be confrontational with them about it"
    },
    {
        "subreddit": "science",
        "sentence": "Especially when were all going the same place."
    },
    {
        "subreddit": "science",
        "sentence": "Yes they are"
    },
    {
        "subreddit": "science",
        "sentence": "No really they are"
    },
    {
        "subreddit": "science",
        "sentence": "You can just ask and say that theyre not, but they are."
    },
    {
        "subreddit": "science",
        "sentence": "It’s crazy how something designed to connect us can have such a negative impact on mental health"
    },
    {
        "subreddit": "science",
        "sentence": "This study should be a wake-up call for social media companies to rethink their platforms."
    },
    {
        "subreddit": "science",
        "sentence": "t's alarming but not entirely surprising that air and noise pollution can have such profound effects on mental health"
    },
    {
        "subreddit": "science",
        "sentence": "Our brains, especially developing ones, are highly sensitive to environmental stressors"
    },
    {
        "subreddit": "science",
        "sentence": "Continuous exposure to pollution might disrupt normal brain development and function, leading to increased risks of depression, anxiety, and even psychotic experiences"
    },
    {
        "subreddit": "science",
        "sentence": "This study underscores the urgent need for stricter environmental regulations and better urban planning to protect our children’s mental well-being."
    },
    {
        "subreddit": "science",
        "sentence": "In my country (NL) rural folks also inhale a lot of pesticides and such from the farmlands"
    },
    {
        "subreddit": "science",
        "sentence": "Especially our famous \"bollenvelden\" (flower fields) are known for this"
    },
    {
        "subreddit": "science",
        "sentence": "I once got a massive migraine from all the dust and probably also various types of -cides from a few hours walking in the bollenvelden"
    },
    {
        "subreddit": "science",
        "sentence": "Never going there again."
    },
    {
        "subreddit": "science",
        "sentence": "Composted material is soil, it's just soil with a very high organism matter level"
    },
    {
        "subreddit": "science",
        "sentence": "Soil is just a catch-all word for grounded up material and includes a ton of different things."
    },
    {
        "subreddit": "science",
        "sentence": "Possible future sources for massive amounts of H3"
    },
    {
        "subreddit": "science",
        "sentence": "Hopefully anyway, we’re not sure yet."
    },
    {
        "subreddit": "science",
        "sentence": "Okay, thank you for helping me put these numbers into perspective :-)"
    },
    {
        "subreddit": "science",
        "sentence": "Wait, how can you feed infants \"peanut pastes\" or \"puffed peanut snacks\" from 4-6 months? Infants are not supposed to have anything but breast milk or formula until they're at least six months old"
    },
    {
        "subreddit": "science",
        "sentence": "Is there a mistype in your post or can infants be fed solid foods earlier than six months?"
    },
    {
        "subreddit": "science",
        "sentence": "THEY REALLY DONT WANT YOU TO KNOW IF YOU DONT HAVE DIABETES AND TAKE THIS DRUG YOU WILL DEVELOP DIABETES \nMy mother literally has blue fingers and toes and her blood sugar is consistently low well after taking the drug she has been diagnosed with type 2 she's only 42 and her weight is very low to begin with she's just crazy and hates her body"
    },
    {
        "subreddit": "science",
        "sentence": "Please elaborate."
    },
    {
        "subreddit": "science",
        "sentence": "Use a cleaning solution on them, same thing that’s used to clean food during pregnancy"
    },
    {
        "subreddit": "science",
        "sentence": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science"
    },
    {
        "subreddit": "science",
        "sentence": "However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**"
    },
    {
        "subreddit": "science",
        "sentence": "Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise"
    },
    {
        "subreddit": "science",
        "sentence": "[Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/Alien0105  \nPermalink: https://medicine.wustl.edu/news/washington-university-researchers-consulting-people-of-st-louis-on-whether-to-participate-in-trauma-research-study-to-investigate-treatment-strategies-for-injured-children-who-are-bleeding-to-death/\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "Easy solution: just don't get a cellphone.\n\nthat was easy 30 years ago, now its impossible"
    },
    {
        "subreddit": "science",
        "sentence": "Nah, it is the same thing as children’s censorship on tv"
    },
    {
        "subreddit": "science",
        "sentence": "With all the studies on how apps are effecting youth development, laws need to be put into place"
    },
    {
        "subreddit": "science",
        "sentence": "Especially now that both parents working is the norm"
    },
    {
        "subreddit": "science",
        "sentence": "Test scores are dropping, kids are becoming too dumb to leave things in parent’s hands"
    },
    {
        "subreddit": "science",
        "sentence": "I mean the rise in youth crime is absurd, things like flash mob store raids are only possible because of apps"
    },
    {
        "subreddit": "science",
        "sentence": "If app bans can save a handful of kids from getting cyberbullied into self harm, I say ban away."
    },
    {
        "subreddit": "science",
        "sentence": "it's getting even worse now with everyone getting covid over and over, there is going to be a serious elder care crisis in society"
    },
    {
        "subreddit": "science",
        "sentence": "That’s like an amazing discovery"
    },
    {
        "subreddit": "science",
        "sentence": "\"If you had to pick between a man or a cow\""
    },
    {
        "subreddit": "science",
        "sentence": "What about the poor little promoted posts here? They need reach! Depression is the price to pay for a successful capitalism"
    },
    {
        "subreddit": "science",
        "sentence": "If only.."
    },
    {
        "subreddit": "science",
        "sentence": "I really wonder if the rise in ‘special’ diets is responsible for the ongoing increase in general food intolerances"
    },
    {
        "subreddit": "science",
        "sentence": "I was really surprised when my daughter was a bit gassy as an infant and the first thing the doctor suggested that we cut all dairy from her diet…I said I was concerned about this as I wanted her to be accustomed to eating dairy"
    },
    {
        "subreddit": "science",
        "sentence": "Month or two later and gas was gone with no change in diet"
    },
    {
        "subreddit": "science",
        "sentence": "If people are removing entire food groups as a ‘let’s try this’, could this be having a similar impact to the avoidance of nuts 15-20 years ago? It would be interesting to see if there is a rise in dairy allergies amongst children of vegan parents for similar reasons"
    },
    {
        "subreddit": "science",
        "sentence": "Really interesting research with hopefully positive results."
    },
    {
        "subreddit": "science",
        "sentence": "Could you link to the study? I'd love to justify buying a horse."
    },
    {
        "subreddit": "science",
        "sentence": "Cars may be one of if not the greatest contributors to noise in cities but they are hardly alone in causing city noise overall"
    },
    {
        "subreddit": "science",
        "sentence": "Cities are loud regardless."
    },
    {
        "subreddit": "science",
        "sentence": "Literally the most common combination - peanut butter and jelly."
    },
    {
        "subreddit": "science",
        "sentence": "Crazy we allow these motorcycles and cars that are modified to be crazy loud to drive in our cities"
    },
    {
        "subreddit": "science",
        "sentence": "They never seem to be charged"
    },
    {
        "subreddit": "science",
        "sentence": "NYC is the only city I have heard to take it seriously"
    },
    {
        "subreddit": "science",
        "sentence": "By assuming they should be there so if the person isn't getting better at taking the tests over time that's evidence of decline."
    },
    {
        "subreddit": "science",
        "sentence": "I’m from a small town where walking on the sidewalk the wrong direction relative to traffic gets enforced as a reason to stop people"
    },
    {
        "subreddit": "science",
        "sentence": "Had a cop acquaintance who was proud of getting someone deported after a stop like that."
    },
    {
        "subreddit": "science",
        "sentence": "Except when i was fed peanuts i had a severe reaction"
    },
    {
        "subreddit": "science",
        "sentence": "And now it seems like it’s actually a “trying to play it safe will make you sorry” thing."
    },
    {
        "subreddit": "science",
        "sentence": "I read a really interesting study years ago that children under 7-8 tend to judge how \"real\" something is by how appealing it is"
    },
    {
        "subreddit": "science",
        "sentence": "Basically, what causes the biggest neuron activation/dopamine hit is real and everything else is suspect"
    },
    {
        "subreddit": "science",
        "sentence": "Typically, anthropomorphic cartoons were most likely to be deemed real - even over realistic humans.\n\nFollowing that line of thought, it makes perfect sense that a socially tuned, novel, visually well-designed robot would be judged as more trustworthy than humans in this age group."
    },
    {
        "subreddit": "science",
        "sentence": "In most times and places, historically, older people live with an adult child or grandchild."
    },
    {
        "subreddit": "science",
        "sentence": "As someone who backpacks for fun and has met tons of great people on my trips into the wilderness, I highly doubt it"
    },
    {
        "subreddit": "science",
        "sentence": "Most random people are nice"
    },
    {
        "subreddit": "science",
        "sentence": "Hangout with a random person at home or the robot, I see the kid picking the robot."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, cities aren't loud"
    },
    {
        "subreddit": "science",
        "sentence": "Cars are."
    },
    {
        "subreddit": "science",
        "sentence": "Anaphylaxis in babies doesn't look like anaphylaxis in adults"
    },
    {
        "subreddit": "science",
        "sentence": "It's defined as an allergic reaction that triggers two or more separate body systems"
    },
    {
        "subreddit": "science",
        "sentence": "Most common is skin (hives or eczema) + vomiting.\n\nWe had a 6-month old enter anaphylaxis from 5 Bambas"
    },
    {
        "subreddit": "science",
        "sentence": "He was fine (paramedic meant to gave him Benadryl but accidentally gave him epinephrine instead) and after a bunch of OIT no longer reacts to peanut, but it can be quite scary in the moment."
    },
    {
        "subreddit": "science",
        "sentence": "They also saying having a pet is good for young children because they bring in allergens for exposure/resistance."
    },
    {
        "subreddit": "science",
        "sentence": "My mum ate 2 to 3 peanut butter and jelly sandwiches daily when she was pregnant with me"
    },
    {
        "subreddit": "science",
        "sentence": "First time I tried peanut butter I was around 6 months and I went into anaphylaxis  Still allergic all these decades later"
    },
    {
        "subreddit": "science",
        "sentence": "So some of us are just unavoidable peanut weaklings."
    },
    {
        "subreddit": "science",
        "sentence": "Seems like it was a more “better safe than sorry” thing."
    },
    {
        "subreddit": "science",
        "sentence": "We should just rename it Urineanus"
    },
    {
        "subreddit": "science",
        "sentence": "meat lobby going to war"
    },
    {
        "subreddit": "science",
        "sentence": "The thinking today is that allergies aren't really inherited, they're the result of the immune system not being exposed to enough pathogens when little"
    },
    {
        "subreddit": "science",
        "sentence": "Without stimulation to train it on what the \"bad\" kind of germs are, it starts going nuts when *anything* foreign enters the body."
    },
    {
        "subreddit": "science",
        "sentence": "Funny you say that, cause parents are usually the ones children distrust over their friends, for instance, and these days probably strangers (youtubers and inlfuencers)."
    },
    {
        "subreddit": "science",
        "sentence": "That's just not true when it comes to sickle cell/malaria."
    },
    {
        "subreddit": "science",
        "sentence": "Tbf it’s not really available anywhere but Israel"
    },
    {
        "subreddit": "science",
        "sentence": "It also understates what RNA can do.."
    },
    {
        "subreddit": "science",
        "sentence": "but yeah that is a hilariously poorly contextualized statement."
    },
    {
        "subreddit": "science",
        "sentence": "One theory is that today, the world is much cleaner and more sanitized in the past"
    },
    {
        "subreddit": "science",
        "sentence": "Kids pre-6 months are exposed to fewer allergens and particles in general, so they don’t build up as many immunities early"
    },
    {
        "subreddit": "science",
        "sentence": "Building off that, there was the advice of late 90s, early 2000s to parents to avoid any allergens for their kid to prevent them developing an allergy but whoopsie, that seemingly has the opposite effect\n\nI’m sure there are some other people theorizing microplastics also might have a hand since some research has shown that nearly all babies nowadays have a large amount of microplastics in their digestive system"
    },
    {
        "subreddit": "science",
        "sentence": "And those microplastics have been shown to weaken the immune system, potentially worsening allergy issues"
    },
    {
        "subreddit": "science",
        "sentence": "But that’s all theoretical because studies are very much in their infancy (poor word choice…) in relation to the effect of microplastics"
    },
    {
        "subreddit": "science",
        "sentence": "https://www.sciencedirect.com/science/article/pii/S0362028X22097459\n\n> \"The temperature of the wash water required for effective hand washing has not been extensively evaluated and still generates interest"
    },
    {
        "subreddit": "science",
        "sentence": "Wash water temperatures have an upper limit; very high temperatures that would rapidly destroy bacterial cells would also severely injure human skin (42,68)"
    },
    {
        "subreddit": "science",
        "sentence": "The temperature of the water used during comfortable hand washing would not by itself inactivate resident microbes"
    },
    {
        "subreddit": "science",
        "sentence": "Higher temperatures may still affect hand washing by increasing solvation or temperature dependent reaction rates"
    },
    {
        "subreddit": "science",
        "sentence": "\"\n\nYup, seems like the only thing wash water temp really affects is solvation rates"
    },
    {
        "subreddit": "science",
        "sentence": "Dude, that's what 'built for an environment' means"
    },
    {
        "subreddit": "science",
        "sentence": "It's the process of evolution"
    },
    {
        "subreddit": "science",
        "sentence": "None of our attributes came custom built like a lego set"
    },
    {
        "subreddit": "science",
        "sentence": "We are all byproducts of survival of the fittest, and all of human evolution is 'pressure of a certain environment' because the environment has existed long before homo sapiens, influenced our evolution, and continues to do so to this day"
    },
    {
        "subreddit": "science",
        "sentence": "So while what you said was factually accurate, it did not actually differ in any meaningful way from what I stated."
    },
    {
        "subreddit": "science",
        "sentence": "Well, much of suburbia is parking lot space"
    },
    {
        "subreddit": "science",
        "sentence": "Eliminate that and you resolve a lot of the issues"
    },
    {
        "subreddit": "science",
        "sentence": "Thanks for the suggestion; I’ll probably look into that"
    },
    {
        "subreddit": "science",
        "sentence": "The brain is such a complex organ, and pinpointing specific networks related to speech disorders like stuttering is a huge step forward"
    },
    {
        "subreddit": "science",
        "sentence": "Cataract surgery cuts dementia risk by 30%"
    },
    {
        "subreddit": "science",
        "sentence": "It also restores  20/20 vision"
    },
    {
        "subreddit": "science",
        "sentence": "It has been very helpful for me to get this precedure and it boosted my confidence enough to resume driving"
    },
    {
        "subreddit": "science",
        "sentence": "If you have catarcts and are undecided about this, talk to your doctor."
    },
    {
        "subreddit": "science",
        "sentence": "WE trust information from books and written sources more that we trust it direct from the mouths of other people"
    },
    {
        "subreddit": "science",
        "sentence": "I suspect this is just an extension of that."
    },
    {
        "subreddit": "science",
        "sentence": "The first exposure to an allergen is usually relatively mild"
    },
    {
        "subreddit": "science",
        "sentence": "If you give your child peanuts and they break out in hives or get redness or swelling, obviously don't try it again and seek medical advice"
    },
    {
        "subreddit": "science",
        "sentence": "But going straight to anaphylaxis would be rare, by my understanding"
    },
    {
        "subreddit": "science",
        "sentence": "I had a baby soon after this recommendation was introduced, and the more nervous parents (or those with specific reasons to be concerned like family history) went as far as doing that first introduction in the parking lot of the hospital"
    },
    {
        "subreddit": "science",
        "sentence": "It's like a vaccine--there's always going to be a tiny tiny risk, but it's pretty minimal and you're cutting the chances of a far bigger danger down the line."
    },
    {
        "subreddit": "science",
        "sentence": "My original point exactly."
    },
    {
        "subreddit": "science",
        "sentence": "And now we have a generation that could be wiped out with the peanut bomb"
    },
    {
        "subreddit": "science",
        "sentence": "Hydrogen bonds (the ones that make water on earth liquid) turn with enough pressure into full blown bonds between a now super saturated Water-Oxygen and 2 additional Hydrogens"
    },
    {
        "subreddit": "science",
        "sentence": "Copypasting Aquodiium \"(H4⁢O2+)\" like this is confusing"
    },
    {
        "subreddit": "science",
        "sentence": "Its more like H₄O^(2+)"
    },
    {
        "subreddit": "science",
        "sentence": "It was doctors, not necessarily scientists, but yeah they were giving advice on things that had not been thoroughly researched by making an educated guess"
    },
    {
        "subreddit": "science",
        "sentence": "Still wrong, but also an educated guess"
    },
    {
        "subreddit": "science",
        "sentence": "I’m not necessarily disagreeing with what you are saying here, though I think tea bags are still more convenient over loose tea"
    },
    {
        "subreddit": "science",
        "sentence": "However, the question I asked concerning your original comment - about how “normal people” use loose tea, is still unanswered"
    },
    {
        "subreddit": "science",
        "sentence": "What are you defining as a “normal person” when it comes to tea consumption?\n\nMost tea drinkers in the parts of the world I listed in my comment use tea bags, not loose tea in tea pots."
    },
    {
        "subreddit": "science",
        "sentence": "I'm 63 years old and have a younger brother and sister who are twins"
    },
    {
        "subreddit": "science",
        "sentence": "They're 22 months younger than me"
    },
    {
        "subreddit": "science",
        "sentence": "My mom, who was a stay-at-home mom, introduced all of us to milk, eggs, fish, crustacean shellfish, strawberries, wheat, soy, peanuts, sesame, and tree nuts as soon as we all stopped drinking formula.\n\nTo this day, none of us have any food allergies"
    },
    {
        "subreddit": "science",
        "sentence": "As a registered nurse, I recognize that mom's habit of introducing us to things that some people are allergic to made all the difference."
    },
    {
        "subreddit": "science",
        "sentence": "Find the drugs, find the tech (and technique)"
    },
    {
        "subreddit": "science",
        "sentence": "Subreddits on growing both cannabis and hot peppers are good starts for good starts."
    },
    {
        "subreddit": "science",
        "sentence": "Lower surface tension = things move better, water gets in more cracks on that tiny scale"
    },
    {
        "subreddit": "science",
        "sentence": "Also soap lowers surface tension dramatically"
    },
    {
        "subreddit": "science",
        "sentence": "At that heat it won’t do much to kill the bacteria but it can be enough to move it off the veggies"
    },
    {
        "subreddit": "science",
        "sentence": "It also makes it easier on your hands to move around since it will evaporate on surfaces and that can cool your hands too much if it’s not slightly warmer than room temperature"
    },
    {
        "subreddit": "science",
        "sentence": "If it’s hot like you think it’s going to kill the bacteria that’s actually too hot for you, too"
    },
    {
        "subreddit": "science",
        "sentence": "That’s for dishwashing machines and sterilisation equipment"
    },
    {
        "subreddit": "science",
        "sentence": "But if you really want to go safe you just obliterate surface tension with microwaves and radiation and then not much will survive that."
    },
    {
        "subreddit": "science",
        "sentence": "See : Oral Immunotherapy for Food-Allergic Children: A Pro-Con Debate\n\nMy problem with these studies is they only look at a particular blood indicator and base everything on that"
    },
    {
        "subreddit": "science",
        "sentence": "Would be unethical to make them eat a potentially fatal dose of allergen"
    },
    {
        "subreddit": "science",
        "sentence": "In this case the indicator was seen 90% less in the experimental group"
    },
    {
        "subreddit": "science",
        "sentence": "No kids in either group died (thankfully) which would be really why you would do this treatment"
    },
    {
        "subreddit": "science",
        "sentence": "So if you just look at death there was no difference in outcome"
    },
    {
        "subreddit": "science",
        "sentence": "Only looking at if blood marker response goes down ignores things like other issues that may now have a heightened risk"
    },
    {
        "subreddit": "science",
        "sentence": "Lots of studies mention an esophageal inflammation that goes down once treatment stops, I would expect prolonged inflammation would lead to future esophageal cancer risk"
    },
    {
        "subreddit": "science",
        "sentence": "Again these are lil babies, I would assume illness plus this chronic food borne inflammation would cause more damage than just an illness"
    },
    {
        "subreddit": "science",
        "sentence": "Every scientific endeavor should be we do not intercede unless the burden of proof shows the benefit outweighs the total risk known and unknown, and allergy research doesn't wholly try to figure that out"
    },
    {
        "subreddit": "science",
        "sentence": "Instead picks one thing, keeps track of anaphylaxis and vomiting and pushes forward.\n\nIf typically 80% of kids with an egg allergy grow out of it and this increases it to 86% is that 6% chance worth it or not."
    },
    {
        "subreddit": "science",
        "sentence": "i fully agree with what ya said above tho about the category being too broad and noisy"
    },
    {
        "subreddit": "science",
        "sentence": "that was a major motivating factor for doing this study, i wanted to start deaggregating conspiracy beliefs (an already existing category in the literature) into more narrow types"
    },
    {
        "subreddit": "science",
        "sentence": "...Both?  It depends on the person and/or the food"
    },
    {
        "subreddit": "science",
        "sentence": "You can also develop food allergies during your life, which truly sucks."
    },
    {
        "subreddit": "science",
        "sentence": "Children under 6 would rather be stuck in the woods with a random robot than a random man."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, I suspect the data from that is a big part of what led to study of the opposite approach"
    },
    {
        "subreddit": "science",
        "sentence": "It's easy to look back in hindsight and say they should have known better, but they were doing the best they could with what they had"
    },
    {
        "subreddit": "science",
        "sentence": "In any case, by the time I had my oldest 9 years ago the advice was to give a full spectrum of common allergens spaced out two weeks apart from 6 months on, so this is just reinforcing advice that's been around for a little while now"
    },
    {
        "subreddit": "science",
        "sentence": "I'm very glad I had my kids in a time when I had access to this advice and information (though it does make you wonder what you're still doing wrong but have no idea about yet)."
    },
    {
        "subreddit": "science",
        "sentence": "The kids died when mom ate peanuts"
    },
    {
        "subreddit": "science",
        "sentence": "Severe food ingestion allergies weren't able to be passed on to their descendents"
    },
    {
        "subreddit": "science",
        "sentence": "I had to take my nursing 5 week old into the ER after I took one bite of a (yummy!) Reese's pieces cookie offered by my doctor's office"
    },
    {
        "subreddit": "science",
        "sentence": "Kid inherited her father's peanut allergy (and her great-grandmother's shellfish allergy.)\n\nRegarding peanuts in particular, there's some theories that what was sprayed on the plants while growing accelerated human reactions"
    },
    {
        "subreddit": "science",
        "sentence": "No available studies to point to, though--no one would sign off on THAT study!"
    },
    {
        "subreddit": "science",
        "sentence": "Uranus does anyway"
    },
    {
        "subreddit": "science",
        "sentence": "Research Paper (open access): [How smart was T"
    },
    {
        "subreddit": "science",
        "sentence": "rex? Testing claims of exceptional cognition in dinosaurs and the application of neuron count estimates in palaeontological research](https://anatomypubs.onlinelibrary.wiley.com/doi/10.1002/ar.25459)"
    },
    {
        "subreddit": "science",
        "sentence": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science"
    },
    {
        "subreddit": "science",
        "sentence": "However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**"
    },
    {
        "subreddit": "science",
        "sentence": "Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise"
    },
    {
        "subreddit": "science",
        "sentence": "[Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/GeoGeoGeoGeo  \nPermalink: https://www.bristol.ac.uk/news/2024/april/t-rex-not-as-smart.html\n\n---\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "science",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*"
    },
    {
        "subreddit": "science",
        "sentence": "No kidding? With all the parents demanding removal of peanuts because they fear their children will die of peanuts only to make their children be more allergic to more ingredients"
    },
    {
        "subreddit": "science",
        "sentence": "It's a pattern that I've observed."
    },
    {
        "subreddit": "science",
        "sentence": "Bambas were how we discovered our 6-month old had a peanut allergy.\n\nI'm hearing now that peanut exposure is vital *in utero* - by the time they get to 4-6 months it's too late and the allergy has already developed."
    },
    {
        "subreddit": "science",
        "sentence": "For me it was Optimus Prime! Moral leader with strong integrity and an unflinching desire to do the right thing, no matter what!"
    },
    {
        "subreddit": "science",
        "sentence": "Fair point, though the headline is a bit suggestive."
    },
    {
        "subreddit": "science",
        "sentence": "In Mexico, people soak their vegetables and fruits in tap water and add a bit of Microdyn (or similar product) and let it sit dor a bit"
    },
    {
        "subreddit": "science",
        "sentence": "It kills what's on the produce and also what's in the water"
    },
    {
        "subreddit": "science",
        "sentence": "You can't smell or taste it"
    },
    {
        "subreddit": "science",
        "sentence": "I believe the active ingredient is colloidial silver"
    },
    {
        "subreddit": "science",
        "sentence": "Doing this in the US, also, would largely obviate this contamination issue.\n\nIn Mexico,  we consider leafy greens the food most likely to be contaminated (and especially lettuce)"
    },
    {
        "subreddit": "science",
        "sentence": "I know I've seen too many future apocalypse movies but this world seems like a bad plot"
    },
    {
        "subreddit": "science",
        "sentence": "The newest generation of humans are growing up with a preconceived notion that AI is their all knowing friend"
    },
    {
        "subreddit": "science",
        "sentence": "Yup, I see where you're going with this James Cameron."
    },
    {
        "subreddit": "science",
        "sentence": "The 80s-00s was also the \"Don't eat dirt!  Sanitize religiously!  Keep kids away from germs!\" era"
    },
    {
        "subreddit": "science",
        "sentence": "Medical thinking changed around 2015, and now parents are told \"Dirt is okay in moderation!  Germs are okay in moderation!  Expose their immune systems to icky stuff early because if you don't they go crazy and start attacking their body and that's how you get allergies.\"\n\nGiven that my first (born a couple years before COVID) and third (born this year) came out seemingly without any major allergies but my second (COVID baby) has a peanut allergy and all sorts of eczema/skin stuff, there may be something to that."
    },
    {
        "subreddit": "science",
        "sentence": "This is the important part"
    },
    {
        "subreddit": "science",
        "sentence": "They controlled for confounds:\n\n“Logistic regression models were controlled for individual-level, family-level, and area-level confounders, and e-values were calculated to estimate residual confounding.”"
    },
    {
        "subreddit": "science",
        "sentence": "And Ayahuasca retreat participant coworkers report a 100% increase in boring Ayahuasca stories."
    },
    {
        "subreddit": "science",
        "sentence": "Was this an allergy concern or a choking hazard concern?"
    },
    {
        "subreddit": "science",
        "sentence": "Always in the gym and hot box equals no time in your schedule for psychosis"
    },
    {
        "subreddit": "science",
        "sentence": "One of my biggest hopes is that we build our cities and towns to be more walkable.\n\nWe need cars too because not everyone will be physically fit enough to walk, or might need a self driving car to go to the doctor or see family or something.\n\nBut many people will never be able to afford a self driving car"
    },
    {
        "subreddit": "science",
        "sentence": "Even today many elderly people can’t afford assisted living facilities"
    },
    {
        "subreddit": "science",
        "sentence": "Many are becoming homeless too.\n\nHaving a walkable city means the elderly can still have a life outside of their home without driving that is affordable and accessible.\n\nBut first we have to legalize medium density housing."
    },
    {
        "subreddit": "science",
        "sentence": "My poop comes out of my black hole."
    },
    {
        "subreddit": "science",
        "sentence": "I can’t wait for the drug prices to come down…."
    },
    {
        "subreddit": "science",
        "sentence": "wait… what’s that?…"
    },
    {
        "subreddit": "science",
        "sentence": "Sorry I’ve just been informed it’s really not that much cheaper so the prices will be going up to compensate the share holders."
    },
    {
        "subreddit": "science",
        "sentence": "Who recommended or endorsed this strategy? My kids were born in that era and our pediatrician made such recommendations"
    },
    {
        "subreddit": "science",
        "sentence": "They aren’t some nutball, I’m sure they were following norms in the medical community"
    },
    {
        "subreddit": "science",
        "sentence": "I’m not an expert in this field, but a Google search indicates the American Academy of Pediatrics recommended toddlers avoiding peanuts etc until 2015"
    },
    {
        "subreddit": "science",
        "sentence": "Some pollutants reflect or block sunlight and cool the atmosphere. \n\nOther pollutants trap heat and warm the atmosphere. \n\nWe’ve managed to cut down a bunch of the first type, but still emit a huge amount of the second type."
    },
    {
        "subreddit": "science",
        "sentence": "This is a 100% correct answer"
    },
    {
        "subreddit": "science",
        "sentence": "I'll stake my entire reputation on it!"
    },
    {
        "subreddit": "science",
        "sentence": "Or just building cities differently"
    },
    {
        "subreddit": "science",
        "sentence": "4000 home developments without any commercial space for a grocery store, hardware store, park, school.."
    },
    {
        "subreddit": "science",
        "sentence": "Of course you need a car when they only way to get *anything* is to drive 20 minutes"
    },
    {
        "subreddit": "science",
        "sentence": "A bus route doesn't solve that issue, really."
    },
    {
        "subreddit": "science",
        "sentence": "Yeah, I'd hope more people in /science would appreciate that 'common wisdom' is often wrong."
    },
    {
        "subreddit": "science",
        "sentence": "So… did the scientists of 2005 telling people to avoid giving their kids peanuts or strawberries not know about this method?  \n\nI’m not questioning the validity of science, writ large"
    },
    {
        "subreddit": "science",
        "sentence": "Science is cool"
    },
    {
        "subreddit": "science",
        "sentence": "I am questioning the strength of studies in certain fields"
    },
    {
        "subreddit": "science",
        "sentence": "Nutrition seems to be one of the least replicable (this is needed for the scientific method) and the most variable in outcome fields"
    },
    {
        "subreddit": "science",
        "sentence": "Lots of bad advice has come from this field (hydrogenated oils to replace saturated fats, baby formula over breastfeeding, replacing fats with low quality carbs, avoiding allergen exposure, over-sterility of foods and ignoring gut biome etc)"
    },
    {
        "subreddit": "science",
        "sentence": "These errors are very apparent in hindsight, and I think it is unlikely that nutrition scientists of 2024 are immune to the errors of just a few decades ago (they are often the same people, or contemporaries, or mentees of those who made those errors)."
    },
    {
        "subreddit": "science",
        "sentence": "Major limitations in drawing meaningful conclusions with this methodology"
    },
    {
        "subreddit": "science",
        "sentence": "The authors state:\n\n\"we were unable to account for familial disposition for mental disorders, quality of life, use of drugs such as cannabis or an indicator of social deprivation, which are all potential confounders"
    },
    {
        "subreddit": "science",
        "sentence": "Third, the results cannot be generalized to women, other age groups and other populations"
    },
    {
        "subreddit": "science",
        "sentence": "Fourth, we could not assess the association between sauna bathing and risk of psychosis when comparing people who used sauna versus people who did not use sauna at all, because of the small numbers (n = 12) who did not use sauna at all"
    },
    {
        "subreddit": "science",
        "sentence": "Indeed, sauna use is a tradition in Finland and the majority of people use the sauna at least once per week\""
    },
    {
        "subreddit": "science",
        "sentence": "Enjoy them while they last, I have a feeling Uranus and Neptune are the two planets most likely to be dissembled for materials and fuel first."
    },
    {
        "subreddit": "science",
        "sentence": "Why warm water specifically?"
    },
    {
        "subreddit": "science",
        "sentence": "We can consume less raw vegetables, i.e"
    },
    {
        "subreddit": "science",
        "sentence": "salads, and switch to more cooked vegetables"
    },
    {
        "subreddit": "science",
        "sentence": "The potential loss in nutrition is minimal"
    },
    {
        "subreddit": "science",
        "sentence": "Just look at the diets of the Okinawan people, one of the healthiest people on the planet"
    },
    {
        "subreddit": "science",
        "sentence": "They don't eat raw salads as a rule."
    },
    {
        "subreddit": "science",
        "sentence": "i don’t use the phrase conspiratorial thinking anywhere in the article, that phrase refers to a particular psychological disposition\n\nbut yea, belief in conspiracies is counted whether or not the particular belief is true"
    },
    {
        "subreddit": "science",
        "sentence": "some conspiracies are real and some are not"
    },
    {
        "subreddit": "science",
        "sentence": "they fit the category of conspiracy regardless (standard definition is private plot of the powerful)\n\nthis isn’t a study of false beliefs, it’s a study of conspiracy beliefs"
    },
    {
        "subreddit": "science",
        "sentence": "My guess is that this is children picking up on social cues"
    },
    {
        "subreddit": "science",
        "sentence": "Are their *parents* displaying more trusting attitudes towards other people, or electronics? Does Mom get more nervous dealing with a teller at the bank, or an ATM? And, by extension, how comfortable are these kids around people, vs"
    },
    {
        "subreddit": "science",
        "sentence": "around inanimate objects? How dangerous do they perceive them each to be?"
    },
    {
        "subreddit": "science",
        "sentence": "I know you *think* it's pointless research, but it isn't"
    },
    {
        "subreddit": "science",
        "sentence": "I'm sorry you can't see that."
    },
    {
        "subreddit": "science",
        "sentence": "I've always felt a basic cognitive test for all drivers renewing their license at 65+ years old should be mandatory"
    },
    {
        "subreddit": "science",
        "sentence": "Even if it's a basic reaction time test and impared vision test"
    },
    {
        "subreddit": "science",
        "sentence": "An average above X amount of time and/or objects unnoticed is a disqualification for license renewal."
    },
    {
        "subreddit": "science",
        "sentence": "This has been known for a while."
    },
    {
        "subreddit": "science",
        "sentence": "The problem is waste from animal farms getting on them"
    },
    {
        "subreddit": "science",
        "sentence": "And no, for some dangerous bugs not unless you cook them"
    },
    {
        "subreddit": "science",
        "sentence": "Which is not how most people eat them"
    },
    {
        "subreddit": "science",
        "sentence": "This is why you should try to only by whole heads instead of boxes of mixed greens"
    },
    {
        "subreddit": "science",
        "sentence": "this was exactly what I was thinking"
    }
]