[
    {
        "subreddit": "todayilearned",
        "sentence": "Except for what we recycled and what Tokyo and Sweden burnt for fuel."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No, but if you compare stories of white men doing it to Indigenous women, they are framed completely differently"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pocahontas has her story told as a love story, and Indigenous women are still at a heightened risk of sexual violence and murder in our society (disproportionately by white and non-Native men)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Framing is extremely important, and we rarely see an honest framing when it comes to Native women’s stories"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Everyone is always focused on the men and wether they deserve to be respected or not, and not on the women and what they go through."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Al Gore wouldn’t have had to do a 9/11 if he’d been elected president"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thats why my balls keep getting bigger.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "fuck"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And let me guess"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We don't know a whole lot about their long term effects on us?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which might have still been true, idk, just a guess but they probably made some bad ass radios in the 40s, perhaps a fridge in the 50s\n\nI had a radio from the 80s that was awesome, till I lost it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There have likely been dupes before; I have worked for several :D Willing or unwilling dupes though? I suspect mostly the former and can't bring myself to believe in the latter -- they have a lot of incentives not to look at this shit closely, to clutch at straws"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Even more fun if you imagine it with a camp German accent."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s inevitable, so how we gonna fix it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A Brazilian."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "BS theory"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Many things show origins from 6th cent"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "BC, and Margherita was made in 1889."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Phteven"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Boring used to have a strip club."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hmm, I grew up with a hand-cranked coffee grinder screwed into the kitchen counter...."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I mean, weird or not, what is AI supposed to do with beer anyway?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And if you see the big oil projections to their shareholders it will only get worse"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In order to maximise profits they are [heavily focusing in increasing](https://www.cnbc.com/2022/01/29/how-the-fossil-fuel-industry-is-pushing-plastics-on-the-world-.html) production of plastic rather than reducing it, and [spending millions to gaslight the population](https://www.bbc.co.uk/news/business-67343893) into thinking their recycle schemes work."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Christian here, don't be that guy, this is why half of Reddit hates us"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you had spaghetti and a salad, in which order would you eat it?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Humans have used coal since ancient times"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was instrumental in our advancement of metallurgy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We wouldn't have been able to even get to the point of making a steam engine without using coal to advance our ability to produce better and better metals"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is so significant that we named the eras in terms of the new metals that were produced"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Steel actually requires coal to be made.\n\nIt's also an issue of energy density"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We can power everything by wood, but we would need magnitudes more of it compared to coal and oil"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You would also need so much more wood to power whatever is transporting that wood, and it would spiral out to rapid deforestation and would release even more CO2 than the more efficient fossil fuels"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You can also leverage fossil fuels to gather more fossil fuels in an exponential way that just isn't possible with wood"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This exponential increase in power production effectively fuels our exponential advancements in technology"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "62 years after the end of the Industrial Revolution, the first plane was made"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "67 years after that, we landed a man on the moon"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hopefully, this advancement will soon lead to fossil fuels becoming mostly obsolete with renewable energy and batteries becoming better"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Western nations have been pouring money into this recently, although not really because of climate change but more to weaken the grip that Russia and OPEC have on them but honestly that's a good motivator and will probably help us get there sooner than later."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Of course it incentivies innovation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That doesnt mean all the greed of humanity disappears"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There’s no perfect system because humans are imperfect"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Survivorship bias"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We mock the for the current processed foods, as they are full of corn syrup and other things that are just unhealty and added to cut costs and create addiction."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes, about 4000 people from different countries"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Scientists for the most part.\n\nedit: [Antarctica has no indigenous inhabitants, only permanent and summer-only staff at its many research stations"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Along with the 1,100 to 4,400 research staff, there is usually an additional 1,000 personnel, including ship's crew and scientists performing on-board research in the waters of the treaty region of Antarctica.](https://worldpopulationreview.com/continents/antarctica-population)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Probably to use the open WLAN to conduct business without leaving a trace."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "depending on how things go this year, Chinas peak emissions might be 2023"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Y’know… make PACs illegal, make businesses donating illegal, set the individual donation limit at like 3% of the median annual wage…"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Do that, and I’m fine with like a .3% tax for campaign financing."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> climate change is now posing an immediate and real-world economic cost\n\nOnly when it’s finally up in their face and hurting their pockets will people begin to do something.\n\nHell fucking yes that’s negative"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Tide isn’t turning fast enough"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Actually water levels are increasing"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Tide is killer now"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Please send help."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We dated for 2 years and she never stopped grinding her teeth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "After we broke up, we didn't really keep in touch"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Couldn't tell you."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pull yourself together man"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "😂"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "do you think it is caused by stress in his life or at work?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Birth rates are falling globally, though, with no end in sight"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's not just Korea and Japan, but all of Europe and much of Asia, with Americas following soon after"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And the increased production doesn't make it to the average citizen.\n\nAt the moment there is no estimate for when population decline should slow down or stop"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Rn Africa and parts of Asia are still keeping the planet wide population growing, but that'll stop in 80 years or so"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Japan Korea and possibly China will drop to half their current population.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "By 2100.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Following the optimistic UN predictions where the birth rates stop declining almost immediately"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But there's zero indication of the rates themselves stopping falling, and anything below 2.1 is mathematically speaking path to extinction"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sure, in reality the rate will probably stabilise somewhere, but there's zero proof if or when"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Will world population fall to 4 billion? 1 billion? Pre*industrial levels? How fast?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "did it eventually go away or did her teeth wear down? did she have a stressful life or take medications?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I compost"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Separate metal"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Within half an hour, the scrappers pull it from the alley"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most of my paper is junk mail"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm anti-consumerism"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My furniture is all wood antique"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Over 90 percent of my waste is plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It takes months to fill a Brute trashcan"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Still smells better than the stink bags my parents would rush to throw out before the garbage truck rolled up"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But, yeah, that's a metric shitton of plastic and I'm constantly seeing massive piles of cardboard"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don't get it."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My husband bites through his mouth guards about once a month from grinding his teeth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The only time they last longer is when he loses it for a week."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "She was captured as a child and lived more years with captors, probably barely remembered her early life"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So to my mind it's pretty normal to grew closed to that way of life and people"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I broke up with a girl because she'd grind her teeth at night"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Jesus christ that sound drove me up the fucking walls"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I can still hear it sometimes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I got her a mouth guard even and she gnawed through that fucking thing in a week"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Doctors visits, even muscle relaxers, that girl still ground her goddamn teeth all night"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Couldn't take it anymore."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Or you you could be the cool one with either a stainless or copper straw & a set of reusable bamboo utensils"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My finger is deformed from chewing on it for over a decade"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's not the bun that makes a burger"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"Hamburger\" originally refers to the ground beef patty itself, so by extension, for a sandwich to be a \"burger\" it should be made with ground meat."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cum bust ion"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sometimes I can still hear his voice...."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Quit doing coke."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "50 Shades of Greyskull"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Luckily they dont have microplastic in their testicles"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh god, it's one of those spam links that link to reddit comments leading to other reddit comments."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "God this historical take is so tired.\n\n1) Populations in Europe stopped growing exponentially pretty much by post WW1, yes there's still growth in Western Countries through immigration but the population differences are not nearly as large as they are in the developing world.\n\n2) Technologies of the past were inherently way less efficient, like we're talking an order of magnitude if not even less efficient in terms of the value that could be gained from pollution.\n\n3) Historical reasoning is shit because it totally ignores the fact that we're staring down the barrel of the dual problems of population growth/economic development in developing countries"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "China will have more historical emissions than the USA within this decade, in fact, it will have more historical emissions than the EU + USA combined probably by mid 2030"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Southeast Asia + Indian subcontinent + Africa has about 8 billion people trying to go through the same process (by the time in which it happens), which we simply cannot afford as a planet.\n\n4) OECD average emissions *per capita* is lower than China's"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "USA and Canada are outliers"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nevermind that cold environments inherently have much higher emissions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The best thing that can be done is advocating for less suburban living, but the reality is that people really like suburbs, as any country develops economically, they get more and more suburbs - so the next best thing is population reduction (most immigration to western countries should not be happening from an environmental perspective, though I guess its ok going from China to Europe now lol)\n\n  \nClimate change would've been much more easily resolvable if the UN sterilization programs of the 1960s were allowed to continue and the developing world was transitioned to 2-3 births per woman, considering that short of cutting down important forests and environmental reserves, many countries in the developing world can't really feed themselves all that well and rely massively on exports on the international market for stability"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The combination of food insecurity + young populations makes wars far more likely for people of the developing world (which continues to empower the poverty cycle).\n\nWorld should've been capped to 4-5 billion until we figured out more efficient technologies either technical or social, because we've way overshot on our land use numbers.\n\nJust look at Egypt, Egyptians would be so much better off if there was 1/4 as many Egyptians as there are now, that's a country that's incapable of getting better because there simply isn't enough resource accumulation for people to advance up to the next stable point in terms of social development."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Only since 2021? Do try to keep up"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oil Companies (especially in Australia) have been doing that for years!\n\nSome Oil Sheik dies? Prices in Australia go up instantly (no waiting for existing supply to be used up first).\n\nAustralian Oil Companies think that the ACCC is too busy? Up go the prices! And the ACCC never finds anything (as usual)."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yep, my abusive ex would wail like a hurt dog if I so much as set a boundary, even years after HE left ME"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He managed to convince himself I had BPD and is now a frequent poster on BPDLovedOnes."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "he wouldn't have languished in jail"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "most high ranking nazi officials tried at nürnberg were hanged if they didn't manage to get ahold of cyanide first"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i know how OP meant it, i'm just ok with swift justice in this case."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So “ Father kills Daughter “ should of been the headline."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The clue is in the memes 🕵️"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What an idiot lmao"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Even the great majority of yarn today is acrylic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I still don't understand why he had his laptop open in a public library in the first place."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Well their was a doctrine that god had given this 'new' land to the christians, \n\n\nand the most zealous believers figured they were answering their gods call and could settle wherever they pleased with little need to protect themselves."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just because you dont understand it doesnt mean it isnt an issue"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A nice start would be to look up papers about the effects of microplastics and its chemicals on filter feeders (marine life - oysters etc.)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They are one of the first species to come in contact with large amounts of microplastics due to the way they forage and are also at the bottom of the foodchain."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not as lucky as the companies that wouldn't *exist* right now without handouts"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fuck GM."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's impossible, Pontiac went out of business in the late 00s!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "would it really have been that easy for them to make carbonara? I hear the same mythology for alla gricia that poor shepards roaming the pastures in lazio would quickly whip up a bowl of pasta alla gricia.\n\nJust some speculation but:\n\nBoth those dishes are relatively easy to but they rely on having good temperature control and finely grated cheese"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which is easy to achieve in a modern kitchen but not so easy when cooking over coals or a fire"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Would the average roman 1-2 hundred years ago have had a cheese grater? I’ve no idea honestly maybe they were common\n\nImo the easiest hearty dish to make that would serve a decent number of people would be a big stew or just bread + cheese + some kind of cured meat maybe"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I believe there is a type of flat bread traditional in the Lazio area called Piadine."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Seeing how cold it is there, one match wouldn't be enough"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> What if life and the universe was meant to happen"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What if we were supposed to develop life and take this plastic and spread it around the planet so some older form of life or information or energy could complete their lifecycle?\n> \n> \n\nThen you're convinced that there is a \"plan\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There isn't"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's no higher being that planned out what you're doing today, or that humnaity would evolve the way it did, etc.\n\nWhat we decide to do *now* is what will effect the future, there's no grand plan from eons ago that we're just helpless to fight against that means we need to pollute the planet or kill off so many species.\n\nAnd because there's no plan.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "there's no limit to how far we can go or how badly we can fuck up"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We can absolutely (and maybe have already) take things too far and destroy the planet enough that humanity will wither and die out as we know it today (or completely) as has happened to lots of species in the past."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What’s more than Trillions??"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thanks"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Now, I am imagining a burger sitting in a vent with a lighter."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Exactly"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Tag your friends to totally FLEECE them!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Tear down that wall \nMr"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Gorbachev ."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "was in 1989"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yup"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This summer\n\nRob Schneider is\n\nTHE HUMSTER"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No, I don't believe I shall"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But thank you all the same."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Maybe, have a reread of the comment I was responding to.\n\nIt was pretty specific, in saying that other plants might not have plastics because they might not have the same level of fossils as us"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I havnt made a single comment on anything other than, “plastics don’t need fossils to be made”\n\nAll of which you are saying is probably correct - it’s just not an opposing viewpoint (or adding) to anything I have said"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We are likely in agreement."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "really? so that's why some adults at raves wear a pacifier so they don't grind their teeth as much? or chewing gum helps?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I had a university flatmate with bruxism and he made so much noise that it could wake me up across the room"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He tried fixing it by drinking a shot before bed each night"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It didn't work, but he did sleep better."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Isn't that also true that half the people that ever existed were born in the last century or so?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "These are the people whoi invented The Big Lie"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ask yourself if Hitler seemed like the sort of fella who would just hang around to the end and then off himself"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No, no he wasn't."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "TIL that many people think that Woman have more Ribs than Men."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Also saw somewhere that the pacifier became part of the typical raver uniform to protect against this very thing"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thanks for the recommendation! Just finished reading Comanche Moon by Larry McMurtry, which had both Quanah and his mother as characters."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All kinds of foods started being put in plastic containers"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It makes stacking products on shelves easier"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There were all the plastic bags  to put your veggie/fruit in."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Marie Curie comes to mind."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In the UK you just have to walk around the shop B&M to see how much plastic is made, and likely thrown away shortly after since most of the stuff is just cheap crap made for a quick cash grab."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nah it's probably so they dont completely dissolve from the air humidity, since they are very cleverly designed to do so, the very insant they touch your drink."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'd say there's a higher chance of a baby drowning in a bucket."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I wouldn't sit next to a chimpanzee"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They have the strength to rip your face off at a whim.\n\nFuck those things."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bacon and eggs are both meats that can be produced by a single farmstead though"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And they had more than 10sqm plots of land in a lot of the country"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My grandmother was born as a farm girl in Northern Umbria in the 1930s"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Today her town is population 6000, and density 160/sqkm"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can you not imagine how sparse the land would have been in the 30s?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's this thing I saw somewhere about Rogers teaching us to be nice to other people, Irwin teaching us to be nice to animals, and Ross teaching us to be nice to ourselves\n\nWhat about the others on your list, I wonder"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most of my bruxism went away when I learned how to massage my masseter, temporalis and both pterygoid muscles."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fair point"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I kinda assumed there would be conflict, but I guess they can also co-exist on a way."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Our current problem is that we produce enormous amounts of plastics because they are a cheap by-product of fossil fuel dependency.\n\n  \n\n\nThe hypothesis was that the abundance of plastics might be one of the great barriers.\n\n  \n\n\nThe counter argument was that alien life might not necessarily have access to fossil fuels like we do.\n\n  \n\n\nTo which you responded that plastics can be produced without fossil fuels.\n\n  \n\n\n  \n\n\nThe question is if the amount of non-fossil fuel plastics on alien planets matters"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My point is that plastics are useful but that the main factors which make them a problem are low degradability, which lets them accumulate, and low price, which incenticives their use"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If an alien civilisation had to make do without fossil fuels and managed to develop to the point where they can produce non-fossil fuel plastics, they might not face the same problems with plastics that we do"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "For such a civilisation, plastics would not be a great barrier."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sure"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The famous medieval Count De Bear, who had the power to travel in time...\n\n\nThat's beyond dumb."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh come on, don't leave a homie hanging!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The best Cranberries song of them all"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I also love both of Faye Wong's versions."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I do love plastic actually"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Exactly"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">they were called by their god to do so and protected by their god. \n\nSorry I'm not American but what does this mean, can you elaborate?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And you have room temperature iq."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Comanche had kidnapped her after killing some of her relatives so it’s kind of bad all around."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "searched too long for that comment! I'd read the book several times in my youth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Very well written by author Lucia St"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Clair Robson."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What happened to the indigenous in the America's is fucked up, however the Comanches 100% deserved their destruction, they were complete pieces of shit."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They'd be nearly 100 now at minimum, but it does seem weird that no one got around to asking some old Roman chefs while many were still alive."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Billions of cows enabled by.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "modern industrial infrastructure!\n\nAnd we still haven't figured out how to monetize it.\n\nLandfills are a source of methane that can be harvested, but.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "once again, modern industrial infrastructure required to get enough garbage in one place.\n\nWe have lots of energy options because energy access has given them to us."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not nearly as long as it would take to cut them all down which makes them a renewable resource if they’re replanted."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You are just parroting a conspiracy theory popular on Reddit.\n\n\nBut that doesn't make it less stupid.\n\n\nIt's like pretending car worth nothing and Chrysler is artificially inflating the price of plastic, rubber and steel.\n\n\nHow a minor actor can do that world wide in a free market? How the raw material is the same thing as the final product?\n\n\nIt's just a completely stupid theory"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s interesting how they can engineer stuff in such a way that it only breaks right after any sort of warranty is up"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah, in America."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Internal cumbustion engine=creampie machine"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "k"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can we still own humans?\n\nWhat no! That’s slavery!\n\nOh okay…"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hey how about the other great apes? We still cool with that?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hunger is the mother of all national dishes?  Lol"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I feel like a lot of ppl see the world going to shit no matter what for any number of reasons, so if everyone thinks it’s all going to end relatively soon anyways or that humanity as a whole is already too far gone they’ll think “who really cares” when it comes to issues like plastic that doesn’t effect their daily lives except in a way that they find convenience in"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A Chinese gamer at that!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yet I am still jerking with my own tears."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Well if the Wikipedia article about him is to be believed he never really saw his father when he was younger except for one week in the summer at a fucking baseball camp"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I doubt that there was a lot of love between the two of them."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cheering when bad things happen to people we don't like is as old as humanity, and it isn't some flawless virtue either, you aren't upholding some moral principle by being glad something bad happened to a jerk."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Honestly it doesn't matter that much"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can just think of the Climate getting fucked like the planet's immune system fighting back a virus, which would be us.\n\nEnough of us die off it'll fix itself after a few million years"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In the mean time, let us be impressed that we fucked the world in a single lifetime on damages that will take eons to fix, very impressive all things considered.\n\nGod help any alien race out there, especially if they're peaceful"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We will ruin the universe as far as we can touch it if we ever make it off this rock."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "George Carlin  wasn’t it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Olive oil is not considered a delicacy in Sicily even after all the advertisement we have today, 100 years ago it was easier to get than clean water"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The place was never poor in terms of not having food, it was poor as an economy."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s crazy how quickly plastic production has ramped up"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Recycling efforts need to catch up."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Dead people can't own anything\n\nThe chimp is someone else's"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I remember an Australia radio show used to sponsored Bubbles."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I hope you are well!!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'd argue that we're actually too happy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Too happy to bother fixing our shit."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Good stuff!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oil company price collusion.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Is literally the reason OPEC exists"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Why tf doesn't the antitrust system enforce it's mandate against that cartel?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This might just be survivorship bias"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There were probably hundreds of that same model of coffee grinder that died in 10 years for each one that lasted 45 years."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "right but there are specific and honestly vital reasons why this is important for people at this stage of life"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "loss of bone density is a huge problem."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You just know it's AI inventing AI BS from wikipedia though, don't you"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Was there a few days  ago"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wasnt a line per say"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Depends on the moment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Could be empty"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Could be a family and 2 or 4 tourist couples wanting to take a picture with it."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Capatalism bby"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I still use the one I got in 1993 as a wedding gift!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Enzymes are proteins, that's all."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Survivor bias"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We don't count all the stuff that broke and was discarded years ago."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I believe Ford had recapitalized at the perfect time and bet on a big recession, or something to that effect, so they got kind of lucky."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "yep, pretty dumb replies here"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "really underscores the lack of knowledge (and interest) in this area."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "South India started eating chappathis since US sent wheat for fighting the famine."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Got a little electric skillet purchased in the 90s, about as old as I am"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The thing probably uses a dangerous amount of electricity because the thing gets burning hot in like 30-60 seconds.\n\nI should actually test to see how long it takes to boil a pot of water, a recent one my mom got takes like 20 minutes to get a boil."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They’re still bitter."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sure, you can look at the most recent 2023 World Energy Outlook https://iea.blob.core.windows.net/assets/86ede39e-4436-42d7-ba2a-edf61467e070/WorldEnergyOutlook2023.pdf"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'll quote the part most relevant\n\n\"There is noticeably less reliance on early-stage technologies to reach net zero emissions in the updated NZE Scenario than in our first roadmap report in 2021"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "At that time, technologies not available on the market, i.e"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "at prototype or demonstration phase, delivered nearly 50% of the emissions reductions needed in 2050 to reach net zero"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Now that number is around 35% (Figure 1.17)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Progress has been driven by both public and private efforts to further develop and commercialise new clean energy technologies, spurred by supportive government policies and the growing market prize of the clean energy economy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Energy R&D spending by globally listed companies exceeded USD 130 billion in 2022, an increase of 25% from 2020, and clean energy venture capital flows remain strong, despite the more difficult macroeconomic  environment.\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In addition to the other reply, they usually go over photos of female celebrities looking for any sign of an Adam's apple."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You're completely missing the point"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They're saying that to \"break through\" the massive technological barrier that was industrialization, we needed massive amounts of energy and the only source of this energy that could be feasibly exploited at the time were fossil fuels"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Now that we have broken through industrialization, we can turn producing energy more sustainably"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No one here is arguing that we need to continue using fossil fuels."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Is it possible to choke on a night guard during your sleep? That’s the only reason I’m afraid to use one lmao"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thank fuck for air fryer"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Completely changed my approach for vegetables."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not sure if you know, but there are a lot of couples who can’t conceive"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "IVF is now not so unheard of"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Between these plastics, the forever chem H2O & the known carcinogens & other deadly chems our FDA is knowingly & willingly allowing in our food supply & health care products."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Damn you're so....dumb"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As in unfortunately couldn't be tried in a court"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Facing the trial, getting their crimes reiterated, being at the receiving end of disgust and languishing in jail like a common criminal seems more of justice than swift death."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's a common misconception that anything in the Bible is factual"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "🙄"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes, I know that, the issue was with using them on 9/11."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Who did he brag about this to for it to be known?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Read empire of the summer moon if you haven't, goes in to detail about her and her family and the aftermath of her captivity"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Warning though it also goes in to graphic detail as to all the horrific shit both sides did to eachother back then along with all the interesting stuff."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's the plastic epidemic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Some key facts: Production increased exponentially, from 2.3 million tons in 1950 to 448 million tons by 2015"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Production is expected to double by 2050."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I agree, I’d like to protect my jaw, not just my teeth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So far, nothing works."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Someday in the distant future, humanoids will be reading facts about how at the turn of the second millenia, scientists thought that quarks were the most basic form of matter."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Alternatively, people find a silly thing silly and funny?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sue me."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it was used daily from the mid 90s until 2010 and i've used it for 100s of hours of gaming since then"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Has anyone tried changing lifestyle changes or ways to reduce stress, which presumably causes involuntary teeth grinding during sleep?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They managed to decipher it shortly after and discovered it was an erotic fanfic, with what appears to be math homework scribbled in the margins."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You got frozen?! We got canned, boiled, again, with some bacon so it gets all rubbery"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Best of luck!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My second favorite video of Gino is about \"sausage in a hole\".\n\nNot a day goes by when I don't say to myself \"sausage in a hole, it's rock'n'roll\"."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh hi there Gojira."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Any idea if this game is still on the shelf!?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I felt the same way as a kid and didn’t have the language to explain it for a long time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But then….\n\nI clearly remember the day I discovered the word ‘suicide.’ I was 7 and it was mentioned on the news"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I asked my mom what it meant"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "When she told me, I had a *Eureka!* moment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Like the universe showed me all its secrets"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’ll never forget it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bruv, the evidence is walking around London on the reg seeing actual foxes all the time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You questioned that there were animals living in cities that could hurt cats"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I simply said there were"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you had asserted the frequency or likelihood of attacks, your rebuttal would be relevant but that wasn’t what was previously being discussed."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but i sneeze uncontrolabley for about 5 mins"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Big fire = bad\n\nLittle fire = possibly bad\n\nHere's a study that links to a bunch of other studies about the effects of microplastics on the earth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10151227/\n\nOne of those studies is about the effects on marine life"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://www.sciencedirect.com/science/article/abs/pii/S0141113619303927\n\nAnother is about the study of the effects on cardiovascular health"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://pubs.acs.org/doi/10.1021/acs.est.2c03980\n\n>You just said nobody knows why"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So what makes you think you can attribute it to plastics?\n\nIf everyone on earth has to deal with lower fertility, it means there is some global environmental issue.\n\nThere are only 3 possible candidates that affect everyone on earth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "1: Climate Change\n\n2: Pollution\n\n3: Microplastics"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Half of all living people were made in the last 40"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There are more than twice as many people on Earth now as when I was born, and it's not slowing down."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> Kinda"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Why would the government do lease payments on private property for a windmill or a solar farm when you and I both know they’ll use unutilized land to avoid all that.\n\nWhy would the government get involved directly? Let the market figure it out.\n\n>Even if they did, then they’ll leave a rotting tower there after the lease as they ineptly forget to remove the windmill site for 20 years or so.\n\nOne more reason to not let that level of ineptness be applied on nuclear sites.\n\n>Also, nuclear sites can host entire solar panel farms in all the acreage around them, no need for all this extra land use.\n\nSo you acknowledge that nuclear sites use a lot of land as well"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which has to be free because of safety regulations."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i seriously thought i was the only one i have to run to the bathroom to sneeze after almost every meal!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They didn't use them during 9/11, but both the Taliban and al-Qaeda do use weapons that either came directly from the US, or were left behind by them."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Everyone watch this movie!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's if you survive the gang rape and other torture,  and if that particular group decides to let you live as a slave. \n\n\nThe natives of that region all knew to never be captured alive. \n\n\nUnfortunately the american men that took their families to live in native territory were assured they were called by their god to do so and protected by their god. \n\n\nAnd everyone paid the price."
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">\"Vibing is life\"\n\n\n–Isogash, ca"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "2024"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I catch quite a few redfin perch where I am, they also have very little fight in them but I rate them higher than trout in eating quality"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They may not fight hard on a line but they really are a ravenous fish, small fish and even trout populations drop dramatically wherever they are present I’ve found."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Those wigs are hilarious, how does anyone keep a straight face?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">  i have a CRT tv in my room that has always been in my life and still works good as new\n\nProbably because you haven't been using it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Picture tubes burn out"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A heavily-used family TV would last 10-15 years back in the old days"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It wouldn't die all at once"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The picture would just keep getting worse over time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And it would cost several times more money than current TVs for a worse picture on a smaller screen."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I think you should rethink or at the very least research this more if you think this is the sole solution to plastic pollution"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Perhaps you know this and I’ll just say the rest of this for anyone curious to read"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes there’s a bacteria developed to consume PET plastics"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But not only is this a fraction of the plastics polluting the planet, the research won’t likely be mature enough to implement this at a scale that outpaces our currently massive production of plastics"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So an overwhelming majority of scientists tackling this issue are curbing our use and production of plastics as the most impactful and feasible solution"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cleanup and recycling technology are also improving but are in a similar boat that is failing to outpace the massive scale that plastic producing companies refuse to take actual responsibility for."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Everyone looked unhappy in photos back then"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hey, I’m from there!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Have you seen the price of cheese and cured meat today despite modern industrial production? \n\n[for 1913, here’s bacon at 31c a lb.](https://www.foodtimeline.org/MLR1923.pdf) that’s 10$ a lb today"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Italians were only making inflation adjusted 5600$ a year"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Italians could only afford 560lbs of bacon per year"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Today an American can buy 8000lbs of bacon per year"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So if you feel like a lb of bacon is the expensive vs your wage, an Italian would feel it 14x worse"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Do you think that Italians with income that low would buy cured meat and aged cheese?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "wait - have I got it wrong? I thought methane was the Greenhouse Gas that is coming out of the billions and billions of COWS arses on the planet now?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I guess by not being legally blind."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The people who need to hear this the most (fundies and misogynists) are currently absent and that makes me sad"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Maybe in the US"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My central european country is struggling with the adoption of EVs as they are struggling with buying new cars in general"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The average age of bought cars is around 15 years and it's increasing."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Big money salvia?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is what gets me"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If I could re-define the word 'conservative' to mean the conservation of raw resources not just of capital"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Another thought - what happens to our ability to go into space/launch satellites etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "without fossil fuels? I don't think we have figuered a better way to orbit the earth or break free of its orbit."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Unfortunately the majority of the time it doesn’t gain respect"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most abusers actually want you to fight back so they can claim mutual abuse or have a reason to abuse you more."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes - or a plasticlike thing"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It might be that civilizations end because they create something useful in the short term but highly detrimental in the long-term."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes! And woke up now."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Gerard Way, the lead singer of MCR, was actually an intern for Cartoon Network working in NYC during 9/11"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It caused him, like many others, to reevaluate their life and priorities"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So, he went from working on art to following his original passion for music"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So 9/11 leads to MCR.\n\nStephenie Meyer said music played a big role in her inspiration for the books"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Particularly Muse and My Chemical Romance"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So MCR leads to Twilight.\n\n50 Shades was Twilight fanfiction"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So, obviously, Twilight leads to MCR.\n\nTherefore:\n9/11 -> MCR -> Twilight -> 50 Shades of Grey"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Every time I read about the Comanches, I hate them more."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thanks!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Upvote for hilarity"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Comanches were awful."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Quanah had a heck of a life"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He became a close confidant of Teddy Roosevelt, had large ranches that made him a very wealthy man, he tried his best to get the Comanche integrated into a more European-style economy and he also founded his own church"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Times were indeed wild on the frontier."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Eh, we are still very much sustainable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The worst that can happen in the ponzi scheme that is the current retirement fund collapses and governments realise they can't bank on exponentially increasing populations."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Jokes on you, I'm not making any kids so the plastic is only for my balls!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Every catcher/processor owner in the Bering would shoot themselves in the foot for that contact"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was leader but now it’s global seas and they have the defender fleet which top shelf."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Same type of lobotomite to defend leaded gasoline"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Lmao your source is a maybe"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nicely done"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You just said nobody knows why"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So what makes you think you can attribute it to plastics?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I've heard this before, that the US is not able to refine their own oil but how did that come to be? That doesn't even make sense to me"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Like, someone thought, \"let's drill for all the oil we can but let's not build a refinery to process the crude we dug up!\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Great movie."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ah yes, exponential growth, go see the video by Albert Bartlett called Exponential Growth, Arithmetic, Population and Energy."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hey now, let's not be a dick"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> The author very clearly lays out how we’re falling behind for 90% of the article,\n\nAnother illiterate"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The author and his team did not say that the world is falling behind at any point"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is them criticizing that changes are not happening FAST ENOUGH for their own liking, and even THEY have to concede that Net Zero by 2050 is now a given."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wasn't the fanfic originally a reddit post?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Waiting with bated breath for nothing to happen."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As someone who is not American, I had to read it three times to understand that this was not about ai"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bisphenols have a lot greater effect than microplastics on human sperm counts."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I did read the article and not one time does it say father killed her (which he did) instead the article says \"Father, Daughter COMMIT suicide\" and that's what I posted"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "not once did I say I believe that she committed suicide, bc a she was literally only 5."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The curious thing is 50+ years ago the same things were said about items being made in the 70's vs those made in the 40's and 50's."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oil wasn’t the only one who profiteered during the pandemic, various companies did as well"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sorry running shoes is literally the worst example to use"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you're using them properly (actually running) they wear out quickly"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most shoes will last 300-500 miles"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Look up how old pairs used to last."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I rarely comment or post on here, and I'm a whole damn year late to this conversation..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but I can't ignore how in your last 2 paragraphs, you've perfectly described this enraging behavior of certain people"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The fury I feel near a person like this is truly visceral"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And I had never thought of It this way"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I never would have found the words to describe this so rationally"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This was so fucking validating to read"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So THANK YOU, internet stranger."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Turbocharge your burn barrel and the wood will gas itself"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's more like if you won $8 million but because you were hoping to win 10, you tell everyone that you lost $2 million."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is why I always cringe at people who say that profit motive incentivizes innovation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It doesn’t, it simply incentivizes getting profits by any means necessary."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s usually two plus one"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But sometimes it’s five minus two or some other crazy formula"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Who *knows* what they’ll come up with next."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "listen or read Empire of the Summer Moon."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I think that in the past the *sincere* belief (among capital) that the majority of profit is added value was a lot more widespread, but I might be giving them too much credit."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> Plastic feed stocks are just 5% of overall oil production"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Food for thought, by the way, the idea that we can just reduce oil consumption but still create plastics ignores that gasoline is a byproduct of refining and it cannot be avoided - and there's no going away from the utility of plastics in the modern world"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What would Biden have us do with the gasoline? Bury it?? LOL.\n\nHyperbole aside, most plastics and in fact most technological advancements in oil refining have come from the requirement to use the waste products from refining for lighter fuel oils - Naphtha, Kerosene, Gasoline etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "in an economical way"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bunker C oil is a good example being just above bitumen is terms of viscosity and was a waste product often used in steam locomotives, power stations, and ship boilers because it was seen as essentially worthless and cheap enough that refineries would basically give it away"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Since the 1960's it has been progressively catalytically cracked to form shorter chain hydrocarbons and plastic feed stocks to the point it's on par with lighter fuel oils in terms of cost per ton."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "yes I this should've been listed as a murder/suicide not a \"Father, Daughter Commit Suicide\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There’s only a couple body parts that are exclusive"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Everything else is there in everyone but stays small unless it gets the proper signal."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Don't forget the rice-peeler"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "From my experience working with their team, I personally believe that Shell sabotaged it's own Hydrogen fuel investment because the DOE made it clear that green Hydrogen would be the primary source instead of Shell's \"blue Hydrogen\" which is just hydrogen from fossil fuels being greenwashed as an excuse to keep petroleum afloat.\n\n\nI knew some of the people running the program, and I worked for a partner company doing the station constructions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There are zero acceptable excuses as to why their stations experienced all the problems they did"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Incredibly foolish mistakes, especially when you consider these people already run gasoline fuel stations and have experience with selfservice POS terminals."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah, you're right"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I just wanted to add that we not only used up most of the fuel but also most of the easy stuff to use it with.\n\nI guess if you just replaced \"mined\" with \"used\" in my comment it would make a more complete point."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Weird Al is just the best dude."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Good for you, really, and i gope it goes well, but I also hope we don't all do this :D there are some group projects to be getting on with!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was not my intention for anybody to get upset I literally just wanted to share what I learned today as I was just in shock that something like this happened"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "so for you to get mad at me when this story has been posted on reddit numerous of times quiet literally crazy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I may have worded it wrong by saying she was influenced and not commanded but that was because this article wasn't the only one I read I read a much more recent one that stated she was influenced"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but I did nothing wrong by posting about something I learned."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I think you are mixing up your 80s sci fi movies"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Queens \"Princes of the Universe\" is in Highlander"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which I assume is why you said, \"Here We Are\" which is the opening line of that song.\n\n\"Masters of the Universe\" was a live-action He-Man adaptation that had Dolph Lundgren in the titular role, a Thenurian named Gwildor eating tons of fried chicken, a magical keyboard that could open dimensional portals, and Frank Langella absolutely killing it as Skeletor."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I think this was always jnderstood by capital, the theft and exploitation was necessary from the get go"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Excuses were sought (e.g., the natives of North America weren't human, Africans weren't human) but all excuses have been contested from the get-go and it is safest to presume They Knew What They Were Doing"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Capitalism is a splitting exercises (commodity-origin from point-of-sale, peasant from land, worker from the value of their labour, white from black, man from woman) and always has been.\n\nThere's a catchy term used by some Gramscian economists for the capacity to live in comfort and ignore the high cost of your life: The Imperial Mode of Living"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most of us are implicated to a greater or lesser extent."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I listened to the Revisionist History episode about this!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "'The first influenza epidemic may have occurred around 6,000 BC in China' (Wiki)."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The second part could easily be a scene from Top Secret!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> You never actually told us why testicle microplastics are bad.\n\nYou never actually told us *why* adding lead to our fuel is bad\n\nJust give it a few years man"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You’re right, but people want to believe stupid shit because anything that happened before they were born is just lore they can retcon"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The dubious nature of this issue is around the prediction actually occurring (and to a lesser extent that the year was noted correctly)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We know the eclipse happened, we know with dead certainty when and where the past and future eclipses were and will be."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Samuel Colt was an interesting  part of the story I really liked because the army of the time was no match for the Comanche bowman and led to the creation of the revolver."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Um if you take care of a modern smart tv it will last for many years, I have had a samsung 4k UHD for 11 years."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The petroleum industry has driven this insane push for plastic everything"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "(Plastic is made from oil). \n\nWe have to fight them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Vote for green candidates, buy cotton garments, avoid plastic products, raise awareness with your peers, for example. \n\nIf we do nothing, we are going to die in an overheated, deforested, trashed out planet."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "“Pro car drivers” exist because the public transport were offered is unreliable as fuck, disgusting and overpriced"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’d be on the bus to work everyday if it showed up on time and didn’t stink of piss"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m going to Edinburgh this October from the East Midlands, it’s cheaper to take a fucking plane than the train, it’s even cheaper and will take me less overall time to just drive there"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That is why people are fighting the ULEZ, all it does is price the working man out of travelling to places they want to visit."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"unfortunately\"\n\ni disagree on that qualifier."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I commented elsewhere:\n\n> I’m aware of the harms caused by the plastic industry, I’m curious as to why it out of all the other challenges facing us is the most likely “great filter.” It’s a bad thing but I’m not seeing much evidence that makes me think it’s going to cause our extinction\n\nI’m interested in knowing why someone thinks plastics are more of an existential threat than climate change, or even something like nuclear weapons"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No one has really answered yet"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can they please do the same thing for broccoli next?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "OPEC is probably the easiest and most commonly used example of a cartel when you are introducing undergrads to the concept"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They embrace the role too, it isn't like they are shy about how they manipulate the market, they even have announcements preceding *how* they are going to manipulate the market."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Built Ford  tough I guess"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just read up on french revolution, french progressed so hard peoples heads fell off..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was not my intention to get people upset"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I was just stating what a few articles I read said"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "which 2 called a suicide"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I do not believe that the daughter even knew what she was doing but that she was only listening to her father"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "this should've been ruled as a murder suicide"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I only wanted to share what I learned today while googling something about divers and going through a rabbit hole"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "so I do apologize to anybody that I offended that was not my intentions as well as I was not trying to make this situation any less than what it really was, which is a murder suicide."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Tomato-based dishes weren't traditional Italian, right up until they became traditional."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can I interest you in Worcestershire sauce? Main ingredient? Fermented fish."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I knew there was a lot but I didn't fully understand how much it's still apparently accelerating"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it's incredibly useful but we already know about many health problems it causes and who knows how many more are undiscovered"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "and it's nearly impossible to fully get rid of it (at least with modern technology)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it's like that old saying by the wiseman homer simpson."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "plastic is \"the cause of and solution to all of life's problems.\" (although he said it about alcohol)."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The scandal was that Blomberg married a woman who was 40 years younger than him and had done some softcore porn, so Hitler wanted Blomberg to kill himself as penance"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Melania Trump did porn shoots herself"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Makes me wonder what the Nazis would have done if Hitler had a wife who did softcore porn."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I got the double-dose, those paper strips are the *worst* thing I have ever tasted"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I also never drink coffee, barely tolerate coffee based sweets (I can tell when something chocolate has coffee or espresso mixed in very easily), have never liked beer, etc, etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I recently tried a small piece of broccoli because it was in a dish I was served, still gross af."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But you know, the Cartel country is our friend! And they price oil in dollars...which helps keep it the world currency.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "so they say.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "so..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "See you in 2039 with the next half"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But that half will be this half and the previous half together."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He was in Glass Onion a few years ago."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah and prior to ww2 fresh ingredients werent invented yet!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No my comment was sarcastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You are right, sort of"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It completely disregards the current situation for many young people around the world"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Gay young people are far more likely to end up homeless, And far more likely to take their own lives.\n\n\"Coming Out' shouldn't exist"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But sadly, for far too many young people they are risking death or being disowned if they do."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "WHAT?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ok👍, but next time read the article as, father kills daughter then jumps off bridge"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Synthetic textiles are the biggest sources of microplastics in our environment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Followed by tire dust"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "People seem to think they are saving the world by not using plastic straws, but the contamination comes from what we wear/sleep in and the air we breathe walking around in our cities"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Some plastic liners mimic hormones in the body, like BPA, but a lot of plastics seem to be inert to biological processes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "More research into microplastics is needed, but it baffles me that people blame everything on microplastics like rising cancer rates and infertility when there are so many known carcinogens that people are chronically exposed to"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If we find a mechanism where polyester causes cancer or infertility, then I'll start worrying more about microplastics."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pretty much the only danger is getting one too early or after it's been on there too long and is overdone"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's assuming the rollers are at temp."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "One of my dad’s friend’s wife’s boyfriend got a Loggins infestation where he just dropped in to see what condition his condition was in and died later while playing cards"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What's sad is 50% of redditors are going to be it's true"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "While the other 40% can't read."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He heard about the tossed salads and scrambled eggs, and well, what's a boy to do?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I mean, the only apocalypse i can think that fits apocalypse is literally just that, whole world is affected by sth so terrible there's no hiding out or escaping, you're either dead or lucky enough to survive and be a cannibal for few thousand years till someone grunts a bit differently, although i doubt language would devolve that fast"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The worst thing for our civilization is that EVERYTHING is in hard drives, in the cloud etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "anything happens and we never existed considering everything we make is never lasting like the wonders of the old world."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm having trouble finding evidence for your claim.\n\nThe best study I can find is a UK one here: https://skeptvet.com/Blog/2015/03/longevity-causes-of-death-in-pet-cats/\n\nThis study from 2017 places trauma related death at around 12.5% with half of that being vehicular"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which seems quite low if cats are out there losing their 1v1s.\n\nComparing that to animal deaths by cats ranging from 160 to 270 million per year.\n https://www.telegraph.co.uk/columnists/2023/12/22/neighbours-cats-decimated-number-of-birds/#:~:text=If%20you're%20a%20cat,a%20quarter%20of%20them%20birds.\n\nThis seems like a high enough kda to place them at the top of the urban food chain."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You mean there are only black leopards in Africa, Asia, Russia."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "and black jaguars in the Americas"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not cougars"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just the big cats with spots."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We could have had light durable TVs"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Producer-owners (capitalists) make goods that do not last because this is the most profitable thing to do: they can keep selling the same stuff to the same person over and over again.\n\nIn this way, one sees the similarity between consumer society and a war economy -- the US was saved from depression not by the New Deal but by the profitable exercise of making bombs, selling bombs, dropping bombs in the Second World War.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "and then making more, selling more, dropping more etc.\n\nThe US shifted into high consumption mode after the war to maintain profits"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Items becoming increasingly throwaway was inevitable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Your cheap TV is a bomb, practically speaking."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Soles compress and don't give the required support anymore"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Prostitution is still legal in many European countries."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I love them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The steamed bun and tartar sauce combo is great, and even the weird addition of a slice of American cheese works."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No it isn’t"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "QT buffalo chicken cheese roller...I don't understand it's construction, but it's good as fuck."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I apologize about that"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it was not out of ill will or anything"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I should've said commanded not influence"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "that was my mistake."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I did read another a more recent article tho that did say influenced by father."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "During Lent, yes."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but you can still remove it from your face, like its not impossible right?\n\nbecause if so then theres no way its not the parents fault for not supervising the child"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yup"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I have some higher drop, max cushion shoes for the longer recovery runs, some plated shoes for fun speed sessions, and some altra’s for trail running along with a pair of zero drop casual shoes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I rarely ever get hurt these days"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I loved Empire of the Summer Moon, it was totally fascinating"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Quanah is such an interesting figure."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you agreed you would have deleted it lol"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Eh, at the Arby's I manage we keep product info placards by all the registers whenever new shit comes out"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Don't even have to think, just look at the card"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Doesn't stop them from asking me every time though."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So i gave it a go its not bad at all, its in cantonese(?) but is it a direct translation or not, for anyone who speaks the language"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "thanks."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And the people responsible will be fined and jailed, the billions of dollars will be returned to the citizens who were forced to pay too much just to heat their homes or drive their cars .."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "yeah, right"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And in other news, the Loch Ness monster has been found, Bigfoot is in the studio for an interview, and Elvis will be performing \"Smells Like Teen Spirit\" with Krist Novoselic, Pat Smear and Dave Grohl."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nah."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What American weapons did terrorists use on 9/11? Didn't they hijacked the planes with very simple weapons?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What would you require to be sure that humans evolved from another species?\n\n\n>But in some ways, placing a faith in a higher power is comforting to me.\n\n\nI understand that aspect"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But it is important to me to believe this that are true, even if it would be more comforting"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "when i learned the details of Gin Blossom's lead's death, his songs has become more powerful."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Factor of 20 you mean."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wait until I tell you when half of the world's population was born..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I agree this should've definitely been ruled as a homicide"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it's so sad what this father made his daughter believe"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I actually found it bc I was looking up if a professional diver could survive if they dived off the golden gate bridge and I went through a rabbit hole"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "absolutely heartbreaking."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What alternative is there? You've said it yourself, we're consumers, not citizens"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We were all sold the post-war dream of endless consumption, in return we gave up our power"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That was the compromise"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Like idk how old you are, but you don't have to have been *that* old to watch it happen in Eastern Europe"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Berlin wall fell, what did they want? Social democracy? Liberalism? Rights? Fuck no, they wanted McDonalds, blue jeans, and Coke"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cos that is what we are and they knew it back then"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They could see it clearly from the outside and wanted a piece for themselves."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Cuyahoga river famously caught fire, TWICE."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Some people just don't know"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Look at the person above me not knowing about fleece often being plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Also, people wore clothes before these plastics and it will become cheaper again if the people who can afford to buy less but better quality choose to and lawmakers are made interested"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's also better for lower income people because the plastic clothes are now also infiltrating second hand shops en mass while before they could get decent quality there..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh, fair enough"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's absolutely room for criticism of what companies have illegally done with plastic and chemical waste.\n\nWe do what we can though and our laws and regulations are incredibly better than they were in the '70s and anyone that thinks our rivers and lakes were *better* back then didn't live back then."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Where is the /s, William?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If nine then she WAS comanche."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not sharing one's own sexuality with the whole world is not equivalent to being dishonest about it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Get a grip."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "maybe the plastic is the organs we made along the way"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm 40 and my mother uses some kitchen appliances that are older than me.  But it's also a bit of survivorship bias"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's also stuff that broke down"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Probably a lot more than stuff that made it this far."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "First of all I saw an article about and posted it on here and then through google doing a little more research I saw somebody else had actually talked about the samething"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "if you don't like it okay?? I put it on here bc it's \"what I learned today\" not \"what I think you will like\"."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Spam musubi"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Rotation is legit key"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Especially if you’re using different brands/ styles"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My back and hips like me a lot more when I switch out the shoes I wear daily"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Apparently it stresses different parts of your feet/ legs/ gait/ balance… whatever so you’re not constantly placing your damage is exactly the same spots"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Idk the science, but I get hurt less now."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You're not getting the point.\n\nPlastics are dangerous in the human body.\n\nMicroplastics are an unknown.\n\nThere are a ton of illnesses happening to people around the world at a rising rate, with no known cause as to why"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In 20 years, there will be studies showing the drastic effects of microplastics on the human body"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There are already studies showing they may do this"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There just isn't a good control group to use and obtain valid data."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s wild to see the white knighting going on in these comments"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I would love for these impassioned liberal individuals to take a Time Machine back to the 1800s"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m sure the Comanche would be very “kind” to them."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fuck I hate Tumblr but I love it too"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "US oil can't be processed with the refineries in the US"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So we export all our oil and have to import crude from overseas"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The US is now the number one producer of oil, but we can't use it ourselves.\n\nWe could build or retrofit refineries to use US oil and immediately end all need for us to be exerting influence in the middle east, but we don't"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That wouldn't play well to the powers that exist today."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm using a 15 year old LCD right now"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Works great"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "People buy the cheapest shit they find on Amazon and complain about quality"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"You get what you pay for\" has always been true."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Gen x here, 90% of the time it was boiled veggies which I could barely eat"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Occasional roast with veggies and I was ploughing then down"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You'd think a pattern would be noticed"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I read somewhere, that there were more things made after 2000 than there were before 2000 in all of human history."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://www.autonews.com/assets/PDF/CA59166128.PDF\nAnd GM apologized for making shit cars"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Only to take taxpayers dollars and continue to make shit cars"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The American way"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "People in 1934 watching all this unfold: “I can’t believe its 1934 and this kinda stuff still happens, smh"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh look, another lynching in the South”"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Companies realized that it's better (read: more profitable) to make junk that breaks quickly rather than something that lasts from father to son and then some"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "When something breaks quickly you probably won't buy the same thing from the same manufacturer, but you just *might*"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If something lasts forever you won't ever need to buy a new one, even if you'd buy the same thing again if you had the need to."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "...so at least *one* other bank got off scott-free, right? Dang it, that's right"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was all"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All of them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All of them lying liars who lie got off scott-free"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "...except for Scott, of course"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He got off, but it cost him dearly"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But that is a tale for another time."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "At the root of it all? The never ending hunger for more profits"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "“When brown people do bad things I feel like it’s\nok.” That’s you"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That’s how you sound."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but there are different types of plastic, can it eat all types of plastics or just specific versions?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Plastic is found in every aborted fetus"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Plastic is found in every cum"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Plastic is everywhere"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is literally worse than lead and asbestos."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I completely agree and I moved out into the woods and stopped participating"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I do understand what's coming and where we are now and all I can do is dive more into nature and learn how to be self sufficient."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The article does say a kite and not glider, and kites have to be pulled so your assumption is definitely correct"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m pretty sure 9/11 would’ve still happened if Gore won"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "One of the main ways that profit is generated is by ensuring that some (often most) of the cost of production is carried by someone or something (and \"something\" always means \"someone\") other than the producer and consumer"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Externalized cost is very nearly synonymous with profit"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This used to be less well understood (and especially less well implemented) by capital"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Almost all profit is unpaid costs, be it labor, environmental, etc."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's not that they don't care, it's that there aren't accessible alternatives"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fast fashion is all that many people can afford.l"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">A joint Fifth Estate/Enquête investigation shows Canada still routinely ships plastic waste to developing countries, often illegally mixed inside containers of paper recycling.\n\nJust a quick check, were destroying our *own* waterways less"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Overall? Lol, no.\n\nMost is dumped or burned."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm getting really tired of this meme, I was born in 2000."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I would agree but imagine the outcry.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "personally I would love to see something done about all the plastic (polyester and acryl) in our clothes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Perhaps people would be less babies about that because those textiles are also ruining the quality of our clothes as well."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Litter is a separate political issue"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The US definitely has a litter problem, but litter represents a fraction of overall trash."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it's a trap!\n\n\n*god I hate brussel sprouts*"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Party on, Wayne."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "...explain how exactly you think plastics are going to cause us to go extinct\n\nEven assuming the most catastrophic health outcomes imaginable from forever chemicals and a total collapse of the ocean ecosystem from pollution, I still don't see it being something that'll wipe out the human race."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So because some random guy named Harry Behnham wrote an article that ends on some vague, speculative, optimistic note, you accuse this commenter of not being literate? Did you just search for a few key words and post the first link in Google? The author very clearly lays out how we’re falling behind for 90% of the article, but ends on a slightly positive note for effect, basically to make the readers feel like there’s a chance for hope"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don’t know how you can take this opinion piece and weakly hopeful footnote as gospel against the mountain of evidence, unless you’re just desperately looking for anything to assuage your feelings about the bleak reality of what we’re facing."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh yeah I forgot how many people are hospitalized per year due to acute plastic poisoning…..\n\nJk"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Shhh, this is exactly why I want us to consume all of the fossil fuels now."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So Stockholm Syndrome."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So glad I'm seeing the positive results of all these plastic straw and plastic bag bans us consumers need to suffer through!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The world's population doubling is irrelevant here"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Its not developing counties that are polluting"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "25% of all man made Co2 emissions have come from the US.\n\nThe one billion people in North America and Europe have put out twice as much carbon as the other 7 billion people combined"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Even if the rest of the world didn't exist, we'd still be in the exact same situation, just maybe a couple years later."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thanks south and southeast Asia"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "100%, the same process that took nature a hundred million years to create will take us a couple decades at most"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Human ingenuity is amazing."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can confirm this is accurate\n\nSource: I've played Fallout: New Vegas"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Kids these days need a middle aged Italian man in Native American garb to tell them about the sad state of littering"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh yeah I forgot how many people are hospitalized per year from microplastics\n\nYou didn’t list any real reasons it’s bad"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just said it stays around for a while"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can confirm: monkey is probably smarter than me"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No - That’s completely beside the point? Or you have missed it - It’s not even about corn or PLA"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s that plastic at its core, is not necessary a byproduct of fossils/the oil industry… there are examples where it can be made in a sustainable way"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "(Disposable, is another issue) \n\nIf we are talking about an alien planet that isn’t able to pass the Fermi Paradox, the claim they they (might not)/don’t have fossils, therefore they don’t have oil, therefore they don’t have plastics is an incorrect deduction"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As plastics can be completely synthetic, or made from completely organic sources… \n\nOne does not have any bearing on the other.\n\nPLA was just one example of where (on earth) there is zero fossils going into it - the percentage of how much is PLA doesn’t matter? Just that it exists?\n\nMy comment isn’t really about plastic, it’s as much as where does products come from on other planets."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah Brussels sprouts used to be kind of the joke vegetable like “eat your Brussels sprouts” and it was this disgusting thing, but now they are super popular, but I thought it may be that they are now pretty closely tied to bacon"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">God did not intend to make Eve in the first place.\n\n...\n\n>God is omniscient and omnipotent\n\nThese 2 statements make no sense when used in the same argument.\n\nIf \"god\" is truly omniscient, then it would have been able to foresee that Adam would need a helper.\n\n>if you take Genesis literally, you’ll find it quite baffling.\n\nCouldn't agree more"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It reads like 2 and perhaps more fairy tales mashed together."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "FYI: There is a *gentleman's agreement* amongst San Francisco newsoutlets to NOT report on suicides as the GGB is a suicide Hotspot"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Funny enough, a jump from the GGB is about 50/50 survivable and almost all surviving suicide victims report \"*....and almost immediate, overwhelming sense of regret the second your foot steps off that bridge...*\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Don't fuckin do it man"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's always a new path."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ohhh \"ala carte?\" Sounds fancy, let's make that $12.99."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Several bugs also have gut bacteria that can digest polystyrene and polyethylene"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wax moth caterpillars and zophobas for example."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And they’re at the bottom of the pacific in the form of fish nets abrasives and trash"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "[I'll show *you* inanimate!](https://youtu.be/Y08catbZ2cw?si=PM5QmcAxhhdnI1Ds)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "To the balls? Sign me up"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What really brings this point home is the fact that only 5% of oil is processed to be plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "95% is mainly fuel that gets burned and blasted in the atmosphere"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> what kitchen appliance will i buy that ever lasts like that\n\nThere is plenty of blenders and stand mixers that are still of high enough quality to last a lifetime"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My kitchenaid stand mixer that is 20 years old still shares parts with the ones sold today."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm Canadian but yes, I was talking about the US and Canada"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fifty years ago rivers in NY state were literally catching on fire"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fifty years ago you couldn't eat fish out of half of the rivers and lakes in Ontario"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Chemical dumping was largely unregulated and happened everywhere"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Factories and smelters didn't scrub their emissions at all, they just built taller smokestacks and acid rain was ubiquitous as a result."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Planned obsolescence"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wait until you learn that beaver was defined as fish (thus not meat) by some catholics\n\nhttps://www.nzz.ch/fisch_der_katholiken_biberfleisch_und_bibergeil-ld.495348"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And half of that plastic is now in the ocean"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "R.I.P."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That is exactly my point"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Modern things are very complex and assembled from parts that are complex as well"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And all of that has gone through a development on it's own"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And so have the machines that build the parts"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And none of them will work without some form of energy available"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Etc etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All products are made based on the availability of other products"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It will be a hard and long road back, if we ever make it."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Too late - all the shallow metal ores, coal, gas, oil have been looong gone.\n\nFirst google:\n\n\"Oil drilling depths have increased over the last six decades, from an average of 3,635 feet (1,108 meters) in 1949 to 5,964 feet (1,818 meter) in 2008, reflecting the depletion of easily accessible oil reserves.\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I think you’re conflating the Comanches with all native peoples of the Americas"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I hope I don’t have to explain the issues with that"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "With the same logic, one can justify atrocities against citizens of the United States at the time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And yeah I agree, anyone who actually believes the stuff you’re referring to doesn’t know that they’re talking about."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What part of the shoes are failing for running shoes?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">either by using a different kind of meat (such as turkey bacon, or jerky or biltong that are not made from pork), or with non-meat alternatives (such as zucchini or mushrooms); thus the dish becomes halal or kosher\n\nThe suggestion to for substituting the pork is to make it _halal_, not kosher"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The kosher suggestion is to swap the port for vegetables."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "THANK YOU! I couldn’t remember the subreddit"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The war against influencers has begun."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "How much does corn produced PLA contribute to the overall amount of plastics?\n\nThe problem with plastic is that most of it is a by-product of fossils fuels, which makes it incredibly cheap as long as we rely on the latter."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I can give americans credit for putting bacon in it but what about the name \"carbonara\"? why didn't they call the dish \" egg bacon spaghetti\" if they originated it? Because it's bullshit,it was coal miners and sellers from the Appeninni mountains(carbonari) who invented the recipe,being poor people their lunch consisted of pasta,cheese and eggs,an old version of the dish that years later was modified in every possible way to meet different flavours."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes, that was her."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "For your plastic, or foamyplastic, or plastic-lined-paper cup."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Single use plastic bans will be coming into affect soon"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It got longer life than human"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "God these sans serif fonts must end."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://community.rspb.org.uk/cfs-file/__key/communityserver-discussions-components-files/13609/6371.6012.1205.6332.Cats-and-garden-birds.pdf"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Then you weren't paying attention"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm barely breaking 30 and I have things that will likely last a lifetime"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Also, you're a fucking idiot if you think we're polluting waterways less than we were 50 years ago"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Seriously? That's literally the only explanation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You're on Reddit, so you use the internet"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The majority of \"recycling\" is just shipped somewhere else to dump in a river, lake, or ocean"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We're absolutely trashing everything"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Or did you just mean the USA? In which case it's marginally better at best? While still destroying the planet worse than before...."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just in new ways."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Article from 2014"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Surely there have been more since then."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "wait- I thought _all_ fleece clothing was made of plastic?\n\nisn't that the definition of \"fleece\" vs say."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"cotton\" or \"wool\" or whatever?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I hate to say it but bringing people out the 3rd world is no bueno"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "20 years ago it was estimated if the entire world's population were to live a western lifestyle it would take 8 Earths' worth of resources."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But we're also much more efficient and productive than we were in the past"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's not a massive issue unless you're talking like South korea"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And even that's fixable if they drop the post war American experiment."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Graduated on May 69th, bro"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">They aren’t like little pieces of uranium that kill everything they touch\n\nHow in the fuck would you know that?\n\nThere is literally no control group for a microplastic study.\n\nIt is everywhere"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In the brain, sex organs, heart, all the water we drink, infants, any animal you eat, any plant you eat"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There is no way to avoid them no matter the location on earth.\n\nDeclining sperm cells in men with no known cause? There is no way to even study if the cause is plastics, but many scientists think there is a connection"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Plastics in general cause cancer when in the human body"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Are they the cause of rising cancer rates? Who knows.\n\nIn the future, they might cause even more issues that we don't know about.\n\nPlastics have only been around for a few decades.\n\nThey are the asbestos/lead paint of today."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just drop by the dollar store for evidence of this…"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's a million random things floating around in our body at any given time that aren't supposed to be there"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "most of them don't cause any problems."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "oh boy I love plugging r/ReallyShittyCopper"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That their way of life is no longer practiced"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Too many seem to think life back when the natives ruled was a utopia, everyone was equal where there was no war and everyone was in peace with nature, before the evil white man came."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But did they have sex though!?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I mean.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "you _did_ say we're pretty resilient - and hey plastics last forever right!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pasta doesn't come from China"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's a stupid theory"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pasta and noodles were invented independently of each other"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "More than one person can come up with the same idea"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And China doesn't have an older culture compared to fuck all"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A lot of places were continuously inhabited by civilised people for even longer than China"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just because political structures changed doesn't mean the civilisations ended like that , they evolved ."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you read Das Kapital, poisoning the bourgeois ecosystem is clearly listed as step 312 of building Communism."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ya thats not the point the point is that if it wasn't a major source another scenario would have probably come up and another way of living life but the same technological revolution would have eventually happened."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> The whole premise of micro plastic remediation was that it would be performed by either bacteria or fungi that would be able to basically take over the world in order to fight the problem.\n\nI don't think this was ever the premise made by anybody who knows what they are talking about.\n\nIn fact, I'd say that's the apocalypse scenario.\n\nImagine that shit getting into power wire insulation, or literally any other plastic product that we actually want to keep.\n\nThe idea is that we can recycle our plastic with enzymes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That will, as far as I know, only work where we target it."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Jung thought that accepting the possibility of dying, even suicide, was maybe the threshold of a great new personal revolution"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "To reach that low state you put down all illusions of comfort and so can keep living without illusion"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We need to cast off illusion (the marketing of consumerist-convenience especially) and accept how things are: our way of doing things was never going to bring stability, peace or common prosperity"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was always going to go like this"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Italian filmmaker Pier Paolo Pasolini was 100% right when he said consumerism was the modern fascism"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "(& both consumerism and fascism are just modes of capitalism.)\n\nYou're ready to ditch! That's good"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We should ditch"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "When a person has accepted how irredeemable the current MO is, other options appear"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Vacating for a simple wilderness life is an option but megastorms are gonna sweep in anyway and besides there is a lot to salvage"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I think most of us are just trying to get over the fear of what we know needs to be done: revolt against our corrupt masters, take control of society's productive capacities ourselves and bend them towards the common good"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It is gonna hurt but they have to be thrown off"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah yeah yeah, only 70 corporations are responsible for most climate emissions etc etc.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but we keep going to work for them! What is wrong with us? Fear of death"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">we used to eat raw ground beef as a snack\n\nYou can totally still do that if it's ground fresh from a bigger piece"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Beef is very dense, bacteria only resides on the surface, unlike with chicken.\n\nYou can even eat raw pork this way"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Google Mettbrötchen and be amazed."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "How long did I sleep? Does anyone even live there?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No they will just clog biological systems inside every individual organism (including you and I) and slowly kill us all by comorbidity and chemical disruptions like false hormones."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> I feel as though this would have kept populations in check and limited our potential for negatively impacting the earth/our environments and all that.\n\nNot as much as you'd think"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The almost complete deforestation of England pre-dates the industrial age by a significant margin and a lot of pre-industrial practices were environmentally worse than more modern ones"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sperm whales would likely be extinct for one"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's possible that without fossil fuels we'd have struggled to achieve the scale of our current population or industry, but we'd have done plenty of different damage even assuming we never manage to jump over the industrial gap, which is somewhat questionable."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "? Do you think native Americans weren’t killing and enslaving each other before Europeans showed up? Because they were, the only thing that changed is who had the biggest stick."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Inject it straight into my veins!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "😱😱🫣"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Got another source that thinks it's realistic to be net zero globally by 2050?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Okay take a seat as this is a long story"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "When I was a young boy my Father took me into a city to see a marching band"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I was shocked by this (thinking “oh, c’mon - it *has* to be mac salad!”) so I Googled it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Turns out Hawaii has no official state food!\nWell, TBF, it does have an official state *muffin* (coconut muffin) but no official state “food”."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ewww jesus that sounds 🤢"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Roasted broccoli tossed with olive oil, salt, and pepper"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Such a great side dish.\n\nSuper decadent and awesome if you put some Hollandaise over it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Works great with deep fried meats, especially Schnitzel."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In that case I lost around three hundred million dollars on scratch off tickets last week"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I can claim that on my taxes right? 😝"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "that doesn't make sense though"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "try saying it with pauses around the name, it does not work"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i am now convinced it was simply an error."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Be lucky if an appliance runs without a monthly subscription at this point."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Why the fuck would you repost that shit then?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Whoa whoa whoa, but we have paper straws! \n\nWe may also eat a credit card worth of plastic each week, we may have separated recyling just being compacted with trash"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We may have most 'recyclable' plastic not being recyclable, most of it never being recycled regardless, or new plastic only using 10% recycled...\n\nBut we have paper straws and businesses now all charge for paper bags"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Surely companies and politicians wouldnt just create some 'feel good' campaign to pretend they're taking it seriously, while continuing to destroy earth itself?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Theoretically everyone in the world could eat plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Once."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I would say the plastic bottle is a damn good start."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Okay yall cry all day about that fact but so what? \n\nWhat is so bad about small things that don’t break down? They aren’t like little pieces of uranium that kill everything they touch"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fossil fuels are much more than just producing energy, they’re the basis of basically every synthetic product in existence"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Every piece of plastic, paint, resin, protective coating, insulation, seal, connector, circuitry, adhesive, lubricant, solvent, ink, colorant, rubber, textile, circuit board, pharmaceutical product, etc are derived from oil"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s the building block of our modern world."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don’t think a lack of fossil fuels would permanently prevent industrialisation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wood-burning and primitive wind and solar steam turbines could provide sufficient energy for far more limited and gradual industrialisation and the eventual development of nuclear and photovoltaic energy, although this would drag out the Industrial Revolution by many centuries and greatly limit human population growth."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "yeah I came here to make this point actually\n\n[**people's brains literally don't get exponential growth**](https://hbr.org/2017/05/linear-thinking-in-a-nonlinear-world) so we just keep making bad decisions and fail to grasp consequences when it comes to this sort of thing _because it is counter-intuitive_\n\nwe THINK linearly even when we know, intellectually, something is NOT following a straight-line curve - and we fail, repeatedly, to deal with those things properly\n\nmaybe the AIs will be better..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah but, we use paper straws now"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So it’s all okay."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Watch this if you want to understand it better: https://youtu.be/bqloPw5wp48?si=zoqXjflVCJQxFMb8"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's nuts, right?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Isn’t it like 20 or something? That’s really not a lot at the end of the day"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’d probably still round up to 100% mortality rate just to be safe."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeahhhh that wiki article is totally fucked up and outrageously biased, but oh well"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's free."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Right so how you gonna get those enzymes literally everywhere that humans have touched it they cannot self replicate? The whole premise of micro plastic remediation was that it would be performed by either bacteria or fungi that would be able to basically take over the world in order to fight the problem"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not saying I agree with it, but for the biological plastic remediation method, they must be able to distribute themselves."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> back to where they came from\n\nComanche tribes, if erroneously considered one whole nation, would have controlled more territory than the Confederacy."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Interesting perspective, that does make sense"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fucking millennials and their love for plastic."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Comanche Empire by Pekka Hamalainen"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you're going to smugly criticise someone for not being literate then your horizon for 'any other time' should be longer than the last 100 years."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So 15 years ago, i had half as much plastic in my balls?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Transparent aluminum"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sadface"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My work has dozens of roll off dumpsters getting taken away every day"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m gonna wear a damn wig if I want to"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thats not what is killing earth"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Don’t try to make it the consumers fault."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Brill! Thanks OP"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As someone who has been on both ends of that kind of behavior.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it's a mix of being genuinely impressed at the audacity (i.e"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "this guy has balls), and some amount of guilt.\n\nChimps often fight to assert dominance over the other, and sometimes will back down if the other chimp proves to be more willful"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Perhaps we humans have a similar trait? It wouldn't be surprising."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Reddit moment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The 5 After movies all originated as Styles fanfic."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If your military action doesn't have a Sabaton song, did it really happen?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Methane is generally categorized as fossil fuel.\n\nAlcohol is indeed a viable alternative to charcoal but not to fossil fuels until you've got, you know, the industrial infrastructure enabled by fossil fuels that's required (in our timeline) to make it in truly huge quantities"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In pre-modern times, alcohol was made/distilled using wood as fuel."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Responding to the beating the wife and daughter with full status has real Office Space energy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i'm not the first person to post this on TIL"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you care about the environment, society, then progressing away from private personal transport and towards nationwide public transport is a no-brainer"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Profiteers market a future of private EVs because it is the most profitable option.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but not everybody can have one"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Making a few buses for a town has a way lower carbon cost, in manufacturing processes, than a new EV for everyone.\n\nThe solutions you celebrate aren't solutions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you understand how much corporate money is now distorting academia you wouldn't trust it'll-be-ok climate modelling"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most researchers know in advance what can and cannot be said to preserve their career.\n\nHope that the same people who brought disaster will invest us out of it is fatal -- how stupid was Pandora for thinking hope was in the box by mistake or something?? It was just another curse on humanity!\n\nNow that disaster is here, profiteers will look for the most profitable options"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Helping everybody is not profitable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Telling the truth is not profitable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Accepting world-savjng regulation is not profitable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Lying is profitable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cheating is profitable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Same as it ever was.\n\nIf you want to feel some relief, you need to wrestle the hands that are currently on the levers **off the levers**"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Otherwise wait for similar headlines to the recent \"plastic recycling was mostly a lie\" but about carbon credits, carbon capture, anything these don't-look-up assholes try to pitch you."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I wouldn’t mind laws against those terrible plastic party favor toys that are basically garbage out of the box"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don’t think they are recyclable"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They are just destined for the pacific garbage patch."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah but now I want some Weird Ale"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Personally I run about 1300 miles per year and get about 300 miles on a pair of shoes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In the 90s I was lucky to get 100"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In the 2000's, 200 mile shoes were becoming more common"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "These days some people claim 500 miles is common to attain but I never have."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The companies responsible for making the plastic are happy to shift the blame to you."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Well, if you don't turn up to the meetings they give your place to someone else."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Why the fuck would you post that?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Individually wrapped in plastic because everyone is so goddamn germaphobic this fast"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This mf really said CUM-bustion"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What ingredients in carbonara would be considered “luxury items” in rural Italy pre WW2, though?  Eggs were relatively cheap"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cheese was also fairly cheap"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hog jowls were definitely peasant food."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah the burger really…..died hard"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All ”fleece” is unless it’s from an actual sheep"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That being said, a sweater I wear for years have a much different impact than sll\nThe single use disposable plastic things, and all the plastic our food is wrapped in, etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "_Hey Google, evolve me some bacteria that is better at eating plastics..._"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The narwhal bacons at poop knife"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "One more reason to love that guy."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I hate it here"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Lets just move to a tropical beach and live under the stars"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Catch lobster and cook it over a campfire"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Maybe climb a tree and grab some fresh coconuts"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's all cheap except our experience here"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Grab life by the shoes."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"nature\" is pretty resilient, even if humans aren't\n\nthe Earth lost the bottom 70% of the entire food chain at one point - and it took 5000 years to recover - but it recovered..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bro wanted a double charge, animal style!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wa’-*wow..*"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Reminds me of the movie Dogtooth."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No, but it does make sense that perhaps every civilization gets to the point where they’re able to chemically engineer materials that their ecosystem isn’t able to handle."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Tbf we are really pushing the limits of what earth can sustain, sure we have physical room but fresh water sources are running out across the globe, arable farmland (something is short supply) keeps getting bulldozed over to put up a fucking Walmart and shitty suburban houses, the fertilizers without which our food supply would quite literally halve overnight are non renewable resources and are also running out."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I AM NOT SAYING THAT THE DAUGHTER WANTED TO DO THIS"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it should've been ruled as a homicide but they say it's a suicide."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "her father is a sick POS"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "and this is one of the saddest things i've read"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i'm just reporting what I learned"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "so if yall are upset take it up with the reporter who is probably dead that wrote this not me."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Make it fast before it gets banned 🤦‍♂️"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Personal observation \n\nCats who spent time in the streets before coming indoors bury their poop better.\n\nKitties who have spent their lives indoors are less fastidious in their burying habits.\n\nWith my fosters, the former outdoor kitties, even kittens, make a mess trying to thoroughly bury their poo"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wait until you read about the Cherokee"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I mean.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "methane."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "alcohols.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I feel like there are a bunch of other fuels which give us more options than just charcoal, which in turn would likely send us down a road not taken (because we went with fossil fuels) that could easily turn up as good if not better efficiencies as the fossil fuels we rely on today\n\nyou actually reminded me of something a friend of mine mentioned a long time ago - which is that apart from photovoltaics, pretty much _all_ our energy production comes from spinning turbines - which is _basically steam engine technology_\n\nand if all you need to do is spin a turbine, there's plenty of uranium still in the ground..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i'm just saying what the report says"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "it states that it's suicide"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I agree her father made her do it and it's fucked up."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Lazar"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I shouldn't have said that"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I should not have said that."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Failure to properly allocate the externality costs to the parties that profit from this system is a major issue for us"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pigou taxes are difficult to implement when the people that would be paying those are lobbying not to have them.\n\nAnd we as consumers are not ready for most of our stuff costing twice as much."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was fungi that evolved to eat the lignin in wood, but yeah your point stands"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That process still takes a very very long time to break down."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The liver can come back even after severe damage.\n\nMy doctor the other day said my liver is functioning normally when just a few months ago he though I was going to have to have diet/medicine restrictions.\n\nIf only all organs were like that."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As a kid my parrents boiled them until they were mush and smelled of rotten eggs"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Then they slather a shit ton of mayo on it in attempt to make it edible."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can’t we just get rid of these assholes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "End the corruption"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "These fucks are completely replaceable these days"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Spend the money it takes to end their monopoly"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "End the bribery"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Stop the status quo"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fuck conservative positions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which mean conserving power to the top."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://en.wikipedia.org/wiki/British_nuclear_tests_at_Maralinga\n\nTried it already"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You don’t need fossil fuels to make plastics though"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I agree 100%"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Normally I’m all for edgy over the top humor but you don’t do that to someone who just lost both of their parents."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah, no"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you’re running In a pair consistently 6 months is a reasonable time frame"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But it also depends on your weight and how rough you are on them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I rotate mine and all of them are still in amazing shape a year later."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What’s the point of your comment?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It is obscene the amount of plastic that is everywhere"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s god fucking awful"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So fucking over the top too"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So many stupid plastic bullshit items."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Dutch golden age was peat bogs - as they cut all those canals and burned through their heyday it all came crashing down when the peat ran out!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Dude I freaking love me some parsnips, aka Luxury Carrots."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's not suicide, that's F%$&ing murder by her bastard father."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "How do you even see anything on a 720p resolution?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Well if you could search you would know.\n\nThe Gold Phoenix tower is mentioned in the 水經註 Shuijingzhu, where it says 南則金虎臺，高八丈，有屋百九間。It is called 金虎臺 \"Gold Tiger Tower\" instead of 金鳳臺 \"Gold Phoenix tower\" here because that was its original name, before it was renamed to its later name by Shi Hu to avoid his own name around 338 CE"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The height was 八丈 upon construction, but records show that Shi Hu made it higher, which is however ambiguous due to the changes in measurements in Chinese history, but the final height of the tower is likely between 25-35m.\n\nAs for the Purple Way, it is mentioned in the 鄴中記 Yezhongji that 紫陌宮在臨漳縣城西北五里，石虎建於紫陌橋側。Thus the bridge was five li or 2.5 km away from the city where the tower was located."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Legend, thanks for linking, hope that was the video you were referring too."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thanks Millennials"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "/s"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I always prefer to roast my corn"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All three of those actually"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Steaming is fine if you want to impart zero flavor to something for some reason"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Roasting vegetables gives you the caramelization reaction and a little bit of the Maillard reaction that create tons of wonderful tasty flavors."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "QUANAH PARKER NEVER FORGOT"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I dunno, pretty much any sentient life is going to need at least hundreds of millions of years of evolution, and all the previous models have to wind up somewhere when they die off"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It might not be the exact same composition, but there would probably be still high-density energy-rich carbon deposits (and yes, unfortunately they would almost certainly be carbon based)."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sorry I wasn't as clear, he plays Albuquerque but in the video his reasons for making it was to create something people would only listen to once and never again"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Push the limits of his audience like Hardware Store.\n\nBackfired spectacularly!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Four hundred and twenty years"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Serious question"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Russia made up 12% of the global supply before the war but crude oil prices in US are up 30-53% since the start of the war"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If it’s not collusion how do you account for that difference? Did a refinery break down?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Had what coming?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Maybe no single person knows how to build a well-optimized modern refrigerator on their own, but there's plenty of people that could take some salvaged pipes and motors/copper and make a fridge that works but kinda sucks"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The principals aren't that complicated, and the bare minimum materials wouldn't be hard to come by"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Modern devices are incredibly complex but they're iterations on much simpler beginnings."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Maybe it's better if we don't ever get back to the industrial era..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We would still be what it was like in 1870, had crude had not been accessible - a little better off with medical discoveries.\n\nThat said, Penicillin would likely not have been a reality.\n\nWe would be still spending our lives working on the next meal"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "One thing fossil fuels has also given us is time - we get to put our knowledge to practice rather than mentoring and dying with a life span of 38.\n\nPlastic feed stocks are just 5% of overall oil production"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Food for thought, by the way, the idea that we can just reduce oil consumption but still create plastics ignores that gasoline is a byproduct of refining and it cannot be avoided - and there's no going away from the utility of plastics in the modern world"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What would Biden have us do with the gasoline?  Bury it??  LOL."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Good work AmeliaAmmalia, very interesting"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Although much of this information is covered in the Wikipedia article your citing the primary sources is authoritative and appreciated"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So not ‘just a theory’ then but the prevailing theory"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I had, up until today, pretty much bought the story that it came from the ‘charcoal burners’ (hence the name) but the weight of evidence suggests otherwise"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thank you."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "vibes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "don't forget pig shit!\n\ngood enough to power Max's Interceptor!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">The idea that a lack of fungi able to decompose lignin during the Carboniferous period was relevant for coal specifically, not all fossil fuels (e.g"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Robinson, 1990)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "However, it appears this was likely not the case, and the abundance of coal formed during the Carboniferous not because of a lack of the right fungi (they were around), but because of a confluence of the right tectonic setting and climate conditions, i.e., lots of extremely wet and flat areas to produce abundant swamps providing the right geochemical conditions for fossil fuel formation (e.g"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nielsen et al, 2016).\n\n>What are those right conditions? In short, those that lead to the \"correct\" kind of organic material being buried in high abundances"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A basic understanding of the long term carbon cycle here is useful (e.g., Berner, 2003), but very broadly the three (sometimes related, or at least coincident) characteristics that lead to those conditions are (1) high productivity (i.e., an area where a lot of organic material is being produced), (2) rapid burial of organic material (i.e., a high sedimentation rate that coupled with high productivity can allow for decomposition to be outpaced by deposition and burial) and (3) anoxia"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In detail, the majority of geologic time periods and paleoenvironments in which large scale fossil fuel deposits were formed were characterized by large anoxic events (e.g"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Demaison & Moore, 1980)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As discussed in Demaison & Moore (and lots of other others), there are a variety of scenarios that can lead to anoxia from global (i.e., a global anoxic events like those that occurred a few times during the Cretaceous, e.g., Leckie et al., 20020) to local (e.g., restricted in/outflow of water bodies like the conditions that exist currently to produce anoxia in the Black Sea, e.g., Arthur & Dean, 2010)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Again referencing Demaison & Moore, there are bacteria and chemical pathways that do breakdown organic material in anoxic conditions (i.e., it's not that anoxic conditions mean that there is no decomposition happening), but these are less efficient than those happening in the presence of oxygen and most importantly tends to leave behind byproducts rich in lipid and hydrogen, which (along with the biomass of these anaerobic decomposers themselves) are the right type of organic material to eventually be formed into fossil fuels.\n\n>In short, it's not actually that the organic material is not decomposed at all, but it needs to be decomposed in the right way (i.e., via anaerobic pathways that are dominant in anoxic marine environments)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This along with lots of starting organic material and fast rates of burial lead to the correct conditions for fossil fuels to form.\n\n[/u/CrustalTrudger explaining it better than I can.](https://www.reddit.com/r/askscience/comments/mebqu3/if_decomposers_are_supposed_to_decompose_then_how/gsfpc10/)\n\nThe PNAS research article that is referenced in (Nelson et al, 2016): https://www.pnas.org/doi/10.1073/pnas.1517943113"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Climate doomsday scenarios are being promoted by fossil fuel corporations as a way of reducing government regulation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If people give up, they can do whatever they want as quickly as possible."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Albuquerque live looks amazing, hope it was half as good a finale as it looks on video!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I could be wrong, but didn't _steam_ get us to the industrial era?\n\nI feel like burning fossil fuels came _after_ we were already industrialised - as a multiplier, purely in terms of efficiency...\n\ndon't all the graphs showing consumption of fossil fuels begin with the industrial era?\n\nI know steam locomotives burned coal, so maybe I'm wrong and it absolutely was required, even for steam power.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "but surely you wouldn't _need_ coal to make steam though, right?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You can buy blenders that should last 30+ years, but they're like $1000"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Italy was very poor for a century or two until post ww2"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s why there were so many Italian immigrants"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Whatever luxuries they produced were exported to bring in coal, iron and other industrial materials or industrial products not produced locally"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So agricultural luxuries aren’t gunna be commonly used by the people"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Too expensive."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What kind of berry were they turning into?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No, we never would have advanced as much as we have"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As another commenter mentioned, we would have stuck in an early industrial time with some steam engines and a global population of a maximum of 1 billion people"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Our civilization probably would have stabilized there and never went much further"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And only if we managed to have sustainable woods (which even now is not given)."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://youtu.be/JK1BfPw7lnQ?si=dqYjB6QY7SidBrS1"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My mind is not managing to combine 'cheap' and 'efficient' in a way that makes sense here\n\nIn the sense you use them, I think they really mean \"low cost and convenient for **someone** -- the cost is imposed on others, and other ecosystems, elsewhere\"  \n\n(It goes without saying that in a global sense there is no 'elsewhere'; 'elsewhere'is created by national borders and TV)\n\nCheap goods need cheap workers to make them, cheap resources to exploit"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But 'cheap' in this sense is an expression of power; the capacity to 'cheapen', to force the conditions in which you can profit"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cheap goods are made at great personal expense by people/places who lack the power to secure proper treatment."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not only the plastics but some other factors also act as great barriers like the rare earth hypothesis, the great filter, the vast distances of space, potential technological singularity, etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Let's tell them about NY's LOVE CANAL Tragedy\nhttps://youtu.be/gR4YBDzPzd0?si=4l3U2xh9yOczZr3U"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And we give you....an orange boomer"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Who's too, very  old to suffer the consequences of his decisions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Also a rapist"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Greatest generation? Greatest disappointment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But #@!^ ya, America!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "stress causes norepinephrine to make its way into the hair follicles which messes with the stem cells present there"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Plastisteel"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "OP tell me you're a religious nut without telling ne you're a religious nut."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ok"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You know how long a tree needs to grow?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And yet we're not doing the most utterly basic things like mandating glass/aluminium bottles for drinks, or packaging suitable items in paper\n\nThis is not hard, it used to be like that"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's no excuse"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">what kitchen appliance will i buy that ever lasts like that?\n\nLots of stuff"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's just generally more expensive"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My parents had shit they before I was born that lasted decades after I was born"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But that's because it was expensive, high quality stuff when they bought it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not some $5 piece of crap from the local shop"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So many people but cheap shit then complain it doesn't last as long as stuff used to"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Or they'll not realise how inefficient it is"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Like that fridge your grandma still owns"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Sure it might be 50 years old and built like a bomb shelter"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But it probably uses 50 x more electricity than any modern fridge does"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There's also confirmation bias"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You're only seeing the stuff that survived this long"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You didn't see the cheap shit that broke a week after it was bought."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yeah that’s what it said."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We should just nuke Australia before their animals spread."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Have they tried adding an extra wing?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "no, you have heard about a few chimps who freaked out because they were abused when forced to perform in front of crowds"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "in the 70s people thought that you could raise a chimp like a human baby and it would grow up to be like a mildly r\\*\\*\\*\\*\\* child"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They believed that conditioning and training coudl shape a child to be anything, or a monkey to do anything.\n\nUnder those very false beliefs, a few chimps went all murdery"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Because that's what happens when a smart, strong, intelligent animal is taken away from its family and its natural environment, put in overalls, and forced to rollerstake in front of a cheering audience with Robin Williams dressed as a clown."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They have to start somewhere and if people hadn't reacted so strongly like tantrum throwing toddles perhaps they would have switched the lids and cups as well by now"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hard agree.\n\n\"Five-year-old Marilyn Demont, obeying in her childish faith a parental ***command*** to commit suicide, leaped unhesitatingly from the 220-foot high Golden Gate bridge, followed seconds later by her father, says the United Press.\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m aware of the harms caused by the plastic industry, I’m curious as to why it out of all the other challenges facing us is the most likely “great filter.” It’s a bad thing but I’m not seeing much evidence that makes me think it’s going to cause our extinction"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Reposting OP’s link in the comments just has me asking the same question"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "exponential curves baby!\n\nthe human brain actually has a really hard time actually grokking how they work - [preferring to think in linear terms](https://hbr.org/2017/05/linear-thinking-in-a-nonlinear-world), always, everywhere\n\nit's one of the reasons we have things like Climate Change - a literal failure of the imagination about the consequences of our actions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most textile mills were river driven in the early industrial revolution"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We'd have no internet but sill could wear Gucci belts."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Empire of the sumer Moon was one of my favorite books about quanah Parker, her son, and the Comanches"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was a savage time on the frontier."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Doesn't make the US any better"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Specially when you consider what came after the civil war"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Segregation and the Jim Crow laws"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Laws so twisted that they were an inspiration for nazi germany's treatment of jews.\n\nAnd the US still permits slavery through it's prison system."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The cumbustion engine in a car is theoretically 50%, more realistically 30-35%"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'd imagine your average generator is about the same, but a bigger engine tends to be more efficientWind is everywhere, though not equally all the time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The main benefit of fossil fuels is that it itself acts as a battery"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Which as another bonus you don't have to carry as much of it around as you use it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We'd need to know what type of apocalypse and how much damage it's done to properly theory craft, but I'd say they'd both be useful to have in  any apocalyptic situation."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Collectively, how much are stored in our balls?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So, my tastes don't necessarily change"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Things change, too! ?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Great"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "All those paper cups and straws really helping huh?\n\nMan, the world gets increasingly depressing"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The more one tries to be mindful and conscious, the more it seems things are falling apart."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And not always in that order!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "People really need to look at the labels of the clothes they buy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Clothes lay directly on top of your largest organ and people don't care"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Didn't it take something like 60 million yeas for nature to start \"digesting\" trees?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That made me so angry I stopped reading the Onion for years"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "As a Weird Al fan, it really felt like a mean-spirited slap in the face"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The guy's parents just died in a tragic accident"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Leave the man alone."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "this guy Carlins"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"Why are oil prices so high?\"  \n\"Because production is down.\"  \n\"Why is production down?\"  \n\"Because we aren't producing as much.\"  \n\"Why aren't you producing as much?\"  \n\"Because production is down.\""
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So they wouldn't be worth building then"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Modern wind turbines barely turn a profit."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The Fillet o Fish is rocking."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They have tried this several times"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Didn't sell well."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "[“i am the center of this universe”](https://youtu.be/Jc4kGo08jLY?si=9s_hJPIMQNFkwo2F)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "almost all major sites have been enshitificationized by the quest for money in the form of subscriptions"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "old porn economies are falling away"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "the once great pornhub is objectively the worst pile of subpar shit on earth."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Beer'ed Ale"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://education.nationalgeographic.org/resource/worlds-plastic-pollution-crisis-explained/"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Isn't it literally 1 woman that got cured at onset and the treatment has failed for others? \n\nI read something about this just a week ago I think"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "How old *are* you? I'm in my mid-50s and honestly, it's always been like this"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hell, in terms of litter and river/lake pollution we are way, way better than it was back in the late '70s and the '80s."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Ironically ,several cataclysmic events maybe caused from our over usage of fossil fuels."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "1/2 of the female population of Paris in the early 1800's worked (in part) in prostitution."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Reddit exemplifies the clueless so hard"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Democracy’s not perfect, but our mistakes tend to be quite correctable, and four years is really not that long.\n\nMeanwhile, Russia is stuck on the same mistake for like 25 years now, so things can always be worse."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Faye Wong.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I remember that name"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Did she sing \"Eyes on Me\" for Final Fantasy 8? \n\n(Yes, I'm a bleeping nerd.)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So this is some high level non definable level of Stockholm Syndrome right ? Or I am too under qualified to understand."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No, good running shoes never lasted as long as they do now"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I get way more miles out of my shoes these days than I did in the 90's"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "6 months is good for shoes if you actually put some miles on them."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "a lot of rock stars blew him off for his weirdness"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bowie turned down a duet bc he was too annoying to be around, someone else said they weren't singing Bad with jackson because of the \"your butt is mine\" line at the beginning"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He was a well known weirdo and it wasn't always cute.\n\nAnd Freddie was a crazy cat lady at home"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "He wrote songs to his cats and took them on tour."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Thats the boomer halt"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No you see, it's all the companies fault"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We consumers needn't change anything and can just continue our lazy way of convinient living."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "No one is going to do anything to address the root cause, only throw paint on artwork and block traffic and make dank memes."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I just used computers as an example"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Electric lights are exactly the same and so is refrigeration"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nothing exists in a vacuum and no single person knows how an end product is made from scratch"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We have knowledge stored in writing and that can be our savior in this apocalyptic scenario"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But only if there are people left that understand what is written, and of course that the writing have survived the apocalypse."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yay! We're winning! Oh wait..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Uh I wouldn't be bragging about the quality of 2000s CRTs"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Those things were made cheap"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "also terrible picture quality, I guess you must not like movies very much"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m still using a Krups coffee grinder my dad bought his first week of college in 1970"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It was used every day from then till 2003 when he switched to pre-ground"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Then I have used it 5x a week since 2012.\n\nNever replaced the blades, the motor, anything, and it works in seconds.\n\nIt’s plastic, but getting 45 years worth out of it (so far!) I think justifies it.\n\nIt’s when we make a plastic shit that’s designed to be thrown away in a few years or in the case of packaging, almost instantly that it becomes such a massive problem."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My favorite one of those is,  “If the brain were so simple we could understand it, we’d be so simple we couldn’t.”"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm 34 but I'm still rocking my 32\" 720p Vizio that I got when I was 18"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What're you doing to your tvs?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What else does the Bible say that you still believe?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just a couple of burgers, have a good time, have a few fries..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "26 years studying Nazi's.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And how many years blasting bongs?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "good for bubbles"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "i wonder if elizabeth taylor visited him."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Again, he’s very much alive"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"Ah, I, uh, I lost my train of thought...uh...let me start back at the beginning...\" - Al, 8 minutes into a 12 minute song."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There was Walk Hard: The Dewey Cox Story from 2007 that did the same thing, albeit with a fictional artist"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's also fantastic."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And where is the 33 metres tower and flew 2.5km part"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Fossil fuels likely accelerated technological advancement, but they weren't the sole driver"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's possible, though unproven, that with more emphasis on renewables, we could have reached a similar technological point, just at a slower pace"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Depends what you consider flying"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m sure plenty of folks flew throughout history long before that due to various circumstances, like maybe getting kicked really hard by an elephant."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Can’t we also speed the process of evolution along greatly due to artificial selection and selective breeding of bacteria cultures"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m no scientist so idk by how much but like faster than hundreds of millions of years"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There are still places where plant material dies and doesn't rot, though"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's not happening at a massive scale, but it does still happen."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "A pool filled with wine and 3000 naked guests playfully chasing each other around sounds boring to you?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "motherfucker woulda been cancelled he try that shit today"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The sources literally say:  \n《太平御覽·卷一百三十·偏霸部十四》：\n\n>又令元黃頭與諸國自金鳳台各乘紙鴟以飛，黃頭至紫陌，乃墜於地。\n\n《北史·卷十九·列傳第七》：\n\n>世哲從弟黃頭，使與諸囚自金鳳台各乘紙鴟以飛，黃頭獨能至紫陌乃墜，仍付御史獄，畢義雲餓殺之。\n\n《資治通鑑·卷一百六十七·陳紀一》：\n\n>使元黃頭與諸囚自金鳳台各乘紙鴟以飛，黃頭獨能至紫陌乃墮，仍付御史中丞畢義雲餓殺之。\n\nIf you can read Chinese, it is perfectly legible and directly says that he flew."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What's the context?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Try to be literate for once, will you?\n\n\"And in general, the global rise of these highly scalable technologies – electric power-trains, electric power grids and electric heat pumps  – will transform the energy sector far, far faster than the incumbents expect, and want to admit.\n\nWe will likely meet Net Zero much much quicker than 2050 – technology and new policy initiatives have already realised this.\"\n\nhttps://carbontracker.org/net-zero-2050-old-before-its-time/"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Haha awesome! Yeah if I heard enough of that I might want to hunt it down too"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There were still sharks though"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "watch \"crimes of the future\", some people start to evolve to eat plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Starbucks"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "wait.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "how does MCR lead to twilight?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes, besides the point that the $6,000,000,000,000 (six trillion) in borrowed spending during Covid is the cause of inflation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But you're claiming someone else is partially wrong, so the requirement of evidence falls on you."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Steam power was by coal, a fossil fuel."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "have any alternative solution?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "no big deal, we need to Jurassic Park it and bring back shit tons of dinosaurs, then [do the thing](https://en.wikipedia.org/wiki/Kill_%27Em_All) and wait a couple of million years and BLAMSKIS...[the boys are back in town baby](https://www.youtube.com/watch?v=Us1u85PnfTg)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But about zero of them are probably playing any of those winter sports"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Y’all actually think there’s any ice hockey going on in India."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Make sure to investigate the shipping companies too"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The extra rates they were tagging on were criminal."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Force a fixed price for the next somewhat odd years and not let them profit to ungodly amounts ever again but let’s be honest the law will offer them a Titty to suckle on while they slap the wrist gently"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's reasonable, makes sense"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I believe that once too, but it seems the process is a bit more nuanced:\n\n* https://www.discovermagazine.com/planet-earth/how-ancient-forests-formed-coal-and-fueled-life-as-we-know-it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Even if accessible, fossil fuels are a finite resource"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They wouldn't last forever, leaving future generations with the same challenge."
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">hydroelectricity would be discovered, but even that's limited compared to the combination of fossil fuel electricity and hydroelectricity.\n\nBig if true."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "India probably has more people living in cold places than Norway does."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I read that as weird a i"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I now have a great name if I want to launch an AI startup."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Add some (red) onion next time!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That was my nickname in college."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I came to the same realization.\n\n\nNo seasonings"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not ever"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not even once"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My mom used to give us shit for adding ketchup to everything"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I grew up ashamed that I was a ketchup addict, it was like a dark shadow hanging over my head for the first 20 years of my life, I was going to go out into the world and everybody was going to judge me.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Turns out, you're supposed to season your food"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don't know why we even had a spice cabinet. \n\n\nYou're also not supposed to cook the shit out of everything"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Everything was so fucking dry all the time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Juices = undercooked = salmonella"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Pop it back in for 10 more minutes! Lemme grab the ketchup bottle real quick...\n\n\nWhich is wild, because I definitely remember hearing her complain once about how \"When we were kids, we used to eat raw ground beef as a snack, and we turned out fine.\" First off, *gross.* Second, then why the fuck are you overcooking everything?\n\n\nAt least half of the meat was freezerburnt"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I can see why somebody might think so, but overcooking freezer burnt meat doesn't save it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It doesn't cancel out, it only makes it twice as gross"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Hello ketchup, my old friend...\n\n\nI hated chili for the longest time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My mom used Campbells tomato soup as a base"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Who the fuck does that? Don't forget the overcooked freezerburnt ground beef! Add a can of beans and simmer, that's her recipe... Probably should've tried adding ketchup"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Maybe it would've saved it."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Muh capitalism bad, etc"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Same with chicken parm"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We are still wild animals deep down so fighting back will always gain you some inherent respect."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I recently watched all of them for the very first time and it was such a wild ride"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That first movie is hilarious/iconic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Truly an experience."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Her arm was mauled by a rabid dog"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "She’s surely gonna die from rabies **= Fatal.**\n\n\n\n\nBUT, a new treatment has been developed that could save her"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "She gets the treatment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "She doesn’t die"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "**= Almost Fatal.**"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "and half of all that is in your balls"
    },
    {
        "subreddit": "todayilearned",
        "sentence": ">except there's this cool knight with a badass name like Sir Stabbington\n\nJesse, what the fuck are you talking about\n\n> Lance a lot\n\nOh.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "my God..."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That's scary"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Boo.\n\nHiss\n\n(still upvotes)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Blackreach?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That’s actually not because of Jingoism, that’s because of English Wikipedia’s (insanely stupid) rule that a source can only be posted if it’s from an “approved” American newspaper, basically."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "did you just call them an inanimate object?\n\n[I'll just go ahead and leave this here for you Chief](https://getyarn.io/yarn-clip/8ad0f9a2-0316-48bb-8d0d-c511ef926aa0#ozfLXdQy.copy)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There is an exit off hwy 26 for Boring and another town called “Oregon City”\n\nThe sign says “Boring Oregon City Next Exit”"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I drove by it for years until I took my mother by it and she pointed out the humor."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And that’s the second largest source of microplastics in drinking water"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I wonder how much of that plastic is just needless junk that didn’t need to be manufactured at all"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "look at the crap they stock dollar stores with that will just end up in a landfill at some point."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Okay but what if we plant new trees after we harvest them?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I was really peeved at this futile effort"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I bought a slushy at a place and they gave me a paper straw for a Styrofoam cup with a plastic lid."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s like 100 pounds of feathers"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Yes it’s just feathers but the thousands of blameless lil individuals are going to weigh you down a lot"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "My immediate thought is that geothermal powerplants and dams would become a huge deal for any civilization"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Huge amounts of power on a much lower required tech scale with a reasonable investment"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It would even allow you to stagger harnessing the energy more and more efficiently over time as you'd find ways to take that electric energy and remake high energy intensity alloys."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Shit is disgusting"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We should be ashamed of ourselves"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm not even a tree hugger or anything but this is just sad"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We need to do better and start getting pissed off about shit like this."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "ROLL PLASTIC"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is an old thread but what you say here just isn't true."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s not really null and void since the discussion was about whether fossil fuels should be left for future humans to advance technologically."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "people that boil it down to just \"IQ\" is just a smoke screen for classism."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I mean you're right, we made it illegal to specifically protest climate change in England. \n\nMeanwhile, there are protests made by Status Drivers protesting against London's efforts for less cars on the road"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oh and don't forget the mayor of Tower Hamlets who made his entire 2022 campaign focused on reducing car restrictions in east London to attract pro-car drivers, despite the fact he was literally kicked out that exact same position about 5 years prior for repeated corruption and voter-base manipulation charges."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "anyone know the biology of the white hair phenomenon? I've heard about this happening a few times, including a survivor of the Khmer Rouge"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "How does stress and witnessing horror cause your hair follicles to age?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "#PLASTIC BAG IN THE SEA"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Plastic can be brought back to its material form to be reshaped into something else"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's just it's simply much cheaper to build from raw materials"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I really wish there was a cheap consumer product that can effortlessly turn your plastic bottles into 3d printer filament"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We have things like that but they are crazy expensive and/or a bit difficult to use."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "How is fish not meat?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It depends a bit on how broad you want to be about no fossil fuels"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If it is no coal, no petroleum, no complex hydrocarbon stores at all then yeah, the Industrial Revolution would have looked very, very different.\n\nWe could still make charcoal (and did) but the scale is just completely different than what naturally occurring coal, tar, oil and such provide"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Petroleum is incredibly energy-dense.\n\nStill, we'd likely eventually replicate a lot of what we've come up with just over a longer timeline"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The biggest missing piece though is space travel and even Low-Earth-Orbit stuff, without hydrocarbons that's just not feasible and making them from scratch is prohibitively expensive.\n\nIt's hard to say though, perhaps we would have found an alternate path."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’ll also take a tv that lasts 10 years over one that weighs as much as I do and can’t even be safely disposed of without me renting a car to drive it to a recycling plant, if one near me even accepts them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Life finds a way.\n\nThere's already evidence that microbes are evolving to treat it as a food source.\n\nAnd that makes sense"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's a source of long chain hydrocarbons"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just like E Coli have been observed in labs to start metabolizing citrate fluid buffer with enough generational exposure (one defining trait of E Coli is that it doesn't metabolize citrate) so too, can microbes present on this planet, with enough generational exposure to microplastics; see them as food.\n\nThis planet already fought its first microplastic battle that the microbes ultimately won"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Trees were a goddamned menace on this planet for millions of years"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They evolved a new substance known as Lignin (deez nuts) that no microbe could metabolize at the time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So trees just piled up on top of each other, generation after generation"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Stack after stack"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And over time, with heat and pressure those trees became coal.\n\nBut of course, eventually microbes evolved that could eat Lignin, and now trees decompose just like any other living organism or thing made of long-chain hydrocarbons."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I'm not seeing [Fantails](https://en.wikipedia.org/wiki/Windmill_fantail) on the new [Turbines](https://en.wikipedia.org/wiki/Wind_turbine) so I hazard a guess to say that there is still some room for improvement, IRL minmaxing if you will"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "got em"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "“Friends, Romans, countrymen, lend me your ears"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But don’t cut them off and give them to me"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Gross!”"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you like that line of thought, give some consideration to reading Prairie Fires, a nonfiction book about the Ingalls family and what the fuck was actually going on during the books"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If you don’t have time for the book, this person did a live tweeting of her read through that was entertaining - she archived it [here](http://www.anamardoll.com/2017/11/prairie-fires-chapters-1-5.html?m=1)."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Like which brands?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Cause we don't have the talent?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In LDN there are foxes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In North America, raccoons"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In India, stray dogs were all over cities"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Etc etc."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I did not know"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Props for having a spine and showing some character instead of taking the easy road and collecting the $5 million."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> With average crop yields remaining at the 1900 level the crop harvest in the year 2000 would have required nearly four times more land and the cultivated area would have claimed nearly half of all ice-free continents, rather than under 15% of the total land area that is required today.\n\n\nWhat an incredible change this brought to farming yields."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don’t think that person was smarter than you."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I appreciate your positivity!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Would you say you have an inner conflict there? Amusingly it seems unclear whether you wish him success in this business or not; it’s like you appreciate your friend’s passion and his need to earn income but you hate his wares on principle.\n\n(Edit: I’m not insisting on a referral btw)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I can't be the only one who constantly misreads Weird Al as Weird AI.\n\nAlso, every time I read something about this guy my respect for him increases."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I stayed in a hotel in Uyuni a couple of months back… I don’t even want to breath the air in"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We obviously got vastly different hotels!"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "they would've been killed tortured raped and maybe eaten lol"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Mentioning vaccines is “agenda pushing” now?    \n\n\n\nWe live in the stupidest of times"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is sad."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Bof.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I don't know"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We have been genetically manipulating plants and animals for millennia"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It is what allowed humans to stop relying on hunting and gathering, but instead do agriculture"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Without genetic manipulation (in those days by cross breeding instead of testtubes and crispr) we would never have become the human race we know today."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The audiobook is also free on Spotify."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "so funny , i fish a small lake in rhode island  US, and while every fish is relatively small, perch are the bitchiest of them all"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "small and no fight"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "nothing interesting about them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "the pickerel on the other hand are bastards"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Nah they’re logistical curves, there are actual limits to that reproduction and they don’t explode forever"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Computers are developed incrementally"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Start simple and go from there. \n\n As long as we have electric lights and refrigeration we would be in a good position to start developing technology again"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It might even take less time because we have a good idea of what is possible and what is useful"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Microchip production probably would take significantly less time to develop and evolve the second time around."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Highly recommend the book Empire of the Summer Moon which features hers and her children’s stories and describes the final downfall of the Comanche nation to white American settlers"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It’s heartbreaking but fascinating- the audiobook is available for free on Spotify."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "What do you mean by \"we\"? And how would you want them to be killed?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Weird how the Wikipedia article says she was “taken” instead of kidnapped, and “married” instead of raped."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Think it was handed out at the entrance."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I mean both levels of care is about zero, so the comment isn't necessary wrong"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Specifically plastic or environmental pollutants in general?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "This is demonstrably false, what are you talking about lol I wish that were true."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Have you read the Genesis recently? I’m not an expert but I can somewhat answer your first question"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "God did not intend to make Eve in the first place"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "God wants Adam to take care of Eden, but turns out, he needs a helper"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "God look through His creation and cannot find any being who fits the job"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So God subsequently created Eve"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I’m not so sure about what you mean by charade"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "However, I can say that taking a ribs out of Adam to creat Eve has its symbolic meaning in marriage etc, that I’m not quite equipped to elaborate"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Word to the wise, if you take Genesis literally, you’ll find it quite baffling"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "God is omniscient and omnipotent, as to why He does what he does is not a question anyone can answer for sure"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But I’m here to point out some obvious discrepancies you made(Adam has a womb), it’s beyond me to answer your theological question, like why God didn’t do this."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Humanity is smart"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Your Jane Austen reference kind of… totally refutes everything you claimed"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "*That’s* your example?    Lol"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "> stone cold fox.\n\nNo, nine tailed didn't you read it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Two words .."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"Clamshell Packaging\"."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Wilson's Snipe.."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "they frequent marshy grounds and areas around streams"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We used to hunt them in Montana and Wyoming"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You'd find them in flooded alfalfa fields in the fall when they'd migrate south"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They are incredibly difficult to shoot and somebody who is adept at hunting them would truly be worthy of the \"sniper\" title"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They are tasty in a stroganoff or wrapped in a bit of bacon with some mashed potatoes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "https://www.allaboutbirds.org/guide/Wilsons_Snipe/sounds \nListen to the \"winnowing\" sound"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "They do that in the air at night"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Straight up creepy."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Well yeah, but it's not like they still do the whole \"kidnap, rape, and enslave people\" thing."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Once charcoal based power allowed enough advancement someone would figure out geothermal or hydroelectric power.\n\nInstead of factories and industry growing in cities near coal mines they could have grew near geothermal plants and dams."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "this"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Watch the 4 episode mini docuseries on Netflix called Broken"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "There’s an episode that blew my mind on plastic manufacturing."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You are talking about references 1-6"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The \"flying\" part is mentioned in reference 7 only, which is a 2009 article, and also marked as \"suspicious\" on the Chinese wiki."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Not only is it energy intensive, we literally use the hydrogen molecules out of the natural gas to fix the nitrogen"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Without gas it would be so much harder, and not just as a source of energy."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But you started the conversation stating that in Italy pasta is a side dish, it is not"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "We don't usually have a full 3/4 courses meal when at home (if not for special occasions), but still every dish is clearly separated in \"primo\" or \"secondo\" or \"contorno\" (first course/second course/side dish) even if it is the only course in that meal.\nAnd pasta is clearly a \"primo\", not a side dish.\n\nFor example yesterday for lunch I prepared tomato sauce pasta and a side of cabbage with yogurt and walnuts"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "But first we ate the pasta by itself because it is a \"primo\" and only then we ate the side dish (that would go with a \"secondo\"), we would never mix or invert them"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "(I know it could sound crazy but for us it's normal)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Most of the clothing we wear contain plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Clothes made only from natural fibers are getting increasingly rare, and more expensive."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Murder\\\\suicide"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Surely there has to be an Italian chief who was working before 1944 still alive, so we can just ask them…"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Everything’s coming up mill whorehouse."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I assume her lawyers did not have the power."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Scientists have proven that the visions that the Oracle at Delphi saw in Ancient Greece was due to gasses coming from the earth that they would breathe in.& like other have said complete darkness/isolation will make you see things"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In prisons, especially in the past, some inmates lose their minds when sent to “the hole”"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I was just talking to my husband about this and shoes"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I used to buy running shoes like 15 years ago, and they would last several years, and all I’d need is to change the inserts"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Now I’m lucky if I get 6 months, and I’m not buying cheap brands."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "That is for sure true, but the switch up in some cases (again, only in ones Ive seen idk how much of a trend it is) to seemingly go on to adore the person standing up to them instead of passively hating them...maybe they do hate them but switch to the \"fawning\" trauma response? Maybe they learned bullying from bad authority figures but still have that respect for authority in a distorted way?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Unfortunately, those are only available via 24 biweekly injections"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3589807/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3589807/)"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "If there is something even remotely bad that comes out about Al, I will cry."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Just wait 200 million years"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "“Stop bitching and climb faster.” \n\n-fellow hiker"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "False"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The trajectories regarding most environmental metrics today are better than any other time"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "The solutions are catching up to the problems at a rapid pace."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I didn't love dog soup"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "And then sit on our hands and die? I think our history illustrates that we will do what's needed to keep advancing and consequences be damned"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I honestly think the initial \"no fossil fuels no advancement\" argument is propaganda to keep people dependent on fossil fuels at the most basic primal level of their minds."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "buddae jjigae is the fucking BOMB\n\nHotdogs, spam, baked beans, American cheese, Ramen noodles, and spicy fucking soup \n\n#1 food I miss from Korea"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "You know what, if it removes the balls plastic I'm all for it"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "gonna go tell Italians they're making it wrong\n\nthey need to use the proper ingredients"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "It's very, very doubtful"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Oil is byproduct of life, and by extension, so is plastic"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "In fact, oil is one of materials probably quite unique to Earth, and it's very unlikely it would have any influence elsewhere in the universe, at least in terms of worlds with life"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Considering how uncommon life is in the universe, and the sheer number of various variables and factors between planets and star systems, it's probably oil, platiscs and everything that comes with that is unique only to us, and wouldn't apply to basically any other kind of life."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "\"I'm doing what I can afford to do\"\n\nYou and every single person who isn't rich."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I found one once"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "At least I lied and said did."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "None of that justifies the brutal abuse."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "I never want to become a soap mummy"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "Let my body decompose."
    },
    {
        "subreddit": "todayilearned",
        "sentence": "So all the \"it's gotta this kind of ham and that kind of cheese and the eggs a certain way\" is just restaurant imposed pretentiousness?"
    },
    {
        "subreddit": "todayilearned",
        "sentence": "not motivated to"
    }
]