[
    {
        "subreddit": "toystory",
        "sentence": "The “You’ve Got A Friend In Me” part at the end was hilarious"
    },
    {
        "subreddit": "toystory",
        "sentence": "So much of his merch and art for the East Asian market is cutesy, it's actually kind of bizarre to see"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's even harder to imagine Ned Beatty's voice coming out of the character portrayed"
    },
    {
        "subreddit": "toystory",
        "sentence": "Like, [look at these phones cases](https://www.aliexpress.us/item/3256806603070632.html?spm=a2g0o.productlist.main.115.41a03ae8QXDJjw&algo_pvid=75365738-6800-4368-ae27-bf26efa0a92f&algo_exp_id=75365738-6800-4368-ae27-bf26efa0a92f-57&pdp_npi=4%40dis%21USD%212.56%212.56%21%21%212.56%212.56%21%402103247417169501340152800eafcc%2112000038306801051%21sea%21US%21168489254%21&curPageLogUid=VSZVgpYF6GcP&utparam-url=scene%3Asearch%7Cquery_from%3A)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Who is that bear?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Like with every show: yes, you can watch the pilot episode."
    },
    {
        "subreddit": "toystory",
        "sentence": "The hat being too flat really grinds my Gears, but other than that it's a nice simple woody doll"
    },
    {
        "subreddit": "toystory",
        "sentence": "I haven't."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah..."
    },
    {
        "subreddit": "toystory",
        "sentence": "That's very intense"
    },
    {
        "subreddit": "toystory",
        "sentence": "What if this was the actual climax in the film rather than Jessie and Woody dangling for dear life?"
    },
    {
        "subreddit": "toystory",
        "sentence": "You gotta disarm him"
    },
    {
        "subreddit": "toystory",
        "sentence": "Lmfao true true"
    },
    {
        "subreddit": "toystory",
        "sentence": "I love all these answers! Thank you all!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I would get the Disney store one but I don’t want to pay costoms and tolls"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is the only Woody doll that is still available at Walmart and Target after Thinkway lost the license 😭\n\nIt’s basically this or the Disney Store one, and I don’t know if the Disney Store one can be easily found in Canada.\n\n\nIf you like it, buy it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody will improve anybody’s life ☺️"
    },
    {
        "subreddit": "toystory",
        "sentence": "Slinky and Woody for me."
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody has always had pretty long arms, they seem to always go a little past his holster\n\nSurprised his arms don’t weigh him down a little with how long they are 😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "Time to burn it with fire! 🔥"
    },
    {
        "subreddit": "toystory",
        "sentence": "Only reason to be mad at this is because in the 90s there wouldn’t be a lesbian relationship! Glad to see that we could go past all of those pointless restrictions!"
    },
    {
        "subreddit": "toystory",
        "sentence": "This horse is capable of ultreme violence."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "Is it me or do his arms seem too long? Other the"
    },
    {
        "subreddit": "toystory",
        "sentence": "that I think it’s a pretty good looking woody!\n\nEdit: clicked send too early😅😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "he's made of plastic?"
    },
    {
        "subreddit": "toystory",
        "sentence": "My question is how did you find the show to begin with"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody will always be my favorite\n\nHe’s been my favorite character since I was born! I adore everything about him (fun fact, I went as Woody 3 years in a row for Halloween!) that’s how much I love this cute selfless little Sheriff! I also have more merchandise of him than any other character!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Off topic from the original post, but has anyone placed the Revoltech Woody on this bullseye? If so, how well did he stay on and was the scale good?"
    },
    {
        "subreddit": "toystory",
        "sentence": "You either die a cowboy or you live long enough to become the owner of a toy barn."
    },
    {
        "subreddit": "toystory",
        "sentence": "Slinky dog he is the best boy."
    },
    {
        "subreddit": "toystory",
        "sentence": "I too noticed how terrible this film was."
    },
    {
        "subreddit": "toystory",
        "sentence": "I’d prefer a story based off Woody’s first owner, it’s been hinted at to be Andy’s dad."
    },
    {
        "subreddit": "toystory",
        "sentence": "Guess I’d be a villain in a Toy Story movie 😅"
    },
    {
        "subreddit": "toystory",
        "sentence": "The first two slides: This is awesome!\n\nThe third: They opened it what the heck!?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Lets gooo"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also funny: the large amount of Toy Story fans who rip apart and customize the toys to make them more screen accurate, much like a certain maniacal boy next door."
    },
    {
        "subreddit": "toystory",
        "sentence": "$250? Maybe if you have to buy new in box"
    },
    {
        "subreddit": "toystory",
        "sentence": "I saw and they are the same price as Ebay"
    },
    {
        "subreddit": "toystory",
        "sentence": "Its hard to save allowance with a sick grandma to take care of with my bad salary, even tho I want it so much"
    },
    {
        "subreddit": "toystory",
        "sentence": "250 dollars..."
    },
    {
        "subreddit": "toystory",
        "sentence": "I dont think so"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thinkway supposedly closed down in 2022.."
    },
    {
        "subreddit": "toystory",
        "sentence": "its a shame."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh, well done, give up hope"
    },
    {
        "subreddit": "toystory",
        "sentence": "Gets collector figure\n\nImmediately opens it \n\n-.-"
    },
    {
        "subreddit": "toystory",
        "sentence": "Won't happen, Thinkway Toys lost the Toy Story license and it went to Mattel, who have not shown interest in replica toys like Thinkway did."
    },
    {
        "subreddit": "toystory",
        "sentence": "Bit late for that based on the pics!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Never open it"
    },
    {
        "subreddit": "toystory",
        "sentence": "This line is notoriously fragile"
    },
    {
        "subreddit": "toystory",
        "sentence": "It feels so wrong to have \"collectors editions\" figurines of characters from a movie where the main antagonist is a toy collector.\n\nStill cool though"
    },
    {
        "subreddit": "toystory",
        "sentence": "You have a wonderful mother"
    },
    {
        "subreddit": "toystory",
        "sentence": "Just wait until Toy Story 5 comes out they'll be bringing the Toy Story Signature Collection back to Target and maybe Amazon"
    },
    {
        "subreddit": "toystory",
        "sentence": "Just hang in there"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe every so often the pull string would get a bit stuck and not go all the way back in"
    },
    {
        "subreddit": "toystory",
        "sentence": "My brother had a woody doll when we where kids and sometimes when you pulled the string it would get stuck and you’d have to pull it out again for it go all the way back in"
    },
    {
        "subreddit": "toystory",
        "sentence": "He’ll probably just have his voice box back"
    },
    {
        "subreddit": "toystory",
        "sentence": "Like magic"
    },
    {
        "subreddit": "toystory",
        "sentence": "In Toy Story one Sid burns a mark in his forehead"
    },
    {
        "subreddit": "toystory",
        "sentence": "But in Toy Story 2 it’s no where to be seen"
    },
    {
        "subreddit": "toystory",
        "sentence": "(And it could of been and then they could of had the toy cleaner fix it) \n\nIn Toy Story 2 is arm ribs and when Andy stitches it up you can clearly see the new stitches…yet Toy Story 3 his arm is like new"
    },
    {
        "subreddit": "toystory",
        "sentence": "I know the voice box is more of a thing / a more noticeable thing but wouldn’t surprise me if he does have it back and they just don’t expect why / how"
    },
    {
        "subreddit": "toystory",
        "sentence": "I agree, Gabby Gabby blackmailed Woody by holding his new friend Forky hostage at the antique store, and then she manipulated Woody by using the memories of Andy to get him to give up his voice box, after she tried to FORCEFULLY rip his pullstring out of his back"
    },
    {
        "subreddit": "toystory",
        "sentence": "Then the movie had the audacity to reward Gabby for her bad behavior"
    },
    {
        "subreddit": "toystory",
        "sentence": "That pissed me off."
    },
    {
        "subreddit": "toystory",
        "sentence": "One of my wishes for toy story 5 is for woody to get a new voice box"
    },
    {
        "subreddit": "toystory",
        "sentence": "I know it might not happen but I still want it 😭"
    },
    {
        "subreddit": "toystory",
        "sentence": "It hurts even more if he actually is one of a kind\n\nMy inner collector is screaming 😭"
    },
    {
        "subreddit": "toystory",
        "sentence": "I understand what you are saying, but Woody did move very suddenly and quickly here, which could’ve led to the string coming out\n\nIn terms of the other scenes, with the truck chase, the only times Woodys string could’ve came out was when the rocket was lit or when he was holding onto Slinky I’m suprised it wasn’t smacking Buzz in the face lol…who knows…it might’ve been\n\nFor the airplane, we didn’t get a good look at his back as he was hanging off the plane, but with how easily the string came out, it was probably hanging down\n\nFor the garbage disposal, there was almost no wind or quick movements moments for Woodys string to hang down, the only times it could’ve was when he was falling into the incinerator or with the magnets\n\n\nI do get what you are saying though"
    },
    {
        "subreddit": "toystory",
        "sentence": "As much as I love Toy Story 4, some parts of it could’ve been done better."
    },
    {
        "subreddit": "toystory",
        "sentence": "This scene alone upset me"
    },
    {
        "subreddit": "toystory",
        "sentence": "I didn't like that woody was left without a voice box"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's his whole gimmick"
    },
    {
        "subreddit": "toystory",
        "sentence": "It makes him a fun toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "And with how rare he seemingly is, it kinda hurts a little more"
    },
    {
        "subreddit": "toystory",
        "sentence": "(Might be my inner collector) and don't get me started on gabby gabby."
    },
    {
        "subreddit": "toystory",
        "sentence": "That is the only scene where the strings hanging out a little"
    },
    {
        "subreddit": "toystory",
        "sentence": "I feel like there's many instances in the franchise where it could've hung out a bit"
    },
    {
        "subreddit": "toystory",
        "sentence": "The moving truck chase from toy story 1, getting off the airplane in toy story 2, the whole garbage scene from toy story 3, I feel like it would have in those moments but it didn't"
    },
    {
        "subreddit": "toystory",
        "sentence": "Plot convenience is toy story 4's best friend"
    },
    {
        "subreddit": "toystory",
        "sentence": "he’s kinda hard to find on the internet"
    },
    {
        "subreddit": "toystory",
        "sentence": "but best bets are on etsy and ebay"
    },
    {
        "subreddit": "toystory",
        "sentence": "Where can i buy one"
    },
    {
        "subreddit": "toystory",
        "sentence": "Where can i buy it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Here is my opinion\n\n1"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 3"
    },
    {
        "subreddit": "toystory",
        "sentence": "It had the best villain, best dark story, and had the best endings that should have been the ending to the series.\n\n2"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story"
    },
    {
        "subreddit": "toystory",
        "sentence": "the movie that started it all still holds today, but it didn't make sense"
    },
    {
        "subreddit": "toystory",
        "sentence": "for example, buzz lightyear thinks he's a real space ranger and not a toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "but he knows the rules of being a toy.\n\n3"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 2"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's an ok movie, great new characters"
    },
    {
        "subreddit": "toystory",
        "sentence": "but i feel like they almost ran out of ideas.\n\n4"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 4"
    },
    {
        "subreddit": "toystory",
        "sentence": "it didn't give the same memories as the first three and was a big disappointment."
    },
    {
        "subreddit": "toystory",
        "sentence": "K, and?"
    },
    {
        "subreddit": "toystory",
        "sentence": "All the effort was certainly worth it."
    },
    {
        "subreddit": "toystory",
        "sentence": "They look satisfying"
    },
    {
        "subreddit": "toystory",
        "sentence": "Out of context but just watching this reminded me how I can’t seem to get behind Gabby Gabby’s character"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t hate her but I definitely don’t sympathise with her plight"
    },
    {
        "subreddit": "toystory",
        "sentence": "How she behaved and what she did to Woody was extra levels of selfishness and callousness combined with the fact that she forcibly removed an ‘organ’ of Woody for her own desires and never addressed or recognised how WRONG it was still has me boiling sometimes."
    },
    {
        "subreddit": "toystory",
        "sentence": "It's about time you Submit to your Master"
    },
    {
        "subreddit": "toystory",
        "sentence": "Interesting, might have to make some myself!"
    },
    {
        "subreddit": "toystory",
        "sentence": "It took me two days to hand shape every single horseshoe and coat them in dark chocolate twice (frosting them with sugar much easier though)"
    },
    {
        "subreddit": "toystory",
        "sentence": "If you're interested, I used Feast Of Fiction's cheerio recipe to make them (it's full on youtube), but I wouldn't recommend to eat a bowl of them for breakfast"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'd personally eat them in a small cup as a snack or dessert, but I do agree they must taste really good with milk."
    },
    {
        "subreddit": "toystory",
        "sentence": "Never knew Woody was a soccer fan"
    },
    {
        "subreddit": "toystory",
        "sentence": "Don’t see many Zurg lovers around here, glad to see another one besides me!\n\n\nEdit:My mistake my lord, you are him! Apologies"
    },
    {
        "subreddit": "toystory",
        "sentence": "Bro, why did they make him cute 😭\n\n\nThose puppy dog eyes 🥹"
    },
    {
        "subreddit": "toystory",
        "sentence": "So precious!!! 🥹"
    },
    {
        "subreddit": "toystory",
        "sentence": "POV: when you and your brother are fighting but your mom walks in\n\n\nBuzz’s face bro 😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "He’s so cute!!!!\n\nHe’s mine now btw"
    },
    {
        "subreddit": "toystory",
        "sentence": "they must taste amazing with milk!\n\nGreat work!"
    },
    {
        "subreddit": "toystory",
        "sentence": "That’s how Woodys pull string always was"
    },
    {
        "subreddit": "toystory",
        "sentence": "It was always out a little bit\n\n\nEdit: at least in Toy Story 1, with the close up on Woodys pull string while Potato Head was making fun of him when Buzz first arrived."
    },
    {
        "subreddit": "toystory",
        "sentence": "Huh… strange"
    },
    {
        "subreddit": "toystory",
        "sentence": "How to fix his red button and laser so i don't have to press down so hard on them."
    },
    {
        "subreddit": "toystory",
        "sentence": "How to get his red button and laser working without having to press down really hard on them."
    },
    {
        "subreddit": "toystory",
        "sentence": "What type of repair you're talking about because I repaired a buzz lightyear just like this"
    },
    {
        "subreddit": "toystory",
        "sentence": "Just save up your allowance and look on Mercari"
    },
    {
        "subreddit": "toystory",
        "sentence": "They are up all time."
    },
    {
        "subreddit": "toystory",
        "sentence": "It's ironic that you're the one with the immature response if you think I'm the younger one here."
    },
    {
        "subreddit": "toystory",
        "sentence": "I've always wanted to get the collection toys but I settled for the play versions like blast off buzz light-year or the 20th anniversary woody"
    },
    {
        "subreddit": "toystory",
        "sentence": "Disney Dreamlight Valley kind of answered the third rule"
    },
    {
        "subreddit": "toystory",
        "sentence": "One of the discussions you can have with Woody pertains to it, and he says that if someone were to turn to life in front of a human, then everyone would start talking about living toys."
    },
    {
        "subreddit": "toystory",
        "sentence": "Does it move when you are not playing with it?"
    },
    {
        "subreddit": "toystory",
        "sentence": "yeah apparently 14 years later he'd return to try and steal Woody again"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah and Woody later repaid him by refusing to help Lotso get untied from the garbage truck"
    },
    {
        "subreddit": "toystory",
        "sentence": "As an adult, the answer is definitely: It's a toy movie for kids"
    },
    {
        "subreddit": "toystory",
        "sentence": "Any theory you come up with as an adult isn't going to match a child's understanding that of course toys are kind of alive."
    },
    {
        "subreddit": "toystory",
        "sentence": "Nice find! Buzz his pose is also inspired by an existing TS2 pose! Very interesting how they remodelled the characters, but for pose reference they looked back to earlier poses."
    },
    {
        "subreddit": "toystory",
        "sentence": "I believe that the toys come alive (out of hypersleep) after a kid played with it for the first time, and expressed joy and laugther with the toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "Like how the Monsters Inc"
    },
    {
        "subreddit": "toystory",
        "sentence": "world create energy out of laugther"
    },
    {
        "subreddit": "toystory",
        "sentence": "Laughter = energy"
    },
    {
        "subreddit": "toystory",
        "sentence": "So a toy's life is power started with a kid's laugh."
    },
    {
        "subreddit": "toystory",
        "sentence": "Neither revealed themselves to the whole world, just one person and slinky never did in Toy Story 2"
    },
    {
        "subreddit": "toystory",
        "sentence": "The girl was never aware that he was a toy."
    },
    {
        "subreddit": "toystory",
        "sentence": "Big time jump, We see Andy happily married with kids and we see him reunited with Woody and Buzz."
    },
    {
        "subreddit": "toystory",
        "sentence": "No of course not"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's Toy Story not Sausage Party."
    },
    {
        "subreddit": "toystory",
        "sentence": "Idk I just know it would end with an old Andy on his death bed and a woody is with him and they tell each other the stories of what they’ve been up to"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ignoring all the rules and there’s an instrumental you’ve got a friend in me playing during this"
    },
    {
        "subreddit": "toystory",
        "sentence": "When the song ends"
    },
    {
        "subreddit": "toystory",
        "sentence": "Andy says Thank you to woody hugs him one last time and woody crawls in bed next to him"
    },
    {
        "subreddit": "toystory",
        "sentence": "We then pan over to the picture of Andy playing with his toys from Toy Story 3 among other pictures of Andy playing with his kids and grandkids but the only from Toy Story 3 ends the movie as we pan away and the credits roll"
    },
    {
        "subreddit": "toystory",
        "sentence": "We saw Woody do it in Toy Story 1 and Slinky in Toy Story 2"
    },
    {
        "subreddit": "toystory",
        "sentence": "(Bark bark bark.."
    },
    {
        "subreddit": "toystory",
        "sentence": "bark.)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh wow, I actually didn't know that was even there!"
    },
    {
        "subreddit": "toystory",
        "sentence": "The series never said who created the rules of the toys or why they come alive"
    },
    {
        "subreddit": "toystory",
        "sentence": "However Toy Story 4, is the only movie in the series where it came SUPER CLOSE to answering those questions, because one of the characters asks \"Why am I alive ?\" but then they don't do it"
    },
    {
        "subreddit": "toystory",
        "sentence": "As far as why the toys aren't supposed to come alive in front of humans"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's because they're inanimate objects to them, their role is to be played with by a child and if they were to reveal that they were alive, the kids wouldn't want to play with them anymore."
    },
    {
        "subreddit": "toystory",
        "sentence": "Does he become alive when you’re not looking? 👀"
    },
    {
        "subreddit": "toystory",
        "sentence": "There is a 🐍 in my 👢!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Are we to believe that in the entire world, not one toy has revealed themselves to the world? It seems unbelievable that every single of the trillions of toys has kept the secret."
    },
    {
        "subreddit": "toystory",
        "sentence": "Sid is that you?"
    },
    {
        "subreddit": "toystory",
        "sentence": "No Problem, Dude"
    },
    {
        "subreddit": "toystory",
        "sentence": "🫡"
    },
    {
        "subreddit": "toystory",
        "sentence": "oh my god thank you so much!\n\n  \nit seems like such an unnimportant place but young me was making up conspiracy theory's about it that's why it's kinda a very fond memory...\n\n  \nthank you so much it feels so nostalgic to see video's about it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ask the bookworm for his instructions"
    },
    {
        "subreddit": "toystory",
        "sentence": "Open him and change his setting to \"Demo Mode\"."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah true"
    },
    {
        "subreddit": "toystory",
        "sentence": "Might’ve been 360 Toy Box Mode"
    },
    {
        "subreddit": "toystory",
        "sentence": "There is a secret/glitch room behind a waterfall near the Fairy World Area."
    },
    {
        "subreddit": "toystory",
        "sentence": "Looks like Pixar knows their stuff more than Disney does"
    },
    {
        "subreddit": "toystory",
        "sentence": "pretty interesting"
    },
    {
        "subreddit": "toystory",
        "sentence": "it was for the xbox 360"
    },
    {
        "subreddit": "toystory",
        "sentence": "Is this the one for the PS3/Xbox?  If so, then that could be a section in 'Toybox Mode'"
    },
    {
        "subreddit": "toystory",
        "sentence": "I have the game- I'll play it later to see if I can see anything that might match this description!"
    },
    {
        "subreddit": "toystory",
        "sentence": "he's beautiful 🥹"
    },
    {
        "subreddit": "toystory",
        "sentence": "No it just looks like"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh sorry pal, I meant having Emily be Andy’s mom."
    },
    {
        "subreddit": "toystory",
        "sentence": "LOLLL"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's really easy to say that it wasn't actually him"
    },
    {
        "subreddit": "toystory",
        "sentence": "Even if he was referred to as Sid, I'm sure there is more than one person in the world who's name is Sid and wears a skull T-shirt"
    },
    {
        "subreddit": "toystory",
        "sentence": "Andy's mum interacted with Al in Toy Story 2, so he can't be Andy's dad"
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you mean by Emily being Jessie's mum?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sid and Andy becoming buddies, Prospector and Lotso teaming up to go after Woody’s group, Al Mcwiggin turning out to be Andy’s dad and still tried to get the roundup gang back, and Emily being Andy’s mother"
    },
    {
        "subreddit": "toystory",
        "sentence": "ultreme violence time"
    },
    {
        "subreddit": "toystory",
        "sentence": "They should show that in a short film about Lotso"
    },
    {
        "subreddit": "toystory",
        "sentence": "OH"
    },
    {
        "subreddit": "toystory",
        "sentence": "I mean that I think the scenario that you described is exactly how it played out, if they saw one another."
    },
    {
        "subreddit": "toystory",
        "sentence": "When you said I was spot-on"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hate to bust this bubble but it isn't one of those, i had the activity center back in the day and i also checked it out, unfortunately its not one of the minigames, ugh the search goes on"
    },
    {
        "subreddit": "toystory",
        "sentence": "sorry"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'm afraid I don't understand where you're confused"
    },
    {
        "subreddit": "toystory",
        "sentence": "Can you clarify?"
    },
    {
        "subreddit": "toystory",
        "sentence": "But he doesn't have balls!  Also what's the point of burning him if he's gonna kill me anyways?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I tried that and I got an IOU :("
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you mean"
    },
    {
        "subreddit": "toystory",
        "sentence": "But I have things to do!!  I can't die right now!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I ain't got a lighter"
    },
    {
        "subreddit": "toystory",
        "sentence": ":c"
    },
    {
        "subreddit": "toystory",
        "sentence": "He's taking notes for next time >:D"
    },
    {
        "subreddit": "toystory",
        "sentence": "If they did, I would be"
    },
    {
        "subreddit": "toystory",
        "sentence": "I love those little dudes!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe he’s going to college as well but works as a garbage to make some pocket money"
    },
    {
        "subreddit": "toystory",
        "sentence": "He is, Pixar even confirmed it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sid’s the garbage man in Toy Story 3"
    },
    {
        "subreddit": "toystory",
        "sentence": "🎵You need to kick him In The Balls🎵\n\n🎵Then burn him so he can kill you🎵"
    },
    {
        "subreddit": "toystory",
        "sentence": "I think you're spot-on!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Pray"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah and if they all saw each other Woody and his friends did nothing to help Lotso while Lotso felt outraged that they had survived and he failed to destroy them"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe!"
    },
    {
        "subreddit": "toystory",
        "sentence": "🤨\n\nIs he in a different position in the second image?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah and did Woody and his friends see him too"
    },
    {
        "subreddit": "toystory",
        "sentence": "But they should do a movie of what he did immediately after the third movie and if Woody or Buzz ever saw him again"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's a likelihood!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes."
    },
    {
        "subreddit": "toystory",
        "sentence": "Isn’t he shown in *3* as the garbage dude?"
    },
    {
        "subreddit": "toystory",
        "sentence": "They just need to cancel it and make a spin-off movie about what happens to Sid many years later after the first Toy Story movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Is it possible Lotso saw Woody and his friends alive when he was tied to the garbage truck cuz it drove right past them?"
    },
    {
        "subreddit": "toystory",
        "sentence": "now you die"
    },
    {
        "subreddit": "toystory",
        "sentence": "She is a selfish brat"
    },
    {
        "subreddit": "toystory",
        "sentence": "Look at her attachment to forky"
    },
    {
        "subreddit": "toystory",
        "sentence": "She doesn't have friends, and her parents don't encourage her to"
    },
    {
        "subreddit": "toystory",
        "sentence": "It is because she is unlikable"
    },
    {
        "subreddit": "toystory",
        "sentence": "Other kids don't like playing with spoked brats"
    },
    {
        "subreddit": "toystory",
        "sentence": "She is capable of knowing right and wrong"
    },
    {
        "subreddit": "toystory",
        "sentence": "She loves trash, just like her."
    },
    {
        "subreddit": "toystory",
        "sentence": "No more Bonnie"
    },
    {
        "subreddit": "toystory",
        "sentence": "She ruined the last 2 movies"
    },
    {
        "subreddit": "toystory",
        "sentence": "Let's bring in a new, better kid."
    },
    {
        "subreddit": "toystory",
        "sentence": "Thank you I spend all day yesterday trying to swapping the heads"
    },
    {
        "subreddit": "toystory",
        "sentence": "He looks fantastic!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I like his face!"
    },
    {
        "subreddit": "toystory",
        "sentence": "toy story 1 cutting to several different takes of buzz trying to nail the scene where he tries to prove he can fly"
    },
    {
        "subreddit": "toystory",
        "sentence": "you know a dictator?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Every villain in Toy Story is redeemable EXCEPT Lotso"
    },
    {
        "subreddit": "toystory",
        "sentence": "Be thankful it wasn’t Flippy! 😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "WOODY'S ROUNDUP"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t know if this is the one they were thinking of, but this is the first time I ever encountered Andy/Sid and it was fantastic, it definitely focuses on their home lives.\n\nhttps://archiveofourown.org/works/617850/chapters/1114701"
    },
    {
        "subreddit": "toystory",
        "sentence": "I was so happy when I found them for that cheap of a price"
    },
    {
        "subreddit": "toystory",
        "sentence": "It was from some church thrift store in my town"
    },
    {
        "subreddit": "toystory",
        "sentence": "20 BUCKS???? Man, that's my dream"
    },
    {
        "subreddit": "toystory",
        "sentence": "You can get new buzz stickers and other stuff like that and make it practically new!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I want him"
    },
    {
        "subreddit": "toystory",
        "sentence": "Don’t worry, the aliens will save your life with the claaaw and you must be eternally grateful 🙏😄"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t believe that man’s ever been to medical school"
    },
    {
        "subreddit": "toystory",
        "sentence": "I have no idea what you're saying"
    },
    {
        "subreddit": "toystory",
        "sentence": "So sure"
    },
    {
        "subreddit": "toystory",
        "sentence": "Why not"
    },
    {
        "subreddit": "toystory",
        "sentence": "I bought all 3 plus some loose army men for around 20 bucks"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thats a collection bullseye too missing the saddle tho"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thanks robot"
    },
    {
        "subreddit": "toystory",
        "sentence": "Gonna change it now."
    },
    {
        "subreddit": "toystory",
        "sentence": "It should though"
    },
    {
        "subreddit": "toystory",
        "sentence": "> and you *paid* less than\n\nFTFY.\n\nAlthough *payed* exists (the reason why autocorrection didn't help you), it is only correct in:\n\n * Nautical context, when it means to paint a surface, or to cover with something like tar or resin in order to make it waterproof or corrosion-resistant"
    },
    {
        "subreddit": "toystory",
        "sentence": "*The deck is yet to be payed.*\n\n * *Payed out* when letting strings, cables or ropes out, by slacking them"
    },
    {
        "subreddit": "toystory",
        "sentence": "*The rope is payed out! You can pull now.*\n\nUnfortunately, I was unable to find nautical or rope-related words in your comment.\n\n*Beep, boop, I'm a bot*"
    },
    {
        "subreddit": "toystory",
        "sentence": "If thats a collection buzz, and you paid less than 150 dollars, W"
    },
    {
        "subreddit": "toystory",
        "sentence": ">have a FNF Song in the Unmasked Toys FNF Mod?\n\nThese are definitely words"
    },
    {
        "subreddit": "toystory",
        "sentence": "I recognise that much"
    },
    {
        "subreddit": "toystory",
        "sentence": "Nooowww… BURN EM!!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Reflections of Humanity by Gothic Storm!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yea I’ve been saving for one myself"
    },
    {
        "subreddit": "toystory",
        "sentence": "Until then I custom made my own"
    },
    {
        "subreddit": "toystory",
        "sentence": "W"
    },
    {
        "subreddit": "toystory",
        "sentence": "I used to have a pirated dvd with the latin american spanish dubs of Toy Story 1 and 2, and even doe the title card of the Toy Story 1 title for that dub is usually the same as in english, the one on this dvd was in some language I didn't recognize, and it looked similar to the one you showed that seems to be in french."
    },
    {
        "subreddit": "toystory",
        "sentence": "oh okay"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ok :D"
    },
    {
        "subreddit": "toystory",
        "sentence": "I love it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Especially the buzz"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’ve been trying to find that one for months"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes."
    },
    {
        "subreddit": "toystory",
        "sentence": "What does your heart say?"
    },
    {
        "subreddit": "toystory",
        "sentence": "At Singapore?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Plaza Singapura"
    },
    {
        "subreddit": "toystory",
        "sentence": "BURN IT"
    },
    {
        "subreddit": "toystory",
        "sentence": "LOL"
    },
    {
        "subreddit": "toystory",
        "sentence": "Which mall"
    },
    {
        "subreddit": "toystory",
        "sentence": "For those who don’t know what happens in this scene:\n\nIt was an original villain defeat for Sid that got scrapped.\n\nSid tries to light Buzz up the fire rocket, but he gets scared by Woody who ACTUALLY talks to him"
    },
    {
        "subreddit": "toystory",
        "sentence": "Then Woody confronts Sid while the other toys surrounds him"
    },
    {
        "subreddit": "toystory",
        "sentence": "After that, Woody says “So play nice.”"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sid then runs into the house yelling “THE TOYS ARE ALIVE!!!” in front of his little sister"
    },
    {
        "subreddit": "toystory",
        "sentence": "Instead of lending him her doll, she looks outside in the backyard but the toys are not moving"
    },
    {
        "subreddit": "toystory",
        "sentence": "Finally, the little sister closes the door."
    },
    {
        "subreddit": "toystory",
        "sentence": "That's actually adorable omgggg"
    },
    {
        "subreddit": "toystory",
        "sentence": "This looks like the table of a serial killer and I’m all here for it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I doubt it, if he was scented it’d probably be a fart smell"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah I know"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yup"
    },
    {
        "subreddit": "toystory",
        "sentence": "Gave my damndest to complete the set, so even have some duplicates, lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "Scale is alittle inconsistent but i still have them all."
    },
    {
        "subreddit": "toystory",
        "sentence": "The pants I'm making out of real denim jeans and the shirt I'm just re using"
    },
    {
        "subreddit": "toystory",
        "sentence": "custom woody body from starch too?"
    },
    {
        "subreddit": "toystory",
        "sentence": "this is funny"
    },
    {
        "subreddit": "toystory",
        "sentence": "I made my own for my youtube channel using a similar font to the original and i'm quite happy with the results [https://imgur.com/xicZiwh](https://imgur.com/xicZiwh)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Always mate, Toy Story 3 is naturally a PS3 game"
    },
    {
        "subreddit": "toystory",
        "sentence": "On the floor laughing my ass off"
    },
    {
        "subreddit": "toystory",
        "sentence": "But alas it has 😂\n\nI tried using the RCPS3 emulator but because I had it \"pirated\" the bugs that occured in game couldn't be fixed and if I continued to speak about it, I would have been banned from that discord server"
    },
    {
        "subreddit": "toystory",
        "sentence": "But there was a comment from a few years ago I think I saved that told me how to get around it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I just never tried again after that experience 😂😭\n\n\nPS3 version deffo the best"
    },
    {
        "subreddit": "toystory",
        "sentence": "Well, I meant building your own little city with missions and all that."
    },
    {
        "subreddit": "toystory",
        "sentence": "get an emulator and play it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I played it heaps as well"
    },
    {
        "subreddit": "toystory",
        "sentence": "they won't sadly"
    },
    {
        "subreddit": "toystory",
        "sentence": "Agreed"
    },
    {
        "subreddit": "toystory",
        "sentence": "I had to get a PS3 emulator on my pc just to play TS3 and boy was it worth it because I had heaps of fun, the pc version is pretty much just the demo version of the full thing whilst the PSP version is horseshit and shouldn't have been ported to the PS5"
    },
    {
        "subreddit": "toystory",
        "sentence": "but it lacks a lot compared to the PS3 and Xbox version"
    },
    {
        "subreddit": "toystory",
        "sentence": "*”You cant, rush, art!”*"
    },
    {
        "subreddit": "toystory",
        "sentence": "Why would anyone believe this? Are you a fundamentalist? Like, I just can’t understand seeing this and thinking it might be true."
    },
    {
        "subreddit": "toystory",
        "sentence": "Honestly same, I genuinely want to see what’d become of Stinky Pete later on"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yea it's not as neat as I'd like but I'm hand stitching everything"
    },
    {
        "subreddit": "toystory",
        "sentence": "Waaaa, I'd have loved to have see that!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah true, I think Stinky Pete may have returned as an ally to Woody’s group and helped him fight off Lotso."
    },
    {
        "subreddit": "toystory",
        "sentence": "Wow!  I hate this! :D"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'm SO pumped to see the results!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Stinky Pete returning could go a few ways, but I think there's two big BIG ways it could pan out:\n\n1.) He'd be royally pissed at Woody's crew for ruining the cushy future that he could have had.\n\n2.) He would be much more relaxed and goofy after having his purpose be fulfilled, and slip into a 'comic relief' role"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'd say that the second option is more likely after seeing him in the TS3 video game, but given that they also had Lotso appear as a totally toothless non-threat, I don't think that the game is an accurate representation of either character."
    },
    {
        "subreddit": "toystory",
        "sentence": "Set it up boss"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is a weird-ass post."
    },
    {
        "subreddit": "toystory",
        "sentence": "Someone's asking the big questions."
    },
    {
        "subreddit": "toystory",
        "sentence": "I love Lotso"
    },
    {
        "subreddit": "toystory",
        "sentence": "He's my fave Disney villain."
    },
    {
        "subreddit": "toystory",
        "sentence": "Always possible, but what made chuckles hold onto it? I’m curious"
    },
    {
        "subreddit": "toystory",
        "sentence": "All good but yeah I agree, the Prospector had never been owned before like Lotso has so he never felt the same way Lotso did with the whole Daisy thing"
    },
    {
        "subreddit": "toystory",
        "sentence": "If the Prospector did come back in Toy Story at all, what do you reckon they’d have done with him? \nYeah I also agree that Stinky Pete was more misunderstood than anything, I don’t think he evil like Lotso was"
    },
    {
        "subreddit": "toystory",
        "sentence": "Stinky Pete just thought that camping in the Museum was safe because they won’t get thrown away whilst Lotso ran an entire dictatorship in the daycare"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’m pretty sure that he was canonically made before scented toys were a thing, wasn’t he? So he probably isn’t scented."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah that's why he left his box, the world had to experience his magnificent musk before being sent off to a museum"
    },
    {
        "subreddit": "toystory",
        "sentence": "Needs to bit of love"
    },
    {
        "subreddit": "toystory",
        "sentence": "I have put it on hold to work on another project"
    },
    {
        "subreddit": "toystory",
        "sentence": "But I will continue it and update you"
    },
    {
        "subreddit": "toystory",
        "sentence": "Pretty cool! How is it now?\n\nit would be awesome if we get 4 player split screeb"
    },
    {
        "subreddit": "toystory",
        "sentence": "WHAT IN THE NAME OF EMPEROR ZURG IS WRONG WITH YOU BOY!!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "The fuq"
    },
    {
        "subreddit": "toystory",
        "sentence": "No."
    },
    {
        "subreddit": "toystory",
        "sentence": "Only people I've seen with those types of collections were youtubers"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah, that would be so cool"
    },
    {
        "subreddit": "toystory",
        "sentence": "Soon after\nThe people who made this got sued by Disney and pixar"
    },
    {
        "subreddit": "toystory",
        "sentence": "It could be!  I tragically wouldn't know, but I DO see some parallels"
    },
    {
        "subreddit": "toystory",
        "sentence": "The biggest difference between Lotso and Stinky Pete is that where Pete hadn't ever been loved, Lotso both loved and was loved.\n\nThe Prospector's disdain for children came from a place of neglect- he was unwanted and so his purpose as a toy had never been fulfilled.\n\nLotso not only had an owner who loved him, but he was in the coveted position of 'favorite.'  He wasn't just *a* toy to Daisy- he was *the* toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "The special one who was missed so badly when he was lost that she needed him back in a way that she hadn't needed the others"
    },
    {
        "subreddit": "toystory",
        "sentence": "He was too selfish to understand *why* Daisy had gotten another, and too short-sighted to see that he was the only one who got replaced because he was the only one that mattered that deeply to her"
    },
    {
        "subreddit": "toystory",
        "sentence": "He was also incredibly stupid and didn't seem to realize that a toddler absolutely did *not* toddle her way to the toy store and get another teddy bear with money that she probably didn't have"
    },
    {
        "subreddit": "toystory",
        "sentence": "You could chalk his lashing out at Daisy instead of her parents up to him being fairly new and therefore...pretty dumb.\n\nThe Prospector made some *incredibly* bad choices, but his story seems to end in a way that might actually be okay!  He will get played with, probably customized, become treasured in a way that he's never experienced before"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah, he's not that thrilled when he realizes just how trapped he is, but that's because it's something new and he has no idea what he's in for"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toys are meant to be played with- he will adjust, I'm sure.\n\nLotso's bad choices began the moment he lied to Big Baby, and then snowballed exponentially"
    },
    {
        "subreddit": "toystory",
        "sentence": "The biggest thing to take from Lotso as a character is that he's not really a victim of circumstance- sure, he didn't have any say in getting left behind and subsequently replaced, but everything from there was a conscious decision that he made to soothe his own bruised ego at the expense of everyone around him, regardless of whether they were part of why he was hurting or not"
    },
    {
        "subreddit": "toystory",
        "sentence": "Stinky Pete is honestly a better person, all things considered"
    },
    {
        "subreddit": "toystory",
        "sentence": "(Babbling over, sorryyyyyyyy :'D)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Voiced by Joe Ranft who also played Heimlich Lenny Pete Claws Ward Jacques Red Elmo St Peters etc"
    },
    {
        "subreddit": "toystory",
        "sentence": "One of my favorite characters"
    },
    {
        "subreddit": "toystory",
        "sentence": "i'm glad he appears at the Disney Parks"
    },
    {
        "subreddit": "toystory",
        "sentence": "Wheezy is adorable"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thank you for looking into it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’ve contacted them a couple time in the past and they keep saying not done"
    },
    {
        "subreddit": "toystory",
        "sentence": "And now it says it won’t ship to the USA"
    },
    {
        "subreddit": "toystory",
        "sentence": "So I wrote them again so who knows"
    },
    {
        "subreddit": "toystory",
        "sentence": "I mean Lotso knew Woody would never be able to find Daisy’s home, so maybe Lotso realized Chuckles had secretly taken it after he tore it off Big Baby."
    },
    {
        "subreddit": "toystory",
        "sentence": "I have find [this](https://www.tfw2005.com/boards/threads/we-want-transitron.1043035/page-10)"
    },
    {
        "subreddit": "toystory",
        "sentence": "That’s how I feel about Transitron"
    },
    {
        "subreddit": "toystory",
        "sentence": "i really need that figure with all my heart"
    },
    {
        "subreddit": "toystory",
        "sentence": "Someone burn it down!!!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I contacted him and he is still working on it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe if more people ask for this he will put a little more effort on it"
    },
    {
        "subreddit": "toystory",
        "sentence": "From what I saw he didn't give any more news apart from a small teaser"
    },
    {
        "subreddit": "toystory",
        "sentence": "if u can send to me i can be very happy"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’m at a stopping point"
    },
    {
        "subreddit": "toystory",
        "sentence": "Got all the parts separated, but they would need polish and mesh repair"
    },
    {
        "subreddit": "toystory",
        "sentence": "Wayy above my Blender knowledge"
    },
    {
        "subreddit": "toystory",
        "sentence": "I would be very happy to provide the files to anyone who could use them"
    },
    {
        "subreddit": "toystory",
        "sentence": "any news?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I did some work on separating the parts out, but it would need work from someone who knows blender better than I"
    },
    {
        "subreddit": "toystory",
        "sentence": "Message me and I would be happy to provide my work."
    },
    {
        "subreddit": "toystory",
        "sentence": "[this it's the link for the 3d model](https://sketchfab.com/3d-models/kingdom-hearts-iii-reptillus-maximus-statue-91b553c794534407a9a072625f9658be)"
    },
    {
        "subreddit": "toystory",
        "sentence": "That’s awesome! Although I’d probably throw him in the fire since I was deathly terrified of Lotso growing up😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "You reckon there was any chance he’d remember that Chuckles had it on him?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I heard that in the original script for Toy Story 3 they were gonna have the Prospector return, is that why Lotso has a similar angry attitude to him?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah I saw how surprised Lotso looked when Woody mentioned Daisy and showed him the pendant he had of her, since then Lotso made it his mission to get rid of them"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah do what must"
    },
    {
        "subreddit": "toystory",
        "sentence": "Agreed"
    },
    {
        "subreddit": "toystory",
        "sentence": "FR, Woody’s group should have kicked his ass at some point"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh shi- woody!! Is what I hear once focusing on the other word"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember watching a video with these eggs also containing Thomas ones as well when I was younger"
    },
    {
        "subreddit": "toystory",
        "sentence": "Holy shit yes please make it I am begging you 🙏"
    },
    {
        "subreddit": "toystory",
        "sentence": "The KH3 model also has the joints and pins modeled in 3D to connect the pieces, all that would be needed is disassembly and reassembly work"
    },
    {
        "subreddit": "toystory",
        "sentence": "It shouldn’t be impossible since like you said there are 3D models, but making the joints is gonna be super hard.\n\nAlso offtopic but that guy has always reminded me of the SharpClaw from Star Fox Adventures"
    },
    {
        "subreddit": "toystory",
        "sentence": "It would've actually been a much better movie than TS4 😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "wow!"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"Puffy Happiness\"\n\nI love that they picked the least happy character ever for this, LOOOOL"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don't really understand why they'd port the inferior version to pc"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe hardware limitations on pc's back then?"
    },
    {
        "subreddit": "toystory",
        "sentence": "The irony of his ideology..."
    },
    {
        "subreddit": "toystory",
        "sentence": "That exemplifies his spitefully developed ideology about toy ownership: he thinks that all toys are \"**trash waiting to be thrown away**\" (which is a rather *hypocritical* argument on his own end) and that humans \"don't\" really love them."
    },
    {
        "subreddit": "toystory",
        "sentence": "It's a promo for Inside Out 2"
    },
    {
        "subreddit": "toystory",
        "sentence": "But they specifically added characters from Pixar'a Film Catalogue for promotional purposes."
    },
    {
        "subreddit": "toystory",
        "sentence": "Are they making a Lotso movie? This looks like promotional material."
    },
    {
        "subreddit": "toystory",
        "sentence": "The floppiest"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe they can make a short film about Lotso and what happened to him after the events of Toy Story 3, including flashbacks of how he dragged Woody into the dump with him and left him and his friends to die"
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you say?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah you’re right"
    },
    {
        "subreddit": "toystory",
        "sentence": "I guess he still counts as pure evil even if he had an understandable reason to leave them to die"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah I think little did Lotso know that Woody had gotten that pendant from Chuckles"
    },
    {
        "subreddit": "toystory",
        "sentence": "Papaw needs his cane!  I'm thinking about embedding a magnet into the wood, then adding magnets to both his paws so he can 'grip,' but I'm also lazy and he seems able to hold it well enough without it."
    },
    {
        "subreddit": "toystory",
        "sentence": "The way he asks \"Where did you get that?!\" upon seeing Baby's pendant is so raw, dude was backed into a corner and he knew it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Someone pointed out that as Woody and the gang had seen him, he'd always been cheerfully in control of his emotions, but the moment Woody hit him with the truth, the veneer cracked *completely*"
    },
    {
        "subreddit": "toystory",
        "sentence": "I absolutely love the way he was written, he's got depth."
    },
    {
        "subreddit": "toystory",
        "sentence": "Did someone say my name"
    },
    {
        "subreddit": "toystory",
        "sentence": "Old bear hahah"
    },
    {
        "subreddit": "toystory",
        "sentence": "Agreed, that way he’ll always be thinking about just how much of a loser he always will be"
    },
    {
        "subreddit": "toystory",
        "sentence": "He had absolutely no right to dictate how others should live their life"
    },
    {
        "subreddit": "toystory",
        "sentence": "I mean Woodys group damn near died because of Lotso, he’s definitely an evil bear"
    },
    {
        "subreddit": "toystory",
        "sentence": "I think that very well could have been it, Lotso probably felt intimidated by the fact that Woody knew exactly what happened to him in the past"
    },
    {
        "subreddit": "toystory",
        "sentence": "I wouldn’t be surprised if Lotso saw killing Woody and his friends as a way of keeping his secret buried"
    },
    {
        "subreddit": "toystory",
        "sentence": "ZURG IS BETTER!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I want that to be canon so badly"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hit him hard with the hopelessness so he has plenty to think about."
    },
    {
        "subreddit": "toystory",
        "sentence": "Then maybe he’s not pure evil if that was the reason"
    },
    {
        "subreddit": "toystory",
        "sentence": "Do you think the reason he left Woody to die even after he saved his life is because he was mad at Woody for bringing up the truth about his past?"
    },
    {
        "subreddit": "toystory",
        "sentence": "3,2,1,4 \n\nToy story 4 was good but does not compare to the original 3."
    },
    {
        "subreddit": "toystory",
        "sentence": "No"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thanks for the love, sorry for the late reply, I’ll contact you"
    },
    {
        "subreddit": "toystory",
        "sentence": "My username is @saucyboii!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sorry for the late reply, add me on discord! @saucyboii"
    },
    {
        "subreddit": "toystory",
        "sentence": "LOL"
    },
    {
        "subreddit": "toystory",
        "sentence": "LOOL, did Buzz really berate Rex for this?"
    },
    {
        "subreddit": "toystory",
        "sentence": "wth"
    },
    {
        "subreddit": "toystory",
        "sentence": "FR"
    },
    {
        "subreddit": "toystory",
        "sentence": "Probably"
    },
    {
        "subreddit": "toystory",
        "sentence": "HAHAHAAH"
    },
    {
        "subreddit": "toystory",
        "sentence": "maybe he did see them, he deserves to know that he failed"
    },
    {
        "subreddit": "toystory",
        "sentence": "pretty much"
    },
    {
        "subreddit": "toystory",
        "sentence": "He's a flop"
    },
    {
        "subreddit": "toystory",
        "sentence": "Absolutely"
    },
    {
        "subreddit": "toystory",
        "sentence": "Well shit, everyday's a school day"
    },
    {
        "subreddit": "toystory",
        "sentence": "Lotso is some kind of something ain't he"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hey everyone I need more comments on my post here https://www.reddit.com/r/toystory/comments/1cv8ndh/why_did_lotso_leave_woody_and_his_friends_to_die/"
    },
    {
        "subreddit": "toystory",
        "sentence": "Cool"
    },
    {
        "subreddit": "toystory",
        "sentence": "By the way y’all should comment about him on my post here https://www.reddit.com/r/toystory/comments/1cv8ndh/why_did_lotso_leave_woody_and_his_friends_to_die/"
    },
    {
        "subreddit": "toystory",
        "sentence": "it's possible"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hi could you maybe view my recent post posted in the toy story community"
    },
    {
        "subreddit": "toystory",
        "sentence": "she also was in 2, for the toy barn scenes"
    },
    {
        "subreddit": "toystory",
        "sentence": "yes."
    },
    {
        "subreddit": "toystory",
        "sentence": "No, I still hear “Oh, Woody.” But when I focus on the other word, it sounds like that"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s kinda like that thing where people hear either Yanny or Laurel."
    },
    {
        "subreddit": "toystory",
        "sentence": "\"Oh Woody\" that's what Buzz is saying, you cut it at the end of the clip"
    },
    {
        "subreddit": "toystory",
        "sentence": "That's why it sounds like the other word."
    },
    {
        "subreddit": "toystory",
        "sentence": "we toys can see everything...\n\nSo play nice!\n\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA-\n\nTHE TOYS ARE ALIVE"
    },
    {
        "subreddit": "toystory",
        "sentence": "Lmao ok obviously im exaggerating a bit i dont literally want to vomit and start gagging"
    },
    {
        "subreddit": "toystory",
        "sentence": "But i def make it a point to talk shit about him every time i see his merch lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "He’s a great villain for sure, and so he’s one of those “love to hate” kinda characters"
    },
    {
        "subreddit": "toystory",
        "sentence": "You love the guy?? What about him do you love???"
    },
    {
        "subreddit": "toystory",
        "sentence": "Do you think that the reason why Lotso left Woody and his friends to die is because he was mad at Woody for mentioning Daisy and bringing up his past?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sure thing."
    },
    {
        "subreddit": "toystory",
        "sentence": "Do you want me to fix the transparency of that woody render"
    },
    {
        "subreddit": "toystory",
        "sentence": "That looks awful"
    },
    {
        "subreddit": "toystory",
        "sentence": "That looks kinda bad."
    },
    {
        "subreddit": "toystory",
        "sentence": "Exactly"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes, but it's actually the other way around"
    },
    {
        "subreddit": "toystory",
        "sentence": "Patrick Warburton originally voiced Buzz in the pilot movie, \"The Adventure Begins\" but he was dubbed over by Tim Allen for the home video releases"
    },
    {
        "subreddit": "toystory",
        "sentence": "When it became a TV series, Patrick Warburton replaced Allen (like he was supposed to in the first place)."
    },
    {
        "subreddit": "toystory",
        "sentence": "Is there any sort of \"punishment\" if they managed to watch the 4th movie, though?\n\nIt's for your cousins, not the movie itself."
    },
    {
        "subreddit": "toystory",
        "sentence": "Actually Tim Allen only did the voice for the pilot of the TV show"
    },
    {
        "subreddit": "toystory",
        "sentence": "The rest was done by Patrick Warburton"
    },
    {
        "subreddit": "toystory",
        "sentence": "Rewatching star command now, I realize how much wit and banter was present in the show"
    },
    {
        "subreddit": "toystory",
        "sentence": "Plus the plot of each episode was engaging"
    },
    {
        "subreddit": "toystory",
        "sentence": "Plus, they did a good job of making Buzz seem like a badass space cowboy while zurg was the perfect balance of menacing and goofy.\n\n  \nLightyear had a nice story, and it wasn't too bad overall, but Buzz Lightyear of Star Command is way beyond."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh that's why Mr potato expression and eye brow change"
    },
    {
        "subreddit": "toystory",
        "sentence": "Wow dude has a huge backlog!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I will thank you! I can't wait to see his little face when he gets a 'real' letter from Buzz Light year! 😁😁"
    },
    {
        "subreddit": "toystory",
        "sentence": "Let me know their reaction to seeing him back! :D"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh you are fantastic thank you! That's much better than what I was going to write, thank you so much =)"
    },
    {
        "subreddit": "toystory",
        "sentence": "This buzz did test flights that were like 10 min for him but 10 years for everyone else"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe you can use that but scale down time since he's toy scale lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"I have returned from my mission by the Star Command! My sincere apologies for my absence,(name)"
    },
    {
        "subreddit": "toystory",
        "sentence": "But my battle on Planet Z to take down the evil emperor Zurg was successful!\"\n-Buzz Lightyear"
    },
    {
        "subreddit": "toystory",
        "sentence": "Exactly"
    },
    {
        "subreddit": "toystory",
        "sentence": "The fourth movie made the last three movies untrue"
    },
    {
        "subreddit": "toystory",
        "sentence": "According to four, it is *not true* that a toy has a higher purpose that is worth pursuing above and beyond selfish wellbeing"
    },
    {
        "subreddit": "toystory",
        "sentence": "It makes it so the entire premise of movies 1-3 is just childish wishing, and “the real world” is about doing what is best for you"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s not surprising: four is a truly post-modernist assessment of truth"
    },
    {
        "subreddit": "toystory",
        "sentence": "But it’s disappointing because 1-3 were about purpose and value of roles and the willingness to sacrifice for others… and four undoes that to say “nah, you do whatever makes you feel right at the time.”"
    },
    {
        "subreddit": "toystory",
        "sentence": "But just like people we grow, learn and change"
    },
    {
        "subreddit": "toystory",
        "sentence": "As he got older ( or his kids did) his perspective changed"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also, he met new toys and re-connected with Bo that also changed his perspective"
    },
    {
        "subreddit": "toystory",
        "sentence": "Exactly"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody made a decision that would benefit him"
    },
    {
        "subreddit": "toystory",
        "sentence": "After they spent 3 movies reinforcing that toys have a higher purpose and them abandoning that purpose for selfish ends is never worth it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Except now they tried to undo what they had been telling us for the whole series."
    },
    {
        "subreddit": "toystory",
        "sentence": "What up fishes!?! I love all the puns in this short."
    },
    {
        "subreddit": "toystory",
        "sentence": "I get why Woody left"
    },
    {
        "subreddit": "toystory",
        "sentence": "He always was in the closet and now he has a broken voice box"
    },
    {
        "subreddit": "toystory",
        "sentence": "If he went back he almost certainly would have been thrown away instead of just being with Bo who he’s always cared about"
    },
    {
        "subreddit": "toystory",
        "sentence": "Dude we about to be top post omg"
    },
    {
        "subreddit": "toystory",
        "sentence": "I can't speak for every *other* Lotso fan, but I def don't agree with his actions"
    },
    {
        "subreddit": "toystory",
        "sentence": "However, as a villain, he is brutally chilling and phenomenally written so we're just going to have to agree to disagree- I love the guy"
    },
    {
        "subreddit": "toystory",
        "sentence": "You're allowed to hate him, I'm just thinking that wanting to vomit just from seeing him on merch is a little...much?  He hasn't caused real-world harm and never will."
    },
    {
        "subreddit": "toystory",
        "sentence": "Sure, but why celebrate how horrible he is? He is as real to me as Woody and Buzz/anyone else in the gang"
    },
    {
        "subreddit": "toystory",
        "sentence": "Obviously not really real, just “literary devices” but the emotion is real"
    },
    {
        "subreddit": "toystory",
        "sentence": "The connection is real"
    },
    {
        "subreddit": "toystory",
        "sentence": "Lotso is the worst."
    },
    {
        "subreddit": "toystory",
        "sentence": "I might!"
    },
    {
        "subreddit": "toystory",
        "sentence": "You're not serious, are you? Do you think an actor known for comedy and voice over work would also be an animator? It's utter coincidence that they share a name"
    },
    {
        "subreddit": "toystory",
        "sentence": "[This Tim Allen](https://www.imdb.com/name/nm0021110/?ref_=ttfc_fc_cr) is the one that worked on Fireman Sam."
    },
    {
        "subreddit": "toystory",
        "sentence": "Not really.\n\nThe Toy Story 3 animations for Woody and the other Toy Story characters, had to be re-modeled from scratch, because Pixar couldn't do anything with their old files anymore"
    },
    {
        "subreddit": "toystory",
        "sentence": "They could open them up, but couldn't use them for the movie because they were too old, so Pixar decided to just remake all of the old characters, but they made the changes as small as possible so that you can't tell the difference unless you pay attention to the details."
    },
    {
        "subreddit": "toystory",
        "sentence": "The OG Sid look a like \nWill Poulter aka the actor with the eyebrows"
    },
    {
        "subreddit": "toystory",
        "sentence": "***Is he stupid?***"
    },
    {
        "subreddit": "toystory",
        "sentence": "Why does the lotsonkler? Is he stupid?"
    },
    {
        "subreddit": "toystory",
        "sentence": "He's not real tho"
    },
    {
        "subreddit": "toystory",
        "sentence": "He's just a literary device like any other fictional character!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Any time i see Lotso toys/merch i wanna vomit"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah I know"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy story 3:\n\n1"
    },
    {
        "subreddit": "toystory",
        "sentence": "Tim allen fumbling around with seductive spanish\n2"
    },
    {
        "subreddit": "toystory",
        "sentence": "When the toys are in the trash conveyer and woody and buzz push lotso up to the ladder for the emergency button, several takes there where lotso doesnt catch the ladder, and him and woody laugh between takes about touching his butt\n3"
    },
    {
        "subreddit": "toystory",
        "sentence": "Mr Potato head laughing the first 2 takes where Jessie admits she was wrong and he says \"Shes right Woody"
    },
    {
        "subreddit": "toystory",
        "sentence": "She was wrong!\""
    },
    {
        "subreddit": "toystory",
        "sentence": "Cause if you don’t, we’ll find out SID"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sid your pop tarts are ready! ALLRIGHT!!!!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'm pretty sure Woody, knowing he's a toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "Would just go back into the house through an open window..letter slot on the front door etc and be salty about Andy picking Buzz over him.\n\nThe only reason Buzz went after Woody and Andy was because he wanted revenge for being pushed out the window"
    },
    {
        "subreddit": "toystory",
        "sentence": "He didn't know he was a toy that could be easily lost..so he wouldn't have known of getting back into the house by himself."
    },
    {
        "subreddit": "toystory",
        "sentence": "From now on you must take good care of your toys…"
    },
    {
        "subreddit": "toystory",
        "sentence": "Anyone know how I can watch Toys Carnival 1, 2, and 3? I can’t even find them on IMDb"
    },
    {
        "subreddit": "toystory",
        "sentence": ":/"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 4 was a perfect ending"
    },
    {
        "subreddit": "toystory",
        "sentence": "The toys that needed to stay with Bonnie stayed and woody and Bo got their happy ever after"
    },
    {
        "subreddit": "toystory",
        "sentence": "What was wrong with 4? Woody got his happy ending with Bo and now can help many children"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh so he left them to die because he wanted revenge on them for ruining his rule at Sunnyside and for learning about his past"
    },
    {
        "subreddit": "toystory",
        "sentence": "You've made a big mistake at the age of 18"
    },
    {
        "subreddit": "toystory",
        "sentence": "But now you are undoing your bad decision and recollecting Toy Story"
    },
    {
        "subreddit": "toystory",
        "sentence": "Welcome back to the fan club."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah, I’d recommend having them watch Rick and morty instead"
    },
    {
        "subreddit": "toystory",
        "sentence": "You did not have permission to leak my face"
    },
    {
        "subreddit": "toystory",
        "sentence": "Aint no way 💀🙏"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t read much no"
    },
    {
        "subreddit": "toystory",
        "sentence": "Mainly online I do"
    },
    {
        "subreddit": "toystory",
        "sentence": "...Do you read much?  Genuine question\n\nIf not, then I can kind of see why this particular work might be a little much, but I personally enjoy reading and really love psychological pieces, so this one hit all the right notes for me.\n\nIt was just a rec!  I like sharing fic that resonates with me, that's all"
    },
    {
        "subreddit": "toystory",
        "sentence": ":)"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s just saying a lot of jibberish nonsense"
    },
    {
        "subreddit": "toystory",
        "sentence": "Like I can’t understand any of the words"
    },
    {
        "subreddit": "toystory",
        "sentence": "Wym?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah he does have a buzz cut like Sid"
    },
    {
        "subreddit": "toystory",
        "sentence": "Nothing in this article here makes any sense whatsoever"
    },
    {
        "subreddit": "toystory",
        "sentence": "True!  I've seen a few fanfic authors examine the possibility regardless, and the absolute best take on it, in my opinion, is [this story hosted on ao3](https://archiveofourown.org/works/531648)"
    },
    {
        "subreddit": "toystory",
        "sentence": "The author clearly read Carrie at some point and the narrative devices that they're using here are sooooo so good."
    },
    {
        "subreddit": "toystory",
        "sentence": "Now I'm not saying he DOES look like Sid\n\nI'm JUST SAYING I wouldn't trust this dude around my Buzz Lightyear"
    },
    {
        "subreddit": "toystory",
        "sentence": "It would honestly be hilarious for him to see them at some point"
    },
    {
        "subreddit": "toystory",
        "sentence": "Really drive home the fact that his petty nonsense really was all for nothing, you know what I mean?"
    },
    {
        "subreddit": "toystory",
        "sentence": "There’s a chance he saw them alive when the garbage truck he was tied to drove past them."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah but probably not"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t think Lotso will ever learn his lesson being tied to a garbage truck and being teased and laughed at by the other toys."
    },
    {
        "subreddit": "toystory",
        "sentence": "That was an autocorrect fail - I meant to type ‘vindictiveness’\n\nAs you say it was a base response to losing everything"
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you expect the army man do"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh so he was angry at Woody for ruining everything so much that he didn’t care if the cowboy saved his life"
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you mean by vindication?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I recognize the whole toy story 3 movie because I watched it A LOT.."
    },
    {
        "subreddit": "toystory",
        "sentence": "I just realized, as far as lotso knows, woody and the gang are dead"
    },
    {
        "subreddit": "toystory",
        "sentence": "He doesn't know they escaped"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's rage bait they don't want everyones kid watching the movie even if it's 25 years old rated G means all age can watch"
    },
    {
        "subreddit": "toystory",
        "sentence": "He sure did!  I feel like his fate was perfect for him"
    },
    {
        "subreddit": "toystory",
        "sentence": "Who knows, maybe it'll humble him a little and we'll see a changed Lotso in the future film (not that I'm holding my breath, LMAO)."
    },
    {
        "subreddit": "toystory",
        "sentence": "He lost his position of power and the life-of-luxury that he had because Woody made his lieutenants lose trust in him\n\nNot saving them was pure vindication"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah he’s pure evil"
    },
    {
        "subreddit": "toystory",
        "sentence": "He got what he deserved as an eternal punishment."
    },
    {
        "subreddit": "toystory",
        "sentence": "Why did Lotso leave them to die after they saved his life at great risk to their own?  Is he stupid? /j\n\nLotso is a great example of the abuser mindset- they entrench, dig their heels in, and refuse to take action to better themselves even when the opportunity to do the right thing is handed to them on a silver platter"
    },
    {
        "subreddit": "toystory",
        "sentence": "In his mind, his actions are justified due to his trauma; he believes, wholly, that he has the right to treat all others as disposable, and will not change no matter how much kindness he is shown."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh my"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah right, lol."
    },
    {
        "subreddit": "toystory",
        "sentence": "Same here!"
    },
    {
        "subreddit": "toystory",
        "sentence": "The writers didn’t know how else to get all the toys in the dumpster."
    },
    {
        "subreddit": "toystory",
        "sentence": "Don't even have to go across the pond"
    },
    {
        "subreddit": "toystory",
        "sentence": "4 out of 5 of the original Planet of the Apes films are rated G despite their (at times quite bloody) violence and, in the first one's case, Charlton Heston's butt, pubic hair, and right testicle."
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s my favorite Pixar movie of all time 💗"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’m pretty sure this is fake"
    },
    {
        "subreddit": "toystory",
        "sentence": "None of this is in Toy Story 2"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s more than safe to show your five-year-old."
    },
    {
        "subreddit": "toystory",
        "sentence": "This is a joke, right? Like, are you actually asking if a kids' movie is appropriate for children?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Prospector one of my Favorite Movie Villains Ever."
    },
    {
        "subreddit": "toystory",
        "sentence": "I used to have the Buzz in that rocket car thingy"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t anymore but I still have the Woody and RC."
    },
    {
        "subreddit": "toystory",
        "sentence": "Obviously fucking not💀 its safe to watch"
    },
    {
        "subreddit": "toystory",
        "sentence": "There's a reason the 2nd one is the best."
    },
    {
        "subreddit": "toystory",
        "sentence": "toys do have a code when produced, it’s like an oath they take"
    },
    {
        "subreddit": "toystory",
        "sentence": "If they showed people they were alive, they would be poked and prodded and experimented on constantly"
    },
    {
        "subreddit": "toystory",
        "sentence": "They feel as their job that they are their kids best friend and have to protect them, and they can’t do that if they are taken away to be tested on"
    },
    {
        "subreddit": "toystory",
        "sentence": "They would also scare the humans and potentially the humans would get rid of them and toys wouldn’t be allowed in homes because of the fear"
    },
    {
        "subreddit": "toystory",
        "sentence": "They are aware that they are toys and should be inanimate to humans, but have a duty to perform like a secret mission"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’ve thought about it so many times as well"
    },
    {
        "subreddit": "toystory",
        "sentence": "Actually, that’s just a joke review that someone gave the movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "The article just highlighted it"
    },
    {
        "subreddit": "toystory",
        "sentence": "They were just being sarcastic, it doesn’t really have anything inappropriate for 5 year olds"
    },
    {
        "subreddit": "toystory",
        "sentence": "Not that I remember, anyway"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"You seen the R-rated version"
    },
    {
        "subreddit": "toystory",
        "sentence": "Mr"
    },
    {
        "subreddit": "toystory",
        "sentence": "Potato head goes on a tyraid"
    },
    {
        "subreddit": "toystory",
        "sentence": "I never heard so many f and c words since \"Casino\""
    },
    {
        "subreddit": "toystory",
        "sentence": "Have you not watched it either?"
    },
    {
        "subreddit": "toystory",
        "sentence": "That's what you get dude"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's Toy Story..."
    },
    {
        "subreddit": "toystory",
        "sentence": "Troll posts are my favorite"
    },
    {
        "subreddit": "toystory",
        "sentence": "Well there was a lot"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hahahahha no all toy story’s are for kids"
    },
    {
        "subreddit": "toystory",
        "sentence": "If you dont know, you've never watched it and you don't deserve to"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is the answer"
    },
    {
        "subreddit": "toystory",
        "sentence": "Lol no"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hey no I watched toy story when I was about 7 yr and I do not remember anything like this you should be all good"
    },
    {
        "subreddit": "toystory",
        "sentence": "Have you ever seen it yourself?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "(Had to split answer due to Reddit character limit LOOOL)\n\n4.) Without his warm personality, I feel like Lotso's bout for leadership at Sunnyside wouldn't be successful- his ability to manipulate and disarm is his most powerful weapon"
    },
    {
        "subreddit": "toystory",
        "sentence": "He would most likely spend his days hiding away from the kids and his nights sullenly ignoring everyone until *someone* manages to break through to him"
    },
    {
        "subreddit": "toystory",
        "sentence": "You might hear other toys talking about how remarkably un-cuddly he is for a teddy bear, with some saying that he's actually not that bad, just hurt and unable to cope"
    },
    {
        "subreddit": "toystory",
        "sentence": "I can see him being extra needy towards the few that he *does* actually trust, were that the case"
    },
    {
        "subreddit": "toystory",
        "sentence": "5.) This one is tricky"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's possible that he might just decide that there is room for two Lots-O-Huggin' Bears and decide to come home and stay with Daisy...but it's also possible that he would instead bid Chuckles and Big Baby good-bye, and wander off to find a new home on his own"
    },
    {
        "subreddit": "toystory",
        "sentence": "Without him being so angry, and thus having his anger at Daisy motivate everything that he does, I get the feeling that anywhere he would choose to settle would be a pretty happy place for himself and any toy that happens to share space with him"
    },
    {
        "subreddit": "toystory",
        "sentence": "6.) Sometimes I literally say \"Why didn't he push the button?  Is he stupid?\" out loud when I remember that he had a chance to redeem himself and threw it away like that"
    },
    {
        "subreddit": "toystory",
        "sentence": "If Lotso had elected to save Woody and his friends instead of being a smug, smarmy, stupid, stubborn, selfish *idiot*, he wouldn't have been picked up by the sanitation workers and wouldn't have spent the rest of his days tied to the front of a garbage truck to face the elements unprotected and catch mouthfuls of bugs"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don't think that he would have been *forgiven* by everyone, because everything that he did was pretty awful in every way, but I'm sure that Woody, having been selfless enough to rescue Lotso from the shredder, would have tried to find some solution...whether that means going back to Sunnyside to face the other toys and apologize and try to make amends, or going to Bonnie's"
    },
    {
        "subreddit": "toystory",
        "sentence": "If Lotso went to Bonnie's, that would, of course, mean reuniting with Chuckles, which could be pretty interesting"
    },
    {
        "subreddit": "toystory",
        "sentence": "I wonder what Chuckles would have to say to him, in fact; he seemed pretty hurt, and I don't think he'd be inclined to be buddy-buddy with Lotso again"
    },
    {
        "subreddit": "toystory",
        "sentence": "I know I wouldn't"
    },
    {
        "subreddit": "toystory",
        "sentence": "5.) Honestly?  I feel like if Lotso's approach to becoming the leader of Sunnyside came from a place of genuine desire for fairness and concern for the well-being of the other toys, it would pan out a lot like we see it as Ken and Barbie run in- cool and groovy"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sorry (but not sorry) for writing a whole novel; these questions really tickled my brain."
    },
    {
        "subreddit": "toystory",
        "sentence": "Kind of surprised that there's been no discussion on this; these are some fascinating what-ifs and Lotso is my personal fave- one of the best villains in the series, if you ask me!  \n\n1.) I can see Daisy being extremely confused and then possibly very, *very* upset at her parents"
    },
    {
        "subreddit": "toystory",
        "sentence": "I get a feeling that Daisy was told that Lotso had 'found his way home' and not, in fact, that the one she'd been holding and spending time with was a replacement"
    },
    {
        "subreddit": "toystory",
        "sentence": "Having realized that she was lied to and given a new bear might seem like a small thing to an adult, but for a child, it would be pretty devastating; she may confront them over it or possibly even scold the new bear for simply not being the original and having 'deceived' her, despite it not being the bear's fault in any way.\n\nOn Lotso's end, he would feel conflicted, no doubt- Daisy didn't replace him out of malice, but there's still this *new* bear who's now in her life"
    },
    {
        "subreddit": "toystory",
        "sentence": "Worse, the new bear is probably less 'loved on' than he is, so his fur is in better condition, his eyes are shinier, and his stuffing is still fresh and firm...whereas Lotso himself, having gone through a long journey on foot to get back home, is most likely notably worse for the wear.\n\nI personally would hope that he'd manage to put his jealousy aside and consider that this new bear could be just another friend to make...but I get the feeling that he'd be more than a little reluctant to accept it, and if Daisy actually *did* prefer him over the new Lots-O-Huggin' Bear, he would find some way to 'dispose' of him or convince him to leave"
    },
    {
        "subreddit": "toystory",
        "sentence": "2.) To be fair, he might as well have been alone anyways; he'd long stopped caring about Chuckes or Big Baby, if the way he didn't even check on either of them after the three of them fell off of the truck is any indication"
    },
    {
        "subreddit": "toystory",
        "sentence": "I feel like not much would change- Lotso is *incredibly* tenacious, and if he wanted to seize power at Sunnyside, he would do it regardless of whether he had Big Baby around to be his muscle"
    },
    {
        "subreddit": "toystory",
        "sentence": "His tactics may change until he can find someone suitable to manipulate and use, but the end result would be the same, in my opinion"
    },
    {
        "subreddit": "toystory",
        "sentence": "The biggest difference is that there would have been no leverage in Woody's favor during the confrontation at the dumpster, and no change of heart from his underlings"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's possible that without Big Baby there to be the catalyst to turn the tide after being reminded of Daisy, Lotso would have actually won against Woody and his friends"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's kind of chilling to think about! \n\n3.)  It's obvious that Lotso loved Daisy so much that losing her (regardless of the fact that she didn't abandon him on purpose or replace him out of cruelty) destroyed him"
    },
    {
        "subreddit": "toystory",
        "sentence": "If there had been no new bear, and Lotso and the others had found her sad without them, I'm pretty sure they would either wait until she'd fallen asleep so that they could find their way inside and be there to surprise her in the morning, or make a disturbance at the window so that she would find them herself and bring them in"
    },
    {
        "subreddit": "toystory",
        "sentence": "It would be the happiest ending for all three of them, and Lotso would most likely take on a role among her toys similar to the role that Woody takes in Andy's."
    },
    {
        "subreddit": "toystory",
        "sentence": "𝙒𝙊𝙊𝘿𝙔 𝙂𝙊𝙏 𝙒𝙊𝙊-"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is a Disney Store Intergalactic Buzz Lightyear"
    },
    {
        "subreddit": "toystory",
        "sentence": "Worth over $200"
    },
    {
        "subreddit": "toystory",
        "sentence": "Very rare"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'll buy it right now 😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "Google is experimenting with using AI to answer questions right now"
    },
    {
        "subreddit": "toystory",
        "sentence": "I'd wager a guess that this search result has to do with that."
    },
    {
        "subreddit": "toystory",
        "sentence": "They do"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don't own one, but I saw the video of the person who actually designed the model used for this."
    },
    {
        "subreddit": "toystory",
        "sentence": "they took \"you've got a friend in me\" too litterally"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thank Google's gross AI!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes I’m emotionally scarred by this"
    },
    {
        "subreddit": "toystory",
        "sentence": "This keeps me up at night"
    },
    {
        "subreddit": "toystory",
        "sentence": "To this very day I sit knowing sick sick people made this film."
    },
    {
        "subreddit": "toystory",
        "sentence": "That's pretty cool!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I hate it when movies have ultreme violence 😞"
    },
    {
        "subreddit": "toystory",
        "sentence": "This has to be satire."
    },
    {
        "subreddit": "toystory",
        "sentence": "right???"
    },
    {
        "subreddit": "toystory",
        "sentence": "Bait used to be believable."
    },
    {
        "subreddit": "toystory",
        "sentence": "I always just thought lotso jumped and pushed it up somehow or used something to at the right moment, and then jumped back up to grab woody"
    },
    {
        "subreddit": "toystory",
        "sentence": "1)Toy Story 3 I don't know why but i just love this one more than the rest probably because of the ending and i really loved the daycare scenes\n2)Toy Story it changed animation forever and one of the best Animated Movies of all time\n3)Toy Story 4 i know the franchise should've ended on 3 but The Ending was the saving point for me\n4)Toy Story 2 i just aint very fond of this one probably because Woody has the least action"
    },
    {
        "subreddit": "toystory",
        "sentence": "And that was a freakin bed."
    },
    {
        "subreddit": "toystory",
        "sentence": "As an expert of Toy Story 2 I can assure everyone Toy Story 2 is neither of those things."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh god is this referencing the Costco version?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Don’t you remember the scene where they’re looking for Woody’s hat?, And Buzz finds it in Andy’s mom’s room and shouts his name to alert him that he found his hat?, Only for another toy in the same room to get confused because they happen to share the same name\n\nOh yeah, Remember during the bloopers reel in the end credits where they meet Andy’s Mom’s version of a toy named Buzz?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I guess it makes sense"
    },
    {
        "subreddit": "toystory",
        "sentence": "I think the door might've been jammed or Lotso grabbed onto him to lure the others in."
    },
    {
        "subreddit": "toystory",
        "sentence": "Doesnt take a genius to know that if its rated G anyone can watch"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's common fucking sense."
    },
    {
        "subreddit": "toystory",
        "sentence": "\"Ultreme\" isn't even a word."
    },
    {
        "subreddit": "toystory",
        "sentence": "Lol, they made up a word"
    },
    {
        "subreddit": "toystory",
        "sentence": "Scroll down further and check the other sources"
    },
    {
        "subreddit": "toystory",
        "sentence": "Really random, but I picked this up the other day from a Goodwill"
    },
    {
        "subreddit": "toystory",
        "sentence": "Was also googling to figure out how to change the batteries under the jetpack"
    },
    {
        "subreddit": "toystory",
        "sentence": "Was messing around with it, and the back pops off"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's connected to the figure on 2 pegs that are within the green screws"
    },
    {
        "subreddit": "toystory",
        "sentence": "I tried unscrewing those, but turns out they're only decorative."
    },
    {
        "subreddit": "toystory",
        "sentence": "That dude's saying that you got a perceivably rad toy."
    },
    {
        "subreddit": "toystory",
        "sentence": "wrong"
    },
    {
        "subreddit": "toystory",
        "sentence": "Do more research before going off acting like you know something."
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme…"
    },
    {
        "subreddit": "toystory",
        "sentence": "Cool."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh"
    },
    {
        "subreddit": "toystory",
        "sentence": "My"
    },
    {
        "subreddit": "toystory",
        "sentence": "God"
    },
    {
        "subreddit": "toystory",
        "sentence": "THIS IS BEAUTIFUL."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah that scene where Buzz calls Rex racial slurs multiple times for losing the Buzz light year video game was really ultremely offensive compared to the previous movie.\n\nAnd I’m just gonna say it because no one else in this Reddit thread well, the Toy Story universe has a fucking fentanyl crisis"
    },
    {
        "subreddit": "toystory",
        "sentence": "The amount of times they did Fentanyl on screen was way too much for my taste"
    },
    {
        "subreddit": "toystory",
        "sentence": "/S for those too stupid to get it."
    },
    {
        "subreddit": "toystory",
        "sentence": "First Hint: Ultreme isn't a word"
    },
    {
        "subreddit": "toystory",
        "sentence": "Me to"
    },
    {
        "subreddit": "toystory",
        "sentence": "Me: looks at watership down U rating in uk"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ye that part where woody called buzz \"a bunch of Chinese plastic toy\" was very offensive like is true but he didn't need to say it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy story 2 is when we learn why the toys are \"alive\""
    },
    {
        "subreddit": "toystory",
        "sentence": "nope"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe they were blind"
    },
    {
        "subreddit": "toystory",
        "sentence": "Um she is a toy and she is animated \nGet some help"
    },
    {
        "subreddit": "toystory",
        "sentence": "Because Buzz was a threat"
    },
    {
        "subreddit": "toystory",
        "sentence": "He was basically replacing Woody"
    },
    {
        "subreddit": "toystory",
        "sentence": "Notice how the others didn’t mind?  Had Buzz been insignificant in Andy’s life Woody wouldn’t have blinked twice."
    },
    {
        "subreddit": "toystory",
        "sentence": "no."
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme?? Clearly fake, not even a word"
    },
    {
        "subreddit": "toystory",
        "sentence": "YES 💔 be careful."
    },
    {
        "subreddit": "toystory",
        "sentence": "Must be the director’s cut"
    },
    {
        "subreddit": "toystory",
        "sentence": "G string"
    },
    {
        "subreddit": "toystory",
        "sentence": "search up \"ultreme\" and if that's a real word"
    },
    {
        "subreddit": "toystory",
        "sentence": "Well there was that one scene with woody and Jessie……"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember the days of messing with Wikipedia articles, some of those guys made some really funny edits lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "The fact it has “ultreme” anything would be my first clue not to pay attention to this review."
    },
    {
        "subreddit": "toystory",
        "sentence": "The Fuq"
    },
    {
        "subreddit": "toystory",
        "sentence": "...what the heck is *ultreme*"
    },
    {
        "subreddit": "toystory",
        "sentence": "Bro What The Hell Boy?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I Just Use To Love Toy Story Through Toy Story 4 All The Time"
    },
    {
        "subreddit": "toystory",
        "sentence": "With buzz lightyear toys that have a wrist communicator, to my knowledge, all of the Disney store buzz figures and the signature collection ones have the communicator sticker after he peels it off in the first movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hopefully, that same logic will apply here.\n\nI just want Woody to have his badge back and a new voice box."
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme violence is some next level violence I've ever seen before anywhere else"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody, you're not a god damn collector's item, you're a child's plaything"
    },
    {
        "subreddit": "toystory",
        "sentence": "You are a *fucking* toy! \n\n*Buzz proceeds to do lots of drugs and uses ultreme violence to take Woody back home*"
    },
    {
        "subreddit": "toystory",
        "sentence": "Are you being serious? I can’t tell"
    },
    {
        "subreddit": "toystory",
        "sentence": "I get that this is a funny mishap on Google, but you don’t actually think Toy Story 2 has graphic violence, sex and drugs, do you?"
    },
    {
        "subreddit": "toystory",
        "sentence": "TOY STORY IS THE BEST ADULT FILM😂😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "Seemed like bs but I googled it and that’s what it said"
    },
    {
        "subreddit": "toystory",
        "sentence": "If it’s on the internet it must be true."
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "Buzz does a line of coke in a ten minute scene"
    },
    {
        "subreddit": "toystory",
        "sentence": "The movie is really light hearted"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s fake"
    },
    {
        "subreddit": "toystory",
        "sentence": "At least Barbie got to be in Toy Story 3"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yrs"
    },
    {
        "subreddit": "toystory",
        "sentence": "and that's exactly why they have those."
    },
    {
        "subreddit": "toystory",
        "sentence": "Noooo 😂😂 it’s just someone’s shitpost fake review"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is some internet troll massing with parents"
    },
    {
        "subreddit": "toystory",
        "sentence": "Once two guys at my school were messing around and found out how to edit a Wikipedia page hit idk what they put"
    },
    {
        "subreddit": "toystory",
        "sentence": "Why would you even look up why a movie is rated R? Though this doesn't apply to this scenario, a parent could be trying to keep a certain topic away from their children."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh yeah I forgot how fcked up Toy Story can be sometimes"
    },
    {
        "subreddit": "toystory",
        "sentence": "G is literally the lowest possible rating.."
    },
    {
        "subreddit": "toystory",
        "sentence": "why would you need to screen that?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme is not a word.\n\n\nWhat do you think?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Didn’t Stinky Pete brought girls into his box 🤣"
    },
    {
        "subreddit": "toystory",
        "sentence": "No it’s a ‘think of me… I mean the children’ uncomfortable with the casting couch gag reel"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ironically, if you're referring to that particular in-universe blooper, that got removed 5 years ago (same year that the 4th film was released)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Not sure how, exactly, but I assume is through *Toy Story 2*'s re-releases."
    },
    {
        "subreddit": "toystory",
        "sentence": "exactly haha\n\n\\\\"
    },
    {
        "subreddit": "toystory",
        "sentence": "HOW do you not know the MPAA ratings?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I pretended to make my buzz fly once by throwing it on my bed"
    },
    {
        "subreddit": "toystory",
        "sentence": "The arm broke and could never fix it properly"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember them being there last time I went"
    },
    {
        "subreddit": "toystory",
        "sentence": "My sister even got me one"
    },
    {
        "subreddit": "toystory",
        "sentence": "And I compared it to one of the much older ones, and they were slightly different"
    },
    {
        "subreddit": "toystory",
        "sentence": "But as far as I know they're still made"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes, it’s definitely real"
    },
    {
        "subreddit": "toystory",
        "sentence": "Clearly the person who typed that was high or something when watching the movie."
    },
    {
        "subreddit": "toystory",
        "sentence": "Dood"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme sounds like a fancy, delicious Mousse 🫣"
    },
    {
        "subreddit": "toystory",
        "sentence": "U talkin bout ME??"
    },
    {
        "subreddit": "toystory",
        "sentence": "G is the lowest rating brotha"
    },
    {
        "subreddit": "toystory",
        "sentence": "What else do you want?"
    },
    {
        "subreddit": "toystory",
        "sentence": "What the f is ultreme violence? Ultimate and extreme meshed into one word?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Isn't that the same website that said that Hilda encourages witchcraft in children?"
    },
    {
        "subreddit": "toystory",
        "sentence": "According to this review might mean gay or gorey lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "Only time you should question if a 2 year can watch something is if its pg or higher"
    },
    {
        "subreddit": "toystory",
        "sentence": "Especially newer movies where pg can be closer to pg13"
    },
    {
        "subreddit": "toystory",
        "sentence": "G-general audiences"
    },
    {
        "subreddit": "toystory",
        "sentence": "Think g as ec(early childhood) or e(everyone) both of which mean anyone can watch regardless of age"
    },
    {
        "subreddit": "toystory",
        "sentence": "Not sure who wrote that but its entirely false or they were thinking of a diff movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "I like how the person who edited the photo couldn't spell extreme"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme"
    },
    {
        "subreddit": "toystory",
        "sentence": "I grew up with it but I didn't watch 2 as much as 1 and 3 so I can tell you anything about 1 and 3"
    },
    {
        "subreddit": "toystory",
        "sentence": "If you find one can you let me know I've been looking for one too 😭"
    },
    {
        "subreddit": "toystory",
        "sentence": "Surely this is a joke post??"
    },
    {
        "subreddit": "toystory",
        "sentence": "I can't tell if you're being ironic or not"
    },
    {
        "subreddit": "toystory",
        "sentence": "“Ultreme” is something I’m definitely adding to my vocabulary"
    },
    {
        "subreddit": "toystory",
        "sentence": "They really pulled out the made up words for this"
    },
    {
        "subreddit": "toystory",
        "sentence": "no, its inappropriate"
    },
    {
        "subreddit": "toystory",
        "sentence": "yes, Toy Story is EXTREMELY inappropriate for a 5 year old, it has multiple sexual jokes and scenes, lots of foul languages, can be offensive towards racial minorities, theres a scene where multiple characters do drugs and have sex, alot of drunkness, and more"
    },
    {
        "subreddit": "toystory",
        "sentence": "dont show kids!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeaaa, like, why would someone even look up why some is G rated in the first place? Im so confused lmao this post is breaking my brain"
    },
    {
        "subreddit": "toystory",
        "sentence": "What comes up on google must be the work of a troll lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "What the? This is definitely fake 🫣"
    },
    {
        "subreddit": "toystory",
        "sentence": "How do you even function in reality"
    },
    {
        "subreddit": "toystory",
        "sentence": "🤦🏻‍♂️"
    },
    {
        "subreddit": "toystory",
        "sentence": "Such gruesome violence they had to make a whole new word to describe it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I think they are joking"
    },
    {
        "subreddit": "toystory",
        "sentence": "I saw but to make it get to Italy from me it costs me 50€ shipping from America"
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you think?…🤦🏻‍♂️"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy story is for kids it has none of this in the film I think Google just messed up cause toy story 2 is one of my fav movies I've watched it probably 100 times believe me there is none of this in the movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Have you seen the movie? This is an understatement."
    },
    {
        "subreddit": "toystory",
        "sentence": "Please tell me you don’t actually believe this?? Lmaooo"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's the IMBd parents guide"
    },
    {
        "subreddit": "toystory",
        "sentence": "Take a look at other Disney/ Pixar films and check them on that website"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's pretty funny considering the movies we grew up on."
    },
    {
        "subreddit": "toystory",
        "sentence": "No"
    },
    {
        "subreddit": "toystory",
        "sentence": "You just go on Disney+, type in Toy Story 2, and watch it"
    },
    {
        "subreddit": "toystory",
        "sentence": "You'll see"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's very child friendly."
    },
    {
        "subreddit": "toystory",
        "sentence": "eBay"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "I’m gonna assume you’re trolling lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "weird they would throw shade at the best Toy Story movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "my 4 year old has seen every toy story"
    },
    {
        "subreddit": "toystory",
        "sentence": "yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "its appropriate"
    },
    {
        "subreddit": "toystory",
        "sentence": "They must've seen the defective R rated version"
    },
    {
        "subreddit": "toystory",
        "sentence": "I love how Troll, a character who is around 10 seconds in the movie, made it to the poster"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "/s\n\n\nAlso, this is a troll post right?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Trying to discern if this is a meme or a real question"
    },
    {
        "subreddit": "toystory",
        "sentence": "They dont call him woody for nothing\n\nJust ask slinky"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"Ultreme\""
    },
    {
        "subreddit": "toystory",
        "sentence": "r/softwaregore"
    },
    {
        "subreddit": "toystory",
        "sentence": "That is a lie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Probably something a random person wrote"
    },
    {
        "subreddit": "toystory",
        "sentence": "5 months ago you posted that you were 14"
    },
    {
        "subreddit": "toystory",
        "sentence": "How did you have a child at the age of nine?"
    },
    {
        "subreddit": "toystory",
        "sentence": "They need to learn how to spell before their next prank."
    },
    {
        "subreddit": "toystory",
        "sentence": "Are you fucking serious? My parents showed me Toy Story when I was 4!\n\nThe most violent thing is probably woodys arm falling off but he’s a toy so it’s not even harmful"
    },
    {
        "subreddit": "toystory",
        "sentence": "Looks like there's a troll on Common Sense Media."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes it has all of those things"
    },
    {
        "subreddit": "toystory",
        "sentence": "The rape scene is actually very hard to watch"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember that scene where woody and the bunch of toys forced the broken toys in the corner and threatened to murder them"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's somebody trolling on a parent's guide movie site"
    },
    {
        "subreddit": "toystory",
        "sentence": "Don't know how it got to the top of the searches"
    },
    {
        "subreddit": "toystory",
        "sentence": "Google should be better at sifting this stuff out."
    },
    {
        "subreddit": "toystory",
        "sentence": "No\n\nNone of that stuff is in the movie, so you have nothing to worry about"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's appropriate for your 5 year old to watch."
    },
    {
        "subreddit": "toystory",
        "sentence": "then buzz put out the order to have bullseye dismembered starting at the hooves..."
    },
    {
        "subreddit": "toystory",
        "sentence": "man that scene always made me cry as a kid"
    },
    {
        "subreddit": "toystory",
        "sentence": "I think Woody should never have stayed with Bo"
    },
    {
        "subreddit": "toystory",
        "sentence": "It completely undermines the theme they spent 3 (great) movies building"
    },
    {
        "subreddit": "toystory",
        "sentence": "Following the theme of the first 3 movies, Woody is making a terrible mistake by leaving."
    },
    {
        "subreddit": "toystory",
        "sentence": "I just looked at the review itself, I think it’s a troll."
    },
    {
        "subreddit": "toystory",
        "sentence": "U L T R E M E"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme isn't even a word."
    },
    {
        "subreddit": "toystory",
        "sentence": "It's real"
    },
    {
        "subreddit": "toystory",
        "sentence": "what about buzz and the gang😭😭😭? they were so important for him😭 how can he leave them like that😭😭I can't"
    },
    {
        "subreddit": "toystory",
        "sentence": "Do a little more research than what Google randomly pulls from some searching algorithms, brother"
    },
    {
        "subreddit": "toystory",
        "sentence": "Check IMDb"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah Toy Story is actually banned in 37 countries for being the most vulgar movie in history"
    },
    {
        "subreddit": "toystory",
        "sentence": "🎶you’ve got a friend in me🎶"
    },
    {
        "subreddit": "toystory",
        "sentence": "Uhhhh whoops"
    },
    {
        "subreddit": "toystory",
        "sentence": "I may be wrong, but anybody can leave reviews on it"
    },
    {
        "subreddit": "toystory",
        "sentence": "All Google does is pluck some text from a website and this time it got fooled"
    },
    {
        "subreddit": "toystory",
        "sentence": "If nothing else, you can always watch the movie first yourself and decide"
    },
    {
        "subreddit": "toystory",
        "sentence": "Every kids movie is rated PG nowadays to the point it's hardly fair"
    },
    {
        "subreddit": "toystory",
        "sentence": "Even the Wizard of Oz got PG on a rerelease one time"
    },
    {
        "subreddit": "toystory",
        "sentence": "Maybe it's some RC controlled toy?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ummmmm no\n\nNot even in the slightest\n\nHow on earth did this even happen?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Where Jessie gets Buzzed by a Woody"
    },
    {
        "subreddit": "toystory",
        "sentence": "Idk why you’re saying this"
    },
    {
        "subreddit": "toystory",
        "sentence": "Of course it’s safe for 5 year olds it’s a Pixar movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Even if you do look it up it just sense there’s tense scenes"
    },
    {
        "subreddit": "toystory",
        "sentence": "~~Toy Sto~~r(ule)~~y~~ 3(4)"
    },
    {
        "subreddit": "toystory",
        "sentence": "I searched this and this is not what came"
    },
    {
        "subreddit": "toystory",
        "sentence": "So you’ve manage to pop a sprog into this world but have to ask advice on whether a KIDS movie is suitable for kids"
    },
    {
        "subreddit": "toystory",
        "sentence": "I feel like I’m in crazy town."
    },
    {
        "subreddit": "toystory",
        "sentence": "wasn't there a recall of one of the early DVDs cause it had a scene from an R rated movie somehow spliced into the film?"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember the part where Stinky Pete and Bullseye had to cook."
    },
    {
        "subreddit": "toystory",
        "sentence": "Blame common sense media"
    },
    {
        "subreddit": "toystory",
        "sentence": "Not anymore!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Everyone knows that, you’ve got Ultreme-ior Motives, tell me the truth, every move shows that you’ve for, Ultreme-ior motives!"
    },
    {
        "subreddit": "toystory",
        "sentence": "this can’t be a serious question"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember the Blooper with Stinky Pete and the Barbies."
    },
    {
        "subreddit": "toystory",
        "sentence": "You are kidding ? Right ?"
    },
    {
        "subreddit": "toystory",
        "sentence": "It was common sense media"
    },
    {
        "subreddit": "toystory",
        "sentence": "Don't be stupid, it's Toy Story."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "I can recite the entire script of the first the movies from memory"
    },
    {
        "subreddit": "toystory",
        "sentence": "Perhaps Toy Story of terror as well? I have read multiple unused scripts and know deep lore from Woody’s full name and home town to where Jessie was born (within Woodys Roundup lore) \n\nI know the basic lore better than the writers of 4 & Lightyear\n\nBlah blah blah\n\nIn other words I have an obsession"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thankfully my addiction to Toy Story has finally died down a little recently and I can FINALLY start liking other things more than it lol\n\nHow bout you?"
    },
    {
        "subreddit": "toystory",
        "sentence": "definitely a troll post, if you look at OPs history it says they’re 14 lmao"
    },
    {
        "subreddit": "toystory",
        "sentence": "on wikipedia they have robots that detect if something false is on a page in 2-3 minutes."
    },
    {
        "subreddit": "toystory",
        "sentence": "Wait, you’ve never seen Toy Story before?"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"Ultreme\""
    },
    {
        "subreddit": "toystory",
        "sentence": "Are you really asking this question? Seriously? 🤣🤣🤣🤣"
    },
    {
        "subreddit": "toystory",
        "sentence": "is this a joke? a G rated pixar movie dude"
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you think G rating means?"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"ultreme\" 💀"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 2 was possibly the most tame movie in the series while also probably the best one of the bunch."
    },
    {
        "subreddit": "toystory",
        "sentence": "oh yeah Pixar went in a totally unexpected direction from the first film"
    },
    {
        "subreddit": "toystory",
        "sentence": "in 2 buzz is a Mafia boss and woody has a meth addiction"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes it has ULTREME VIOLENCE"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yep this is the Toy Story 2 i know and love! It's such a great R film."
    },
    {
        "subreddit": "toystory",
        "sentence": "NOT ULTREME VIOLENCE!!!"
    },
    {
        "subreddit": "toystory",
        "sentence": "He was a \"14 year old minor\" having trouble opening a bank account a few months ago"
    },
    {
        "subreddit": "toystory",
        "sentence": "Fair play to becoming a dad at 9 years old"
    },
    {
        "subreddit": "toystory",
        "sentence": "Seems almost unbelievable."
    },
    {
        "subreddit": "toystory",
        "sentence": "Surely you jest?"
    },
    {
        "subreddit": "toystory",
        "sentence": "And this wasn‘t even the hardest part of the movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "My 3 year old watches Toy Story 2 all the time, but personally if you haven’t seen it I’d watch yourself then 1st then decide if you want your kid to watch it if you have concerns"
    },
    {
        "subreddit": "toystory",
        "sentence": "But it rated PG and made for kids."
    },
    {
        "subreddit": "toystory",
        "sentence": "Wait didn't you watch Toy Story 2 Already?\nYou would know this is not true"
    },
    {
        "subreddit": "toystory",
        "sentence": "And this is how I find out there is a Toy Story Subreddit"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "The most graphic movie I have ever seen."
    },
    {
        "subreddit": "toystory",
        "sentence": "No, it isn’t true it is supposed to be rated PG"
    },
    {
        "subreddit": "toystory",
        "sentence": "There are a few scenes that mention things like that but never actually do any of it just hint at it it isn’t anything a child would understand so you’re perfectly fine"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s true… all of it"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hate it when I mix a child’s movie with my super erotic sex movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Happens all the time…"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "I think they are just describing the United States so you’re good"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is definitely a troll post"
    },
    {
        "subreddit": "toystory",
        "sentence": "Did that bullshit “One Million Moms” write that? They always make up extremes about kids shows and movies"
    },
    {
        "subreddit": "toystory",
        "sentence": "ultra + extreme = ultreme"
    },
    {
        "subreddit": "toystory",
        "sentence": "such egregious levels of violence, drugs, and lovecraftian horror cannot be elucidated with merely one word or the other, so they had to be fused."
    },
    {
        "subreddit": "toystory",
        "sentence": "My guess is some jerk who figured out the algorithm and had nothing better to do with their time wrote a bogus review for Toy Story 2 and that pops up for the first thing on Google."
    },
    {
        "subreddit": "toystory",
        "sentence": "ultreme is insane"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t think ultreme is a real word."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ah yes, the contracted expression of something being both ultra, and extreme"
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme"
    },
    {
        "subreddit": "toystory",
        "sentence": "A word among words."
    },
    {
        "subreddit": "toystory",
        "sentence": "I love the scene when woody makes out with buzz"
    },
    {
        "subreddit": "toystory",
        "sentence": "“Ultreme Violence” sounds like the name of a boomer shooter on Steam"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also starring Woody and Buzz"
    },
    {
        "subreddit": "toystory",
        "sentence": "Of course not!"
    },
    {
        "subreddit": "toystory",
        "sentence": "G is for Gangster."
    },
    {
        "subreddit": "toystory",
        "sentence": "Yeah man, don't you remember the scene where Bullseye gets dismembered?  I thought twenty minutes was maybe a little too much, but they *really* didn't shy away from the harsh, brutal consequences of gang violence"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember assuming it was over when Buzz had finally finished sawing his hooves off, but then he went for the knees too and I was like \"Ah shit, this is gonna be rough.\"  My roommate had to get up and leave halfway through that scene because she couldn't take the screams anymore.\n\nI also wasn't expecting Stinky Pete to roofie Rex and do...all of *that*...to him, onscreen no less"
    },
    {
        "subreddit": "toystory",
        "sentence": "No cutting away or anything"
    },
    {
        "subreddit": "toystory",
        "sentence": "Very bold move by the directors that really opened up a conversation about where the line is between unapologetic portrayal of abuse and straight-up suffering porn.\n\nThe Buzz Lightyear concentration camp was a step too far imo, so this only got two out of five stars from me"
    },
    {
        "subreddit": "toystory",
        "sentence": "Definitely let your kid watch it nonetheless; he'll have a more well-rounded, cultured view of the capabilities of cinematography to 'wow' his classmates with as a result."
    },
    {
        "subreddit": "toystory",
        "sentence": "it's fine for a 5 year old"
    },
    {
        "subreddit": "toystory",
        "sentence": "Search result was obviously poisoned and inaccurate."
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh god."
    },
    {
        "subreddit": "toystory",
        "sentence": "This ain’t real, your 5 year old can watch Toy Story 3, it’s a very good film"
    },
    {
        "subreddit": "toystory",
        "sentence": "“Ultereme” ☠️ oh yeah it’s 100% true"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 2 was my favorite movie when I was five"
    },
    {
        "subreddit": "toystory",
        "sentence": "It still kinda is lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "I remember being surprised Toy Story 3 was rated G and not PG after seeing it"
    },
    {
        "subreddit": "toystory",
        "sentence": "There were children at my screening who didn’t understand that the toys were holding hands cause they were gonna die"
    },
    {
        "subreddit": "toystory",
        "sentence": "And those who did… oh boy the screaming and crying"
    },
    {
        "subreddit": "toystory",
        "sentence": "I just rewatched the movie and now I understand that scene"
    },
    {
        "subreddit": "toystory",
        "sentence": "Nah its real, u dont remember THAT scene?"
    },
    {
        "subreddit": "toystory",
        "sentence": "This feels like a troll post, but if not, use IMDB parents guide instead"
    },
    {
        "subreddit": "toystory",
        "sentence": "It is actually pretty useful"
    },
    {
        "subreddit": "toystory",
        "sentence": "I've been noticing weird stuff like this happening on Google more recently because of AI generating Google responses"
    },
    {
        "subreddit": "toystory",
        "sentence": "It's ridiculous!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Everyone should take a look at this kids post history lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don't understand their motives for posting this, but genuine confusion was not one of them."
    },
    {
        "subreddit": "toystory",
        "sentence": "Why would you even look up why a movie is rated “G”? 🤣"
    },
    {
        "subreddit": "toystory",
        "sentence": "Nope"
    },
    {
        "subreddit": "toystory",
        "sentence": "There was that incident where a copy of Toy Story 2 would switch to a movie with John Cusack and Jack Black."
    },
    {
        "subreddit": "toystory",
        "sentence": "Rated G means literally for any age with or without guidance"
    },
    {
        "subreddit": "toystory",
        "sentence": "PG means a parent should potentially be watching if not of age but that’s probably pulling from the first article which isn’t always the factual one"
    },
    {
        "subreddit": "toystory",
        "sentence": "Could be Wikipedia which is never you should take info."
    },
    {
        "subreddit": "toystory",
        "sentence": "This statement was pulled from a review website"
    },
    {
        "subreddit": "toystory",
        "sentence": "In fact, it’s a review that’s literally spreading misinformation"
    },
    {
        "subreddit": "toystory",
        "sentence": "**Don’t follow that statement.**"
    },
    {
        "subreddit": "toystory",
        "sentence": "No it’s not true, the movie is made for kids around 5"
    },
    {
        "subreddit": "toystory",
        "sentence": "search up why is toy story rated G, and this is what I see"
    },
    {
        "subreddit": "toystory",
        "sentence": "is it appropriate for a 5 year old ?"
    },
    {
        "subreddit": "toystory",
        "sentence": "U."
    },
    {
        "subreddit": "toystory",
        "sentence": "Ultreme?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes, that was my intention"
    },
    {
        "subreddit": "toystory",
        "sentence": "That is ultremely offensive"
    },
    {
        "subreddit": "toystory",
        "sentence": "Well, since ultreme is a word that doesn't exist, maybe that implies that the violence, sex, etc"
    },
    {
        "subreddit": "toystory",
        "sentence": "doesn't exist in the movie?"
    },
    {
        "subreddit": "toystory",
        "sentence": "What?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Whoever wrote this mixed it up with Toy Story the erotic adult film."
    },
    {
        "subreddit": "toystory",
        "sentence": "Jessie kinda bad tho"
    },
    {
        "subreddit": "toystory",
        "sentence": "😂😂😂"
    },
    {
        "subreddit": "toystory",
        "sentence": "yeah"
    },
    {
        "subreddit": "toystory",
        "sentence": "Stinky Pete got a little too stinky in whatever this is 💀"
    },
    {
        "subreddit": "toystory",
        "sentence": "What? No"
    },
    {
        "subreddit": "toystory",
        "sentence": "Of course this isn’t real."
    },
    {
        "subreddit": "toystory",
        "sentence": "As an adult, I find it weird that Andy's room was redecorated right before the move."
    },
    {
        "subreddit": "toystory",
        "sentence": "As others have pointed out, Buzz wasn't just acting"
    },
    {
        "subreddit": "toystory",
        "sentence": "He really believed he was a space ranger"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody's attitude towards this is a little more layered than just being upset"
    },
    {
        "subreddit": "toystory",
        "sentence": "He's upset that Buzz was replacing him as Andy's new toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "Didn't help that the others were just as impressed with him"
    },
    {
        "subreddit": "toystory",
        "sentence": "The first time Woody calls Buzz a toy, Buzz says something like \"I believe the word you're searching for is space ranger.\" To Woody, Buzz is coming off as an elitist"
    },
    {
        "subreddit": "toystory",
        "sentence": "As if being called a toy was beneath him"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody is amused at first when he learns that Buzz actually thinks he's a real space ranger"
    },
    {
        "subreddit": "toystory",
        "sentence": "It becomes less amusing when they get lost and stuck at Sid's house"
    },
    {
        "subreddit": "toystory",
        "sentence": "To Woody, he is now stuck with a crazy person"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also, Buzz's delusion is dangerous to both of them"
    },
    {
        "subreddit": "toystory",
        "sentence": "It was because of his delusion that they ended up in that claw machine which brought them to Sid's house"
    },
    {
        "subreddit": "toystory",
        "sentence": "Buzz actually thinks his laser works"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody knows it doesn't and that believing that it does work will only get them killed."
    },
    {
        "subreddit": "toystory",
        "sentence": "I loved playing this one, and yes, a lot of restrictions"
    },
    {
        "subreddit": "toystory",
        "sentence": "Buzz was the cool new Toy and was a major hit to Woody’s ego and place of leadership"
    },
    {
        "subreddit": "toystory",
        "sentence": "Pretty sure there was a montage of Andy’s Western theme room turning into a Space theme"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t think Woody would have cared if Buzz got little attention  from Andy or the others."
    },
    {
        "subreddit": "toystory",
        "sentence": "My friend found a photo vur I canr attach it lol"
    },
    {
        "subreddit": "toystory",
        "sentence": "The magic of imagination causes them to grow whatever plastic on the inside of their mouths or eyelids they need to function as a magic organism, I assume if they are ever taken the plastic reverts back to how it was originally molded"
    },
    {
        "subreddit": "toystory",
        "sentence": "The Battlesaurs did"
    },
    {
        "subreddit": "toystory",
        "sentence": "Buzz didn't act like a Space Ranger.\n\nHe thought he was REALLY a Space Ranger, that was the problem"
    },
    {
        "subreddit": "toystory",
        "sentence": "Buzz thought he was talking to Star Command (even though it's a plastic sticker), thought he could fly and that his wings were made of terranium carbonic alloy"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh and look at how he reacted when Slinky pressed his laser button, or when Woody did it : \"BE CAREFUL WITH THAT !! it's extremely dangerous\".\n\nOr how the utility belt Buzz reacted to when Andy's Buzz pressed his laser in Toy Story 2 : \"Has your mind been melded ?\" \"You could've killed me, Space Ranger or should I say, traitor\".\n\nBoth Buzzes, also fall to the ground, and choke and gasp for air thinking that they can't breathe without their helmets on.\n\nYes, they were really that dumb lol."
    },
    {
        "subreddit": "toystory",
        "sentence": "How can he move his fingers when they’re just static pieces? How can he walk&stand when hes a ragdoll? Some stuff just is what it is, lol."
    },
    {
        "subreddit": "toystory",
        "sentence": "Even better question"
    },
    {
        "subreddit": "toystory",
        "sentence": "Why hasn’t he been smashed to bits yet? Look at all the stuff that happens to him in all the films and then try to do it with a real Buzz toy, lol.\n\nFreakin indestructible plastic.."
    },
    {
        "subreddit": "toystory",
        "sentence": "My favorite a love this is pretty cute, Either way the interaction between 💜Opel Springs💛 “Deer” x 🤎Slinky Dog💛 “Dachshund” like as perfect there are date with real we boyfriend to girlfriend good for I please let it be true!!! I’ve been waiting for 3 years!!! I want this couple right now!!! I hope it’s official!! Please toy story 5 Disney!! Pixar Animation Studios is drawing a fan artwork for concept art new design by concept poster and render blender Between watching in movie trailer do it! Never to ask for anything!! 👏"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes this was the one with a large free roam mode map that had restrictions, in ToyBox Mode or known in game as Woody's Round-Up."
    },
    {
        "subreddit": "toystory",
        "sentence": "First is *the* Zurg"
    },
    {
        "subreddit": "toystory",
        "sentence": "Second always felt weird"
    },
    {
        "subreddit": "toystory",
        "sentence": "Is it a suit? Is he a cyborg? Is he a robot? Sometimes the skirt is solid, sometimes its clothlike"
    },
    {
        "subreddit": "toystory",
        "sentence": "Make up your mind"
    },
    {
        "subreddit": "toystory",
        "sentence": "Third is sorta like a prototype, less sleek version of #1."
    },
    {
        "subreddit": "toystory",
        "sentence": "Also whenever he enters Bonnie’s house, one of the 3 peas ask if he’s a real cowboy, he starts smiling and saying “Well,” but then another pea says “of course not pea brain, he don’t even have a hat” and then woody says “of course I have a hat” then realizes he doesn’t have a hat"
    },
    {
        "subreddit": "toystory",
        "sentence": "Sounds like he was rlly gonna introduce himself as a “real cowboy”"
    },
    {
        "subreddit": "toystory",
        "sentence": "So wheels under his feet, no knee articulation and two right hands?\n\nI’m usually fairly good at identifying Toy Story toys but this has me stumped, lol."
    },
    {
        "subreddit": "toystory",
        "sentence": "I stopped with Pops a long time ago but this one i really want, lol."
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody himself acts like a cowboy, telling Etch to “draw” minutes into the first film"
    },
    {
        "subreddit": "toystory",
        "sentence": "They all play their roles, but know their place."
    },
    {
        "subreddit": "toystory",
        "sentence": "I think it’s because the army men and bullseye are 100% aware that they’re toys"
    },
    {
        "subreddit": "toystory",
        "sentence": "What bothers him about buzz is that he believes he’s a legit space ranger and not a child’s play thing"
    },
    {
        "subreddit": "toystory",
        "sentence": "Because they're not delusional \n\nJessie talks and acts like a cowgirl because she's a cowgirl doll"
    },
    {
        "subreddit": "toystory",
        "sentence": "But she does not go around believing she really is a cowgirl and furthermore refusing to believe she is a toy.\n\nSplash in some jealousy about him replacing Woody as favorite toy and bam, Woody is pretty upset\n\n(sidebar, now I'm imagining if any other toys ever had a similar experience realizing they were a toy fresh out of the box, especially Jessie as she's pictured alone in her flashback, so did she just have to deal with realizing she's not a real girl by herself?)"
    },
    {
        "subreddit": "toystory",
        "sentence": "This"
    },
    {
        "subreddit": "toystory",
        "sentence": "Plus the jealousy issue really compounds it as well."
    },
    {
        "subreddit": "toystory",
        "sentence": "Neither the army men nor Bullseye claim to *not be* a toy"
    },
    {
        "subreddit": "toystory",
        "sentence": "There’s a difference between “personality traits” and delusions about reality."
    },
    {
        "subreddit": "toystory",
        "sentence": "Dear Healer Charm,\nHaha, I've been getting into a bit of Toy Story lately, and wanted to have a go at creating my own toys Inspired by the 80's and early 90's with a bit of modern twist, I aimed to design them to be just what mostly every little girl wants in a toy  I'm pleased how they all turned out and hope y'all like too! An extra piece of my main Toy Story OC and Pastel Pal, Opal Springs will be coming real soon, so stay tuned, dears~!\n\nBefore I created the other three Pastel Pals, Opal Springs was the very first toy design I came up with 😁 It was just gonna be her, but then a few of my buds asked if there were gonna be more like her, and it got me thinking and inspiration struck during work (like it usually does ) 😆 so I made notes of what they were gonna be like, including Opal  ✍🏻 If you haven't seen all the Pastel Pals yet, just click the link here to know more about them~"
    },
    {
        "subreddit": "toystory",
        "sentence": "👉 Now what inspired me to create Opal before creating the other Pastel Pal members? owo Well, ever since I saw Toy Story over the years, from one to four, I've had more than one :3 favorite  Not only do I love Bo Peep, but I love Slinky Dog too! 🥰 He is such a cutie over all, and I thought him and Opal would look real sweet together~ 😍 I've thought up two scenarios of how they could meet 💡I think good Haha, I've been getting into a bit of Toy Story lately, and wanted to have a go at creating my own toys 😁Inspired by the80's and early 90's with a bit of modern twist, I aimed to design them to be just what mostly every little girl wants in a toy 😌 I'm pleased how they all turned out and hope y'all like too! 👍 :3 An extra piece of my main Toy Story OC nd Pastel Pal, Opal Springs will be coming real soon, so stay tuned, dears~ ✌️😉!\n\nAll “Meet The Pastel Pals 💜🦌💚🐇❤️🐹🩵🐿️The Hottest New Collectible Girl Toys For Easter!”\n\nNeon Glow (Team Leader ❤️🐹) An otter, who can glow in different colours with the different shapes on her body, which show different patterns and emotions"
    },
    {
        "subreddit": "toystory",
        "sentence": "She is the faithful and organized leader of the group, who never fails to come up with a bright idea.\n\nOpal Springs (Team Member 💜🦌) A deer/doe, who can reach up to 8 feet with her extendable spring legs, which become slink when extended"
    },
    {
        "subreddit": "toystory",
        "sentence": "She is the kindest of the group, who's often quiet but isn't afraid to support her fellow pals in need.\n\nCrystal Record (Team Member 💚🐇) A hare, who can record any sound or message from up to 4 miles"
    },
    {
        "subreddit": "toystory",
        "sentence": "She's the talkative one of the group, very bubbly and gets excited at times when meeting someone or discovering something new.\n\nPrism Speed (Team Member 🩵🐿️) A squirrel, who can speed dash up to 35 miles per hour with her advanced wheels under her feet"
    },
    {
        "subreddit": "toystory",
        "sentence": "She is the cool one of the group with a quirky sense of humor and with speed as her passion, she's always on a roll.\n\nEach Pastel Pal has realistic styling hair, their own accessories and a secret flower compartment on their backs, to store their accessories or your own special possessions in! 🏅🤫🪮🗝️ They're also poseable and soft to the touch~💕With the power of friendship and teamwork, you can be unstoppable and ready for anything, just like The Pastel Pals!\n\n👥👯‍♀️ Go get 'em, girls~! 👏"
    },
    {
        "subreddit": "toystory",
        "sentence": "Amen brother"
    },
    {
        "subreddit": "toystory",
        "sentence": "Toy Story 3 is my favorite movie of all time while Toy Story 4 is my least favorite, I don’t even consider it cannon to the Toy Story TRILOGY."
    },
    {
        "subreddit": "toystory",
        "sentence": "I did, but I hated the movie from the second I saw it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I cried out of sheer disappointment for 15 minutes straight as an 11-year-old"
    },
    {
        "subreddit": "toystory",
        "sentence": "I watched the series as a 16 year old"
    },
    {
        "subreddit": "toystory",
        "sentence": "I want to save them from the emotional pain the movie caused me and maintain the sanctity of the trilogy."
    },
    {
        "subreddit": "toystory",
        "sentence": "I was born in 1994 I know about the Disney stores"
    },
    {
        "subreddit": "toystory",
        "sentence": "We got it at the Disney store back in the early 2000’s"
    },
    {
        "subreddit": "toystory",
        "sentence": "It’s not from Walmart"
    },
    {
        "subreddit": "toystory",
        "sentence": "No, the knees can bend on the search and rescue Buzz"
    },
    {
        "subreddit": "toystory",
        "sentence": "The knees on mine can’t"
    },
    {
        "subreddit": "toystory",
        "sentence": "That's zzub bright month the Walmart brand \nYou can tell it's Walmart brand cuz it's blue"
    },
    {
        "subreddit": "toystory",
        "sentence": "The ending basically overturns the central theme of the previous three movies; the following quotes will illustrate my point:  \n  \n”it doesn’t matter how much we’re played with, what matters is that we’re here for Andy when he needs us” (Woody in the first Toy Story)  \n  \n”come on Jessie, this is what it’s all about, to make a child happy, and you know it” (Woody in Toy Story 2)  \n  \n”somewhere inside that pad of stuffing is a toy that taught me life is only worth living if you’re being loved by a kid” (Buzz addressing Woody in Toy Story 2)  \n  \nAnd it’s not even necessary to bring a quote from Toy Story 3, as the whole movie revolves around Woody (and the gang after he convinces them) trying to return to Andy despite the fact that he was gonna put them in the attic, and had basically moved on from them"
    },
    {
        "subreddit": "toystory",
        "sentence": "Instead of choosing to live independently or to stay at the daycare; the gang of toys is transferred over to Bonnie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Woody is consistent in the first 3 movies; the life of a toy is all about being loyal to a kid and that’s their fundamental purpose"
    },
    {
        "subreddit": "toystory",
        "sentence": "In Toy Story 4 he basically retains this attitude up until the ending scene, when he decides to leave his kid, (Bonnie at this point) his friends, and instead live as an ownerless toy with his girlfriend"
    },
    {
        "subreddit": "toystory",
        "sentence": "This is a complete betrayal of everything he has stood for, believed in, and sacrificed for in the previous three films"
    },
    {
        "subreddit": "toystory",
        "sentence": "just because woody was not being played with as much by Bonnie, compared to how he used to be with Andy, doesn’t mean he should abandon ship to be with his former girlfriend, who by the way is now an overly independent feminist icon"
    },
    {
        "subreddit": "toystory",
        "sentence": "”it doesn’t matter how much we’re played with, what matters is that we’re here for Andy when he needs us” (Woody in the first Toy Story)  \n  \nwhat should matter is that Woody should stay with Bonnie to be there if she needs him, and to help her if he can"
    },
    {
        "subreddit": "toystory",
        "sentence": "his decision to not do that, stay behind with his girlfriend, and leave all his friends, goes against his beliefs and character"
    },
    {
        "subreddit": "toystory",
        "sentence": "And he has no good reason, other than the fact that he is not being played with as much, and that he loves Bo-peep"
    },
    {
        "subreddit": "toystory",
        "sentence": "well, Bo-peep could choose to go back with Woody to Bonnie, instead of living as some circus doll"
    },
    {
        "subreddit": "toystory",
        "sentence": "TOYS ARE MADE TO BE WITH KIDS  \n  \nto turn their back on that calling is to betray their purpose; to be empty, lifeless"
    },
    {
        "subreddit": "toystory",
        "sentence": "but yet Woody does just that"
    },
    {
        "subreddit": "toystory",
        "sentence": "The ending was quite terrible to be honest.dont tell me it's a good ending for woody at all"
    },
    {
        "subreddit": "toystory",
        "sentence": "Bro watched the 6 hour TS4 trash analysis, I guarantee"
    },
    {
        "subreddit": "toystory",
        "sentence": "*buck, buck, bucks"
    },
    {
        "subreddit": "toystory",
        "sentence": "Is this the semi free roam one"
    },
    {
        "subreddit": "toystory",
        "sentence": "Search and rescue buzz light-year?! [here](https://www.ebay.com/itm/305504291444?itmmeta=01HXRVNPYBADEN2HS6PN420WAC&hash=item4721798a74:g:Cy8AAOSwK21mFqp2&itmprp=enc%3AAQAJAAAA8MRhubo8y6%2BXG5ORZhNEWydGaLD731YkWwpSEsYa4pT8raYCOH2GmIGK%2FBhuZUfOZ%2FmlNYNbzlbw%2FfVkoq6tQPd8%2BRBlKOiIljxL%2FY5--aShz4yo3bYyqg%2FXdAtnt5eZkEmu0b7ZxPV33Ezq6eWmoNgFb8U4sHiyVbx%2FGV4xa7PgtE%2BdFbSbUVec4qyv50ceZIFvo4OTxW%2B1cgXomu9KQi8YpDuqaeurDzvONiH5y%2FRIWbdg0WAIMBAOToFNK5idVIM27ux4NeuvmT8c%2FF3wEQSAug%2FhbBJdRg0iqzdoQ9EInqSHGpeZbxir4ftR7wx02w%3D%3D%7Ctkp%3ABk9SR5zv1pvuYw)"
    },
    {
        "subreddit": "toystory",
        "sentence": "That’s not it"
    },
    {
        "subreddit": "toystory",
        "sentence": "The interstellar one is a very different color from this one and also, two main features of this Buzz is the rollers on the feet and the lack of knee joints"
    },
    {
        "subreddit": "toystory",
        "sentence": "Okay, if that's what you're going for."
    },
    {
        "subreddit": "toystory",
        "sentence": "I snagged one at my local Game Stop the day they hit the shelves."
    },
    {
        "subreddit": "toystory",
        "sentence": "Because it’s my least favorite movie of all time"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t want to promote disloyalty to them and anti familial value to them"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also please share any other codes you guys have found even if they are for different regions or consoles just please specify where it would work and what console"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also if you wish you can try the codes on other consoles and say if they work for you or not."
    },
    {
        "subreddit": "toystory",
        "sentence": "Interstellar buzz."
    },
    {
        "subreddit": "toystory",
        "sentence": "I think he came from the Toy Story Interactive Buzz and Woody Figure Playset."
    },
    {
        "subreddit": "toystory",
        "sentence": "Ok I can't tell you a lot"
    },
    {
        "subreddit": "toystory",
        "sentence": "But can help you out slightly"
    },
    {
        "subreddit": "toystory",
        "sentence": "This looks like a color variation of the American flag buzz lightyear"
    },
    {
        "subreddit": "toystory",
        "sentence": "I had it as a kid and the main thing I remember is the pointer finger could be moved, just like this one it looks like"
    },
    {
        "subreddit": "toystory",
        "sentence": "So that should give you an idea of who made it and when, if you look up that one"
    },
    {
        "subreddit": "toystory",
        "sentence": "Why?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Hello"
    },
    {
        "subreddit": "toystory",
        "sentence": "The new coming soon Toy Story 5 will be released in theaters June 19, 2026.\n\nDisney movie series in will drawing on though from different things fan artwork for concept art is created need complete official had been in the works for a Pixar Animation studio to first film this trailer at least “Pastel Pals” soon design cute new name with she one find a to finish called “Opal” Springs as voice a her beautiful woman through person for who are you?\n\nScenario One - Bonnie is invited to a friend's birthday party (who is also one of her neighbors that I named, 'Phoebe') and her parents bought Opal Springs as a birthday present"
    },
    {
        "subreddit": "toystory",
        "sentence": "Bonnie's toys (including Andy's, of course) spy her from the bedroom window as Bonnie is shown Opal"
    },
    {
        "subreddit": "toystory",
        "sentence": "Amongst all the toys' discussion about the new toy, Slink becomes infatuated by her, instantly falling in love"
    },
    {
        "subreddit": "toystory",
        "sentence": "Opal is placed in Bonnie's room whilst she gets ready for the party, and Slink moves in cautiously to get a closer look at Opal...only to get stuck in the party bag and unknowingly scooped up by Bonnie when it was time to go"
    },
    {
        "subreddit": "toystory",
        "sentence": "Slink and Opal get to know each other during the car ride and the birthday party"
    },
    {
        "subreddit": "toystory",
        "sentence": "A little shyness is shown at first, but they become closer"
    },
    {
        "subreddit": "toystory",
        "sentence": "Slink even gives Opal encouragement when she is finally given to Phoebe, who adores her so"
    },
    {
        "subreddit": "toystory",
        "sentence": "Before the party ends, the two toys arrange to see each other again on a play date and a lovestruck Slink returns home, much to the bafflement of the other toys.\n\nScenario Two - After seeing The Pastel Pals advertised on the TV, becoming the new popular girl toys for Easter, Bonnie excitedly go with her parents to the mall to see the grand unveiling of the new toys"
    },
    {
        "subreddit": "toystory",
        "sentence": "Buzz and the gang secretly go with them to see the event themselves, when they get lost in the mall and pursued by some troublesome toys"
    },
    {
        "subreddit": "toystory",
        "sentence": "They're however, saved by The Pastel Pals, themselves and get away in their creators' limo (driven by toy animal butlers, one called 'James' who takes the wheel) Neon Glow, the team leader introduces herself and the rest of the pals"
    },
    {
        "subreddit": "toystory",
        "sentence": "But when Buzz and the gang do the same, Slink remains quite speechless, instantly falling in love with Opal.\n\nWhich scenario do you guys like better? c: I personally like the second one, myself~😚 Do enjoy Opal's ref, I have lots more adorableness to come! ❤️✌️😉"
    },
    {
        "subreddit": "toystory",
        "sentence": "I have never seen this in my entire life"
    },
    {
        "subreddit": "toystory",
        "sentence": "I expect the embodiment of Gene Siskel and what do we get instead? The inane ramblings of an undisciplined amateur!  She has no business flaunting her baseless and unprofessional rankings of the Toy Story films around here!"
    },
    {
        "subreddit": "toystory",
        "sentence": "I will be messaging you in 5 days on [**2024-05-18 01:22:00 UTC**](http://www.wolframalpha.com/input/?i=2024-05-18%2001:22:00%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/toystory/comments/1cqfz0p/anyone_know_what_kind_of_buzz_lightyear_toy_this/l3sfzrm/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Ftoystory%2Fcomments%2F1cqfz0p%2Fanyone_know_what_kind_of_buzz_lightyear_toy_this%2Fl3sfzrm%2F%5D%0A%0ARemindMe%21%202024-05-18%2001%3A22%3A00%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201cqfz0p)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|"
    },
    {
        "subreddit": "toystory",
        "sentence": "RemindMe! 5 days"
    },
    {
        "subreddit": "toystory",
        "sentence": "I don’t allow my 4 year old cousins to watch Toy Story 4"
    },
    {
        "subreddit": "toystory",
        "sentence": "\"It's time for *Gatekeeping Moments*!\""
    },
    {
        "subreddit": "toystory",
        "sentence": "What do you mean by I hit the jackpot? Do you know what kind of Buzz it is?"
    },
    {
        "subreddit": "toystory",
        "sentence": "In Latin Spanish he changes his accent from neutral latin Spanish to spaniard Spanish\n\nIn the Spaniard Spanish dub, he changes to an Andalucia accent which is more exaggerated than the neutral Spaniard accent"
    },
    {
        "subreddit": "toystory",
        "sentence": "I agree!"
    },
    {
        "subreddit": "toystory",
        "sentence": "Bro, you you hit the freaking jackpot"
    },
    {
        "subreddit": "toystory",
        "sentence": "You’re gonna be rolling in those big bucks soon"
    },
    {
        "subreddit": "toystory",
        "sentence": "No chuckles haven't you watched toy story 3"
    },
    {
        "subreddit": "toystory",
        "sentence": "No chuckles haven't you watched toy story 3"
    },
    {
        "subreddit": "toystory",
        "sentence": "Actually chilling; I wouldn't wanna run into this dude."
    },
    {
        "subreddit": "toystory",
        "sentence": "I think it's about the cat toy but I still don't know why they post it 🤷"
    },
    {
        "subreddit": "toystory",
        "sentence": "What are you, a *propagandist*?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Thanks"
    },
    {
        "subreddit": "toystory",
        "sentence": "Oh I never thought of that"
    },
    {
        "subreddit": "toystory",
        "sentence": "What does this have to do with Toy Story"
    },
    {
        "subreddit": "toystory",
        "sentence": "Movies and be objective well written, have internal consistency, follow principles like show don't tell, have good production value, cast members who give their porformances their all, creative and not very distracting cinematography, etc"
    },
    {
        "subreddit": "toystory",
        "sentence": "etc.\n\nMany movies are like that that I do not like (like Barbie 2023, except for the writting part)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Many movies are not like that and I like them (like X-Men: The Last Stand or the Resident Evil animated movies)."
    },
    {
        "subreddit": "toystory",
        "sentence": "Also I like Space Jam, but it's objectively not anything above average when it comes to it's story"
    },
    {
        "subreddit": "toystory",
        "sentence": "Also what's wrong with not likely The Last Jedi and what's wrong with LSMark?"
    },
    {
        "subreddit": "toystory",
        "sentence": "Did this dude really just say Ralph Breaks the Internet is a good movie."
    },
    {
        "subreddit": "toystory",
        "sentence": "\"No"
    },
    {
        "subreddit": "toystory",
        "sentence": "And by the way.."
    },
    {
        "subreddit": "toystory",
        "sentence": "you don't want to do that either"
    },
    {
        "subreddit": "toystory",
        "sentence": "You think you do, but you don't.\" J"
    },
    {
        "subreddit": "toystory",
        "sentence": "Allen Brack President Blizzard Entertainment (Activision/Blizzard) from 2018 to 2021."
    },
    {
        "subreddit": "toystory",
        "sentence": "They're right"
    },
    {
        "subreddit": "toystory",
        "sentence": "That other guy I don't know the name of (who I give the benefit of the dought and assume is joking, my dad jokes like that all the time), when his words are taken seriously is basically just telling a guy he doesn't believe what he thinks he believes"
    },
    {
        "subreddit": "toystory",
        "sentence": "Which is silly."
    },
    {
        "subreddit": "toystory",
        "sentence": "I went into it expecting it to be unnecessary but entertaining"
    },
    {
        "subreddit": "toystory",
        "sentence": "I finished watching it with my family with a generally neutral opinion on it, I didn't like the ending because it felt weired for the loyal Woody to leave his child, and I also didn't enjoy it as much as the original Tory Story trilogy (which I'm not even particularly nostalgic for)"
    },
    {
        "subreddit": "toystory",
        "sentence": "But I didn't think it was porrly made and the voice actors, animators, and sound designers did a great job so I thought it was a good 7 out of 10 movie (5 out of 10 is average)"
    },
    {
        "subreddit": "toystory",
        "sentence": "Then I watched/listened to the Tory Story 4 GamingMagic13 video and it was like a \"fride thoughts moment\" (where you come home from the theatre and while you're looking in the fridge you realize something in the movie made no sense) but for the entire movie"
    },
    {
        "subreddit": "toystory",
        "sentence": "Now my headcanon is that the only canon Toy Story entries are the first 3 movies, Buzz Lightyear of Star Command movie+tv show, Toy Story of Terror, and maybe Toy Story that Time Forgot"
    },
    {
        "subreddit": "toystory",
        "sentence": "I would say that I'm not looking forward to Toy Story 5 but honestly I wasn't gonna watch it"
    },
    {
        "subreddit": "toystory",
        "sentence": "I've just stopped watching Disney movies at this point"
    },
    {
        "subreddit": "toystory",
        "sentence": "I only watch them if my family wants to which is rarely."
    },
    {
        "subreddit": "toystory",
        "sentence": "The most important changes in a character and their most important decisions should usually be shown on-screen at some point in visual storytelling media."
    },
    {
        "subreddit": "toystory",
        "sentence": "Once that used to haunt my dreams as a child"
    },
    {
        "subreddit": "toystory",
        "sentence": "Yes"
    },
    {
        "subreddit": "toystory",
        "sentence": "That was deleted pretty early in production (no voices, no animation), so it’s interesting that it ended up being incorporated into the game (which would have had a later script and unfinished animation to work from)"
    },
    {
        "subreddit": "toystory",
        "sentence": "I guess the concept just made for a good boss fight to progress the story."
    }
]