[
    {
        "subreddit": "unpopularopinion",
        "sentence": "You must live in the north"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Water here is like bathwster"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I actually dislike Gulf of Mexico cause water is so still you can’t do anything."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There's always someone who is better than you at most things if not all of them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You just don't always get to meet those people."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now you’ve left me in a dilly of a pickle"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Do I say “duh,” “a-doi,” or “oh really? Dear God Fiona…”"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’d rather ban karaoke from people who are so awful that it seems like they’ve never even heard the song"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Off time, off key and don’t know the lyrics"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And they even chose the song themself!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a terrible singer, I agree"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Terrible singers should stick to the shower, don't subject other people to torture just to satiate your own vanity."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The music in that clip is pissing me off."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Pondys the coolest"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "OP thinks because they were loud, they probably didn’t have a very educated child"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Trying to be prejudice but don’t have the huevos to say it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I thought it was widely known that both programmes are low tier comedy for the brain dead audience"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why it's weird?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's like people forget this sub isn't just an echo chamber for unpopular opinions"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People will discuss and criticise said unpopular opinions"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "“No u” Genius tier response.\n\nWhat would I even be bitter about?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your hands, my cheeks, your Civic?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is so well written that now I feel bad about myself because I don’t write very good and I know that I could just practice but my spouse is a better writer than me too so I’d rather just be mad at them about it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I didn’t even make one episode it was hideous."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well… you‘re partially right and partially wrong"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Of course limiting every device to a single standard isn‘t great"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But: in a lot of cases companies create their own charging port for the sole purpose of being the only one who sells the power adapter"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just take a look at most small electronic items (especially electric razors / trimmers / …)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I‘ve got a box full of cables and adapter purely because if I loose one of them I‘d need to find the specific type  from that manufacturer"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And there are hundreds of different options"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hell… my dad has the same type of electric trimmer I have"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There‘s virtually no difference between them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But one is a bit more recent and thus they have incompatible charging ports"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So if one of us looses the charging cable we‘d have to buy a new one even though the other trimmer needs the exact same V & A"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And that‘s obviously not okay"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But good luck trying to get a micro USB / USB C / … trimmer"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Especially for a similar price.\n\nSo I‘m totally fine with 2-3 standards for certain kinds of electronics, if a new and better standard can still be developed and potentially replace an older one.\n\nRegarding easy to remove batteries… Again: unfortunately nearly every significant smartphone company glues the battery to the phone / makes it inaccessible without a lot of tools"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And we‘re now at a point where every component has to be „id coupled“ to all of the other components"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Don‘t get me wring: for storage and security features that‘s fine"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I wouldn‘t want someone to be able to use my storage in another phone to read my data"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But my battery doesn‘t have significant data"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So why do I need to pay the manufacturer to couple my battery to the rest of my device if I‘ve already got a working battery? And given that the battery is the first thing that fails replacing the battery is the most common thing people would want to do"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like… I‘ve got really old phones and they‘re still working great"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But their batteries are fucked and getting the batteries replaced would cost more than the devices are worth"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Obviously due to water resistance etc"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don‘t expect the old way of just removing the cover with a fingernail and switching the battery"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But the way it‘s currently done is meant to keep people from replacing batteries by themselves and to increase the cost of replacing it professionally"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Which is nonsense but it works because every significant manufacturer is doing it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And lastly: software… That really hit a nerve"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I do like iOS"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It‘s a nice operating system and even though I‘d like the option to customize it more I‘ve had a few iPhones over time"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But as a developer I‘d really like to get my own apps on my phone and to load other apps I want but that I can‘t get from the AppStore"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And given that the phone is my property I should be able to do that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But for „security reasons“ apple has refused to allow people to load other apps without having to deal with really annoying hurdles & buying a mac and / or their Apple developer license"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I‘m not a child anymore"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Give me the option to install Apps you haven‘t checked and I won‘t blame you if I install malware and fuck up my device"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But again: Apple doesn‘t do that and there is no second iOS"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The only alternative would be a really custom Android version and then I‘d need to find a matching phone for it etc"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "which is really annoying"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "(And there are a few features I need / like that only iPhones have…).\n\n\nSo while I do agree that the EU tends to overregulate (especially with idiotic stuff like the new copyright laws) these new rules are a few examples of when government intervention can be useful"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I do believe in a mostly free market and technically I‘m fine with some monopolies (like Apple with the iPhone & iOS) but if monopolies exist they need to be regulated more than other companies would because the ability of the free market to change it is limited"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can‘t just recreate iOS because then you‘d get sued by Apple"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So until Apple allows other to modify iOS it‘s essentially a monopoly and thus other rules apply"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Especially to things like the AppStore which was the only App store you could use."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ">the point of karaoke is that it’s fun and funny because everyone is trying their best despite their abject mediocrity\n\nNo, the point of karaoke is that it's fun because everyone is singing together regardless of their voices"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Don't take away someone's fun night because of your insecurity."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "More like 2 weeks, but I guess ymwv"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "OP thinks he’s invented Darwin Awards lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I never said that, I wrote it to prove that this really is an unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Is what sense is it superior protein compared to steak or chicken?\n\nEven in terms of flavour.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "you could apply all that seasoning you mentioned to meat and it would be the same taste with imo better texture"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can t change how other people will think about it,you can just change how you react on it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It seems that you are too worried what others think and you feel that you have to explain yourself...no need,live your life"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "At the same time there is also nothing wrong with a woman just being together with an older guy for money, but I m quite sure you would be one of the first to judge that..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hey, u/buddhistbulgyo"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Politics is a banned topic, full stop.\n\n**DO NOT ATTEMPT** to evade our filters to continue posting about politics or anything in relation; We will swiftly respond by placing a permanent ban on the accounts that choose to ignore this advice.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "both are true though lol\n\npretty sure most people aren't unhinged enough to feel embarrassed bc they aren't that good at karaoke"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No one is saying you don’t have that right"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Strange take."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The water is ice cold its windy and the water is always so rough"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Too many memories of almost drowning from being thrashed around by rough waves close to the shore"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also, being flexible lets muscle groups overlap their range of motions making you effectively stronger without having more muscles"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Being flexible kinda automatically makes you stronger in a larger range of motion."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "its only takes 6 days without touching my self and i already get one"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I wonder how many times you've had room temperature ketchup and not thought about it? \n\nSachets just sitting out"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Squirty bottles just sitting out waiting to go on a hot dog"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "None of it chilled, just sitting out for days on end."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "See this is why when I am cooking for people who can’t cook, I make them bad food so as to protect their feelings"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Everyone loves that I do this."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Core premise just seemed awful."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "For me, the jump from my ps2 to 360/ps3 was much smaller than the jump from 360/ps3 to ps4"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I still remember getting the ps4 and the new battlefield for my birthday, playing it with a friend"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We both just sat there thinking this might be the best looking game we’ve ever seen."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I would never tip anyone"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It won't be on the ketchup."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "yes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you register the subreddit hamburger, you can post as many cheese burgers as you want, as long as buy and/or eat them in freaking Hamburg.\n\nYou should see how many people don't realize that r/cologne is about the city that gave you the word cologne and not about the hopefully-smell-nice water that is a version of perfume you can reapply every once in a while."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a good singer (in a cover band for a short while), everyone who can't sing good should not do karaoke"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It kills the mood in the room."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Semi-truck plows into stopped traffic causing deadly highway pileup (youtube.com)](https://www.youtube.com/watch?v=WKVZbLKKWGM)\n\nStuff like this means you're wrong"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I get the point when ONLY thinking of the driver (though on the fence on it)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But when innocent people get injured or die from it, it's not a good thing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "> It’s literally just women bitter \n\nOh someone does sound bitter …"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Surprised they don’t carry Faygo"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "OOOh yeaaah like that \"invisible\" statue, such experimental masterpiece."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why would I want to do something if someone is better than me? It just proves how inferior and subhuman compared to that other person"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don’t agree with OP, though."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No, it’s just the way it is"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "“Well, they’re secretly doing this because they’re evil and want to manipulate!” is just an excuse to avoid admitting “they want a younger woman because younger women are more attractive.”\n\nIt’s that simple, as we age, we lose attractiveness, and there’s generally a higher value to youth for women."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Never seen the show before but I just watched that clip and that line about the piano playing dog is so cold"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hope I get an opportunity to use it someday haha"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well he does end up taking a back seat in his own show and becomes mostly B plot only for a reason lol."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tipping, and OP 's opinion, both need to die"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Horribly."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Getting up from the floor is a balancing act"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It is incredibly easy if you can place your weight so you are supported by your bones"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The main reason people struggle is because they try to get up in unbalanced positions which makes them wobbly and requires a lot more muscle strength from the entire body"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And the reason they to that is because they don't have the mobility (which is kinda just another word for flexibility here) to reach the stable positions to rise up."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "How is this stopping you?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The sugar and vinegar content makes it safe to keep at room temperature."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Good unpopular opinions should be allowed on r/unpopularopinion, it ruins it for everyone else!\n\nThankfully your opinion is as weak as your karaoke game."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Kind of an ugly attitude dude"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe women remember when they were young and some ugly boring old tool took advantage"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People will always take advantage of others just because they can, and then make excuses to justify their crappy behavior - it’s just human nature"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah I like it with rice"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "However meats are good too"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And you're unable to have your preference because of these videos?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This sure is unpopular, I’ll give you that lol\n\nI guess me, my mother and my grandmother should just never do karaoke just because we used to do choir and can carry a tune, lmao"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I loved both of them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe you have to know a lot of people like the characters"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I can see so many characteristics of the people in the show in people I knew in college and people I work with."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Love the puff"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "it's not bad, but it is different"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I couldn't believe i would dislike his mom even more after YS though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Major an unnecessary retcon at the end though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It is certainly no tbbt"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Mema and the siblings are the most redeemable parts of the series."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Because everyone is going to assume you only pick younger people because they're too inexperienced to know how lame and bad at sex you are \n\n\nEven though the real reason is \"everyone my age either has kids or is a crazy cat lady who literally won't go to bed if the cat falls asleep on their lap\" \n\nPlus it just seems like everyone over 30 has given up on life? I don't like dating anyone in their 20s but I can't deny that at least they have passion and energy and want to have fun...whereas older folks just sigh and whine and never want to go anywhere or do anything and always assume the worst"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Modern art is experimental, all right"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's like a four year-old is experimenting with crayons."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So, what? Just fuck those people, they get excluded every time because you have feelings about your singing voice? That's rude and pretty mean of you."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think a lot of the time they are hoping to \"liven up the party\" with louder music."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm not a vegetarian, but I love tofu and tempeh, eat them a ton, crave them.\n\nHowever, I really haven't been able to get into seitan which is a shame since its protein per calories is amazing (the same as chicken breast)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've had dishes I like enough with it (like using it for a gyro replacement)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "but it's just been kinda eh compared to tofu and tempeh"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Wouldn't really go out of my way to cook with it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Got any recipe suggestions for seitan that you love?\n\nmaybe it's because most recipes I see for seitan use it more for a meat replacement, whereas tofu and tempeh stand out as their own thing.\n\nIf I were veggie though I definitely would see the appeal more there, from what I have had."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Coronavirus posts are not allowed on this subreddit, due to [difficulty in applying the rule about COVID-19 misinformation](https://www.reddit.com/r/unpopularopinion/comments/prsb7g/policy_update_re_covid_opinions/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "**This especially includes posts starting with \"I'm vaccinated and believe in covid BUT!!!!!!\" and \"I'm vaccinated but vaccine mandates are bad!!!!\".** We get several dozen of those posts an hour"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also, if your post is another complaint about r/HermainCainAwards, you need to find a venting sub"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That is reposted many times a day"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Evading this filter in any manner will be an automatic ban/mute and reported to the admins for proproganda"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hundreds of accounts suspended sitewide so far"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also add some extra fresh grated cheese towards the end with some oregano and a little garlic butter on the crust it's way better"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "see, this is a good opinion."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes but no.\n\nIt's just a matter of throwing shit at the wall and have influential friends who'll call it art and pull some \"explanation\" out of their ass to make it feel smart and groundbreaking."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What’s the uk equivalent for a bri’ish person like me?\n\nI’ve never had one :("
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes!!! I love a hotel"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We are off to one next month for 3 nights for a work conference and I’m already excited about my ‘holiday’"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I liked the show but think it has some huge problems"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Mostly that no one fucking listen to tommy for 5 fucking minutes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But will not say it is an amazing show just that I found it a good watch that had dips for sure."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your first mistake is thinking comments on videos is at all representative of real life."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Given how many of them rack up endless charges of reckless driving, DUI etc before they finally have a fatal accident and are put out of our misery (and how often they take someone else with them when they do), you’re absolutely right.\n\nThe safety of the many is always worth more than any individual, functional societies understand this, individualist hellholes on the brink of collapse screech about freedom."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Downvoted cause you are annoying me with cornyness"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Kim there's people that are dying"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If only terrible actors with rotten voices were allowed to perform, then North West wouldn't feel so bad."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Do Muppets Babies next!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They been the goat of fast food pizza for years, people are just finally wising up"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m in Houston and these 14-17 year olds are all over here killing people like crazy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They just need to be locked up at this point."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I thought it was infinitely better than Big Bang Theory, because it’s the same behaviour as the adult, but he’s a kid so it’s more acceptable."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Of course that also happens but it’s a very small minority of abortions that occur because of strictly medical reasons"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A great majority of abortions are done because the mother doesnt want a baby either because they think theyre too young, not financially stable, bad timing or because they dont want to have kids with their current partner"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Which is really sad because 99% of _those_ abortions could have been prevented if they werent a bunch of idiots."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Is it though, most videos that I see that features a person expressing their preference is flooded with judgemental comments."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s literally just women bitter that the men they want to go after, who are financially secure and stable rather then immature and broke like most young people, don’t want them back.\n\nThey REALLY don’t want to admit “I look worse now that I’ve been aging” so they decide to pretend literal adults are children who can’t make their own decision, while also stating it’s perfectly fine for these adults to start an Only Fans, it’s empowerment."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That right already exists"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But society retains that right to find things weird and judge them against social mores"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't get to determine what people find normal"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No just no"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is incredibly insecure.\n\n\nKaraoke is not a competitive sport"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you know someone who's a good singer, why can't you enjoy getting to hear them cover a song you like - and then have the rest of the group butcher the songs you all planned to butcher anyway and have a laugh about it?\n\n\nHow far do you take this? Are professional photographer friends not allowed to share pics in your group chat?\n\n\nChrist, I'd hate to have any kind of talent and be a friend of yours."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This post has to be bait"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Try a nude beach..you don't have to cart anything except sunscreen"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Gaming nerds think their takes are somehow controversial or their conclusions somehow would not be reached by others"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Unpopular opinion: DLC should have been part of the original game !!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ditto"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've tried several times to watch Big Bang and never got past the third episode"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "714 Star Wars jokes in those 3 episodes, btw."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I still get sex dreams all the time"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "To me they aren’t necessarily “better” than real sex because I can still physically orgasm, even multiple times during sex dreams like I do during sex (I’m a woman)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The orgasms feel the same to me, as in exactly the same as normal sex because it is a real climax"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What IS better can depend on your dream sex partner"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I get my fictional crush the most often, sometimes random strangers and occasionally my husband"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I even get unwanted sex dreams about people I don’t like"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I get the whole spectrum lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But the only one who is “better” is my fictional crush because he is absolutely wild and into all kinds of things (which is cannon btw) and after 8 years in a relationship that has been mostly vanilla sex, you start to crave something different"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My husband is still great in bed but yeah I have to say those sexy dreams about a fictional character are something else… out of this world lol."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fucking A"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Steak sucks ass."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I only don’t like it bc it’s less fun to listen to someone talented"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The fun in karaoke other than doing it is laughing at/encouraging bad singers."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This SUB is stupid, there is no moderating that can make it make sense"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Having a orgasm with sex is as much of not more about the journey than the destination"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That you keep going on about it requiring less or no effort just makes me think you massively lack experience with actual sex."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sure, you have the right"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Doesn’t make it any less weird."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's a really populistic opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Anyone can look amazing with a team of plastic surgeons darling"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You don't live in the New York/New Jersy or the Chicago area"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Do you?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And karaoke is probably not your sport."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Is? Or was in the 70s"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I enjoyed it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Liked the first one, too."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you think LCs is good now, you shoulda been there in the early 2000's"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Thicker crust, more sauce, more cheese, and it would last all week on the coffee table before even remotely becoming unsafe to eat."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "so true, people should sometimes remember that personal responsibility exists"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But if you're in a group of good singers it's also fun too because it's like you're on The Voice Finale 😁"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I can't find tofu big enough to sleep on"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You have the opportunity here to try making a chicken and rice soup for the first time, based on your incredulity"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Rice in soup is amazing, imo much better than noodles in most cases."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm sorry, I'm not a native speaker, I confused the two 😅\n  \n yeah that's what I meant"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "“Everyone is starkly aware of their lack of talent” that’s where the fun is becuase you realize you’re as bad as everybody else so you don’t have to worry about it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sorry about your gf issues though it sounds like someone impressed her 😆"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I agree except reheating in air fryer is pretty good also"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Microwave is awful."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If the service is bad I will tip zero dollars and zero cents"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They can kma"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Its not worth the price anymore"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I love his mother"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "She's pure ridiculousness."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "parents who have to take care of their kids 100% of the time are more busy than parents who take care of their kids 50% of the time?\n\n\nHot take"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But we’re talking now"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And today you can see that at any time on the app on your phone"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You also keep a buffer in the account that you never go below"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And if you do have to run that close to 0, then you need to keep track of deposits and purchases."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The show is a spin off telling the childhood of an adult character who is just like that.\n\nWhat did you expect?\n\nThe show was ok in a \"I don't know what to do with 20 minutes\" kind of way.\n\nDidn't try being anything else that what is was, which is \"turn your brain off for 20 minutes\"."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The best part about little Caesar’s is that once the pizza cools over night it hardens into a triangle-shaped weapon similar in strength to steel that can be used against your enemies."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Glad to hear they finally made a decision"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Too bad they chose the dark side…"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your insecurities aren't anyone's else's problem to manage"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I shall continue to knock it outta the park on karaoke nights."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nope"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You'll get the rounded up to the next few bucks...barely a few % points on the total.\n\nDo a better job...*because it's your current source of income.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's not a complete protein so actually it is an inferior source of protein"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And Meemaw"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm sad it ended specifically because of her."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "![gif](giphy|K0AnEB2t2EM|downsized)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What you get after a wedding is a picture of the newlywed to keep"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "At least that's how it's in Norway"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If there is no picture I agree."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lol hard disagree"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Remaining kind and calm when someone else is NOT is extremely effective to any audience viewing the incident.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "which ends up being the most important factor at the end of it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I can't tell you how many interpersonal conflicts I have \"won\" because I \"killed them with kindness\".."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "they ended up coming and apologizing because everyone that witnessed the event shamed them for their behavior.\n\n\nWhen you are known as the kind, caring, calm, rational, non confrontational person.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "SURE, some people see that as weakness, but everyone else sees your kindness and gets pissed on your behalf when you are mistreated.\n\n\nObligatory your mileage may vary based on location."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please ensure you are posting an unpopular opinion and not an extremely typical redditor opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If your opinion is the same or similar to ones on [this list](https://www.reddit.com/r/unpopularopinion/wiki/index#wiki_military), it has been reposted daily for a few years now"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Thanks \n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He also has a character that appears a few times."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've seen worse shows"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This one is ok but a little cheesy and hokey"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Follows the trope of smart lil bro, sassy sis and horny older teen bro"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Dad is bumbling and Mom is crazy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Remember TBBT is essentially what dumb people think intelligent people are like.\n\n\nYoung Sheldon is an annoying know it all because that's the stereotype."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Bro, fuck people"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah, the fact that a kid will still go for Minecraft despite its basic graphics just tells us what needs to be prioritised.\n\n\nHell, I still enjoy Rollercoaster Tycoon and Age of Empires, while GTA V bores me now."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "everyone will shit on this unless you know someone where the good people died in the accident and the aggressive driver survives the accident"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "that shit changes you"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "esp since USA laws makes it so automobile induced deaths often have lax sentencing due to the historical precedences to make sure people want to drive and not feel like there is too much liability."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It tastes like nothing, has poor texture and doesn't even have that much protein."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The pizza cupcakes 🤤"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I said this at Halo, then mirrors edge came out"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "then I said this Detroit become human, then mirrors edge catalyst came out  after that Arkham Knight came out"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "ghost of Tsushima is beautiful af"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I wonder what I'll say a year from now."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sometimes the issue is on board; people putting their personal items (which should go under seat) in the overhead"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Or their jackets/coats"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Or put their fuckin carry on suitcase sideways (??!?)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Flight attendants probably could help here but it’s often so difficult for them to move around that it would delay flights, if they were to micromanage the entire process"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I agree though, it’s fuckin ridiculous"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I pack in a carry on when I day trip for work, and waiting an extra 20 minutes for my bag to arrive is not always time that I have to spare"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Equally sucks having to wait for a gate checked bag on the return trip when it’s midnight and you packed light just to avoid this in the first place."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then nobody should sing karaoke!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "😂"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Omg you’re right"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I hadn’t thought of that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Aspiring professional writer 🥰"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But that Superman example makes perfect sense"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And you’re right about lazy writing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a person who watches teen dramas I see people talk about how rich privileged kids still gossip girl can drink at bars and get into clubs but the answer is in rich and privileged"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Or pretty little liars on why the girls don’t ever go to the cops when the answer is in their harasser is always steps ahead and the entire police department is corrupted"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But those are small examples but the answer is usually right in front of the viewer in scenes like those"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Shows like succession are the types of writings I’d like to develop"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Or movie like the dark knight or avatar where things have been done before and you see it as a viewer but it’s Also a refreshingly different spin on it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I work in an east asian street food kitchen and we regularly sell tofu to meat eaters"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Its growing in popularity definitely"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We bread it and deep fry it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Its fkn lush"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s not even close to actual proper Detroit style pizza."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Is it really unpopular though? I have a small community of gamer friends and we all agree on this.\n\nAt least in term of photorealistic graphic"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Artstyle matters more now, just look at Persona 5 or Hades"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "FFXIII is still a pretty game even now 15 years later."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s not superior in many ways especially if you’re looking at it as a protein source"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "8grams of protein per 100gs of tofu vs chicken 31g of protein in 100gs of chicken breast"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even if you look at it by protein per x amount of calories tofu is just not as efficient and is a lot less satiating than any meat"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please do not repost height preferences in dating to this sub"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The same posts are continually spammed here and none are unpopular opinions"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a great day \n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Found Anakins account."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Honestly, if someones phone dies they were too moronic to begin with"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Would she enjoy a wave pool more? For me, I love the beach because I love the waves."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You say this as if there isn’t a whole world to learn the cardinal locations of"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If I was making the bank he was playing someone I thought was annoying I'd suck it up"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The viewership count clearly indicates that's not a deal breaker for them  and the character is accepted for what he is"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Much like the audience needing to accept the annoyingness of Screech on Saved by the Bell  or Archie Bunker as a biggot on All in the family."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 1: Your post must be an unpopular opinion'.\n\n* Your post must be an opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a question"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a showerthought"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a rant"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a proposal"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a fact"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "An opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "One opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A subjective statement about your position on some topic"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please have a clear, self contained opinion as your post title, and use the text field to elaborate and expand on why you think/feel this way.\n\n* Your opinion must be unpopular"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The mods reserve the right to remove opinions\n\n* Elaborate on your topic and opinion give context to its unpopularity."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "both shows are bad"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your arguments are personal issues that the majority of people don’t suffer from and your comments give off the aura that you want to see VR Gail just because it doesn’t work for you, so yes ridicule the salty nerd"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah, but the post wasn't about adult Sheldon."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 6: No r/self style posts'.\n\nPlease refrain from posting anything that resembles an r/self style post"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is not the subreddit to be sharing personal anecdotes, likes or dislikes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want unpopular, thought provoking, and unique opinions on your chosen topic."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fried tofu is always surprisingly good at Asian restaurants"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A good vegetarian option when I'm not feeling like meat."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "With the way things going - I wonder if they would install turnstiles with receipt readers."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 3: Do not post opinions that are heavily posted/have been on the front page recently'.\n\n* No response posts about upvoted posts here.\n\n* Posts relating to highly popular topics aren't allowed outside of the relevant megathreads"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can find a list of the topics and their respective megathreads in a post on the top of the sub.\n\n* POSTS DIRECTLY ABOUT THIS SUBREDDIT ARE NOT ALLOWED OUTSIDE THE MEGATHREAD\n\n* Please check the wiki linked here: https://www.reddit.com/r/unpopularopinion/wiki/index/\n\n* We ask that if a post fails to post do not just spam repost it; message mod mail."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I get the sarcasm lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is such a funny post, it’s so easy to become flexible especially if you’re a young person"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Family to me is mom dad and 1 brother with his family one day."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "4-5 cousins oof I don’t even know or talk to them,"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have a wonderful husband, I don’t need a very active social life and solo travels for fun"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sounds like it depends on the family.\n\nI'm more than happy for mine to visit and stay with me"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I like my family."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah, I mean I'm not talking about grandma that just can't drive as good as when she was young"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm talking about road users that drive willfully reckless, often knowing very well that they are endangering others"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think, if I'm hearing that someone like that died in an accident, I would not feel the same thing than when the person drove considerate.\n\n(Not saying that the reckless drivers are bad people in general)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Shame is a you thing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "However, if you have one of those plastic torsos in your closet.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "you should feel shame."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "When I got my first toy and told my husband about it (he works out of town as a trucker) he decided to try one too it was cold where he was so he put it on a heating vent in his truck to warm it up and it melted into his truck because he forgot about it he spent so long picking out of the inside of his dash he’s never bothered to get a new one"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He never even got to try it! I keep wanting to surprise him with one, a really nice one but then I’m like do I want to compete with a pulsating vibrating warming Barbie perfect vag lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This isn’t true"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "CBT is based on changing your thoughts and feelings"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Show a triple a gamer the original rouge and tell them it's history and influence on modern gaming."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 1: Your post must be an unpopular opinion'.\n\n* Your post must be an opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a question"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a showerthought"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a rant"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a proposal"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a fact"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "An opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "One opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A subjective statement about your position on some topic"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please have a clear, self contained opinion as your post title, and use the text field to elaborate and expand on why you think/feel this way.\n\n* Your opinion must be unpopular"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The mods reserve the right to remove opinions\n\n* Elaborate on your topic and opinion give context to its unpopularity."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Honestly man sex-toys suck"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And not that way"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I tried a few and all of them are just a pain to maintain or loud as fuck that kill the mood"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So a hand is still the best option for me."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 1: Your post must be an unpopular opinion'.\n\n* Your post must be an opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a question"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a showerthought"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a rant"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a proposal"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not a fact"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "An opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "One opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A subjective statement about your position on some topic"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please have a clear, self contained opinion as your post title, and use the text field to elaborate and expand on why you think/feel this way.\n\n* Your opinion must be unpopular"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The mods reserve the right to remove opinions\n\n* Elaborate on your topic and opinion give context to its unpopularity."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I forgot about the car situation… smh"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 2: Do not post low effort/satirical posts'.\n\n* We get it, you all think this sub is garbage and is just for popular opinions, and you want to be funny and post \"going to be downvoted to oblivion here, but I think racism is bad.\" We enjoy the memes, but please keep them off the sub.\n\n* Filter evasion is a bannable offense\n\n* This includes clickbait and/or gotcha posts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your opinion can not be that unpopular if you're doing these things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have the accurate opinion in the title."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post from unpopularopinion was removed because of: 'Rule 7: No banned/mega-thread topics'.\n\nPlease do not post from (or mention) any of our mega-thread or banned topics such as: \n\nRace, Religion, LGBTQ, Meta, Politics, Parenting/Family issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[Full list of banned topics](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Rich bastard list"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You sound like a very selfless and nice person… I respect that thank you for sharing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like the big bang theory..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've tried tofu, and I absolutely hated it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The texture was off-putting for me."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They aren't killing anyone"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The reckless driver broke the law and got themselves killed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You want to be safe.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Follow the laws."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If your watching tv for charachters you like personally, you are missing out on some of the best acting and shows ever, stick to disney braa"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Careful though Scar from the lion king is cruel, manipulative and evil, might be too muxh for you"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Take my upvote"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Idk if it's an ADHD thing but I need to float in the ocean with waves for a few hours"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But the closest thing I have is a wave pool an hour away from me."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You're right, I basically described the trolley problem.\n\nI was not talking about killing someone because of bad behaviour"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I talked about accidents.\n\nNo worries, I'm not in charge of anything!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I feel that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think I might have vaginismus and it took awhile just to find a small size dildo that didn't hurt"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It made me feel very ashamed and embarrassed for a long time"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But having something that actually works for your body can give you alot of comfort."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lose*\n\nLoose = not tight"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Corruption is merely the lack of transparency"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Would love to see what you mean by \"exterior regulation often ends up being just corrupt\", especially in the context of unregulated markets.\n\nThe idea that government is incompetent is just neoliberal meming - don't buy it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Haha, no worries! Wouldn’t have taken it in a creepy way 🤣"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And thank you!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've got a 4 year old and a one year old :P lol we wear out our welcome pretty quickly"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's part of the reason why I help out so much when I'm staying with relatives."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "gotcha"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yea, the FL takes getting used to"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hes annoying, rude and entitled as an adult too."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some women who are super freaky, are also super crazy."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You should meet my ex.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "she had a whole treasure chest of toys.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I bought ONE, and she lost her fucking mind over it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "From the other side of my years long addiction that started with drinking alone:\n\nWhat’s smart to do when drinking is very individual"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If it works for you, great"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And it’s not like people don’t become alcoholics from social drinking"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But i’d say it’s easy to develop some bad habits without noticing, when you do things alone"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But the problem is they are killing a person who had not committed a second offence"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They assume people never change"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That is definitely not justice"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's not good for our society."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Laughing if it's the same man"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Western problems"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I snorted so hard at the cucumber part that it hurts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ">It is basically universally accepted that women, like myself, tend to have a few sex toys.\n\nLmao no its not.\n\nBut yeah, men absolutely should be able to use sex toys without shame"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People shouldn't talk about it in a derogatory way either, it's not a \"joke\", it's rude and shames people."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm thinking so"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also (not in a creepy way), I would watch"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I used to do cams and it was even difficult for me as a girl"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I can even give pointers if u want"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's hard for amateur guys to break in"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Best of luck and my dms are open if you have any other queries (again not in a creepy way lmao) !"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Through out history we use words like \"plowed\" and \"dominated\" refering to the penis, stating that the penis *give* whereas on the other hand the vagina is literally named after the greek word vagina meaning \"sheath\" insinuating a place for the penis"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even more so the \"box\" stating something goes *in* that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Pretty sure it's wildly known that men \"give\" sex and women \"recieve\" sex and this is the male dominated way of seeing it or the human understanding"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That is men woo women and women wait for the man to approach"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is the invention of socialised chivalry eg"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Holding the door open"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sorry I'm right."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "To little to quantify"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And you, how much have you been delayed?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's just grose."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Has to be."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "i didn’t say it wasn’t, i upvoted the post"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I agree with you on all that, except, just an FYI, women aren't equal yet."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yea but again when we talking about cancer we not talking about 1 risk factor we talking about multiple"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "All these risk factors add up"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Its not like we don't also have correlation to go off we have mechanism that why red meat increase risk of bowel cancer"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The confounded variable is N-nitroso chemicals which damaged cells in the gut"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And we know cell damage cause cancerous cells"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like chief you do what you want no one stopping you from eating meat"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But the evidence is there majority if not all the experts agree on this."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ok but where's the drama? Where's the mexican novel plot? Where's Liz when you need her..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Depends on family member, not everyone gets along"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's a really interesting viewpoint, I think that sums  up a lot of the perception around it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So it's an unpopular opinion then"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Dude they would be but the prices are now the same they would be at any other chain so I don't go there anymore"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And does the term FiFi mean anything to anyone here?  If you know…you know"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lmao."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's illegal to bike on motorways, perhaps you mean regular roads? The roads made for everyone.\n\nSure, very few are targeted, but it's to many and there are far to many cases of gross negligence."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "OP, we *do* use sex toys without shame — at least many of us do.\n\nAnd I don’t think it’s “universally” accepted that women use sex toys, and certainly not “universally” accepted that men use them.\n\nBut as long as there is kink, there will be kink shaming"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I believe that’s just a fact of life."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Dildos cause ovarian and colon cancer because of chemicals"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In addition to what other folks have said, I think they tofu generally available in the West (outside of dedicated Asian supermarkets) is a bit crap"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It has a mealy texture and a weird flavour"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But then I'm a fan of silken tofu, so maybe that's why I don't like the firmer stuff."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah you are a weirdo"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Never go full utilitarianism.\n\nJust like not trying to save a person because they have low survival chance"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So it is better to donate their organ to 5 people"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Every life is valuable so 5 lives is better than one life or potentially 0 life"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's utilitarianism.\n\nAnd you assume people don't change after a mistake, so it is better kill them if they show bad behavior even when it had not happened yet.\n\nThose are crazy thoughts and hopefully you are not in charge of anything."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not unpopular for Sinosphere countries."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "as long as they’re respectful i don’t care"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "don’t come over to my place and complain my apartment is messy or cramped or my couch is uncomfortable"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "that’s just bad manners"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "get a hotel if you’re gonna act like that."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This goes for all tech"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The 80s, 90s and 2000s - each generation of everything was substantial.\nPC - you needed to replace every 3 years, just to be able to keep playing the latest games.\nConsoles - huge differences between PS1, 2, 3 less so with 4 and even less with 5x\nMobile phones - again"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now the yearly release of a iPhone is meh… where as the 3, 4, 5, 6 upgrades were significant."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Except the guy whose socks keep going missing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you can’t relax and have fun without being insecure that someone is better than you at something, that’s a you issue"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Since when does ejaculation cause uti's?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have an uncle like that.\n\nBut I work in education so my vacations time is written in all calendar in France"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So at least he looks it up and only comes when I am off"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "(And yes, I'm always here because I am not making enough to travel during high seasons)."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Those are gross, old fashioned and most women find them a turn off"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What about pizza hut with their stuffed crust pizzas?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "you're the type of person that watches spin offs of terrible tv shows."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like many many dildos? With the balls and veins..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah I know what that is but he didn’t say Loofah he said Pouf."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your submission has been removed as the title has less than 3 words in it, and therefore likely breaks rule 1"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Feel free to repost this ensuring that you state an opinion in your title"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I might be a rarity, I've never seen an issue with either sex having toys"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My partner and I both have a collection."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No, not really"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "She’s just not that good, some people are ok with mediocrity though."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I had no idea people even liked it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Happy cake day broski"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think it's also that the vast majority of women's sex toys look like coloured lumps of plastic and a large proportion of men's are disembodied chunks of female human anatomy, like something a serial killer would leave a crime scene with"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like the men's ones aren't just about sensation, they are trying to look like human parts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even the name \"Fleshlight\" is a bit creepy and they were making them to match actual women's vulvas at one point"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It takes it a lot further than a simple vibrator or dildo and you also get the guys using them commenting that this is the only part of a woman that matters etc, so there's an association with incels and creepy men"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And yeah you can get dildos that look like penises but they are the minority and often targeted at men, or for comic effect too"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have never met a woman who uses or wants one."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A good thing for society.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Probably not for their loved ones"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "At some point it's not an 'accident' if you are intentionally driving recklessly and breaking laws because you think you are bulletproof"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Would you mourn someone that killed your loved one on the road because they were intentionally driving too fast or weaving in and out/cutting people off?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Because you're barefoot, toes in the soft sand, the white noise effect of the waves in your ears, wind in your hair, that really important thing you're worrying about at the office or work fades into the background and you're just a guy walking on the beach like people having been doing for thousands of years before offices were invented"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yea I think this is secretly a popular opinion that others won’t admit lol."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yessss"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He’s just smoking brisket, he’s just smoking brisket"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why would you tell the truth? It's not like it matters, you didn't consume an unknown poison, it doesn't matter how it got there."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Isn’t that a gay slur?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some of the best karaoke moments are after several bad singers getting a surprise of a good one"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "yes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "it’s fucking weird either way"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "although men aren’t objectified the same way women are"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah I never got the big deal about it to be honest"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "1/15 vs 1.2/15 is only a change of 6.7% to 8% lifetime risk..\n\nSo it’s saying that possibly your risk goes from 7 to 8% and probably isn’t perfect since that’s again a confounded variable.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I can see that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I guess unless you were going super fast fudging the number is smarter."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fun fact : Cici means Butthole in Fijian"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is not normal behavior."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hold up, you might actually be cooking here"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ">1/100, and it goes to 1.2/100\n\nYou kinda pulling a number out of your ass"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Bowel cancer got 1 in 15  for men and 1 in 18 for women"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Look, no one says you should stop eating meat or you will die"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But there is a lot of evidence to suggest that red meat is a risk factor"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "When we talk about reducing your risk factors (Im Sports therapy so i know a little about biology), it's about not over consuming and just reducing unnecessary potential risks that will cause you injury or illness"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "For example, if you eat red meat every now and again, you will probably not die"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But if you have it every meal of the day, it will definitely increase the risk factor of illness"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But there is a lot of evidence to suggest an increase, and now this one increase might not seem much"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "0.2 like you said but this is also adding to all the other risk factors.\n\n>Saturated fat is also a bogeyman that probably isn’t as bad as we’ve been told saturated fats review\n\nNow, I wouldn't undermine it like that, but I do believe our understanding of saturated fats might be misunderstood: \n\nhttps://www.mrc-epid.cam.ac.uk/blog/2021/11/30/heart-disease-saturated-fats-foods/\n\nIt depends on the source of the saturated fats you eat from that show a greater increase in heart disease"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And the article doesn't really undermine all the other research"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They seem to focuse on possible bises of some of the researchers, which are fair point"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But there are far more articles says saturated fats cause illness then the one that are mention in the article."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Love it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Especially in a pho or deep fried"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Prefer to salmon or chicken in many dishes."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "a lot of east Asian food (Japan, Korea, china) is more about texture than flavor"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "tofu is a prime example; it tastes like nothing, and with sauce it tastes like nothing with a bit of sauce"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "some find it an enjoyable texture, but us westeners tend to prefer firmer/crunchy textures over chewy squishy soft textures they seem to prefer in those regions."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Uh.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "what did you tell them?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I would argue that masturbation in general is a lot more socially accepted for men than for women."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But anyway, thank you for your comment"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I know that my opinion is highly controversial, especially in a moral way, and I'm not exactly sure where these thoughts come from."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I love the beach, my wife hates it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why are you taking all that shit with you though? Just rock up, take off your shoes and socks and walk in the sand"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There's no need to bring crap with you"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Oddly specific but also crazy true"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It really is"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "as long as it's in the bedroom nobody actually cares dude."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Every life (human or not) is valuable"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But, if a person would kill 2 innocent people in an accident but dies a week before because of speeding on a motorcycle, one life is spared."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That’s a different point entirely to the one about the creepiness of anatomical sex toys"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "[“Herbert required your attention"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Herbert is stuck near a cliff.”](https://imgur.com/gallery/drama-queen-UU3ninr)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I didn’t ask further but for what it’s worth that was me talking to first responders after a car accident, so technically not my doctor, mb if it was my doctor then it would’ve been covered under doctor patient confidentiality, really I’m not too sure"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m not a lawyer lol, just know my lawyer said unless it’s specifically medical don’t tell anyone anything."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Mapo tofu ❤️"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ">Most women prefer toys that don’t look anatomical at all.\n\nYou are missing the point, the point is that women are free to choose from a vast range of options more or less without judgement"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There is even a 30 year history of being able to book \"sex toy [parties](https://www.annsummers.com/ann-summers-party.html)\" to collectively compare options and so on"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I couldn't imagine in 1000 years a group of men doing something like that together as it would be creepy as hell."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then you might want to say \"aspiring writer\" to differentiate yourself from these people who tell everyone they're writing except they never actually finish a book.\n\nAs to why I said we want clever people to do clever things, imagine a scene where Superman sees a big bomb floating 3 meters high"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He then laments that he can't do anything about it, and asks if anyone has a ladder"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You see the problem right? As the audience you're not invested in the scene, you're just confused as to why he's not using his established abilities"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe the bomb needs to go off for the plot to advance, but this is devastating on the immersion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And once the rules of what each character can do have been broken the audience won't feel as much tension the next time they're tested.\n\nIf you need the bomb to go off you need to coat the bomb in kryptonite or something, have a good reason why the character can't do what they normally do"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "For a clever character that could be an emotional weakness, or an ever more clever villain."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Those pizza puffs are next level"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m a big little C’s supporter too"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It was oddly challenging finding a vibrator for someone with vaginismus to try out insertion after surgery made it possible"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Broader selections would help a lot of people feel less ashamed of their bodies and what they like"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Little ceasers more than any other brand gives horrible heart burn"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Growing up we ate it a lot once the hot and ready came out"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Honestly at this point the smell makes me ill"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The only worse pizza is the weird pizza you get at gas stations that is super sweet and has pizza sauce that tastes spoiled"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Something about that crazy bread though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Still heart burn but always liked the crazy bread."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I really doubt it, at least nothing that's as hassle free as doing it \"acoustically\" 😂😂 look all I'm saying is I've had very little trouble getting off with my hand or a partner consistently, I can get there with a toy as well, but nothing I have experienced with one of those toys has ever been like \"i can totally end up only being able to cum this way\" like it can be the way I've heard some women talk about their vibrators or whatever.\n\nThis is totally fine btw I don't need a toy to \"take me to new heights\" or whatever, its more a mental game for me, but my comment was more about how mediocre toys for men are in general."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There is no opinion on the superiority of tofu as a source of protein.\nPeriod. \n\n\nProtein does not equal protein"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's a complex mix of amino acids"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some your body cannot make itself and is totally reliant on you consuming through food. \n\n\nMost complete (veggie) combinations for your body are potatoes and eggs"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also meats are high(er) up there because.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well humans are made of meat also"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It contains most of what you need by default."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I agree 100% with you OP, and I say this as someone who’s dating a professional singer that LOVES doing karaoke"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Upvote"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Waiter waiter \n\nThere seems to be some ketchup in my bacteria and mold"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "![gif](giphy|gECIOj9UDkqwvep8A5)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That should be nice"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Much easier to control."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m flexitarian and I use tofu daily, so versatile"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Silken tofu can be blended into creams and has great texture"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I recently discovered tofu crumbs (squeeze water out of a firm tofu brick and make it into crumbs, then season it with paprika, onion, garlic in a pan) and I use it in so many different dishes.\n\nAnd there’s so many byproducts of tofu that westerns don’t know (I.e Yuba)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I agree"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People who are falsely accused are entitled to the revenge of having their accusers lives irreversably destroyed."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What I don’t get here is…the robots are already here? \n\nMeaning you can get a blow job machine, a technologically advanced fake vagina with more functions than the real thing or a fake tits or a fake ass"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even a whole sex doll.\n\nWhat is the added value of a robot? Why not just buy the sex toys that already exist?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m explaining WHY the answer is common"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is not my unique fucking opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Otherwise female sex toys wouldn’t be considered common as OP points out"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I also never mentioned my own personal experience so why don’t you go shove a sex toy up your ass and leave me alone."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Most women don’t want disembodied penis looking vibrators"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They’re a bit old fashioned, from when men assumed that was what turned us on! Most women prefer toys that don’t look anatomical at all."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Eat lil Cs within 30 minutes and its better than pizza hut by miles,  as good as domino's and can hold up to papa johns"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I was in a car accident, I was speeding 5-10 over I wasn’t sure, the ems from the ambulance asked how fast I was going, and I thought in my head exactly what the comment above said about being honest, so I said “really I don’t know but probably 5 over 10 max”.\n\nLong story short, I was completely not at fault regardless of my speed (other driver pulled in front of me and came to a complete stop) so I was sueing the other driver for pain and suffering and my lawyer said we could’ve gotten more but unfortunately I told ems that I was possibly speeding"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He said never admit to anyone even medical personal anything, unless it’s specifically medical, but I was just in a car accident and they were asking how fast I was going, I thought it was important medically but he said ideally I wouldn’t have told them that and just said I don’t know, but if they ask where it hurts then tell them."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So you just want people to die and think it is a good thing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The ones that are disembodied replicas of women’s genitals kind of do."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I would actually love a dual unit that could automatically transfer the laundry but it would only work in cases where I have nothing that needs to be separated out to air dry, like when I’m washing towels and sheets"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And no I’m not talking about a combo singular unit, those things suck."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "💯"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just say your broke and can't afford to buy a sneaker"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why coming up with this rubbish excuse ?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "**Historic event: an unpopular opinion I agree with.**\n\nMen should buy and use sex toys without shame"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Technologically sex toys for men are quite fancy these  days"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Only thing is to be thorough with cleanup or you’ll get health issues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some men get so easily off with their hand that they can’t be bothered"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But a sex toy could still be a new experience"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s worth trying out, to see if it is more fun."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes the only non-homosexual way to masturbate is manifest an orgasism"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can also go the Mormon route and pray for wet dream"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Disagree"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Everyone knows every dude on the planet jerks off"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fucking a fleshlight is not thought of in the same way"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Did you just wake up one day and think to yourself \"today, I'm going to create the most non argument I can think of\"? \n\nWhat's your beef with this? It's such a weird thing to get argumentative about."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I LOVE TOFU\n\n![gif](giphy|SFK0E6kYjfIlI4xwEr|downsized)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lol tons of women can't even make themselves cum"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Cope indeed."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Q.Q someone waylaid my arguments, better ridicule the nerd!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "> in the same way that male masturbation is viewed as\n\nFalse"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Everyone knows men jerk off"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It is decidedly *not* viewed as the same or with the same stigma as using toys like a flashlight"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why is that a unpopular opinion?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I avoid it because it's one of the most processed foods that's made but I'm not sure if that's a great reason or not given its benefits."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "![gif](giphy|c6W48VCLPF1l8Uu18A)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Umm no lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I am a writer, but not professionally(just because I don’t have a professional credit doesn’t mean I’m not one )\nI’m Literally just a college student"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m still new to storytelling and what makes a story and characters compelling"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I realize by responding to the other answer that I identified as well worded, I could expand upon my post"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But no, I don’t want lazy writing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I do appreciate the sarcasm though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If I’m gonna develop thick skin in the industry, why not experience constructive criticism on Reddit firsthand lol."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm a mountain boy as well; in the times I've lived without any mountains I've missed them dearly and the flatness nearly drives me mad"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "![gif](giphy|xULW8N9O5WD32L5052)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lol I've got the Hugo 2 arriving this week"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I can't wait..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Who tf is doing that, how can you like warm ketchup? It's disgusting like that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Only fridge no pantry!!!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "uh...this whole premise doesn't ring true to me."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A true unpopular opinion take my involuntary upvote"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes, like 20 years ago."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "lol understandable, something can just be so crazy you have to say it’s bait or else it’s like “damn are people really that bad” at least that’s how i’m looking at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I always find it fascinating when a person feels comfortable conflating their singular experience with the experiences of billions of other people.\n\nIt's just so casually arrogant..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes, let's judge something without understanding what it is or what it is trying to do.\nThat is exactly the guide on how to form opinions"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just be uneducated about the subject matter."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "it’s just sort of fallen into modern dialect as being a synonym for bad, i guess"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "this is like saying men need better fitting clothes...\n\n\nI'm sure theres something out there for you."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Shame comes from the inside"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So I hear a lot of.\nI make it a point to be super active still.\nMorning and afternoon and night runs if I can, pumping weights.\nGotta keep that cardiovascular system healthy if you wanna keep going.\n\nAlthough as I said, I have noticed my mood can affect my drive, but it's still just as high as always"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Being single probably helps too."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It depends on what are you gearing up for"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you gearing up for lonely life, it's shamefull.\n\nSo, man's gear that can be used with partner is ok (such as BDSM gear or cock ring).\n\nIt is assumed that some amount of woman's toys can be used during sex"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also, some girls have hard times with fingering"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But if the girl has a library of didlos or male sex doll, that's just as shameful"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is true 🙃"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I had Papa John's today and I was impressed 👀"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The subreddit is living up to its name"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also are you really that dumb to judge a whole tv show based on a single episode"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The side characters are the real charm and they become   satisfying only  after a few episodes ."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't have shame, tho I don't think anything can beat My hand."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe as people are generally getting taller and bigger the seats should just reflect that and give everybody enough room to be comfortable!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Many people expect you to baby them and be with them 24/7 when they’re visiting, touring them, making up exciting schedules for them and things to see, etc"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even if you’re working from home and you make it clear you’re busy, they might expect you to do it around them while they talk to you incessantly"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It leads to unpleasant conversations."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What guy can't use a \"woman's toy\" though?\n\nWhy are dildos and vibrators seen as exclusively for women? Plenty of guys use them too..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "She buys clothes and sells them."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "100% correct"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "huh, then why not just say that instead of calling it bait? i always assume they actually think it’s bait, thanks for telling me tho! never thought of that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People use it to mean \"men's fault\" a lot of the time"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No surprise it has taken on that definition."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even the article you’re linking kind of proves my point"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "18-20% increased risk so let’s say the risk is 1/100 and it goes to 1.2/100 that’s a 20% increase in relative risk between the two but a minimal absolute risk changed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Probably a significant difference but the impact is very small"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And then you have to assume all of that increased risk is attributed to the red meat and not other lifestyle factors which are difficult to control for"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Saturated fat is also a bogeyman that probably isn’t as bad as we’ve been told [saturated fats review](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC9794145/#:~:text=The%20PURE%20investigators%20found%20that,risk%20of%20stroke%20%5B34%5D)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hating fat people isn’t an unpopular opinion mate, it’s the standard"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "OP is a writer and just wants carte Blanche to be lazy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sorry OP but we want clever characters to act cleverly, not grab the stupid ball because you want to stop working early today."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fucking a cold fleshlight is a very uncomfortable experience, it's basically like VR necrophilia.\n\n\ntaking care of a fleshlight is a WHOLE responsibilty.\n\n\nbut tbh it's worth it if you want to have a special lil night.\n\n\nI 100 percent regret throwing mine away years ago.\n\n\nDef not an everyday thing, but nice when Handjalena get boring."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tell to carry her own shit!!!!!!!!!!!!!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’ve seen posts that 20 years ago I would have assumed was one of the most obvious troll posts in the world be 100% played straight today"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s upsetting, and I don’t know how much of that is the Internet rotting society and how much of that is just me getting older"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Probably an even 50/50.\n\nSometimes I need to convince myself something is bait or I’ll actually lose it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s a coping mechanism at this point."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some of us do 8-10 pumps and need quite a lot of tissues then"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So bigger thing is needed."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What kind of dollar store fleshlights are you guys using? I got one from a sex store and it feels amazing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The Big Bang Theory wasn’t anything groundbreaking and didn’t deserve a prequel"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "At this point I’m just glad Young Sh**don is finally over."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Still a psychopath though I’m afraid"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It is so, so bad"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Same with porn and smut, women will yap about porn addictions for hours only to goon for days reading about a dragon violently ripping someone apart with its cock."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Are you reusing these socks? I can’t imagine cumming in something and then putting my foot in it, even if it was washed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Is this unpopular? Do people keep ketchup outside of fridges frequently? Sounds disgusting"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I am here to say that I hate both going to the beach and hiking, thank you."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tofu can even be cooked with meat"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Case in point: tofu with minced pork"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've heard from an ex-inmate that a banana peels between pillows are the closest to the real thing in terms of feel..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Oh man! I feel like there’s some good sociology to be had in here"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s like somehow it’s acceptable of course that a woman need a penis, that she is somehow lacking"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A man, however…"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Look if you can't find a woman you are doing something wrong and that's ok but compensate something with toy IS NOT ok"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Git gud."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men rarely talk about their sex preferences to get shamed in the first place.\n\nAnd if we're talking about podcasts, then ig yeah, instead shaming men for using sex toys they'll shame you for not getting a gf like a looser.\n\nPatriarchy doesn't mean everything is controlled by each individual man, with unlimited control"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's description of society from perspective of general relationship between the genders, steaming from material reality and cultural background"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Materially we mostly don't have patriarchy like decades ago, when women couldn't vote or open a bank account or work"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But most of our population is still culturally in it, either grew up in those times or were raised by people from those times"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Culture change is slow, as we tend to live long and it's hard to change on individual level, albeit teaching children to be open minded, tolerant, and otherwise educating em about world people and science results in better adults.\n\nAlso, while noticeable the old time patriarchy is gone, there are new complex and developing struggles we have to deal with that still perpetuate things like \"women give sex, men receive it\" and other stigmas"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Male loneliness, growing political divide between men and women, social media fucking over with our perception of beauty, parasocial relationships, in US the car centric cities mean you literally can't walk to bar to meet people"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My nephews aren’t impressed by ANYTHING"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "that's not really the point"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can make cardboard taste good if you're good enough, that doesn't mean cardboard is better than meat, which is the title of the post.\n\nI personally dislike the natural flavour of tofu, that doesn't mean it cant be masked with other flavours, but its original flavour is not to me liking."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Calling a take “rage bait” is usually just another way to call it bad, i don’t think most people who call them rage bait actually think it’s bait"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If it doesn't run on a diesel engine, it's not a real sex toy!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "On the physical level a lightning style connector is more robust"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If Apple worked together with the USB folks, then lighting could have been the universal connector type c is"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They didn't and used their own outdated standard without upgrading it, so on a feature level lightning is just outdated."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Drinking alone is fine"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Binge drinking alone is dangerous"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What 300lbs are you lugging to the beach god damn"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Plus for someone who supposedly enjoys hiking you cannot handle some sand walking? Got damn you must be out of shape, just stay indoors then."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What??? 🤣 Can you elaborate"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Does this mean like some low angle/pov shots from down below?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not the best, but they're good for how cheap they are"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Unfortunately the one by where I live is ran by idiots who can't even cut their pizzas properly."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like, what else are they gonna do with the flashlight?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Would you say the same about a male sex doll for women and gay men?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Try ones that go in your butt."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Papa John’s the goat"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Robot underlads"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "kinda true"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Masturbation has not been a problem for thousands of years but suddenly it is? It’s the excessive porn consumption that is more of a concern."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I used to love little ceasers, but the one by me has been nasty for the last like 5 years"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Do not do this in a prone position that leverages your body weight to put pressure on your bits"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That shit is about the worst thing you can do with regards to desensitisation, can lead to serious ED problems."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Former little Caesars pizza Maker here thanks for this!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Never thought about that but you're right"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Makes me think of how the only dildo sizes they have are fuckin 10+ inches which doesn't leave many options for people that like something a bit smaller."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In my opinion, not at all.\n\nI made the mistake in confusing your series of replies to be the person you were initially responding to who found the torso toys to be creepy and for that I apologize"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I just figured I'd refute the notion that all guys care about is a hole\n\nI would assume some of the reasons for the female version of toys with torsos to exist are similar: every partner I've been with sure seemed to enjoy putting hands on pecs/abs while riding on top, plus the base is more sturdy with the additional weight"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you're willing to spend the money, the Lelo Lokie Wave 2 is fucking amazing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Omfg 💀😂"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "woods and a lake do everything you just said dude"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Unless you’re doing the 2 for $6.99 deal at dominoes you shouldn’t be shopping there"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No women need to boil it, only rinsing it off will give you a yeast infection."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "man istg everytime i visit my aunt in England we go to the beach"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I hate it, there are so many fun activities we could do yet we lie down on a towel looking at a big big pile of water"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ugh."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It was wasn’t bad… mostly because I switch the the aisle seat for a family with a baby could sit together"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The idea of a group of men getting around someones house for a social evening with some nice drinks and snacks getting fleshlight demos does tickle me a bit"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I feel the same about both shows"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you have to experience people like Sheldon in real life; it's not cute at all"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I find that a lot of people who enjoy this show have about equal social awareness as Sheldon as well."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well I wouldn't know myself, but OK, let's assume all that is true, is there anything \"creepy\" or \"degenerate\" about any of that?  It there anything that stands out compared to some 8 inch veiny dildo complete with balls, etc that are commonly sold?\n\nI'm just not seeing it and view the reactionary suspicion to be suspect."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You mean it's not normal to open with that during a job interview?\n\n\"Do you have any questions for -us-?\"\n\n\"Yes, how do you feel about my sex toy collection?\" \n*Opens steamer trunk to play show and tell*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Kalsarikännit ftw"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "All four of my kids are black belts and none of them have ever been in a fight"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Martial arts teaches self discipline, not violence."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I didn't even bring up scurvy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Wtf you on about."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "How'd this wasp learn how to type?\n\nI've had wasps decide to nest right above my doorway and get pissy when I walk under them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I've been attacked just for entering or leaving my own house"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They're assholes, not amazing.\n\nr/fuckwasps"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The topic of the current Ukraine and Russia war is quite sensitive and we ask that all posts about or in relation be had in the politics megathread"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Thank you and enjoy your days!\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "![gif](giphy|iAXf0xpRBtx9KPK0E7)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You're correct"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If I want good pizza, I will pay $20-30 for a large pie at a good local spot.\n\nIf I want fast food pizza, I can get a solid ass pie from little Caesars for a lot less"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Domino's and Pizza Hut are just getting way too expensive for the quality now, especially pizza Hut"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They're getting over $20 for a cheese pie which is insane"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Those both are of pretty much the same quality to little Caesars and charge so much more.\n\nLittle Caesars is the king of fast food pizza to me\n\nIt's not great, but you get more than what you pay for."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Love mapo tofu with spring onions 👌👌👌"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Okay? Murder is wrong and water is wet lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What the fuck even is this?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I mean, it’s not surprising that they come to that conclusion considering the correlation that exists between the two groups, but it’s just that they have the reversed the causation"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "“Feminine” men are more likely to choose a vegetarian (and by extension, a soy based diet) than more “masculine” men."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I 100% agree but there is just something about fleshlights or whatever sex toy is suppose to look like a womans body or parts that looks like a cut up corpse"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It looks really fucking weird."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You have forgot Indian dishes that can substitute paneer for tofu"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "????? Can you be normal for 5 seconds? Get help"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Reminds me of that old SNL skit, Appalachia ER."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "well im romanian so"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There Are Videos of Drake Talking to an underaged Girl Kissing her and telling her her breasts feel good 🤮"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tbf I wasn't the pull up guy but I was the top part of the flexibility and pacwr test and at 30 it means fuck all because I'm sure I'd die or pull something if I tried to do either part of them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So like I said, you don't actually give the guards this stupid little self righteous speech you've printed here"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Because I will say that acting like an idiot is more likely to bring you MORE scrutiny and not less"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even if you didn't actually steal, saying that showing your receipt to the security guard is too hard unless you're paid is really going to sound suspicious"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't really hang out with dumb people, but I've known them throughout my life through classes and hobbies and such.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "people who get on their soapbox about things like this always come out the loser"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The guy who challenges the security guard who asks to see their receipt at the door? Well, let's just say that it doesn't result in the guard agreeing that they don't have to show it and just letting them go"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some people have lots of stories about little things like that and don't grasp that the reason this sort of thing keeps happening to them is that they KEEP going out of their way to piss off people they really shouldn't piss off"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's like if you get pulled over for a minor traffic infraction"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you're calm and polite, the cop will be lenient with the fine because they have some leeway they can use at their discretion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But if you act like a total ass and tell the cop to go and catch some real criminals instead of bothering you because you were speeding.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "yeah, they're going to hit you with as many infractions as possible and the biggest fine they possibly can just because they can"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ":p"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Or GOW Ragnarok"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That one’s wild"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hey, u/WhisperBorderCollie"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Politics is a banned topic, full stop.\n\n**DO NOT ATTEMPT** to evade our filters to continue posting about politics or anything in relation; We will swiftly respond by placing a permanent ban on the accounts that choose to ignore this advice.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Their 5 dollar pizzas in the mid/late 2000s were crap but great for when you found a $15 gram."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They're the best cheap pizza.\n\nBest fast food pizza period is Round Table"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fight me."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I haven't watched the show"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just in general, anyone judging a show based on one episode is not worth listening to."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You also miss out on the fact that women who've been raised .."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "let's call it 'too traditionally to be healthy' see sexually satisfying their man as part of their reason for existence, and for a man to want to just jerk it means that it degrades them and lessens their value as wives and women.\n\nAs far as testosterone -- that's true, when they're young"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "When people get older, it's reversed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm an elder millenial, my GF's a few years older than me, and holy shit she goes through phases where she's insatiable, lol."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "W"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I just want to say I have never in all my years of life had a conversation with someone where they said \"men shouldn't use sex toys\""
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ever"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I see it all the time on the internet, but IRL I don't think anyone gives a flying fuck"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's not everyday I follow people, much less on reddit"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But when I do, I know it's damn good."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Big bang theory is nerd blackface"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Young sheldon is a decent show, I can understand people that don't like his childhood persona though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But I was a little know it all and I find him to super relatable lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I know thank you sweetheart.😘😘"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Amen"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Their weird calzone thing they had for a bit was delicious."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The torsos provide things that flashlights can't:\nThe feeling of weight on top if they want to lie on their back, a pair of cheeks to grab/hold/squeeze/slap/look down at if simulating doggy, the feeling of skin on skin in multiple different positions, etc."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Commodore Vic20> commodore64+IBM XT>Amiga500> Atari Lynx> Sega Master System 2> Super Nintendo>PS1>PS2>PS3>PS4>PS5>PSVR2 also several pc's over the years\nIt's always been a good game is a good game to me.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Graphics have never been as important as the game design and my ability to immerse in it..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Pretty sure I could go back to c64 games and (if I only had the time) I'd enjoy them all the same"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I remember playing dungeon crawlers as a kid where the monsters were represented as x on a black screen with ascii graphics drawing the dungeon from above"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just as fun as gt7 in vr now"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In saying that modern warfare was just as amazing on ps3 as it was on ps5."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Oh"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Oh no...\n\nI need to call my boyfriend and let him know."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Brother, no one is getting scurvy because they replace meat with tofu."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There are biological reasons for a lot bad things humans do/ have done/ will do"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's not a very strong argument."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't even know what the alternatives you need to beat here are: Papa John's? pizza Hut? My impression is that fast food pizza chains in the US are super low quality"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You noticed only now there’s a omnipresent double-standard in modern feminism / society in general ?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I used those examples (I could have the details a bit wrong - it was while ago) because I actually saw them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The glasses one was, literally, someone accidentally forgot their glasses somewhere (I think it was in the floor) in a gallery and people gathered around like it was the Mona Lisa"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you want to have a conversation about whether or not that’s art, be my guest"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "To me, it’s just someone who forgot their glasses somewhere."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "idk, I feel like more than half of earths population (entire asia) would probably agree with this opinion."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Funny you mentioned this"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I recently had a job interview where the interviewer mentioned her own age"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "She is in her 30’s and fairly high up in the company"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I thought it was odd, and now I realize that she is overly proud of being a young-ish person in that role."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "cheers."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m curious"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tell me about naps 1, 3, and 5"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "How long is your list of ‘best naps’?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Frankly I doubt men talk about these things more than women talk about their toys (basically never).\n\nAs for \"child sized\" dear god that's a real reach, and something entirely different."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I always assumed that was scripted ragebait"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I know some women are hypocrites but come on..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I love little caesars, and I'm sad I know so many people who don't"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's just people I can't enjoy it with"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tragic"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a guy I enjoy toys, wife and I both have them and play with them with each other or solo just adds another dimension to a fantastic sex life"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Cockaine is a hell of a drug."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Cool take, where's your evidence on it?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "How do you expect to make some crazy human/fungus hybrid like that, hmm?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "OK, what do you think then."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We do understand the mechanism at play, tho"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "For example: when a chemical in red meat called haem is broken down in the gut, N-nitroso chemicals are formed and these have been found to damage the cells that line the bowel, which can lead to bowel cancer"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "https://www.cancercouncil.com.au/1in3cancers/lifestyle-choices-and-cancer/red-meat-processed-meat-and-cancer/#:~:text=For%20example%2C%20when%20a%20chemical,when%20processed%20meat%20is%20digested\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC10577092/#:~:text=Heme%20iron%2C%20which%20is%20abundantly,the%20formation%20of%20DNA%20adducts\n\nAlso red meat has a lot of saturated fats"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And we know too much of saturated fats cause heart problems and strokes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like I'm all one for a good steak"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Love a beef roast and a pork joint"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But I know all these can increase my risk of illness"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There are better meats like chicken and fish"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We shouldn't brush it under a rug"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As the science on this back up by a lot of evidence."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yet real life people do illogical and inexplicable things all the time"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I hate when that happens"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes Becky, I know this is the 15"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm buying but I'm building up a harem with different hair colours based on people I know IRL"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes, there is a Robo Becky too"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now mind your own business."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I meant that yes it's a thing as in SOME places do it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There's a nationwide electronics store that does it and has been doing it for a very long time in Australia called JBHiFi.\n\nYou must show your receipt and let security look in your bags so they can make sure you've paid for all your electronics"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's not like it's hard - the person who checks you out puts your items in a bag and hands you the receipt, so you only need to show them the receipt and hold the bag open at the door for the security guard.\n\nLike I said, that's been their policy for quite a long time, we all know that's how they do things so if anyone objects to such a practice I would assume they would just shop somewhere else"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There's no point whatsoever in going into a store with this well publicized practice and then having a temper tantrum when the security guard treats you exactly the same way as they treat everyone else"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You won't get anywhere and the cops won't come and arrest the guard because you interpret store policy as an 'accusation' that you stole something without any proof when it ISN'T that at all."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "you can't really have any opinion on something you know nothing about."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My regret as a man is not buying a sex toy sooner"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm glad we finally now have a meaningful selection of pleasurable devices to use"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That selection exists because that stigma of shame is outdated and finally starting to fade"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't experience shame enjoying my body and I don't think anyone else should either, no matter the gender they identify as."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think this guy eats Cheetos puffs in the morning and doesn't wash his hands until 8 p.m."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ">Bonus it can also be used as a club. \n\nJust how well-endowed _are_ you??? 😝"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "FINALLY SOMEONE SAID IT, 💯💯🗣️🗣️🗣️🔥🔥💪🏻💪🏻💪🏻"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's not at all true in my social circle"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There is no shame"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My exes all found the though of me using a toy to be hot and wanted to see me use one"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then we both used different stuff together.\n\nJust have fun, people ! Shame is dumb."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Drinking every day is courting alcoholism."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men can do anything they want without feeling shame"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That is the perk of being a man, you don't need to follow the stream"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So don't complain and live as you wish"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Too much concern about what other people would say is unmanly"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No drinking should be encouraged."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just a heads up, when I managed a lil c boys years ago, I was impressed by their pizza making"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They make the dough in house, but everything else is shipped in"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "With that said though it was really good"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They also had that garlic sauce in a HUGE container and I would make a cup of it to have over the shift"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also - the “hot n ready” pizzas and dishes are thrown out (discarded) really quickly, so you will get a relatively fresh dish when you go there"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The discard goes to the employees (thank you)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Compare that to the “authentic New York pizza” shop I worked at that would let slices sit for 4-6 hours and still serve"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now, if it was really authentic New York pizza they would have let it sit for at least 10 hours"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I wouldn’t say the show is amazing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But it isn’t that bad either"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s basically cliche humour that’s appeals to a general audience for casual viewing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "idk where you're from but they're equally common in asia"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you want an idea, if you’re a systems guy - create a terraform repository in GitHub and hook it up to GitHub actions"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What happens is, you push a change to the repository, review a pull request (optional), and a GitHub actions runner executes your terraform code"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Think like, adding a new server or deleting one"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That can be accomplished in this way"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "https://spacelift.io/blog/github-actions-terraform"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I prefer the seat in our cross country high speed rail...oh wait."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Couldn't agree more.\n\nPersonally I don't really see the point in getting a toy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My hand works just fine"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But to each their own."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "She looks like a One Piece character"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Americans just have no idea how to cook and think its supposed to be eaten raw"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is reddit, you dont have to censor the word shit"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why did the sperm cross the road? Because I put on the wrong sock that day."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tastes more like Pizza Hut than Pizza Hut."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ok, a dragon feels bad but certainly not as bad as an ape."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Horizon forbidden west does not stand out to me"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I mean putting zero dawn vs forbidden west side by side, and then you compare them with FF X vs FFXIII side by side.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah, they look like they have no improvement tbh"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Whole lotta words, seems like the entire first post could be broken down to \"be yourself and don't force your views on others\"  no need to write a book twice the length of the bible for that\n\nIt's also not an unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "How the fuck did you interpret my response as meaning that I think Little Caesars makes the best pizza?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post belongs in the race issues megathread pinned to the top of the front page of this sub"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes, this includes posts about being a white male"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "**Do not message the mods if your post about issues related to being a white male belongs in the race issues megathread**"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The answer is yes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Life isn't fair dude"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Offensive? Being shamed over sex habits is now offensive? Harmful? Dude, we still mutilate babies' genitals, I need you to understand that you're ability to pleasure yourself without shame isn't that important"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What makes me say it? Because it's seems like these behaviors have always been shamed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe there's a reason for it.\n\n\nOffensive? What's offensive?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Or you can just cum in a tissue and throw it in the trash.\n\nOr you can cum in your hand and wash it down the drain.\n\nOr you can just cum in the toilet/shower.\n\nAll these things prevent needing to wash a nasty crusty sock."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Superior protein? It's PCDAAS score is 0.7..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I dont know how that cucumber got there.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "what, are you a cop?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I got a lodge cast iron pizza pan"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I had been cooking pizzas on pizza stones for ages"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lifechanger"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Gives them a perfectly crispy crust, whether I make it from scratch or use a frozen pizza"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Highly recommend."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is a strange take"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's probably the worst of the chains, at least here in Canada"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe it's better in the US?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah, I think I need to update my brains firmware to stop thinking of solutions like storing on a server to access from multiple computers.\n\nOnce it clicks it will be a great resource, and a good thing to learn for the professional space.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "its just a bit clunky trying to get started with out having someone be an idea springboard."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You cooked, take this upvote-"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Young Sheldon is farrrrr better than Big Bang"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like shockingly better."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Patriarchy doesn't mean men are behind everything? It's about the general relationship between different genders in society, shaped by material reality, cultural background, etc.\n\nDecades ago women couldn't vote, open a bank account, only real control they had was who they show affection to"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In short, women generally give sex, men generally receive it, and while nowadays materially we don't really live in a patriarchy anymore, culturally it's still ingrained in society as your parents and other older generations either grew up in the timed where societal roles were much more enforced, or they were raised by parents with said views.\n\nHence partially why generally male masturbation is seen as pathetic (failure to get a woman), while female masturbation is generally seen as empowering and liberating.\n\nNow, how does the toys objectifying women part come into this? I don't know, I'd confidently just say the women that said it were both stupid and ragebaiting for views as everyone with a podcast does nowadays"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There's not much more to it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That claim can't be backed up with anything logical."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men get made fun of for a lot of things women would never."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Do you owe child support to a fleshlight or something"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Because I've had plain tofu many times"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The floor mattress theory of sex toys"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In public? In public, right??"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That deep dish personal pizza combo is where it's at."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Those things always makes me thing about [this 911 call ](https://youtu.be/JvHuPYv6UH4)\n\nAnd I'm guessing some women could use that advice too, even though I did read that most people who seek medical attention for that \"accident\" is men.\nI'm guessing this could be because of how it is less accepted for men to have sex toys, so they improvise instead of getting a real toy that wouldn't get stuck inside.\n\n\nBut on this subject and women: There was a girl at my school, when I was in my teens, who used a hot dog and she accidentally broke it and while panicking about it or something she ended up pushing it upwards(using the front door) and couldn't get it out since she was so tensed up because of it, so she had to go to the hospital and get muscle relaxers or something."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A loofah"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The scrubby things that are like a ball of fine plastic mesh."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My sex toy is drugs and porn"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You stick your hands up your ass?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Man i love train"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "1 to 2 is quite a jump if you consider FF X to latest ps1 game"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Otherwise early ps2 game still looks more or less the same with FF IX graphical wise"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I feel like ps3 jump is almost as big since most ps3 game on release are drastically prettier"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ps3 to Ps4 is definitely less impressive but still wowed you nonetheless"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think 4 to 5 is the exact point of diminish return"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I honestly cant differentiate ps4 to ps5 graphics."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "On the contrary, most martial arts teach discipline as well as expose individuals to the fact that there is potentially always someone who can take you down.\n\nFrom my experience, those that practice martial arts tend to have *more* self control than those that don't.\n\nI think you'll find that the idiots who resort to violence quickly are rarely trained martial artists."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You gave the digust chills from reading this."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah, when I finally earned solid money and moved I made sure that I could at least accomodate 4 guests for sleepover at any giving time so that family and friends could just stay when they want"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But just because I am generally open for it, doesn't mean I am always open for it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I feel like op has problems putting up boundaries outside of a general yes and no"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like, no one needs to take a holiday for family staying over and you can just put them up to clean or cook."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is the same reason you're quitting Reddit, right? You wouldn't want to program yourself on the internet for social interaction!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes, but then you have people who think they can't *possibly* have an alcohol problem because they only go out for alcohol, but never keep it in the house so they \"can't drink too much.\" \n\nIf having a drink or two by yourself in your own home is likely to contribute to or trigger an ongoing problem, the problem is not *where* you're drinking, but how much you're drinking and why."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I made some crispy tofu not long ago and it's so good"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Even then taste is unique to everyone so no taste can be universally loved or hated"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now the protein amount can be superior or worse depending on the food but taste is not universal"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't mean to out myself, but...Tenga 3D"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just turn it inside out (outside in??? idk) and you can clean it in 5 seconds"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No assembling or disassembling"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Feels great (to me anyway)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You're welcome!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They're not, if you know that you had unprotected sex"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But whatever"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It also works if you are 8 weeks along.\n\n\nYou had the first abortion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That sets off the timer"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then you still have a whole month to recover your fertility (very plausible in a young woman)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then another two months of the child developing for the second abortion to take place.\n\n\nIt's possible!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nobody should be able to use sex toys without shame."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But he’s not the focal character in BBT"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "when a girl buys a vibrator, its seen as a bit of naughty fun"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "BUT when a guy orders a 240 Volt FuckMaster Pro 5000 blowup latex doll with 6 speed pulsating vagina, elasticized anus with non-drip semen collection tray, together with optional built in realistic orgasm scream surround sound system, hes called a pervert?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Cope"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "yes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I often hear following reasoning"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Women are allowed toys because they are for quick self help"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But ban sexdolls! Because they look like dead bodies, can't give consent and basically training men to rape women.\n\nThere are campaigns to ban sexdolls"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Perpetum (m)onanyobile"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Only if you like it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People shouldn’t be fucking those guys though."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ah shit, I did not get the memo that I should be embarrassed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Should I start getting embarrassed now?  \nWill the embarrassment police get me if I don't?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think there's been a shift in this in recent years with the rise and normalisation of pornhub and so on"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Back in the day I don't think many dudes openly had porn mag collections yet now it's become more accepted"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe the same will happen with toys in a few years."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A luxury apparently? Extra food Joe"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "😂"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The reason why this is the way can be seen in multiple reasons \n\n1"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Women can get sex anytime they want"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hence using sex toys is a choice"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men can’t get sex anytime they want hence toys are depicted as a “loser” \n\n2"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If men using toys are widely accepted"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Women would be pissed because no one will ask them out for dinners, buy them gifts etc etc etc"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "GitHub just uses Git"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You should learn Git before trying to use GitHub, just like you should learn to add and subtract before trying to use a calculator"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you are just looking for a place to save projects and share them without version control, then GitHub (and Git in general) is not what you are looking for"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Okay well you definitely live a life I don’t :p"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There are plenty of blind people who wish they could experience visual art, though."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm guessing you have not heard of bad dragon"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Maybe not really bestiality themed, but close to it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Although I've not really fully browsed their stuff, so maybe they have it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Huh, wouldn’t have thought about that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Superior in what way? You talk about food and taste"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But tofu is not superior in terms of protein quality to a beef steak"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No plant sourced protein is."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "100% agree, I don't understand the popularity at all."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "i disagree but its good enough that i have a job"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nice stretch of taint never hurt nobody..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There's a viral clip of a woman that was asked what the most evil invention is and she answered a fleshligt"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "When the interviewer asked what about dildos she got furious and short-circuited."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Thanks, I will check that out :)  \n  \nEDIT: So I have started going through the lessons.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "and this looks like exactly what it is that I need,"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Both men and women can be sluts"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like it or not its the truth"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Its up to you wheter to associate with them, like them or whatever"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Period."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sir, you just solved the perpetual energy source."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We reached that point like 15 years ago"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I still feel like we're on the PS3 generation."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Has anyone ever done that? Or have artists deliberately pushed boundaries in order to provoke conversations on the very meaning of art, a conversation that you’re contributing to years later."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That fake butter crap is common in a lot of restaurants"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nobody uses real butter unless they’re high end."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lol, yep"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah… colored and flavored skins and connective tissues are waaayy better than real meat…"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think “Abstract Art” is more what you mean"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Abstract art is more of a vague thing that observers can infer their own meaning from, and yes, it can be made by a five year old child or a chimpanzee."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "nope"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "colleagues or strangers"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": ":P"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The real answer is that some people definitely do fake having adhd because it’s relatively easy to do (unfortunately), and that gets them access to stimulants"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "People that do this are drug addicts."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Oh you have friends! I forgot that people have those :p"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "gigolo exist, bruv."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yes, “modern” doesn’t mean contemporary/current, though that’s what most people mean when they use that word"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "“Prepare to be decimated!”\n\n“What, you mean you’re going to reduce my military force by 10%?”\n\n“No, I’m going to totally destroy you!”\n\n“Oh, then you mean to say centimated, because 10 is deca and 100 is centum.”"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think girls are under-diagnosed because the behaviour is passed off as hormonal"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Much in the same way autism is under-diagnosed in women."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You’re obviously not a cultured woman like [Lindsay Bercosky](https://www.tiktok.com/t/ZTLENPasC/) she fw the whip"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "rlly? all the zoos i been at have miles and miles of land and tons of space for the animals to wander"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "what zoos are u going to? lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Little caesars was the best when i was growing up in the 90s"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We didnt order it that much because they didnt deliver in our city yet"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I still remember the commercials.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "pizza pizza"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I would rate pizza hut the best then little caesars in the 90s."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I mean, they asked, \"what bloke\" so I thought I'd answer them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They're sadly pretty common."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "ChatGPT generated paragraph"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nice!!!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "# ...that little kid is so entitled, rude, and a know it all"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That...is kind of the point of the show lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The character is a child genius that has an incredibly difficult time understanding social etiquette/cues"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is exactly how the character was originally played on The Big Bang Theory."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a lifelong west coaster, I love the beach AND the mountains"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Both are awesome."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "AI personality of your choice will be included."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "wow it will happen soon"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m excited to see where this goes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's the point"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "WTF is leftover fried chicken?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Silken shredded through soup is great, the rest I can take or leave."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They don’t count.\nThat’s like asking a blind person what they think of paintings."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Indeed"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I love the ambiance of the whole thing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "i agree, i also love the lighting too it's dark but also light and got a real vibe to it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "it's also nice seeing all the diff types of fishes too."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ngl I’ve not met many guys who don’t like hearing about women’s toys.\nPersonally I find them fascinating because they’re so varied"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Like I was watching TT of some women who sells them and some of them are ??? The designs are crazy."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Say hello to morbidly obese person to your left, and to your right.\n\nNeither are crazy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "So good luck."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Claim without argument"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Make your case."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Da fuq is a pouf?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yall, yk they just could have parted ways, relationships can end for more than 2 reasons (cheating and death)."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Duck Hunt and pacman 😃"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think a lot of people hate this show, but maybe I'm wrong because it's still on."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sounds like an old Radiohead song"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's because female sexuality is beautiful and should be celebrated, while male sexuality is a vile and depraved thing that's constantly demonised"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's a ridiculous double standard."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Intrigued by all the comments that imply only men can be bad getting their partners to climax or sex in general"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men can usually climax fairly easily, but it isn’t always a ‘good’ orgasm and the way a women is in bed can be a huge part of that (not just talking about skill either; talking about general intimacy skills also)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "in a room full of other ppl?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Only watched 1 episode and already posting hate about it on the internet is crazy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now do game physics"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Half of porn on OF is watching women use women's toys."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Kids over all suck."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s the place it’s coming from"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That has changed for Conor"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He’s legit negative energy now, rather than tongue in cheek/entertainer."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Okay, I'll bite"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If only to see how moronic this gets.\n\n\nGeez, why though? What is it about being a man that makes it impossible to be a whore or a slut?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm supposed to feel shame?\n\nA deusex-machina power outage was the only thing keeping my landlord from showing my apartment with the Legoshi wolf-dong drying in plain view..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Bit too girthy for me"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Need to stretch first"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Literally added just to flex"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I didn't think it was graded"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I thought it was recorded for some study of children's health"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I know I got good grades in PE but never touched my toes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just staying active and engaging is what was graded on.\n\nThis might be dated now and I'm sure there are other places where this wasn't the case."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I like looking at the ocean but it’s hard for me to get excited about going to the beach because i refuse to swim in that dark water"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I will not swim in water i cant see through because sharks and jellyfish and lord knows what all else."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Agedashi tofu with big, soft bonito flakes in the broth is exquisite"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can use alcohol for the euphoric effect"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's what most people use it for.\n\n\nYou can use alcohol for the anxiolytic effect"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Doing so pushes the anxiety away momentarily but it's an unproductive behavior that actively prevents the anxiety from getting better"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You're free to do it, just like how you are free to pick at your wounds to prevent them from healing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Don't fool yourself into thinking it's treatment though."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nah, my mum used to do this back when I was a kid"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s not okay to do so"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s an enterprise application built on top of the Git version control system"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It shouldn’t be thought of as a backup, syncing tool, or anything like that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s meant to track history on a code repository"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s so a team can push code and create releases from select commits and branches, give teams a centralized location to store code, and gives you the ability to roll back to those releases, patch hotfixes into them, etc"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Here’s how I’d imagine a similar workflow that I use could compare"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have two computers and want to code on each of them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I make a few changes on pc1, I commit changes to my repository"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Those are now on GitHub, and not just my local clone of the repository"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "On pc2, I can fetch the changes that I made earlier with a git pull command"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Now I have the changes that I made on my first computer on this repository to work with"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And if I make more changes, I can commit those here as well."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If the \"zoo\" you're going to only has \"tiny cages\", it isn't a proper zoo lol.\n\nAlso, animals may look tired or depressed, but still be perfectly content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You're projecting human traits onto another animal."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think that’s it’s more of a”how they do it”, since women have different ways to get to climax"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men just rub their hand and it’s done"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Women on other hand have often troubles reaching climax so they trying what’s best for them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And also yeah, I can see using dildo or vibrator during sex but not flashlight or blow up doll."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ok Anakin!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Atleast fleshlights are universal in size and shape"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then you look at you're gf's gargantuan dildo."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Better than getting stds and babymamas"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Women’s sexual pleasure actually used to be MORE stigmatized than it was for men, but years of activism and open discussion has shifted the scales"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Men are more than welcome (and encouraged) to do the same thing— if you aren’t willing to talk openly about something, you can’t expect it to become more socially acceptable"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can ask your friends what toys they use, ask for recommendations, etc"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "regardless of your gender."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Franchises are notorious for having variable quality"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’ve had some good and some bad ones but the best part has always been the price point."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Go swimming, play in the waves, look for shells, sit at a tiki bar, go for a boat ride, try surf fishing, float, go shopping for kick knacks, fly a kite, ride a bike, walk on a pier, eat a seafood dinner, have a beer on the beach, play beach volleyball, spot some wildlife, try surfing, look at some butts.\n\nTheres lots of great things to do at the beach."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Mine's like a mf turtle head as of late."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I remember hearing it too"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It was pretty prolific during the 2000s"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He left the show right as someone else with his name got arrested for child touching"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Is what I figure from my 10 mins of searching.\n\nHowever that thought is obviously still around and it was very prolific in the 00s"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you were old enough to remember the 1st steve, and the shows transition more surprised others don't remember"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can find a couple articles touching on the subject but himself wasn't the actual pedo"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Someone else with a different name was."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You’re able to do it, but would you have thought of it? Sometimes it’s the concept, not toil."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "+1 for the chuds who keep posting screencaps from the show on their insta with some cringe lines overlaid."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Right, and that’s unfair on both sexes right? It’s one of those societal prejudices that’s harmful and offensive to everyone - so what makes you say it stems from something biological? \n\nAnd by the way, the way you phrased \n\n>generally seeing slutty women as disgusting \n\nis in itself pretty offensive, I’m sure you get why."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Wtf, people talk about sex toys with their mom? That’s awkward as hell 💀"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nah"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sausage and a baked potato doesn't have the same ring to it as steak & bake."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "potato"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That whole half a calorie..."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "just like diet coke"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This really depends on the people and your relationship with them."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’m the one who got my husband his toys"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He has a whole self pleasure set up in his shower"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "🤷🏻‍♀️"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There was nothing backhanded about that I don't hold grudges I don't really get mad at people I accept everything we've been talking about I really do it's okay my friends it really is I appreciate everything and I accept what you have done and I think it's perfectly Fair"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I do these things with the nothing but s**** and giggles in my heart jokes for folks yeah I don't take it serious I really do mean it I think you're all great people and this is what it's about you know I hope I didn't hurt anybody's feelings"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Not my intention I just like to bust the balls because I have large balls and it gets you know it's in my character I guess have a great night everybody maybe we'll talk again and I'll try to be more Hooked on Phonics."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "https://docs.github.com/en/repositories/working-with-files/managing-files/adding-a-file-to-a-repository\n\n  \nAdding files to a repository is like one of the most basic fundamentals of git"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Don’t do this stuff in the UI, it will only confuse you more by abstracting how it works even more"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a software engineer, understanding basics of git is a requirement if you ever want to work on a team of developers."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Ironically I did just that and they told the cops"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And according to my lawyer it was perfectly legal and I shouldn’t have said anything."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "One of the worst shows ever made."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Every time I eat it I get stomach pains that wake me up in the middle of the night and I sit on the toilet for an hour in agony"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think it’s something in the dough."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Hey, u/WasteChard3488"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Thanks for submitting to r/unpopularopinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Your post has been removed for the following reason: You are attempting to post about mental health which is a banned topic listed in [our wiki](https://www.reddit.com/r/unpopularopinion/wiki/index/)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You are welcome to create a new post within our posting guidelines"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you attempt to evade our filters to continue posting about mental health; you will be banned from the subreddit.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I personally dislike the sauce, and the price is rising enough that I'd pay a couple dollars to get a pizza I'd enjoy more."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "or pay a couple dollars *less* to get a frozen pizza I'd enjoy more.\n  \n  \nI'll still take their pepperoni cheese bread any day though!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have no idea, but there's a trend with people generally seeing slutty women as disgusting and men who can't get partners as disgusting."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "As a massive fan of the show i agree so much"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That little shit is the only bad thing about the show for me.\n\n  \nRest of the characters are awesome tho , especially Georgie and George Sr"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Been a while since I heard that"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I remember everyone saying he was one when the show got a new Steve"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That was ages ago though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "There was one actor who did get in trouble round that time for jacking it in a movie theater.\n\nDunno never confirmed or cared about it and it's just a faint memory now"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "God me rethinking my adolescent days tho."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What it always boils down to is religion, a lot of astigmatisms and the like stem from religion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Some, not all, but some religions really hammer down on sex because it's a form of control"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Followed by a method to gain more followers through closely controlling people into starting their own families and pumping out as many babies as they can"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Given in some religions it's taboo or considered heresy to use contraceptives, similar to how it's heresy to use toys that allow for the spilling of seed as some put it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Given it again boils down to some religionS want all that baby juice to only be pumped into a woman as disgusting as that sounds"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Mormons are a very good example of this, in which a common theme for a lot of teenage and young adult Mormons is to use marriage as an outlet to satisfy their sexual needs"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Given from my understanding masturbation is heavily frowned upon, and can lead to discipline from the church"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Followed by inna typical religious fashion sex is highly controlled by the church to try and pump out as many followers as they can"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Religion can be blamed for a lot of the fucked up laws, stigmatisms, and taboos that exist within society"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's all about control from the public point of view, and non public point of view."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Finally an opinion that actually fits this sub!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This submission has been removed as your elaboration was less than 160 characters (roughly two or three standard sized sentences)"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If you wish to resubmit the post, make sure you include an elaboration/explanation to your post that is has more content"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please read Rule 1, and the rest of them while you're at it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Note that Reddit's character count is unreliable as they count spaces, whereas I'm programmed to not count spaces and there's nothing the mods can do about it.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I respectfully disagree"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Family can stay any time they visit and I'd extend that to friends too"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'll say  with friends I'm a little more particular"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Close friends yes"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Casual friends maybe"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Acquaintance no."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lmao we’re about the same age"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That super (and perhaps the first to overuse it) auto tuned dO yOu beLiEevE iN LifE aFtEr LoVe song had me sure she was 70 when I was a kid watching MTV"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Coupled with my parents telling me stories about her and Sonny Bono, I figured she was born during the depression."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It is deeper than that."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And the cleanup is a pain in the ass"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I even own an autoblow and as nice of a walk as it makes its loud and not discrete in the slightest"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have a partner now so I wouldn't use it anyway but my hands can get me off faster, more reliably and silently"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nice backhanded complement I like it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I couldn't agree more"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I moved back home with my parents last year and, for no discernable reason I can find, this has become my dad's favorite comedy show lately"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "However, I hate it with a passion, to the point that whenever he turns it on, I literally can't stay in the same room because even just hearing it in the background while I'm on my laptop or whatever just pisses me off.\n\nI mean, why tf am I going to find a show funny when its single, unceasing premise is \"smart kid, meet regular people\"...?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Fr"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Where would someone even hide that? Why would they have that? That's just absolutely disgusting"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Do they just take \"him\" in the bathroom and wash him off after? What the fuck?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'drather have great gameplay rather than good or stylish graphics"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That's probably why I love Rimworld"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I hate big bang theory but love young Sheldon!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sure, linked to."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "again"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "These are confounders and you can’t possibly control for everything even in the same person."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Nope"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "A suction cup isn't the same as a life zised doll."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "More amazed that they had him make I through life and never get his ass beat at least once"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Both actors were great but God damn everyone in life would hate him"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Where only a few people would get along with his ego"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Most would at the very least prank and try to be cruel to him for the sake of how he acted."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It grosses me out so much"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Was the Xbox 360 1080p? I thought it was 720p with an upscaler"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Thank you very that is great advice I do agree I do this not only on Reddit but Facebook Instagram and I usually go back and then edit everything because it's just easier that way you know what I mean sometimes I make it before somebody says anything sometimes I don't all good man I don't really hold any hard feelings I just like to mess around with people I think everybody's great I love everybody and yeah you know we all have our own special unique characteristics and I love everything about everybody even you my friend even you"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If everything is fine then judging and looking down is also fine."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This was posted last week"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Toys are a joke"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No wonder you live a miserable life"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Pleasure should be between a man and a woman not a machine !!\nIf you are not pleased enough just do it the natural way.\nDo not program yourself on toys because gradually you’ll be fully dependent on them and lose romance."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Mfs that try to be \"alpha\" and think that all a woman needs is the piss poor sex provided to them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The same ones that see it as intimidating or competition rather than a tool."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Vanilla is shit"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Vanilla bean is heaven."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "what's the point when a game needs 2.7TB for GrApHiCs"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "3 tb hard drives for 2 or 3 games? no Thanks"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Games need to have less money poured into them"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Indie games are incredibly popular despite the low investment, why do \"AAAA\" games need to be pumped full of everything and called a \"cinematic experience\"?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Huh? Literally never met anyone with such a toy."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I felt like the conversation was more about opinions from outside of a relationship, but sure, partners can have one too!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "name one."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What? You have strange acquaintances."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yep"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "South Park is absolutely a great example of \"how to get away with being offensive legally\""
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sometimes the way it turns when it's inside can prevent you from pooping it put because it gets stuck"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also, sometimes the toy may pierce a hole in your intestine and get lost in your abdomen, not very pooping friendly"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Lastly, sometimes it can get way too far high for you to poop it out effectively, your anal sphincter and pelvic muscles are very low you know, and peristalsis cannot help you move a forearm-sized toy from your intestine to your butt"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Bonus thing, to get it out you have have multiple people rummaging through your butthole before they attempt surgery"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Those people are generally males (surgery is generally male dominated) with quite big hands"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm a (female) med student and well, I did see an extraction"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Interesting for me to see, not very fun for the patient."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Tubi + Freevee is objectively the most economical way to stream movies"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Duh."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "What about Sheldon from the Big Bang Theory?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm not saying you're wrong about anything but there's difference there's a difference between God and what the Catholic or any biblical teaching that have been manipulated by men represent that you know it's two separate things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It's not right or wrong you're not winning anything you didn't prove anything I'm just agreeing that I don't agree with what teachings are taught but I do believe that there is a God a greater being or multiple gods"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "My lovely friend"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Rubber vagina? No issue"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Continuously talking about it? Certainly issue.\n\nChild sized sex doll? BIG ISSUE."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The earth shook so much it eventually swallowed her up.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well, in that  case people should use them as a defense all examples covered if South Park already got away with it because of winning court cases A lot of people could probably be safe from being canceled"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Why not go even further and use a headlamp from when fire was the source of light."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If they can make a robot that can move and feel close enough to the real thing"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Goodbye sex outside of breeding 😂 the planet would struggle as no one having kids"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I think it's just too corporate now"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Too much money goes into it and they don't wanna try new things"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They need a return on their investment"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I was born in 93 and maybe kids nowadays feel differently, but that's just me."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "??? Old post I know but when? Its peak was late 80s to 90s and we didn’t access to the internet in this way just that aol late 90s maybe 🤔\n\nI know we had loud obnoxious moms who attacked the show over Bart’s behavior which I assume is why he’s treated the way is now"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "He was what caused the Simpsons to be a hit over all though"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The reason modern day Lisa is so off putting at times to Bart from the audience is they always treat her as a Queen and is always right, it used to be at least treated equally in the classic episodes now it’s like “Lets dump on Bart even when he doesn’t deserve it” Matt needs to have a balance here."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "While reading the comments I realized that the thing that's absolutely disgusting is men talking about it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If I ever found out by somehow accidentally evading a dude's privacy that he uses toys I'd be ashamed of myself, and probably wouldn't think anything of it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "However, if some dude just announced that he was using them I'd probably gag right there"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Same with women"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please keep sex talk at minimum unless its with your consenting partners"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Most people Don't wanna hear It"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Same with masturbatiom habits"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yall might find women talking about it hot but most women genuinely don't think it's hot when yall talk about it"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please stop."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Important distinction that not all traffic stops that result in tickets are arrestable offenses"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In Oregon, for example, most speeding stops are just violations, and aren’t considered a crime that you can be arrested for."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well a properly made sausage (not the ones you get from a supermarket) is always going to be better than a unflavoured unseaned steak"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Considering you can put herbs and spices into a sausage I'll say it's a no brainer."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I’ve never had to tenderize meat"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I know it can be done and has some benefits in certain recipes and preparations, but it’s absolutely not true that “most meat needs to be tenderized”."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "https://learngitbranching.js.org/\n\nThis site is pretty useful"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Once you get the hang of pulling and pushing, which is around 5 commands max, you will be fine"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You can learn the rest as you go no problem."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I have one and have used it like 3 times, because I live with room mates it’s an effort to warm it up discreetly, then have to lube the toy and myself which is messy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Then it needs cleaning immediately and try cleaning that and airing it dry discreetly and you bet cleaning it leaves a silicone and lube smell in the bathroom"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "All this in a house full of people"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "When lubed up it also makes too much very obvious noise that anyone walking past the door in the dead of night would hear"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "It’s just not a practical tool."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yep, this is the answer"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "For women, sex toys are seen as a choice"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "For men, they are seen as their \"only\" option"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Don’t really care enough to change the name but yeah, I’m only skimming post while having a cig In the dark outside, so yeah, it’s straining"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "That aside If you’re gonna write that much You gotta do it like any good book and grasps the reader’s attention with your first few sentences then go on your tangent and rant and people will probably read it."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "also commenting on your own post with nobody else answering"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Makes people stop reading too lol… well good job on that one"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I read the whole thing."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "This is so true!"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Sure buddy"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I wrote a big ass research paper on free speech using South Park as one of my case studies"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "They have amazing lawyers AND that disclaimer at the beginning , which saves their asses in a brief nutshell \n\nI wanna see the scripts BEFORE the lawyers made them change stuff"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "lol 😆 I bet those scripts are insane lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If someone told there is a cucumber in their ass, would you really need to ask how they got it there?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "No, but they are linked to longevity, for example, shorter telomeres are linked to cell senescence, higher risk of disease, genomic instability and lower longevity"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Meanwhile I’m way more impressed by good pixel art than whatever triple A thing is newest"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "And George"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I agree with the sentiment but as a Brit I've eaten lots of tofu in many contexts, never once have I seen \"cold cubes at a salad bar\""
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Are you confusing one country with the entire western world?"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "If I was that would probably get deep at me"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Probably cuts deep that you realize I'm right about the whole proof thing for the bible"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm not going to live forever"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I don't want to wait 35 years to finish a trilogy of video games"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "imagine if every gta took as long as 6 is"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "we'd still be at gta 3 or 4 rn"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I do have to admit I'm very proud that none of you have block and bitched out yet"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Yeah they’re great and the price is really affordable"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "do you know if there is any decent documentation or youtube guides to get you started with the basic workflow of it? I have looked and havent been able to find anything that is either easily understandable, or works for me.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I dont know what works for me yet which is a major part of the problem.\n\nIs there an App that takes care of everything for me so I can move into the cmd line when I am comfortable? or do i need to use the command line?\n\n  \nI find official documentation is amazing for when you have already got your toes wet, but is highly highly confusing when you have no idea what your reading."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "I'm really surprised one of you real big tough people tough guys tough girls whatever you are I didn't pull the old block the account and then you know choose the person of something that's not true at least you're taking the conversation and going with it like you actually have a pair like you have a pair good for you or all of you good you didn't block out and b**** out yet"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We call it toxic pizza, but god damn I love a slice of their cheese pizza."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Americans dont know how to use tofu"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Amazes me how little pushback they get"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You see things getting canceled for much less"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Did a little research it didn’t seem like there was like crazy good lawyers or anything really note worthy that explains how they get away with everything…."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "but I’m glad they do"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "rather not play fallout or red dead with \"cartoony\" graphics, thanks"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "George Lucas actually discusses this on the New Hope commentary"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "The sandcrawler vehicle actually got stuck in the sand and made for a huge time-sink with already limited time to film"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Also, Luke is somewhat based on Lawrence of Arabia, where the main villain is literally the desert."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Oh cool, what kinda flashlight did you get? I got a Pelican 7600, which is a bit expensive for what it is.."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "But since it can do white, green, or red light and has a wand attachment, I used it at my old job to marshall aircraft"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Plus it's blindingly bright"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Always good to have a nice flashlight around."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "🍆🍆🍆🍆🍆🍆🍆🍆🍆🍆🍒🍒🍑🍑🍑"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "In the pantry until it’s open, then in the fridge"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Science."
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please remember what subreddit you are in, this is unpopular opinion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "We want civil and unpopular takes and discussion"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Any uncivil and ToS violating comments will be removed and subject to a ban"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Have a nice day!\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/unpopularopinion) if you have any questions or concerns.*"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Well you only feel shame if you let yourself feel shame"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Just do what makes you happy dude as long as it doesn't hurt anyone"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You live on a ball flying through space at millions of miles an hour things genuinely don't matter in the long term"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "You’re kind of supposed to love your family dude lol"
    },
    {
        "subreddit": "unpopularopinion",
        "sentence": "Plot twist: I can't digest soy, so it's basically a laxative for me"
    }
]