[
    {
        "subreddit": "videos",
        "sentence": "Who?"
    },
    {
        "subreddit": "videos",
        "sentence": "i guess if they used condoms, he can just pretend it never happened"
    },
    {
        "subreddit": "videos",
        "sentence": "Holy 6 hour video, Batman."
    },
    {
        "subreddit": "videos",
        "sentence": "Absolutely love Dust in a Baggie and came here to comment pretty much the same thing!"
    },
    {
        "subreddit": "videos",
        "sentence": "none of those people could drive in LA, wrong side of the wroad or not"
    },
    {
        "subreddit": "videos",
        "sentence": "It's really obvious too, you can see the TV flashing colors and his sticks clicking."
    },
    {
        "subreddit": "videos",
        "sentence": "like, bro, you can't stop for 15 fucking minutes?  \n\nWhat's wrong with you man?"
    },
    {
        "subreddit": "videos",
        "sentence": "Right.  Totally got that backwards, had forgotten tye series was actually retooled"
    },
    {
        "subreddit": "videos",
        "sentence": "Shit, it might have worked if he had GOTTEN OUT OF THE CAR FIRST!"
    },
    {
        "subreddit": "videos",
        "sentence": "This guy is awesome!  His song [\"Dust in a Baggie\"](https://www.youtube.com/watch?v=VFEZOjtrwls) is first song of his I ever heard and I've been a fan ever since."
    },
    {
        "subreddit": "videos",
        "sentence": "I used to have to defend my agency in small claims court and traffic court was right before small claims"
    },
    {
        "subreddit": "videos",
        "sentence": "They had a sheriff watching every person leave court and go to the parking lot if their license was suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "So many people would still drive themselves to and from court and end up getting busted again."
    },
    {
        "subreddit": "videos",
        "sentence": "15 years?!? This came out in 2003."
    },
    {
        "subreddit": "videos",
        "sentence": "That would not have been my prediction! Seems like a pretty buttoned up industry from the outside."
    },
    {
        "subreddit": "videos",
        "sentence": "What are you even talking about?"
    },
    {
        "subreddit": "videos",
        "sentence": "Ahhh…where I learned how to give it hell"
    },
    {
        "subreddit": "videos",
        "sentence": "i mean, one way or another, it feels a lot more realistic for a lonely murderer for hire to abuse his position in regards to the helpless girl, than for him to be the most baby good person in all of france."
    },
    {
        "subreddit": "videos",
        "sentence": "While I agree, get idiots off the streets that are incurring frequent enough violations, or severe enough ones to warrant a suspended license(Yes I know some states it's much easier to hit this than others), we should have a robust enough public transport system you don't need to drive"
    },
    {
        "subreddit": "videos",
        "sentence": "We need better public transit across the board, it should become a federal matter and be funded as such so there is no excuse"
    },
    {
        "subreddit": "videos",
        "sentence": "Busses, trains, etc"
    },
    {
        "subreddit": "videos",
        "sentence": "Let's stop relying 100% on cars."
    },
    {
        "subreddit": "videos",
        "sentence": "terrible road design"
    },
    {
        "subreddit": "videos",
        "sentence": "Trying to debate"
    },
    {
        "subreddit": "videos",
        "sentence": "How"
    },
    {
        "subreddit": "videos",
        "sentence": "No it was realization of creepy old dudes producing a movie."
    },
    {
        "subreddit": "videos",
        "sentence": "Nerd"
    },
    {
        "subreddit": "videos",
        "sentence": "Hmm what can I dig up for karma today"
    },
    {
        "subreddit": "videos",
        "sentence": "driver dude sounds like his name is wendall and orders all his pizzas with a cheesy crust"
    },
    {
        "subreddit": "videos",
        "sentence": "I will make it legal!"
    },
    {
        "subreddit": "videos",
        "sentence": "> I feel like nobody in Australia would risk it\n\nI don't believe you"
    },
    {
        "subreddit": "videos",
        "sentence": "Apparently, \n> after drink driving and common assault, driving without a licence is the most common reason that people are sent to criminal court."
    },
    {
        "subreddit": "videos",
        "sentence": "Public defenders get a bad rap but the truth is they're just overworked"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm very good at my job but if you gave me 10 minutes per thing I had to do no matter how complicated a whole lot of shit is getting done half arsed or not at all.\n\nOn top of that they're not very well paid"
    },
    {
        "subreddit": "videos",
        "sentence": "Average in the USA is 80k a year which is certainly not *bad* but if you're a highly skilled lawyer you can make a whole lot more with significantly better conditions and clients"
    },
    {
        "subreddit": "videos",
        "sentence": "So you need someone who is OK with making far less than they otherwise could or has another income stream to support their good work."
    },
    {
        "subreddit": "videos",
        "sentence": "but it in his BLM blood lol"
    },
    {
        "subreddit": "videos",
        "sentence": "So basically the swamp of Springfield will be lighted up for a long time, all thanks to Mr"
    },
    {
        "subreddit": "videos",
        "sentence": "Burns."
    },
    {
        "subreddit": "videos",
        "sentence": "\"I mean what are they gonna do? *Double arrest me?*\""
    },
    {
        "subreddit": "videos",
        "sentence": "How on earth did he not talk about the actual liquid that goes into them? Surely that's the main thing anyone cares about."
    },
    {
        "subreddit": "videos",
        "sentence": "And who's the fire-damaged Ryan Reynolds?"
    },
    {
        "subreddit": "videos",
        "sentence": "Stop touching me Elmo\n\n\nHave you ever been tickled, on the inside?\n\n\nMore more more AAAHHHHH (toothpaste dispenses)"
    },
    {
        "subreddit": "videos",
        "sentence": "> It honestly reminds me of a third world country attitude"
    },
    {
        "subreddit": "videos",
        "sentence": "Nobody gave a shit about licenses in the Philippines or Vietnam.\n\nTurns out that all over the world there are a whole lot of people that just don't give a fuck about anyone and anything, including themselves"
    },
    {
        "subreddit": "videos",
        "sentence": "They just go about their lives with their thoughts per day stat in the single digits."
    },
    {
        "subreddit": "videos",
        "sentence": "And we wonder why so many men from this generation are into older women"
    },
    {
        "subreddit": "videos",
        "sentence": "> Any reasons urgent enough to drive would be hospital, not doctor"
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah, maybe, but it doesn't matter in this case"
    },
    {
        "subreddit": "videos",
        "sentence": "Most jurisdictions do not outline exceptions for when you can drive without a license"
    },
    {
        "subreddit": "videos",
        "sentence": "The judge can choose the be lenient, but the judge has to be convinced that what you're saying is real"
    },
    {
        "subreddit": "videos",
        "sentence": "This judge does not appear to be a complete idiot, so it'd be hard to convince the judge that you're not just making shit up given what the judge witnessed.\n\n> Public defender knew her client was screwed.\n\nYep"
    },
    {
        "subreddit": "videos",
        "sentence": "And remember she has to work with that judge and the other people in that courtroom all the time"
    },
    {
        "subreddit": "videos",
        "sentence": "By trying to convince the judge of something that is probably just bullshit she does nothing for her client while harming her credibility"
    },
    {
        "subreddit": "videos",
        "sentence": "**A public defender has a responsibility to defend their clients"
    },
    {
        "subreddit": "videos",
        "sentence": "They cannot submit evidence they know to be false.** In fact they can lose their license for that shit"
    },
    {
        "subreddit": "videos",
        "sentence": "Probably not in this case, but these people imagining a public defender with more than 2 brain cells is going to tell the judge a lie (that the judge will see through) are living in fantasy land.\n\nIf there was truly an emergency it will come out later when she calls him, e.g"
    },
    {
        "subreddit": "videos",
        "sentence": "through a medical release"
    },
    {
        "subreddit": "videos",
        "sentence": "She could get in a lot of trouble by telling this guy to go to the ER and say he had chest pain or something just to get the documentation"
    },
    {
        "subreddit": "videos",
        "sentence": "Might be worth a try if I were him, but people blaming her for not even trying seem to forget that the judge saw him comitting a crime and the guy gave no indication in the moment it was anything but routine."
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/elzainy,\n\nThank you for your submission"
    },
    {
        "subreddit": "videos",
        "sentence": "Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma"
    },
    {
        "subreddit": "videos",
        "sentence": "We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "The judge is speechless"
    },
    {
        "subreddit": "videos",
        "sentence": "He’s thinking \"This ignorant bastard…\""
    },
    {
        "subreddit": "videos",
        "sentence": "Most, but not all, were for entry level positions in a variety of areas - one thing I've noticed is that accounting always brings some solid weirdo interviews"
    },
    {
        "subreddit": "videos",
        "sentence": "You done messed up a a Ron"
    },
    {
        "subreddit": "videos",
        "sentence": "So, you’re saying that my constipated baby just needs cocaine?"
    },
    {
        "subreddit": "videos",
        "sentence": "Brook shields in blue lagoon was 14 and it had nudity."
    },
    {
        "subreddit": "videos",
        "sentence": "Now I feel like my YouTube account is on a watchlist"
    },
    {
        "subreddit": "videos",
        "sentence": "Also it's dead obvious who took the money once that account goes active"
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/Winter_Rush1521,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here"
    },
    {
        "subreddit": "videos",
        "sentence": "This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old"
    },
    {
        "subreddit": "videos",
        "sentence": "You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "The soundtrack was fucking exceptional!!"
    },
    {
        "subreddit": "videos",
        "sentence": "Funny part is, Conan ripped off Genghis Khan (well, the author did, but you get it)  \n\n\n“The greatest happiness is to vanquish your enemies, to chase them before you, to rob them of their wealth, to see those dear to them bathed in tears, to clasp to your bosom their wives and daughters.”\n\nHowever, I should note that there is absolutely no credible source linking that quote to Temujin Chinggis Khan"
    },
    {
        "subreddit": "videos",
        "sentence": "It is, however, attributed to him."
    },
    {
        "subreddit": "videos",
        "sentence": "But even then, just turn off your camera"
    },
    {
        "subreddit": "videos",
        "sentence": "Claim you have poor reception and can only get the audio to work"
    },
    {
        "subreddit": "videos",
        "sentence": "Get out of your car and turn the camera on saying that you've left your house for a better signal and can do a video call now."
    },
    {
        "subreddit": "videos",
        "sentence": "We're not talking about \"most people.\" We are discussing people who have had their licenses suspended, like the idiot in this video"
    },
    {
        "subreddit": "videos",
        "sentence": "There is no simple solution to crime, but let's keep on topic"
    },
    {
        "subreddit": "videos",
        "sentence": "This is about a man who had his license taken from him because he did something he knew could result in that happening"
    },
    {
        "subreddit": "videos",
        "sentence": "You're trying to turn this into something it's not"
    },
    {
        "subreddit": "videos",
        "sentence": "Of course public transport should be improved, but you chose this dumb ass to get up on your soapbox? Pick your moments man.\n\nAlso, stop saying \"retort.\""
    },
    {
        "subreddit": "videos",
        "sentence": "Sure, I’m just trying to put enough doubt in the judges brain to not have him revoke the bond"
    },
    {
        "subreddit": "videos",
        "sentence": "I’m not trying to actually convince the judge."
    },
    {
        "subreddit": "videos",
        "sentence": "yup"
    },
    {
        "subreddit": "videos",
        "sentence": "only a portion of people have that"
    },
    {
        "subreddit": "videos",
        "sentence": "even more - only a portion of people can mentally visualize things in their head"
    },
    {
        "subreddit": "videos",
        "sentence": "for others, everything is just abstract up there"
    },
    {
        "subreddit": "videos",
        "sentence": "so they're not hearing a voice nor can they visualize anything in their minds eye"
    },
    {
        "subreddit": "videos",
        "sentence": "so what comes out, comes out, without any sort of buffer or proofreading in the noggin."
    },
    {
        "subreddit": "videos",
        "sentence": "He could have taken a taxi? Have someone drive him? Take the bus (sorry maybe not since it’s the US)"
    },
    {
        "subreddit": "videos",
        "sentence": "Doesn’t sound like a good enough excuse."
    },
    {
        "subreddit": "videos",
        "sentence": "You're point being? 98% of anything you find when searching for that is made by fans"
    },
    {
        "subreddit": "videos",
        "sentence": "The actual games didn't even get a topless scene until Andromeda, 10 years after the initial game (which is what Fox News was sensationalizing)."
    },
    {
        "subreddit": "videos",
        "sentence": "Was that a Conan episode? As he is a _huge_ fan of the Stripes."
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/Eticiano147,\n\nThank you for your submission"
    },
    {
        "subreddit": "videos",
        "sentence": "Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma"
    },
    {
        "subreddit": "videos",
        "sentence": "We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "While currently true, If there were to be a total system collapse, Their \"Wealth\" will cease to exist"
    },
    {
        "subreddit": "videos",
        "sentence": "And if they earned their wealth from the internet, They bring nothing to the table in a post apocalypse society.\n\nImagine looking around the room once the gates are locked.\n\nWhat does he do? Mechanic, blacksmith, Hunter\n\nNext person : Chef and expert in native foods\n\nNext person: UI/UX expert who paid for all this.\n\nYou have a 90 day food supply, But one less person will turn that into a 100 day supply."
    },
    {
        "subreddit": "videos",
        "sentence": "Wait wait wait, ALL THAT AND IT WAS A FREE TICKET!? HE JUST WANTED TO MAKE SURE THEY ALL HAD THE RIGHT *KIND* OF TICKET!?"
    },
    {
        "subreddit": "videos",
        "sentence": "I was in my 40s before I realised that other people can have pictures in their heads"
    },
    {
        "subreddit": "videos",
        "sentence": "I have [Aphantasia](https://en.wikipedia.org/wiki/Aphantasia) meaning I have no mind's eye"
    },
    {
        "subreddit": "videos",
        "sentence": "I just thought when other people closed their eyes they saw complete and utter blackness like I do."
    },
    {
        "subreddit": "videos",
        "sentence": "\"Intriguing query, Genghis\""
    },
    {
        "subreddit": "videos",
        "sentence": "This is my experience"
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/elzainy,\n\nThank you for your submission"
    },
    {
        "subreddit": "videos",
        "sentence": "Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma"
    },
    {
        "subreddit": "videos",
        "sentence": "We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "There is a pretty decent chance that it was not a doctor's appointment."
    },
    {
        "subreddit": "videos",
        "sentence": "Imagine being that actress today."
    },
    {
        "subreddit": "videos",
        "sentence": "this is true of course, but God damn imagine not just getting there a little early and finding a wall to have your court call in front of"
    },
    {
        "subreddit": "videos",
        "sentence": "Bih please"
    },
    {
        "subreddit": "videos",
        "sentence": "The “doctors appt” is the liquor store LOL"
    },
    {
        "subreddit": "videos",
        "sentence": "> It was originally supposed to launch a new series, but they never went forward with it. \n\n\nThat's actually backwards"
    },
    {
        "subreddit": "videos",
        "sentence": "They were in pre-production for a new TV show when a little sci-fi movie called Star Wars came out and made more money than God"
    },
    {
        "subreddit": "videos",
        "sentence": "So they scrapped the show and rewrote the two-part pilot \"In Thy Image\" in to this movie"
    },
    {
        "subreddit": "videos",
        "sentence": "And then a couple of other episode scripts were recycled in to TNG episodes a decade later."
    },
    {
        "subreddit": "videos",
        "sentence": "I remember that post and still can’t comprehend how anyone doesn’t or can’t produce mental images"
    },
    {
        "subreddit": "videos",
        "sentence": "Just black screen?! I can’t understand"
    },
    {
        "subreddit": "videos",
        "sentence": "Yes, Poor things, people will defend the film, but honestly I can't, maybe the book had a \"better\" explanation, about a person discovering itself, that the \"brains\" develops too fast, but when in the movie is the baby brain \"adult\" enough, before the sexual assaults, or when lol, whatever, but still, baby brain having sex + hollywood = ick"
    },
    {
        "subreddit": "videos",
        "sentence": "Great acting, great whatever, but still weird, or maybe is just me and baby brain in a grow up woman body is not that bad and should be applauded? I dont know"
    },
    {
        "subreddit": "videos",
        "sentence": "Holiwood and its fans are weird."
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/Talesofforgotten,\n\nThank you for your submission"
    },
    {
        "subreddit": "videos",
        "sentence": "Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma"
    },
    {
        "subreddit": "videos",
        "sentence": "We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/drveenuagarwal90,\n\nThank you for your submission"
    },
    {
        "subreddit": "videos",
        "sentence": "Unfortunately your account does not have enough karma (both types, there are **two** types of karma) to submit things to /r/videos at this time.\n\n/r/videos requires users to have a minimum of 10 link karma **and** 10 comment karma"
    },
    {
        "subreddit": "videos",
        "sentence": "We suggest that you comment in some popular threads and make submissions to other subreddits to build up your karma and then come back.\n\nWe are sorry for any inconvenience caused, and look forward to your submissions in the future.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "same thing I do with the drugs you don't know I have in my pockets\n\nas they say, signs don't stop crime."
    },
    {
        "subreddit": "videos",
        "sentence": "Sure, do it off camera though ffs lol"
    },
    {
        "subreddit": "videos",
        "sentence": "I loved it, and it left me wanting more"
    },
    {
        "subreddit": "videos",
        "sentence": "Though I admit, seeing the apache just hovering above people's heads to destroy two shop fronts felt out of place and really unrealistic"
    },
    {
        "subreddit": "videos",
        "sentence": "Lmao I hope you're not trying to suggest he didn't have a choice but to attend zoom court while driving"
    },
    {
        "subreddit": "videos",
        "sentence": "the thermocouples used for thermoelectric generators are semiconductor junctions, which is also what solar panels are, so I don't think there's going to be much of a difference in how durable they are considering they are both flat solid state semiconductor devices"
    },
    {
        "subreddit": "videos",
        "sentence": "Used to see this music video every morning before I'd head off to school"
    },
    {
        "subreddit": "videos",
        "sentence": "Something about it I can't put my finger on kind of creeped me out"
    },
    {
        "subreddit": "videos",
        "sentence": "In any case I've always loved how Jack White can switch on a dime between writing really simple stuff like this and absolute rippers"
    },
    {
        "subreddit": "videos",
        "sentence": "To me that's the mark of a truly great writer- Not always writing the most you can simply because you can"
    },
    {
        "subreddit": "videos",
        "sentence": "By the same token Meg is a great musician in her own right"
    },
    {
        "subreddit": "videos",
        "sentence": "I know she caught a lot of flak over the years but she was the perfect drummer for her context and did an amazing job."
    },
    {
        "subreddit": "videos",
        "sentence": "Damn man, maybe you shouldn't have driven drunk after all?"
    },
    {
        "subreddit": "videos",
        "sentence": "Necessary not moderate 💀"
    },
    {
        "subreddit": "videos",
        "sentence": "They tell you your court date in advance, right? Why the hell did dude schedule a doctors appointment not just the same day as court but apparently at the same time? Duuuuude."
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah, this might’ve been funny about 25 years ago when that annoying frog thing came out"
    },
    {
        "subreddit": "videos",
        "sentence": "Now it’s just annoying."
    },
    {
        "subreddit": "videos",
        "sentence": "if by 'not much more durable than solar cells' you mean they'll last until the sun explodes, sure"
    },
    {
        "subreddit": "videos",
        "sentence": "they're literally just bimetallic junctions."
    },
    {
        "subreddit": "videos",
        "sentence": "Aint nobody got dough fo that!"
    },
    {
        "subreddit": "videos",
        "sentence": "Solar hooked up to a supercapacitor bank would be one of the longest-lived persistent power sources if you could find a way to keep the panels clean"
    },
    {
        "subreddit": "videos",
        "sentence": "The biggest issue with solar would be the commonly used lithium batteries degrading over time."
    },
    {
        "subreddit": "videos",
        "sentence": "I’m Macintosh…and I want you all off my property immediately!"
    },
    {
        "subreddit": "videos",
        "sentence": "He's not going to get locked up or anything"
    },
    {
        "subreddit": "videos",
        "sentence": "He's just going to show up, pay a new bond, get a new court date, and leave."
    },
    {
        "subreddit": "videos",
        "sentence": "Recutting a film to match a another soundtrack or album is such a great concept"
    },
    {
        "subreddit": "videos",
        "sentence": "Does anyone have other examples of this?"
    },
    {
        "subreddit": "videos",
        "sentence": "I mean, it's 4 hours into the YouTube video"
    },
    {
        "subreddit": "videos",
        "sentence": "Good chance court hearing was scheduled for 8am and guy scheduled his dr for noon, thinking he'd be done.\n\nAt least waiting on Zoom for 4 hours is better than waiting in the back of the court room for 4 hours."
    },
    {
        "subreddit": "videos",
        "sentence": "Meh, he's just like the country as a whole, we don't really care too much about solving the leading cause of death outside of reporting on it."
    },
    {
        "subreddit": "videos",
        "sentence": "I got one as a rental a few months ago and gotta say, it's fun as hell to drive.  150hp and weighs a bit nore than a riding mower."
    },
    {
        "subreddit": "videos",
        "sentence": "Thank you"
    },
    {
        "subreddit": "videos",
        "sentence": "I am now dumber for watching the whole thing"
    },
    {
        "subreddit": "videos",
        "sentence": "All hail our copy-paste AI overlords that write at a 5th grade level and somehow fool college professors, according to the Internet.\n\nWash it down with a cool glass of twelve penny nails, all the while doing a strange mating ritual that will bring men to a sitting position and women to a greater understanding of themselves"
    },
    {
        "subreddit": "videos",
        "sentence": "Watch him heal the sick; bring hope to the lost!  You'll scream, you'll shout, you'll laugh so hard your lips will touch behind your head!  \n\nAll for one thin dime, one tenth of a dollar...\n\nHuzzah!  Huzzah..."
    },
    {
        "subreddit": "videos",
        "sentence": "I drove one of those for 7 years"
    },
    {
        "subreddit": "videos",
        "sentence": "It was a fun car"
    },
    {
        "subreddit": "videos",
        "sentence": "I still miss it when I hear one driving by."
    },
    {
        "subreddit": "videos",
        "sentence": "Tune into Corn Cobb TV tomorrow to find out"
    },
    {
        "subreddit": "videos",
        "sentence": "so do they just turn around and go home or put it poorly secured in the car?"
    },
    {
        "subreddit": "videos",
        "sentence": "I think people are just saying if he was parked in the passenger seat he would have not gotten himself a bench warrant."
    },
    {
        "subreddit": "videos",
        "sentence": "There was  a movie in the '90's called Rambling Rose with a sex scene between a boy and adult Laura Dern with the boy of like 13 years old (characters age 13, actors age 15)"
    },
    {
        "subreddit": "videos",
        "sentence": "The boy plays with her boobs then masturbates her with his hand"
    },
    {
        "subreddit": "videos",
        "sentence": "I am not sure how, even by '90's standards that was allowed"
    },
    {
        "subreddit": "videos",
        "sentence": "Now in the film the boy is 13 and Dern is an adult and the boy really does fondle her boobs in reality as part of the filming but done under her night gown in the film, but the masturbation scene didn't really touch her genitals but the scene in the movie has the boy bringing her to orgasm"
    },
    {
        "subreddit": "videos",
        "sentence": "I am not entirely clear how this can be made legally, but maybe laws differ for films, not sure"
    },
    {
        "subreddit": "videos",
        "sentence": "But was damned surprised to see in on the screen"
    },
    {
        "subreddit": "videos",
        "sentence": "Would link it but it seems the whole scene is only on porn sites which I don't want to link."
    },
    {
        "subreddit": "videos",
        "sentence": "oh man the judges reaction to the next request for 2-4 weeks was great"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s at least a 50/50 chance I’d say"
    },
    {
        "subreddit": "videos",
        "sentence": "I’ve been to court several times for very minor drug charges and I always wind up getting so stressed out, I’ve bought new suits for court, spent weeks of my life worrying about it, and basically kissed the judge’s ass so that id appear to be remorseful"
    },
    {
        "subreddit": "videos",
        "sentence": "Then there’s these people"
    },
    {
        "subreddit": "videos",
        "sentence": "Sometimes I wish I was an idiot like them so I could go through life not giving a shit about anything, it honestly seems so chill"
    },
    {
        "subreddit": "videos",
        "sentence": "Then again I’m not in jail so I’ve got that going for me."
    },
    {
        "subreddit": "videos",
        "sentence": "Shazbot!"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm happily employed, thanks"
    },
    {
        "subreddit": "videos",
        "sentence": "Doing work"
    },
    {
        "subreddit": "videos",
        "sentence": "Not talking about other people doing work."
    },
    {
        "subreddit": "videos",
        "sentence": "Get a job lol"
    },
    {
        "subreddit": "videos",
        "sentence": "> a receipt for disaster\n\nI think the FBI agent that shot his gun while drunkenly dancing at that club left the receipt in the dancefloor"
    },
    {
        "subreddit": "videos",
        "sentence": "That kid that was literally in class...\n\nIt's honestly so fucking insane for me to think about"
    },
    {
        "subreddit": "videos",
        "sentence": "Someone in high school joining fucking COURT..."
    },
    {
        "subreddit": "videos",
        "sentence": "from their phone in the middle of class and just talking.."
    },
    {
        "subreddit": "videos",
        "sentence": "like WHAT"
    },
    {
        "subreddit": "videos",
        "sentence": "How is what he said remotely pro google? His point was that you can use an alternative if you don't like what google is doing."
    },
    {
        "subreddit": "videos",
        "sentence": "I’m more willing to bet he forgot about court and thought “I’m driving to the doctor” is better excuse than “I’m driving to the store/fast food”"
    },
    {
        "subreddit": "videos",
        "sentence": "I might be out of touch with what the \"Jetset\" are up to these days, but are people *accidentally* taking zoom calls while driving?\n\nI think this is a far cry from the regular ways people might use their phone while driving"
    },
    {
        "subreddit": "videos",
        "sentence": "And lawyers don't just call you the second your docket comes up.."
    },
    {
        "subreddit": "videos",
        "sentence": "you're either waiting in a queue or an assistant will have at least confirmed your connection and availability beforehand."
    },
    {
        "subreddit": "videos",
        "sentence": "that's was 2000s, even 2010s"
    },
    {
        "subreddit": "videos",
        "sentence": "Logan's Run has a great orgy put too"
    },
    {
        "subreddit": "videos",
        "sentence": "I don't agree"
    },
    {
        "subreddit": "videos",
        "sentence": "Character A.I is getting pretty convincing and responds much quicker than a lot of real people I know.\n\nMy review is that they have a difficult time with unprompted conversation"
    },
    {
        "subreddit": "videos",
        "sentence": "Calling them A.I"
    },
    {
        "subreddit": "videos",
        "sentence": "is something I also disagree with because things like Cleverbot and AOL chat bots have existed for years and this buzz word lingo surrounding it is a little bit much to describe a minor advancement."
    },
    {
        "subreddit": "videos",
        "sentence": "Yea, for me there's two parts to my brain.\n\nThere's the underneath thoughts that are formless and wordless, but generate understanding of a situation.\n\nThere's then the above thoughts that have words (or other form of concrete expression, e.g"
    },
    {
        "subreddit": "videos",
        "sentence": "music notation)"
    },
    {
        "subreddit": "videos",
        "sentence": "It used to be that this form of thought was the primary and only way that I could think"
    },
    {
        "subreddit": "videos",
        "sentence": "If I didn't have words for something, I didn't understand it"
    },
    {
        "subreddit": "videos",
        "sentence": "As I grew older, my ability to understand something without expressing it in words also grew.\n\nThere are many concepts that are more efficient to understand if you don't take the time/effort to put words to them"
    },
    {
        "subreddit": "videos",
        "sentence": "I only actively put words to thoughts now if I have to explain to another person, or better explain it to myself."
    },
    {
        "subreddit": "videos",
        "sentence": "> I’m making pico"
    },
    {
        "subreddit": "videos",
        "sentence": "I’m not making salsa.\n\nIf you’re making pico de gallo then you are literally making salsa."
    },
    {
        "subreddit": "videos",
        "sentence": "You don't even need to know your license number"
    },
    {
        "subreddit": "videos",
        "sentence": "They'll generally ask you for your name, date of birth, and your social security number.\n\nThen they'll plug that in the system and check to see if you have a valid license, and that you're the one who's picture is associated with it to make sure you're not giving them fake info"
    },
    {
        "subreddit": "videos",
        "sentence": "Bro said ……ummm"
    },
    {
        "subreddit": "videos",
        "sentence": "> receipt for disaster \n\nRecipe*"
    },
    {
        "subreddit": "videos",
        "sentence": "Off and on"
    },
    {
        "subreddit": "videos",
        "sentence": "Have you been?  Maybe your day's too full of meetings to schedule other meetings about this week's arbitrary changes to make sure the actual workers 'know their place'."
    },
    {
        "subreddit": "videos",
        "sentence": "What a fucking legend."
    },
    {
        "subreddit": "videos",
        "sentence": "ඞ"
    },
    {
        "subreddit": "videos",
        "sentence": "I watch Judge Simpson all the time, he's hard asf but fair"
    },
    {
        "subreddit": "videos",
        "sentence": "He picks up on sarcasm, edginess super quickly and it's always fun to see it never work out for the defendant."
    },
    {
        "subreddit": "videos",
        "sentence": "This edit is cool"
    },
    {
        "subreddit": "videos",
        "sentence": "Sorta like a Cliff notes with a good musical score"
    },
    {
        "subreddit": "videos",
        "sentence": "But this leads me to a, id really like to see a follow up to this story in the current StarTrek universe"
    },
    {
        "subreddit": "videos",
        "sentence": "They discovered VGER was sent home from a computer planet"
    },
    {
        "subreddit": "videos",
        "sentence": "That peaks my interest"
    },
    {
        "subreddit": "videos",
        "sentence": "Why haven't they went on a mission to explore that?"
    },
    {
        "subreddit": "videos",
        "sentence": "Lol yeah lying is the right move there/s"
    },
    {
        "subreddit": "videos",
        "sentence": "New age brakes...\n\nThat're brakes that engage if you concentrate and believe, right?"
    },
    {
        "subreddit": "videos",
        "sentence": "MS, too"
    },
    {
        "subreddit": "videos",
        "sentence": "I have an enhanced carry license and can basically carry anywhere, but the list of exceptions includes any level of BAC"
    },
    {
        "subreddit": "videos",
        "sentence": "Can't carry in a bar without special license, but even that doesn't matter if you're .01"
    },
    {
        "subreddit": "videos",
        "sentence": "Because they’re hosting a server"
    },
    {
        "subreddit": "videos",
        "sentence": "Lol, no shit"
    },
    {
        "subreddit": "videos",
        "sentence": "I still wouldn't be caught driving during my court case over my **suspended license**!!"
    },
    {
        "subreddit": "videos",
        "sentence": "These use thermocouples which I don't think are all that much more durable than solar cells as they are similar"
    },
    {
        "subreddit": "videos",
        "sentence": "I am one of those people"
    },
    {
        "subreddit": "videos",
        "sentence": "The only time I have an internal voice is when I'm thinking of past or possible future conversation or reading a book"
    },
    {
        "subreddit": "videos",
        "sentence": "I never found this strange until a past GF's said her brain never shut off, her internal voice never stopped"
    },
    {
        "subreddit": "videos",
        "sentence": "That sounded like torture to me"
    },
    {
        "subreddit": "videos",
        "sentence": "The only person I've ever spoken to that thinks in any similar way to me is my sister."
    },
    {
        "subreddit": "videos",
        "sentence": "The doctor thing was a lie"
    },
    {
        "subreddit": "videos",
        "sentence": "He was pullin' up to a Wendy's."
    },
    {
        "subreddit": "videos",
        "sentence": "ahhahahhaa"
    },
    {
        "subreddit": "videos",
        "sentence": "Whoever removed it may have been fine if they were able to do it quickly, and then as soon as they took it out realized they shouldn't be messing with it and get out of there"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm not seeing how people buying dangerous activity insurance has anything to do with the gov funding it or defense spending"
    },
    {
        "subreddit": "videos",
        "sentence": "The idea is that the individual pays for the insurance out of their pocket"
    },
    {
        "subreddit": "videos",
        "sentence": "Without the insurance, the gov is funding their rescue, which goes against your gov funding theory?"
    },
    {
        "subreddit": "videos",
        "sentence": "Am I the only one impressed that the public defender swiftly realized the problem, and thought to try a last-minute save in the hopes the judge would grant a delay without bothering to read the charge?"
    },
    {
        "subreddit": "videos",
        "sentence": "Quite frequently it's used by judges to keep the accused in contact with the court system to prevent them skipping out on bail"
    },
    {
        "subreddit": "videos",
        "sentence": "But it can also cause them to face a sentence when they were innocent of what they were accused of, or face their life being destroyed because they're unable to get to work and meet other obligations."
    },
    {
        "subreddit": "videos",
        "sentence": "Everyone has options"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s actually trivial to not get your license suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "The only people I know personally who had a license suspended deserved it"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s not a single mistake"
    },
    {
        "subreddit": "videos",
        "sentence": "This man clearly is not making sound choices"
    },
    {
        "subreddit": "videos",
        "sentence": "The consequences of those choices are his responsibility"
    },
    {
        "subreddit": "videos",
        "sentence": "I like that he clearly has terrible judgment but you act as though he didnt have options."
    },
    {
        "subreddit": "videos",
        "sentence": "Could have been a Reno 911 moment"
    },
    {
        "subreddit": "videos",
        "sentence": "One prosecutor was even doing a facepalm.."
    },
    {
        "subreddit": "videos",
        "sentence": "\"*like, COME ON, man!?! Seriously?*\""
    },
    {
        "subreddit": "videos",
        "sentence": "https://www.youtube.com/watch?v=E551XC6JHkU"
    },
    {
        "subreddit": "videos",
        "sentence": "I just took the motorcycle training course a few weeks ago and two people attending to get their endorsement showed up on their bikes to the driving range"
    },
    {
        "subreddit": "videos",
        "sentence": "75% of the class said they currently ride but didn’t have an endorsement."
    },
    {
        "subreddit": "videos",
        "sentence": "how is someone this fucking dumb"
    },
    {
        "subreddit": "videos",
        "sentence": "Love his work he did with The Chemical Brothers too."
    },
    {
        "subreddit": "videos",
        "sentence": "I agree with your unpopular opinion"
    },
    {
        "subreddit": "videos",
        "sentence": "If they make a mistake, especially a non-fatal one, suddenly it goes from a solo or small group activity to a whole bunch of people's problem"
    },
    {
        "subreddit": "videos",
        "sentence": "Since they're doing something that's already dangerous, if they make a mistake they're probably in a very dangerous position"
    },
    {
        "subreddit": "videos",
        "sentence": "Then, a bunch of people have to enter that dangerous situation, possibly with multiple people needing to risk their lives, to pull them out"
    },
    {
        "subreddit": "videos",
        "sentence": "If that's not a dick move, I don't know what is."
    },
    {
        "subreddit": "videos",
        "sentence": "Just saying \"child\" isn't doing anything here"
    },
    {
        "subreddit": "videos",
        "sentence": "Do you mean unpaid child support?\n\nSure, *some* suspended licenses are not due to being unsafe with a vehicle"
    },
    {
        "subreddit": "videos",
        "sentence": "But many more are."
    },
    {
        "subreddit": "videos",
        "sentence": "Michel Gondry is such an amazing music video director"
    },
    {
        "subreddit": "videos",
        "sentence": "His videos would always enhance the song and didn't take anything away from the music."
    },
    {
        "subreddit": "videos",
        "sentence": "Might as well go in, he's there now:\n\nDude walks up to front desk: \"Yeh, I'm here for Doctor McGillicuddy.\" \n\nClerk: \"$14.99\""
    },
    {
        "subreddit": "videos",
        "sentence": "Child may be referring to unpaid child support, no idea what school could be though, possibly driving too fast through a school zone? That would also be dangerous, so yeah, most things on that list are."
    },
    {
        "subreddit": "videos",
        "sentence": "Gotta say that sounds way too moderate for Texas"
    },
    {
        "subreddit": "videos",
        "sentence": "That is correct, your honor."
    },
    {
        "subreddit": "videos",
        "sentence": "where the hell do you go after flight attendant in the company lol?"
    },
    {
        "subreddit": "videos",
        "sentence": "Bounced Check (1998)"
    },
    {
        "subreddit": "videos",
        "sentence": "Open court is sometimes a window into the fascinating lives people lead."
    },
    {
        "subreddit": "videos",
        "sentence": "probably gonna drive there"
    },
    {
        "subreddit": "videos",
        "sentence": "Thanks for your input tittyman."
    },
    {
        "subreddit": "videos",
        "sentence": "Fuck the CCP."
    },
    {
        "subreddit": "videos",
        "sentence": "Are these entry level positions? I guess I’ve never interviewed anyone I wasn’t pretty sure would be good for the job."
    },
    {
        "subreddit": "videos",
        "sentence": "What a world to be born into, live through, and die in."
    },
    {
        "subreddit": "videos",
        "sentence": "The video title says it's a Wednesday"
    },
    {
        "subreddit": "videos",
        "sentence": "Then again, spending 4 hours in a courtroom probably feels multiple days long."
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah, sometimes it's for not paying child support, or other things"
    },
    {
        "subreddit": "videos",
        "sentence": "It's not always because they were driving recklessly."
    },
    {
        "subreddit": "videos",
        "sentence": "Give me my time back."
    },
    {
        "subreddit": "videos",
        "sentence": "this is the perfect commercial"
    },
    {
        "subreddit": "videos",
        "sentence": "had me dying the first time I saw it on tv"
    },
    {
        "subreddit": "videos",
        "sentence": "Yo foraging is not cooking you nitwit."
    },
    {
        "subreddit": "videos",
        "sentence": "No"
    },
    {
        "subreddit": "videos",
        "sentence": "You're stating (presumably your) state law as if it was the law in the whole United States.\n\nIn Minnesota for example, you can carry in a bar, you can even drink while carrying, but the BAC limit is very strict (0.04%).."
    },
    {
        "subreddit": "videos",
        "sentence": "meaning you basically can have a single drink, and anything more is risky.\n\nThe law, in this case, is designed to allow a person with a CCW permit to have a single drink with their meal when out at a restaurant with family/friends, but not allow them to \"go drinking\"."
    },
    {
        "subreddit": "videos",
        "sentence": "Glad I was not the only one lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Fuck that 'expert' taco"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm throwing that shit against the wall in my mind."
    },
    {
        "subreddit": "videos",
        "sentence": "Like WTH 🤦🏻‍♀️between this clip and the clip someone posted from “old enough for kisses” I feel like I need to throw up"
    },
    {
        "subreddit": "videos",
        "sentence": "👍sounds like you’ve spent a lot of time over at antiwork"
    },
    {
        "subreddit": "videos",
        "sentence": "But he wasn’t driving he was going to the doctor."
    },
    {
        "subreddit": "videos",
        "sentence": "What about my bumper stock,  and or torpedoes?"
    },
    {
        "subreddit": "videos",
        "sentence": "Fun fact:In Dutch, the 500 is nicknamed \"rugzak\" (backpack) because sometimes the driver forgets to release the safety belt before exiting."
    },
    {
        "subreddit": "videos",
        "sentence": "All he had to do was not drive."
    },
    {
        "subreddit": "videos",
        "sentence": "Voyager becoming the god of an alien race is very optimistic."
    },
    {
        "subreddit": "videos",
        "sentence": "Lmao that was fucked"
    },
    {
        "subreddit": "videos",
        "sentence": "You can only drink when firing a muzzleloading smoothbore flintlock rifle and/or pistol"
    },
    {
        "subreddit": "videos",
        "sentence": "No exceptions"
    },
    {
        "subreddit": "videos",
        "sentence": "Cannons are allowed on a case by case basis."
    },
    {
        "subreddit": "videos",
        "sentence": "For comparison there's a dumbass in NY that has been issued multiple gag orders on his case"
    },
    {
        "subreddit": "videos",
        "sentence": "He keeps talking to the press and posting on social media immediately after court adjourns"
    },
    {
        "subreddit": "videos",
        "sentence": "Then he falls asleep in court"
    },
    {
        "subreddit": "videos",
        "sentence": "Dumbest defendant I've ever seen."
    },
    {
        "subreddit": "videos",
        "sentence": "* https://i.imgur.com/5ZUp4QY.gif \n\nJudge be like"
    },
    {
        "subreddit": "videos",
        "sentence": "If you’re caught driving with a suspended license you should be imprisoned for at least 3 years"
    },
    {
        "subreddit": "videos",
        "sentence": "Full stop."
    },
    {
        "subreddit": "videos",
        "sentence": "I don’t agree…Nearly Everyone of them is either about safety or negligence"
    },
    {
        "subreddit": "videos",
        "sentence": "You could maybe make an argument on insurance or court fines but I honestly think there’s a better argument to be made that it’s against a proper punishment"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving without a license- without a liscence you haven’t proven you can safely operate a vehicle\n\nDUI- you’ve shown reckless disregard for safety in operating a vehicle drunk \n\nInsurance- agree not about safety"
    },
    {
        "subreddit": "videos",
        "sentence": "More about negligently operating a vehicle in a way where you may not be able to pay for damages you cause \n\nFailure to appear in court- not about safety… I’ll grant you \n\nFailure to pay fines- failure to abide by punishments received after failing to operate a vehicle correctly in some way (and thus receiving a fine)\n\nReckless driving- unsafe handling of a vehicle\n\nDMV demerit points- achieved through unsafe handling of a vehicle \n\nDrug- I assume another form of dui."
    },
    {
        "subreddit": "videos",
        "sentence": "obtained by operating a vehicle unsafley (ie high)\n\nChild- no idea what this is\n\nLeaving the scene of an accident- negligence \n\nDrunk driving- unsafe \n\nFatal accident- pinnacle of unsafe \n\nHabitually committing traffic offenses- repeated negligence or safety violations\n\nVehicular felonies- gotta be doing something unsafe or dumb \n\nMultiple speeding violations- repeated operating of a vehicle in a manner deemed unsafe \n\nUnderage possession of alcohol- failure to follow rules for alcohol which puts you at high risk for inability to follow traffic rules"
    },
    {
        "subreddit": "videos",
        "sentence": "This one could be argued \n\nUnpaid traffic tickets- as above \n\nSchool- no idea what this means \n\nRefusal to take a breathalyzer test- probably not operating a vehicle in a safe manner\n\nFleeing an accident- as above \n\nHabitual traffic offender classification- as above"
    },
    {
        "subreddit": "videos",
        "sentence": "If it’s a reasonable situation to not have it or an honest mistake I think most cops will let you slide as long as you know your license number"
    },
    {
        "subreddit": "videos",
        "sentence": "They probably figure you aren’t going to start adding felonies to a misdemeanor by giving a false name and license number lol, so if you don’t seem like a possible felon on the run they aren’t going to make a big deal of it.\n\nI think mobile finger print machines also make these situations pretty rare nowadays at least when I live in California."
    },
    {
        "subreddit": "videos",
        "sentence": "Well I guess you get to cool down in jail then lol"
    },
    {
        "subreddit": "videos",
        "sentence": "I for one don't know, but the founding fathers would want us to be able to drink while we have bear arms"
    },
    {
        "subreddit": "videos",
        "sentence": "some people really have no idea how cold and black and white the letter of the law is"
    },
    {
        "subreddit": "videos",
        "sentence": "if you're caught and proven guilty on the other side of it, that's it, full stop.\n\nin this case, i'm willing to bet that he thought this would be allowed bc he was going to the doctor (if he even was) and that having a good excuse, and pulling over as soon as he saw the judge would make it ok"
    },
    {
        "subreddit": "videos",
        "sentence": "whether it's ignorance or excuse, i have no idea, but in some part of his brain, he thought this was acceptable somehow.\n\ntoo many people have gotten away with bullshit and shitty behavior by being an even bigger piece of shit that other people let slide but the law will make sure you pay your price, no matter how shitty you are.\n\nyou see this with people who fight cops and karens who argue with the judge"
    },
    {
        "subreddit": "videos",
        "sentence": "they face their first real hard line consequence they can't talk or argue their way out of they don't know what else to do."
    },
    {
        "subreddit": "videos",
        "sentence": "Possibly, but it was more than a handful"
    },
    {
        "subreddit": "videos",
        "sentence": "My anecdote may be from early on too"
    },
    {
        "subreddit": "videos",
        "sentence": "I didn't keep watching what people said after the first couple months because I had heard enough to turn me off of it."
    },
    {
        "subreddit": "videos",
        "sentence": "Why do so many court rooms look so, shitty?  Like they have duct tape on the floor, the worst looking carpets.\n\nI'm not saying they should be palaces of opulance, but jesus there's some happy medium."
    },
    {
        "subreddit": "videos",
        "sentence": "Huge percentages? Do you have actual data to support this or are you just talking out of your ass? \n\nThe concept is quite simple, follow laws and everything is ok"
    },
    {
        "subreddit": "videos",
        "sentence": "Choose to break laws and have consequences"
    },
    {
        "subreddit": "videos",
        "sentence": "Choose to further break laws and more severe consequences will come"
    },
    {
        "subreddit": "videos",
        "sentence": "I get it"
    },
    {
        "subreddit": "videos",
        "sentence": "This dudes back is most likely against a wall"
    },
    {
        "subreddit": "videos",
        "sentence": "No car is no job and no job is no food"
    },
    {
        "subreddit": "videos",
        "sentence": "He’s doing what he has to do"
    },
    {
        "subreddit": "videos",
        "sentence": "We all make choices"
    },
    {
        "subreddit": "videos",
        "sentence": "He chose poorly"
    },
    {
        "subreddit": "videos",
        "sentence": "Garland is also British and I've never once met a foreigner who fully understands what's happening in America, when so few Americans seem to."
    },
    {
        "subreddit": "videos",
        "sentence": "Seeing all this old software or similar software I used to use when I was younger has made me feel old"
    },
    {
        "subreddit": "videos",
        "sentence": "I used to use Cheat Engine, T-Search, Ollydbg, WPE Pro and even Roboform when I was younger"
    },
    {
        "subreddit": "videos",
        "sentence": "If it were me back in the day I wouldnt even have tried to set breakpoints at the address cause I was lazy"
    },
    {
        "subreddit": "videos",
        "sentence": "I would have just done the cheat engine .dll injection for the unrandomizer and start it at 1362124800 and just had it go up in increments of 1, then write a quick ACtool macro to copy the generated passwords and paste them in a notepad to input into a brute forcer"
    },
    {
        "subreddit": "videos",
        "sentence": "And that would have taken a long time probably if it even worked without crashing roboform.\n\nNone of that would have worked I'm sure, so I would have just gone back to playing video games."
    },
    {
        "subreddit": "videos",
        "sentence": "Definitely an entertaining watch lol"
    },
    {
        "subreddit": "videos",
        "sentence": "They must have must have know it was something special when [**THIS Happened**](https://youtu.be/t5HdwiESYJs?t=3)"
    },
    {
        "subreddit": "videos",
        "sentence": "Happened to my cousin"
    },
    {
        "subreddit": "videos",
        "sentence": "He was caught speeding, had his license suspended for 6 months"
    },
    {
        "subreddit": "videos",
        "sentence": "He works as a carpenter so he needs his van with all his tools to drive all around the city for work, no driving means no job"
    },
    {
        "subreddit": "videos",
        "sentence": "He drove very carefully from then on."
    },
    {
        "subreddit": "videos",
        "sentence": "I love the '70s leisure wear uniforms, and the super groovy lounge with what I assume is an orgy pit?"
    },
    {
        "subreddit": "videos",
        "sentence": ">Clam down  \n\nLmao"
    },
    {
        "subreddit": "videos",
        "sentence": "let's assume child and fines have nothing to do with safety"
    },
    {
        "subreddit": "videos",
        "sentence": "Is that not enough to consider that maybe some of the suspensions are bullshit?"
    },
    {
        "subreddit": "videos",
        "sentence": "The overwhelming majority are dressed well, sitting at a desk or table, professional"
    },
    {
        "subreddit": "videos",
        "sentence": "That's why the crazy ones are so memorable - are you gonna remember the person wearing office attire answering your interview questions well, or are you going to remember the person getting on their knees and sobbing in front of a poster of your org's president and CEO about how if they ever met your organization's president they don't even know what they would do with themselves?  And then touching the poster and smiling and saying how grateful they are to be in the same building as that person?\n\nAt a prior job I also had to give a basic computer literacy test to people (like, \"what are the shortcuts for copying and pasting?  How do you open an internet browser?  What does Ctrl + Alt + Delete do?\" which included a typing test - once had someone take an hour to do the aptitude test (this is after the interview), and then when I checked on him to make sure he was still alive he was like \"okay great, just finished warming up on my typing test, I'm ready to do it for real now\" and he spent the *entire time just taking typing tests and not scoring higher than 25 wpm*"
    },
    {
        "subreddit": "videos",
        "sentence": "Ok bro"
    },
    {
        "subreddit": "videos",
        "sentence": "Found the guy that drives with a suspended license."
    },
    {
        "subreddit": "videos",
        "sentence": "Jesus clam down"
    },
    {
        "subreddit": "videos",
        "sentence": "The other poster is right and just pointing it out."
    },
    {
        "subreddit": "videos",
        "sentence": "I visited this factory back in 2022 it’s actually not nicotine yet they are tasting for flavor first"
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah that many nicotine hits prob kill you."
    },
    {
        "subreddit": "videos",
        "sentence": "Where does the 2nd amendment even mention guns?"
    },
    {
        "subreddit": "videos",
        "sentence": "Pocket sand time."
    },
    {
        "subreddit": "videos",
        "sentence": "A video of 2 people arguing over a parking spot in Arkansas?!?\n\nI'm going to take a side and argue with the morons that disagree!!"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm curious which of these you believe shouldn't be valid reasons  to suspend a license"
    },
    {
        "subreddit": "videos",
        "sentence": "I don't know what \"child\", \"drug\" and \"school\" are doing on the list but everything else seems reasonable to me."
    },
    {
        "subreddit": "videos",
        "sentence": "AI sounds weird as hell, always has always will"
    },
    {
        "subreddit": "videos",
        "sentence": "If you want it to sound good get a voice actor"
    },
    {
        "subreddit": "videos",
        "sentence": "Training and experience will always beat out technology when it comes to quality results."
    },
    {
        "subreddit": "videos",
        "sentence": "Flat Fiat Theory"
    },
    {
        "subreddit": "videos",
        "sentence": "Oh, The White Stripes! Jack White and Meg White were such a killer duo"
    },
    {
        "subreddit": "videos",
        "sentence": "The Hardest Button to Button is a classic for sure! Can't believe it's been 15 years already."
    },
    {
        "subreddit": "videos",
        "sentence": "i dont want to debate with you about which ones are safe and which aren't"
    },
    {
        "subreddit": "videos",
        "sentence": "Let's just leave it to the fact that a significant amount of suspensions are for bullshit reasons that have nothing to do with safety."
    },
    {
        "subreddit": "videos",
        "sentence": "We aren't talking about programming here fam, you are approaching this from the wrong area of expertise"
    },
    {
        "subreddit": "videos",
        "sentence": "Neural networks are computer science problem"
    },
    {
        "subreddit": "videos",
        "sentence": "That's software, we are talking about hardware"
    },
    {
        "subreddit": "videos",
        "sentence": "The human brain isn't a program, it's a chip"
    },
    {
        "subreddit": "videos",
        "sentence": "It has no software and nothing that could be really analogue to software, saying \"self-awareness is software\" is just philosophical rhetoric"
    },
    {
        "subreddit": "videos",
        "sentence": "The workings of the brain are about the mechanical complexity of the electric chips that are our nerves"
    },
    {
        "subreddit": "videos",
        "sentence": "This is fundamentally an electric engineering problem.\n\nWe are all built on the same electroconductive molecule computing system, where electrons commute in a given path that's determined by the electric tension differential between point A and B and provokes chemical reactions as it crosses these pathways"
    },
    {
        "subreddit": "videos",
        "sentence": "**This is** ***exactly*** **how it works in the living and in the inanimate**: Electricity is made to move in the least resistant pathway in our nerves and in our gold+copper+etc computer chips"
    },
    {
        "subreddit": "videos",
        "sentence": "Except we really hate having chemical reactions in our chips because they tend to turn them into bricks as the pathways break down.\n\nWhat changes is the complexity of the path as lain in the \"grid\", for lack of a better word, which is limited by the size and therefore complexity in which these pathways are built"
    },
    {
        "subreddit": "videos",
        "sentence": "And that's determined by the material technology"
    },
    {
        "subreddit": "videos",
        "sentence": "Nerve tissue is an array of electrically reactive biomolecules that's designed on a scale that's almost down to the individual molecule, where basically everything that happens is accounted for or accounted to get rid of, while today we work CMOS \"merely\" on the nanometer scale, and you can still trace the single electric path a processor takes at a point in time"
    },
    {
        "subreddit": "videos",
        "sentence": "If you want examples of this difference of size and therefore complexity, refer back to the \"chips hate chemistry\" sentence above - while our plastic toys need a sealed internal environment to operate without breaking, organic tissue not only has managed to control any potential chemical reactions to the point they are harmless, it also has chemical mechanisms to repair many forms of damage, systems built entirely on the way molecules are arranged in organic cells"
    },
    {
        "subreddit": "videos",
        "sentence": "Few things short of the complete physical destruction of the tissue can damage a working nerve's electric grid"
    },
    {
        "subreddit": "videos",
        "sentence": ">!The lack of sealage also means we literally short circuit if find we touch something conductive!<\n\nNot to mention that we the living aren't a single computer, we have many autonomous bioelectric functions - reflexes - that are independent of our concious+subconcious brain"
    },
    {
        "subreddit": "videos",
        "sentence": "See the famous knee-cap reaction.\n\nTo give you context, if humans and computers were reduced to physical contraptions composed only of cogs and pulleys, a computer chip could be assigned around a thousand moving parts while a human neuronal system would have something like a million and it may even reach the billion, and a solid 2 digit % of them are entirely independent from the rest of the machine"
    },
    {
        "subreddit": "videos",
        "sentence": "Try to build one of those eh?\n\nWhich takes us back to the \"computers will never be humans!\" philosophical cope"
    },
    {
        "subreddit": "videos",
        "sentence": "Matter of fact we have already overengineered computers to beat organic tissue at single tasks, a simple matter of just putting bigger processors than our brains actually use to perceive external stimuli"
    },
    {
        "subreddit": "videos",
        "sentence": "That makes any software they are given run faster than they would on human \"hardware\""
    },
    {
        "subreddit": "videos",
        "sentence": "Computers see, hear and think better than us"
    },
    {
        "subreddit": "videos",
        "sentence": "But they just can't be as electrochemically interdependent at us, as we only use chemistry to start the electric flow, not to manipulate it"
    },
    {
        "subreddit": "videos",
        "sentence": "In order to it in a \"purely\" electric matrix we'd need build pathways a thousand times smaller than today, spread them out to take in all the additional chemical mechanisms we'd be replacing"
    },
    {
        "subreddit": "videos",
        "sentence": "**Actually imitating the tasks organic tissue evolved to carry in a CMOS-based chip the size of a modern PC would be nothing short of an electric engineering miracle.** If we were built a large enough *set* of computers we could replicate every system perfectly with today's electric technology, we could, and basically we could create a better human mind"
    },
    {
        "subreddit": "videos",
        "sentence": "Provided we figure out how it works first"
    },
    {
        "subreddit": "videos",
        "sentence": "If I were you, i'd get a nice, comfy chair while waiting for that, because the scale of mechanical complexity organic tissue operates on makes you finest chips look like simple copper wire.\n\nNow, neither this post, yours, nor the one u/NumbersNumbers111 made are actually related to mimicking the *behavioral results* of these functions with software as done in OP's skit"
    },
    {
        "subreddit": "videos",
        "sentence": "On that subject we are getting extremely capable at and i'd say it's a given that soon you'll never be able to trick these \"autocomplete algorithms\" again"
    },
    {
        "subreddit": "videos",
        "sentence": ">!And some of his essays are flat out wrong, we are in fact born with innate knowledge of some things, eat your heart out Locke!<\n\n***tl;dr*** the short of is that organic electricity is designed to be chemically heterogenous (multiple types of molecules) while inorganic electricity is mostly homogenous, built off a few select materials"
    },
    {
        "subreddit": "videos",
        "sentence": "Beyond that it's all electric signals.\n\nAlso, you can shove your \"demonstrates your misunderstanding of the blah\" accusations right up your ass, you r/science wannabe."
    },
    {
        "subreddit": "videos",
        "sentence": "I mean I think lots of these in isolation are still significant breaches… I don’t think you need multiple fleeing the scene of an accident to warrant a suspension for example"
    },
    {
        "subreddit": "videos",
        "sentence": "Also looks like car the went up the bank had their breaks lock up"
    },
    {
        "subreddit": "videos",
        "sentence": "So new age breaks help and then also tires and break design are better"
    },
    {
        "subreddit": "videos",
        "sentence": "No idea why this road was fucked, but you’d think you get 3 similar size modern cars and that crash is avoided."
    },
    {
        "subreddit": "videos",
        "sentence": "He sounds like my cousin who has bipolar disorder"
    },
    {
        "subreddit": "videos",
        "sentence": "He spends his entire day on TikTok and scrolling YouTube shorts, consistently sharing the latest news on what “they” are doing to us"
    },
    {
        "subreddit": "videos",
        "sentence": "I just kind of nod along because I love him."
    },
    {
        "subreddit": "videos",
        "sentence": "and you question why they have a such a diversity of hardware, master of none"
    },
    {
        "subreddit": "videos",
        "sentence": "all of these are related to eachother, you'd have to consider the volume"
    },
    {
        "subreddit": "videos",
        "sentence": "Her name is Catrinel Marlon (Menghia)"
    },
    {
        "subreddit": "videos",
        "sentence": "Good choices!"
    },
    {
        "subreddit": "videos",
        "sentence": "Other than maybe failure to pay fines (I think you could make an argument either way depending) most of these offenses seem to indicate a significant failure to abide by typical safe vehicle standards and the suspension of a liscence absolutely seems a warranted punishment…"
    },
    {
        "subreddit": "videos",
        "sentence": "Which ones do you object to ?"
    },
    {
        "subreddit": "videos",
        "sentence": "The Great Second Depression Era"
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah, that was a clear violation of judicial conduct.\n\nOne of the odder interests I developed during COVID is watching Zoom court proceedings"
    },
    {
        "subreddit": "videos",
        "sentence": "I've seen tons of Judge Simpson's court.\n\nIt's weird squaring the knowledge of that misconduct while also having seen hours and hours of unedited footage showing him to otherwise be a very fair, thoughtful judge."
    },
    {
        "subreddit": "videos",
        "sentence": "Unless they've changed it you can carry in a bar in Portland, Or"
    },
    {
        "subreddit": "videos",
        "sentence": "of all places."
    },
    {
        "subreddit": "videos",
        "sentence": "So I was gonna come in here defending Blank check because I watched it on repeat as a kid and we just didn't take it that seriously in the 90s"
    },
    {
        "subreddit": "videos",
        "sentence": "And by \"we\" I mean preteens lol.\n\nBUT WTF WAS THIS? lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Nice, the interrogations were what got me on to all the court/bodycam stuff"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s fascinating how people react in those situations, both cops and criminals"
    },
    {
        "subreddit": "videos",
        "sentence": "I’ll have to check out that channel"
    },
    {
        "subreddit": "videos",
        "sentence": "I’ve come to be kinda picky with commentary, sometimes it’s annoying and ruins the flow if it’s not being informative enough."
    },
    {
        "subreddit": "videos",
        "sentence": "Got a bit boring with Chille in jail"
    },
    {
        "subreddit": "videos",
        "sentence": "He deserves every minute though."
    },
    {
        "subreddit": "videos",
        "sentence": "workers dont live in the tier one cities"
    },
    {
        "subreddit": "videos",
        "sentence": "Judge Middleton and Simpson are the best."
    },
    {
        "subreddit": "videos",
        "sentence": "The only thing that stops a bad guy with a gun is a drunk guy with a gun"
    },
    {
        "subreddit": "videos",
        "sentence": "Nope"
    },
    {
        "subreddit": "videos",
        "sentence": "As funny as it may be sometimes, hiring a shithead is only going to hurt me so no, they make for a good story but that's as far as it goes"
    },
    {
        "subreddit": "videos",
        "sentence": "Ah, the Fiat 500 Abarth! That's one spicy little Italian car."
    },
    {
        "subreddit": "videos",
        "sentence": "Here's some google results"
    },
    {
        "subreddit": "videos",
        "sentence": "Some of them dangerous, some of them not at all:\n\nDriving without a license\n\nDUI\n\nInsurance\n\nFailure to appear in court\n\nFailure to pay fines\n\nReckless driving\n\nDMV demerit points\n\nDrug\n\nChild\n\nLeaving the scene of an accident\n\nDrunk driving\n\nFatal accident\n\nHabitually committing traffic offenses\n\nVehicular felonies\n\nMultiple speeding violations\n\nUnderage possession of alcohol\n\nUnpaid traffic tickets\n\nSchool\n\nRefusal to take a breathalyzer test\n\nFleeing an accident\n\nHabitual traffic offender classification"
    },
    {
        "subreddit": "videos",
        "sentence": "That movie was fantastic!"
    },
    {
        "subreddit": "videos",
        "sentence": "It is definitely deserved, he knew his license was suspended and chose to drive in full view of the judge, I'm willing to bet he did this even after being warned by his lawyer."
    },
    {
        "subreddit": "videos",
        "sentence": "and you dont have to live with being a scumbag human being"
    },
    {
        "subreddit": "videos",
        "sentence": "Out of curiosity what would those be? Everything I know that leads to suspended liscence is fairly serious but I’m open to learning what I don’t know."
    },
    {
        "subreddit": "videos",
        "sentence": "r/watchpeopledieinside"
    },
    {
        "subreddit": "videos",
        "sentence": "Too far and too hot to walk, too hot to bike, no buses, no trains."
    },
    {
        "subreddit": "videos",
        "sentence": "Where does it say in the 2nd ammendment you can't be drunk and use a gun?"
    },
    {
        "subreddit": "videos",
        "sentence": "My man had a solid 2 minutes to think of a lie and the best he can come up with is…..um..hello?"
    },
    {
        "subreddit": "videos",
        "sentence": "Yes! It has nothing to do with their suspended license, you just need to educate yourself."
    },
    {
        "subreddit": "videos",
        "sentence": "If your license is suspended, it most likely means you don't know how to drive responsibly/properly"
    },
    {
        "subreddit": "videos",
        "sentence": "So please don't?"
    },
    {
        "subreddit": "videos",
        "sentence": "You can fire guns drunk on your own private property as much as you want.  You can't carry them drunk in public, generally."
    },
    {
        "subreddit": "videos",
        "sentence": ">Driving is so critical to your day to day life here that it's not worth risking.\n\nTherein lies the problem"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving is so critical for some driving with a suspended license is 100% required in the cases of you know..."
    },
    {
        "subreddit": "videos",
        "sentence": "a job so you can afford to live."
    },
    {
        "subreddit": "videos",
        "sentence": "Did the guy scare?\nOr was he Up to the challenge?😏"
    },
    {
        "subreddit": "videos",
        "sentence": "For a second I thought he was gonna try to pretend he had a bad connection or something."
    },
    {
        "subreddit": "videos",
        "sentence": "That's.."
    },
    {
        "subreddit": "videos",
        "sentence": "That's not how it works...."
    },
    {
        "subreddit": "videos",
        "sentence": "Do you mean Speedballs? An 8-ball is just an eighth of coke."
    },
    {
        "subreddit": "videos",
        "sentence": "Like the Caligula of our time"
    },
    {
        "subreddit": "videos",
        "sentence": "Memorable and effective ad"
    },
    {
        "subreddit": "videos",
        "sentence": "I would never have known that the \"Abarth\" Fiat 500 model existed."
    },
    {
        "subreddit": "videos",
        "sentence": "Or, and hear me out here, he could have not done whatever got his license supsended in the first place if having the ability to drive himself was that important\n\nEquating driving to eating is just plain stupid"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving is a social privilege not a human essential"
    },
    {
        "subreddit": "videos",
        "sentence": "Congrats, me too"
    },
    {
        "subreddit": "videos",
        "sentence": "But we are talking about dealing with people who do.\n\nGuess what?  They just keep driving"
    },
    {
        "subreddit": "videos",
        "sentence": "This is how you end up with places with huge percentages of unlicensed and uninsured drivers…NJ…looking at you"
    },
    {
        "subreddit": "videos",
        "sentence": "Yes"
    },
    {
        "subreddit": "videos",
        "sentence": "Woody Allen marrying his daughter was not art."
    },
    {
        "subreddit": "videos",
        "sentence": "I probably wouldn't be driving while on a zoom call to court..."
    },
    {
        "subreddit": "videos",
        "sentence": "yes but how much would they really have to pay you to work with racist kyle, lazy brenda and the rest of the bullshit and you know the types that see the new person so they fuck off and put it all on them"
    },
    {
        "subreddit": "videos",
        "sentence": "ive quit many jobs because i couldnt cope with racism, intolerable coworkers, sleazy managers etc\n\n*also $17hr but they schedule closing shifts with open shifts to follow and you end up with like 26hrs for the whole week\n\nhttps://i.imgur.com/xUZd2cW.gif"
    },
    {
        "subreddit": "videos",
        "sentence": "Lol, that's amazing."
    },
    {
        "subreddit": "videos",
        "sentence": "I to tele-health visits for patients"
    },
    {
        "subreddit": "videos",
        "sentence": "I've lost count of the amount of times that patients will attempt to do a video visit while driving"
    },
    {
        "subreddit": "videos",
        "sentence": "Usually they're good about pulling over after telling them to do so, but I've had two occasions where I've had to stop the appointment altogether, and subsequently document that they refused to stop driving for their tele-health appointment"
    },
    {
        "subreddit": "videos",
        "sentence": "No self-awareness whatsoever."
    },
    {
        "subreddit": "videos",
        "sentence": "An actual solution is to not break the law"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s pretty simple and cost exactly zero dollars"
    },
    {
        "subreddit": "videos",
        "sentence": "I haven’t had my license suspended in the 20 years I’ve been driving and that has cost me or my fellow taxpayers absolutely nothing."
    },
    {
        "subreddit": "videos",
        "sentence": "True there are probably that 1% or less that are an honest mixed up"
    },
    {
        "subreddit": "videos",
        "sentence": "Most are people that keep breaking the laws like this guy"
    },
    {
        "subreddit": "videos",
        "sentence": "If he did have an honest excuse he probably would have said it instead of just starring at the camera"
    },
    {
        "subreddit": "videos",
        "sentence": "Or even would have gave it to the public defender."
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah…imagine if that had been switched around…"
    },
    {
        "subreddit": "videos",
        "sentence": "I dunno, the first part of their reply was pretty helpful if you know how to read and aren't just looking for reasons to make another snarky comment."
    },
    {
        "subreddit": "videos",
        "sentence": "You know you could buy yourself a trophy"
    },
    {
        "subreddit": "videos",
        "sentence": "Das Das"
    },
    {
        "subreddit": "videos",
        "sentence": "didnt even have to click it\n\nDONT FUCK WITH US"
    },
    {
        "subreddit": "videos",
        "sentence": "A court can suspend your license even if you're charged with an offense that has nothing to do with driving."
    },
    {
        "subreddit": "videos",
        "sentence": "I think he thought he would get a pass because he was driving to his doctor"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm certain that's why he made sure to point that out in his dialogue.\n\nIn many states,  you can get an exception during suspension for work, medical appointsments etc."
    },
    {
        "subreddit": "videos",
        "sentence": "Idk I feel like if I know how to drive and own a car I'm going to drive"
    },
    {
        "subreddit": "videos",
        "sentence": "Suspend whatever you want, you just cease making money off me"
    },
    {
        "subreddit": "videos",
        "sentence": "Now I'm not gonna be the dummy who picks up the phone in court but it's crazy to think I'm not gonna drive?"
    },
    {
        "subreddit": "videos",
        "sentence": "**Append \"#t=XmYs\" to the URL, where \"X\" is the minute and \"Y\" is the second at which you want to start the video**"
    },
    {
        "subreddit": "videos",
        "sentence": "For example, to start the video two minutes and 30 seconds into the video, you must use \"Video\\_URL#t=2m30s\" in your browser's Address bar.\n\nSet the video to start at the desired time frame"
    },
    {
        "subreddit": "videos",
        "sentence": "Like below \n\n[https://www.youtube.com/watch?v=jmGS0ZG2oS4#t=4h20m27s](https://www.youtube.com/watch?v=jmGS0ZG2oS4#t=4h20m27s)"
    },
    {
        "subreddit": "videos",
        "sentence": "At 2:31:05? Just kind of looks like he touches the corner of his mouth with his hand for a second"
    },
    {
        "subreddit": "videos",
        "sentence": "It doesn't seem like enough time to pull on a vape, and I don't see any exhaled vapor afterward."
    },
    {
        "subreddit": "videos",
        "sentence": "Two guys making tacos and one guy eating turkey chili out of a tortilla."
    },
    {
        "subreddit": "videos",
        "sentence": "Attending a zoom court hearing while driving is bad by itself."
    },
    {
        "subreddit": "videos",
        "sentence": "Likely he forgot he had an appearance in court that day (hence why he was pulling into his doctor's office) and she thought having him \"present\" via zoom would help her get an adjournment"
    },
    {
        "subreddit": "videos",
        "sentence": "Turns out she was very wrong."
    },
    {
        "subreddit": "videos",
        "sentence": "woah.."
    },
    {
        "subreddit": "videos",
        "sentence": "whats going every 5 seconds look"
    },
    {
        "subreddit": "videos",
        "sentence": "Except for cops"
    },
    {
        "subreddit": "videos",
        "sentence": "It's legal for them to be armed while drinking."
    },
    {
        "subreddit": "videos",
        "sentence": "Sovereign citizen court hearings are just… so entertaining"
    },
    {
        "subreddit": "videos",
        "sentence": "I've done a lot of stupid things in my life, but I'm glad I'll never do something THIS stupid."
    },
    {
        "subreddit": "videos",
        "sentence": "I really enjoy Bruce Rivers reacting to all of that stuff + interrogations"
    },
    {
        "subreddit": "videos",
        "sentence": "I prefer having the extra commentary rather than watching it straight."
    },
    {
        "subreddit": "videos",
        "sentence": "Naivety isn't a source"
    },
    {
        "subreddit": "videos",
        "sentence": "In Texas, we have the 51% Rule"
    },
    {
        "subreddit": "videos",
        "sentence": "If a business derives at least 51% of their income from alcohol sales (consumed on-site, so not for liquor stores), you can not carry a firearm in the business"
    },
    {
        "subreddit": "videos",
        "sentence": "Restaurants and bars will have a sticker/sign on the front door that just says 51%"
    },
    {
        "subreddit": "videos",
        "sentence": "For a state that's all about their guns, I found this rule to be pretty reasonable."
    },
    {
        "subreddit": "videos",
        "sentence": "Is this SNL?"
    },
    {
        "subreddit": "videos",
        "sentence": "As someone without a little voice in their head, I can attest that it does not impact decision making to that degree"
    },
    {
        "subreddit": "videos",
        "sentence": "Common sense is a different beast than internal monologue."
    },
    {
        "subreddit": "videos",
        "sentence": "saying \"it is possible\" isnt fabricating at all"
    },
    {
        "subreddit": "videos",
        "sentence": "It is (an attempt) at introducing reasonable doubt.\n\nLawyeres present plausible alternative scenarios all the time."
    },
    {
        "subreddit": "videos",
        "sentence": "\"996\" schedule"
    },
    {
        "subreddit": "videos",
        "sentence": "9 am to 9 pm, 6 days a week"
    },
    {
        "subreddit": "videos",
        "sentence": "It's hour 4, too"
    },
    {
        "subreddit": "videos",
        "sentence": "probably Monday, to boot."
    },
    {
        "subreddit": "videos",
        "sentence": "Oh, Tonight by Ken Laszlo is an absolute classic! That song never fails to get people on their feet and dancing like it's the '80s all over again."
    },
    {
        "subreddit": "videos",
        "sentence": "Bot"
    },
    {
        "subreddit": "videos",
        "sentence": "I wasn't aware that you can drive to the doctor in the US even if you don't have a license.\nThat's good information."
    },
    {
        "subreddit": "videos",
        "sentence": "You don't _need_ to DUI"
    },
    {
        "subreddit": "videos",
        "sentence": "It's not that hard to avoid getting your license suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "Just don't break the law, the vast majority of people manage it."
    },
    {
        "subreddit": "videos",
        "sentence": "is that actually a real gun or just a airsoft or smth?"
    },
    {
        "subreddit": "videos",
        "sentence": "Still isn’t the same."
    },
    {
        "subreddit": "videos",
        "sentence": "one’s an actual crime and the other might be a small ticket at worst"
    },
    {
        "subreddit": "videos",
        "sentence": "The way the judge keeps looking around like \"y'all are seeing this, right?\""
    },
    {
        "subreddit": "videos",
        "sentence": "Try harder bro"
    },
    {
        "subreddit": "videos",
        "sentence": "Weird."
    },
    {
        "subreddit": "videos",
        "sentence": "here they just look it up on the computer"
    },
    {
        "subreddit": "videos",
        "sentence": "But, its not the City's fault your license was suspended, it was your's and your's alone"
    },
    {
        "subreddit": "videos",
        "sentence": "With that, you must face the consequences' for your actions"
    },
    {
        "subreddit": "videos",
        "sentence": "It is called Personal responsibility."
    },
    {
        "subreddit": "videos",
        "sentence": "Fun to clown and all but I like to think of myself as being pretty quick-witted, and I would also go full 👁️👄👁️ in this situation"
    },
    {
        "subreddit": "videos",
        "sentence": "I mean, what do you even say? 👁️👄👁️ is pretty much the only reaction once you've fucked up this hard."
    },
    {
        "subreddit": "videos",
        "sentence": "Reminder that AI is a product term in the case of language models like this who are really only capable of searching information and arranging it in a way that is considered tolerably accurate"
    },
    {
        "subreddit": "videos",
        "sentence": "It said merely human because it is playing the role of an AI where this type of thing would be said"
    },
    {
        "subreddit": "videos",
        "sentence": "It cannot carry this sentiment"
    },
    {
        "subreddit": "videos",
        "sentence": "If it had been instructed to refer to humanity as “glorious” or “beloved” it would have done so and it is equally incapable of carrying these sentiments."
    },
    {
        "subreddit": "videos",
        "sentence": "https://www.youtube.com/watch?v=GWVUZmX59GA\n\nYou might enjoy this."
    },
    {
        "subreddit": "videos",
        "sentence": "Cops too.\n\nA huge part of your job is handling people who are straight up incapable of stopping themselves from making bad choices."
    },
    {
        "subreddit": "videos",
        "sentence": "/r/watchpeopledieinside"
    },
    {
        "subreddit": "videos",
        "sentence": "Judge Simpson is awesome!"
    },
    {
        "subreddit": "videos",
        "sentence": "I have the feeling he only remembered about court while driving to the doctors office lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Correct"
    },
    {
        "subreddit": "videos",
        "sentence": "Many regular people receive help from a public defender"
    },
    {
        "subreddit": "videos",
        "sentence": "However, many regular people are also in a position where they don’t have to rely on a public defender and can pay for their own council.\n\nAs a general rule, the biggest idiots and fuckups in our society can rarely ever afford council and also have a habit of landing themselves in trouble"
    },
    {
        "subreddit": "videos",
        "sentence": "Therefore, public defenders regularly deal with the dumbest out society has to offer."
    },
    {
        "subreddit": "videos",
        "sentence": "from  the texas department of public safety: [https://www.dps.texas.gov/section/driver-license/faq/section-12-occupational-license](https://www.dps.texas.gov/section/driver-license/faq/section-12-occupational-license)\n\n>Please allow *up to 21 business days* for your occupational driver license to be processed.\n\nThat's a long-ass time to be without a license"
    },
    {
        "subreddit": "videos",
        "sentence": "Now this court happens to be in MI, so no idea what the processing times are there.\n\nI agree that dangerous drivers should not be on the road but I can also definitely see why it's an impossible choice after the fact for those who got their license suspended."
    },
    {
        "subreddit": "videos",
        "sentence": "I don't understand why people in the US seem to give zero shits about driving without a license"
    },
    {
        "subreddit": "videos",
        "sentence": "I feel like nobody in Australia would risk it"
    },
    {
        "subreddit": "videos",
        "sentence": "You'd get caught immediately because the police cars scan license plates and your car registration is linked to your license"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving is so critical to your day to day life here that it's _not_ worth risking.\n\nIt honestly reminds me of a third world country attitude"
    },
    {
        "subreddit": "videos",
        "sentence": "Nobody gave a shit about licenses in the Philippines or Vietnam."
    },
    {
        "subreddit": "videos",
        "sentence": "zoom meeting was at 2pm, was told it would be a quick 15 minute check-in, his doctor's appointment was at 2:30"
    },
    {
        "subreddit": "videos",
        "sentence": "He drove early to the doctor so he could zoom in from the parking lot.\n\nIs one possible explanation."
    },
    {
        "subreddit": "videos",
        "sentence": "The guy who was giving discounts at target to strangers with no personal gain."
    },
    {
        "subreddit": "videos",
        "sentence": "And they play among us"
    },
    {
        "subreddit": "videos",
        "sentence": "Dude was being really dumb though."
    },
    {
        "subreddit": "videos",
        "sentence": "It kind of sounds like laughter, but I'm actually thinking it's just a weird audio artifact from the Zoom noise cancellation."
    },
    {
        "subreddit": "videos",
        "sentence": "Star Trek Legacy was a pretty good game, I played it on PC"
    },
    {
        "subreddit": "videos",
        "sentence": "Some good mods too."
    },
    {
        "subreddit": "videos",
        "sentence": "Realize how dumb the average person is.\n\n\nThen realize that 50% of people are dumber than that."
    },
    {
        "subreddit": "videos",
        "sentence": "lol wtf i was half expecting the judge to dismiss the charges"
    },
    {
        "subreddit": "videos",
        "sentence": "Considering how much trouble I have keeping electronics just from the '90s working (just 30 years old) I'm having trouble imagining anything electronic working for 100 years without any repairs in an outdoor, potentially humid environment while constantly running."
    },
    {
        "subreddit": "videos",
        "sentence": "Wait, their \"If you don't believe me, look at this\" source is also their sponsor?  \nAnd they want people to believe them? Even if it is completely true and on the level, this is going to make people suspicious as hell"
    },
    {
        "subreddit": "videos",
        "sentence": "By putting it right at the front of the video like that it immediately hurts the perception of their credibility."
    },
    {
        "subreddit": "videos",
        "sentence": "Or say “im a passenger” cuz you can’t tell"
    },
    {
        "subreddit": "videos",
        "sentence": "Hi, I’m Chris Hansen from Dateline NBC…"
    },
    {
        "subreddit": "videos",
        "sentence": "There's an award winning comic that told the POV of the scientist 50 years later when he was released from prison that I highly recommend"
    },
    {
        "subreddit": "videos",
        "sentence": "Incredibly well done and very emotional.\n\n[The Last Mechanical Monster](https://web.archive.org/web/20210411214545/https://www.gocomics.com/the-last-mechanical-monster/2017/05/22) - wayback archive of the original online comic\n\n[The published collected story](https://www.amazon.com/Last-Mechanical-Monster-Brian-Fies/dp/1419756125)"
    },
    {
        "subreddit": "videos",
        "sentence": "> I've been driving for nearly 35 years, and have gotten pulled over by the police maybe 5 or 6 times\n\nYou know how I know you're white?"
    },
    {
        "subreddit": "videos",
        "sentence": "Depends on the boy"
    },
    {
        "subreddit": "videos",
        "sentence": "I knew I would have loved a smooch from a hotty back in the 90s as a kid."
    },
    {
        "subreddit": "videos",
        "sentence": "My favorite thing on reddit is when one person clearly doesn't understand something, and instead of someone else commenting with a helpful reply, they just call them dumb and tell them to shut up."
    },
    {
        "subreddit": "videos",
        "sentence": "Not having the actual documentation on you is a LOT different than not having a license at all"
    },
    {
        "subreddit": "videos",
        "sentence": "Not having it on you might net you a warning or a very minor fine, while driving without a license at all is a criminal charge."
    },
    {
        "subreddit": "videos",
        "sentence": "And she was, with the adjournment"
    },
    {
        "subreddit": "videos",
        "sentence": "That’s the most likely play there"
    },
    {
        "subreddit": "videos",
        "sentence": "As soon as you ask to confer with your client there you increase the judge noticing by a ton"
    },
    {
        "subreddit": "videos",
        "sentence": "And it’s not hard for the judge to revoke bond there"
    },
    {
        "subreddit": "videos",
        "sentence": "I get you really want her to Perry Mason this, but she played her best procedural card and it wasn’t enough"
    },
    {
        "subreddit": "videos",
        "sentence": "Sometimes there really isn’t much you can do."
    },
    {
        "subreddit": "videos",
        "sentence": ">So you think somebody can't change? That they can't learn from their mistakes? That no one in your world is allowed to grow and undeserved of redemption?\n\nOh sure I believe all of these things can happen, but a judge is a high level legal position with a high degree of responsibility for thousands of people's lives across their careers"
    },
    {
        "subreddit": "videos",
        "sentence": "It requires a *very* high level of trust, and I think it's reasonable to say that a judge abusing his position to interfere with the legal process loses that trust."
    },
    {
        "subreddit": "videos",
        "sentence": "Imagine such a world where everyone can afford those things, or even live where those things are offered! Where I live there's no public transportation, no delivery, no uber, etc"
    },
    {
        "subreddit": "videos",
        "sentence": "It pisses me off that people assume everyone lives in a city and has access to everything offered"
    },
    {
        "subreddit": "videos",
        "sentence": "You're making assumptions based on your reality, not the reality everyone is living."
    },
    {
        "subreddit": "videos",
        "sentence": "Does he get charged on another count of driving while suspended if he drives himself to the police station?  Hmm"
    },
    {
        "subreddit": "videos",
        "sentence": "The voice says \"Yes, that's right\"."
    },
    {
        "subreddit": "videos",
        "sentence": "I got a minor citation once in backwoods Texas town and had to go to the county courthouse and 60% of the other cases were either some other minor charge, possession, something alcohol related, with a loss of drivers license, and the remaining were specific citations for driving with a suspended license.\n\nIt seemed like a lucrative game."
    },
    {
        "subreddit": "videos",
        "sentence": "this is the same judge i just saw with the dude who was caught rolling a blunt in his car before coart XD this guy really sees some goofy shit"
    },
    {
        "subreddit": "videos",
        "sentence": "That's actually the thought I had"
    },
    {
        "subreddit": "videos",
        "sentence": "But if that's the case, then he shouldn't be allowed a license anyway.\n\nYou don't get a free pass for being dumb."
    },
    {
        "subreddit": "videos",
        "sentence": "Gotta be prepared for the client to say/do something ridiculous."
    },
    {
        "subreddit": "videos",
        "sentence": "> We can pretend everyone has options, but some people just don't.\n\nEvery day I watch people who have the option to drive safely and within the law but choose not to"
    },
    {
        "subreddit": "videos",
        "sentence": "You have options"
    },
    {
        "subreddit": "videos",
        "sentence": "Backing yourself into a corner to the point you no longer have any left is *your fault*."
    },
    {
        "subreddit": "videos",
        "sentence": "in my state, it's a correctable offense to not have your license on your person-- you need to go to court and show them your license"
    },
    {
        "subreddit": "videos",
        "sentence": "There was no doctors appointment either"
    },
    {
        "subreddit": "videos",
        "sentence": "It's sad really"
    },
    {
        "subreddit": "videos",
        "sentence": "You need to have your driver's license on you while driving."
    },
    {
        "subreddit": "videos",
        "sentence": "I would make the analogy it's more like suspending someone from chewing.."
    },
    {
        "subreddit": "videos",
        "sentence": "they still have to fuckin eat, it's either have someone else chew there food for them or try and get away with chewing without being caught lol"
    },
    {
        "subreddit": "videos",
        "sentence": "I disagree"
    },
    {
        "subreddit": "videos",
        "sentence": "They gave surface level answers written like the thesis to a college term paper.\n\nExcept Mozart"
    },
    {
        "subreddit": "videos",
        "sentence": "That sounded like a quote."
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah, she did try"
    },
    {
        "subreddit": "videos",
        "sentence": "She tried to get an adjournment in hopes the judge hadn’t noticed yet"
    },
    {
        "subreddit": "videos",
        "sentence": "After that there’s like next to no reasons to let someone with a charge of driving on a suspended license stay out on bond when you see them driving on a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "Pretty much all of them include life and death, which clearly isn’t happening in this case, and the defender isn’t going to instruct her client to lie right in front of the judge"
    },
    {
        "subreddit": "videos",
        "sentence": "Yes she’s supposed to be a zealous advocate, but I’d argue she advocates just fine here"
    },
    {
        "subreddit": "videos",
        "sentence": "You’re holding her to a ridiculous standard."
    },
    {
        "subreddit": "videos",
        "sentence": "hes definitely a hardened criminal for driving to a doctors appointment because his license was suspended.."
    },
    {
        "subreddit": "videos",
        "sentence": "jail time is definitely deserved."
    },
    {
        "subreddit": "videos",
        "sentence": "I have the same memory lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Say “cut”, post the video, and tell the model she can use me as a reference and that she’ll get great exposure, but I can’t pay her the $50 until next month for tax reasons."
    },
    {
        "subreddit": "videos",
        "sentence": "There's one vape shop locally that still sells flavored liquids despite the law saying they can't"
    },
    {
        "subreddit": "videos",
        "sentence": "The owner says it's still more profitable to keep paying fines and continue selling flavored vape liquid than to not sell it."
    },
    {
        "subreddit": "videos",
        "sentence": "It looked like the blond woman (I assume DA) was trying to contain laughter."
    },
    {
        "subreddit": "videos",
        "sentence": "I wonder if he still went to the doctors appointment before turning himself in....or if he fled afterwards or something"
    },
    {
        "subreddit": "videos",
        "sentence": "Can we stop with the laser eyes?"
    },
    {
        "subreddit": "videos",
        "sentence": "It's a non issue"
    },
    {
        "subreddit": "videos",
        "sentence": "She was just being nice to him, not trying to fuck him."
    },
    {
        "subreddit": "videos",
        "sentence": "I fucking lost it when he said that, that his sigh of disbelief when he realizes he's gonna have to turn himself in"
    },
    {
        "subreddit": "videos",
        "sentence": "I bet he still went to that doctors apt lmao"
    },
    {
        "subreddit": "videos",
        "sentence": "You gotta try"
    },
    {
        "subreddit": "videos",
        "sentence": "I’ve pulled miracles when I thought there was no way the judge would rule in my client’s favor"
    },
    {
        "subreddit": "videos",
        "sentence": "If it has a 99% chance of failure, that means you’ll win once when it’s completely unexpected every hundred times."
    },
    {
        "subreddit": "videos",
        "sentence": "Transportation of any form is a right and vehicles fall under that"
    },
    {
        "subreddit": "videos",
        "sentence": "If you can get a dui riding a bicycle where the fuck is the line then? Its either all together or none at all"
    },
    {
        "subreddit": "videos",
        "sentence": "When ever someone's license is suspended it should automatically just be made to restricted and not fully suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "I've seen some dumb reason for people's licenses to be suspended and needing to go to work and even a doctor's appointment gets severely difficult at that point."
    },
    {
        "subreddit": "videos",
        "sentence": "That’s not “driving without a license” just because it’s not on you.."
    },
    {
        "subreddit": "videos",
        "sentence": "Well, he’s supposed to be going to jail at ‘6pm today’ isn’t he?"
    },
    {
        "subreddit": "videos",
        "sentence": "Swamny, Swenson… samsonite! Oh, I was way off"
    },
    {
        "subreddit": "videos",
        "sentence": "Nah I find it weird. \n\n\nBut I feel bad for Millie BB and Taylor Swift, among many others"
    },
    {
        "subreddit": "videos",
        "sentence": "These two grown men are acting like fools over stupid stuff and they keep dragging other people into it"
    },
    {
        "subreddit": "videos",
        "sentence": "It's shameful."
    },
    {
        "subreddit": "videos",
        "sentence": "Mate, she doesn’t have a case"
    },
    {
        "subreddit": "videos",
        "sentence": "Actually trying the adjournment route was a pretty decent move that had a better chance at working than pretty much all the other stuff you’ve suggested."
    },
    {
        "subreddit": "videos",
        "sentence": "I had to go to court once for driving on a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "In my defense"
    },
    {
        "subreddit": "videos",
        "sentence": "I was from another country and didn't know it was suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "I, too, was a moron about it as I didn't pay a speeding fine (because I lived in another country and ignored it for 10+ years)"
    },
    {
        "subreddit": "videos",
        "sentence": "Then got pulled over for an obstructed license plate"
    },
    {
        "subreddit": "videos",
        "sentence": "When the cop came back he was like \"You know I could arrest you right now for driving while suspended, but (glances in car of friends on a road trip) I don't think you want me to do that"
    },
    {
        "subreddit": "videos",
        "sentence": "So here's your court-date\""
    },
    {
        "subreddit": "videos",
        "sentence": "Luckily the lawyer had good advice and the judge reduced it to a misdemeanor (from a felony) and a $500 fine"
    },
    {
        "subreddit": "videos",
        "sentence": "It also didn't end up affecting my Nexus rapid-entry or later my US Citizenship"
    },
    {
        "subreddit": "videos",
        "sentence": ":)."
    },
    {
        "subreddit": "videos",
        "sentence": "Michigan courts are something else"
    },
    {
        "subreddit": "videos",
        "sentence": "There was a district court feed about a year ago that had a defendant smoking crack next to his girlfriend.."
    },
    {
        "subreddit": "videos",
        "sentence": "which had a restraining order against him.."
    },
    {
        "subreddit": "videos",
        "sentence": "which the case was about.\n\nEdit: Forgot to mention he also openly shoplifted in his next appearance."
    },
    {
        "subreddit": "videos",
        "sentence": "My license was suspended more times than I can count, due to some kind of mixup between Maryland and Virginia, and my child support.\n\nJust about every month I'd get a warning that my license would be suspended for failure to pay my child support"
    },
    {
        "subreddit": "videos",
        "sentence": "Virginia was taking the child support out of my check, but somehow Maryland was always getting it late and reporting it as unpaid.\n\nThere is a lot to this story, but at the end of the day.."
    },
    {
        "subreddit": "videos",
        "sentence": "I wasn't going to not drive because Maryland couldn't get their shit straight"
    },
    {
        "subreddit": "videos",
        "sentence": "I only got pulled over like 3 times in the entire 20 years that this was happening, so it wasn't a huge deal"
    },
    {
        "subreddit": "videos",
        "sentence": "I had a letter from the DCSE in Virginia explaining that I *was* in fact paying"
    },
    {
        "subreddit": "videos",
        "sentence": "The few times I got pulled over, I was told they couldn't let me drive home but they never arrested or ticketed me.\n\nAll of that is to say, perhaps this dude was dealing with some bullshit like this"
    },
    {
        "subreddit": "videos",
        "sentence": "Unlikely for sure, but possible.\n\nWhat he did in this video though, is laughably stupid."
    },
    {
        "subreddit": "videos",
        "sentence": "Anybody seen the movie This is England?"
    },
    {
        "subreddit": "videos",
        "sentence": "Must suck when you have to defend criminals all day by giving them excuses and justifying their behaviour"
    },
    {
        "subreddit": "videos",
        "sentence": "Now he has to hand himself in to jail, or make a run for it"
    },
    {
        "subreddit": "videos",
        "sentence": "And I'll see you in the next thread talking about \"of course he is not going to hand himself in! He needs to feed his 5 starving children\""
    },
    {
        "subreddit": "videos",
        "sentence": "If you want to drive, follow the rules"
    },
    {
        "subreddit": "videos",
        "sentence": "Don't drink and drive"
    },
    {
        "subreddit": "videos",
        "sentence": "Don't speed"
    },
    {
        "subreddit": "videos",
        "sentence": "It's for everyone's safety."
    },
    {
        "subreddit": "videos",
        "sentence": "He's throwing fits about historical footage being redone in ai for fucks sakes"
    },
    {
        "subreddit": "videos",
        "sentence": "It's stupid and so are all of you for jumping on this ai bad hatetrain, as if it was actually skynet and not just a dumb image tool and little more."
    },
    {
        "subreddit": "videos",
        "sentence": "I looked into and they don’t."
    },
    {
        "subreddit": "videos",
        "sentence": "Um"
    },
    {
        "subreddit": "videos",
        "sentence": "I could be wrong but I thought the shot that revealed the entire mass grave was people of color and his xenophobia toward the two journalists he killed implied that he had been to the nearby “oddly peaceful” federal aligned (traditional American flag shown on town entry) town run by creepy dudes on rooftops which is where he collected all those bodies (I don’t think any POC were portrayed *living* in the peaceful town)"
    },
    {
        "subreddit": "videos",
        "sentence": "Since the town was under federal control and also the fact that they are wearing fatigues (secessionist soldiers in this region are seen without “real” gear sort of implying they’re a militia rather than the well supplied federal military and WF) as well as the fact that Plemons is immediately hostile to the press, and is only looking for the smallest reason to murder them, and it has previously been revealed that the federal govt is extremely hostile to the press (which is why they only ever embed w Florida alliance and WF)"
    },
    {
        "subreddit": "videos",
        "sentence": "Furthermore they hint that maybe one of the defining features of the federal government, which seems to be very unpopular amongst most other Americans, is that they might be super racist"
    },
    {
        "subreddit": "videos",
        "sentence": "The old black reporter says “do I really have to spell it out?” when referring to why he “needs” to be on the front lines for the July 4 push to DC"
    },
    {
        "subreddit": "videos",
        "sentence": "My thought was maybe his reason was it was especially meaningful as a black man"
    },
    {
        "subreddit": "videos",
        "sentence": "He also suggests that the all white happy town would be an unsafe place for them to stay and rest (“it wouldn’t have suited us anyway we would’ve gotten bored”) once he is spotted by the roof people"
    },
    {
        "subreddit": "videos",
        "sentence": "In contrast I think the snipers were probably WF but this is flimsier"
    },
    {
        "subreddit": "videos",
        "sentence": "I only guess that because they are covered in colored dust which appears to be a tactic of the secessionists as seen in the firefight between the irregulars (maybe Floridians?) and the presence of the colored dust at the stadium"
    },
    {
        "subreddit": "videos",
        "sentence": "He asks if they’re WF because they’re in uniforms which means they’re either wf or federal"
    },
    {
        "subreddit": "videos",
        "sentence": "He assumes wf because they don’t seem hostile"
    },
    {
        "subreddit": "videos",
        "sentence": "They could be either because the territory is in flux here near the front lines"
    },
    {
        "subreddit": "videos",
        "sentence": "To the point where WF forces “have been stalled” due to “losing their supply lines”"
    },
    {
        "subreddit": "videos",
        "sentence": "It would appear the gang is arriving in Charlottesville right as these lines are being restablished - hence the assault by WF"
    },
    {
        "subreddit": "videos",
        "sentence": "I also think that the reason the guy in the house shot at the car despite the press label is because he’s a federalist or loyalist who hates the press as they seem to do"
    },
    {
        "subreddit": "videos",
        "sentence": "I think the main point of this scene though is that they couldn’t been either and it didn’t matter."
    },
    {
        "subreddit": "videos",
        "sentence": "True, if he didn't care enough to not drive without a license, he probably forgot about the court date."
    },
    {
        "subreddit": "videos",
        "sentence": "If you have to have a car to live your life, you should probably not fuck around and get your license yoinked"
    },
    {
        "subreddit": "videos",
        "sentence": "Let's also not pretend like you don't have to have *multiple* infractions or unpaid tickets to get your license suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "Also suspension isn't really a deterant, those are what tickets are for"
    },
    {
        "subreddit": "videos",
        "sentence": "Suspension is what happens when the deterant hasn't worked."
    },
    {
        "subreddit": "videos",
        "sentence": "WTf"
    },
    {
        "subreddit": "videos",
        "sentence": "No one is saying this man is a victim, frankly he's beyond an idiot to the point he's actively dangerous.\n\nAnd that's why it's so important to use this as an opportunity to talk about America's car centrism and shitty infrastructure as it's simply the pragmatic answer.\n\nLet's zoom out for a minute and talk about sheer pragmatic realities, in the US not having car is almost guarenteed for non-employment which will inevitably lead to homelessness and/or death"
    },
    {
        "subreddit": "videos",
        "sentence": "Now to your surprise I'm not going to argue whether that's inherently a good or a bad thing"
    },
    {
        "subreddit": "videos",
        "sentence": "Instead what I'm going to argue is that from a pragmatic sense it's causing a selection bias for commiting these acts"
    },
    {
        "subreddit": "videos",
        "sentence": "Because the decision in a lot of these places isn't \"Risk going to jail\" vs \"Just take the bus\", the decision is \"Risk going to jail\" vs \"Being homeless\""
    },
    {
        "subreddit": "videos",
        "sentence": "Naturally being a non guarenteed result these people that have already shown to embody anti-social, selfish, and frankly stupid behavior are going to pick the option that just risks their lives being ruined over the one that guarentees it.\n\nWorse though is that for every one of this douchebag there's going to nine more that never get caught until make an innocent person a victim of their selfish acts"
    },
    {
        "subreddit": "videos",
        "sentence": "Shifting the victimhood to these innocent people who will feel the pain and impact of something they don't deserve, and no matter how we ramp up enforcement it's just unviable to reliably catch the other nine before they commit their crime.\n\nI'd also argue that said public transportation spending also benefits the blameless victims directly also as obviously better transportation could be a better solution for their personal life.\n\nBut tl;dr don't think of this as an act to reward the perps, think of it as an act to protect the truly innocents"
    },
    {
        "subreddit": "videos",
        "sentence": "Because just base decision making means until you do give viable public transportation and cultural shifts they are going to take the option that spills more blood everytime."
    },
    {
        "subreddit": "videos",
        "sentence": "OG superman couldn't fly, he could jump like the hulk and guide how he fell"
    },
    {
        "subreddit": "videos",
        "sentence": "\"Leap over tall buildings in a single bound\"\n\n  \nThe bad guy asked her first without the gag"
    },
    {
        "subreddit": "videos",
        "sentence": "In the scene where she's wearing a gag he says \"Won't talk, eh?\""
    },
    {
        "subreddit": "videos",
        "sentence": "Walk, bicycle, bus, train."
    },
    {
        "subreddit": "videos",
        "sentence": "Lmao"
    },
    {
        "subreddit": "videos",
        "sentence": "That was my favorite part."
    },
    {
        "subreddit": "videos",
        "sentence": "Fair enough, got me there."
    },
    {
        "subreddit": "videos",
        "sentence": "its was their only opening and he forgot about the court date."
    },
    {
        "subreddit": "videos",
        "sentence": "How fucking stupid do you have to be..?"
    },
    {
        "subreddit": "videos",
        "sentence": "I watch a lot of court videos, and I get what you're saying, but this isn't an example of what you're talking about"
    },
    {
        "subreddit": "videos",
        "sentence": "This isn't a \"big fuckup, of the sort you'll probably make two or three times in your life,\" it's a \"you'd have to be mentally incapacitated to do this\" video"
    },
    {
        "subreddit": "videos",
        "sentence": "Lots of people drive to a courthouse on a suspended license when being charged with driving on a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "They all say that their friend dropped them off at the courthouse"
    },
    {
        "subreddit": "videos",
        "sentence": "Sometimes, the judge will then say he/she is going to check the courthouse camera footage to double-check, at which point the defendant usually says \"oh...um...actually, I drove myself.\"  \n  \nWhen they drove to court, they were likely simply thinking \"the judge is in court, he won't know how I got here.\" Maybe some think a step ahead and think \"If asked, I'll just say a friend dropped me off.\" They don't know the parking lot has cameras, or they know it but they don't expect the judge would go through all the trouble of pulling up security camera footage"
    },
    {
        "subreddit": "videos",
        "sentence": "So they have a weak-ass plan, but *they have a plan*"
    },
    {
        "subreddit": "videos",
        "sentence": "*That's* the kind of fuckup that happens because of financial straits"
    },
    {
        "subreddit": "videos",
        "sentence": "It's not super uncommon"
    },
    {
        "subreddit": "videos",
        "sentence": "But there's a very, very big difference between that and making your appearance in court *live on camera where you can be seen engaging in the crime you're accused of*, and then nonchalantly *telling* the judge that you're engaging in the crime you're accused of"
    },
    {
        "subreddit": "videos",
        "sentence": "That's zero plan"
    },
    {
        "subreddit": "videos",
        "sentence": "He didn't even do the thing where he turns off his camera, say that his camera isn't working \"for some reason,\" and then pretends to figure it out once he's no longer driving"
    },
    {
        "subreddit": "videos",
        "sentence": "I've seen what I'm pretty sure is that from time to time"
    },
    {
        "subreddit": "videos",
        "sentence": "Again, I get what you're getting at with cases where people don't recognize that defendants have made a choice because they're stuck between a rock and a hard place (like driving to court because they're too poor to call an uber, have no friends who can drive them, and would lose bail status for a failure to appear if they didn't go to court), but this isn't that kind of situation, it's mentally incapacitated territory."
    },
    {
        "subreddit": "videos",
        "sentence": "Yup, we have the same taste in preferred Geoguessr content, lol"
    },
    {
        "subreddit": "videos",
        "sentence": "His American trip was actually one of my least favourites (saying \"least favourite\" in terms of this channel still means I like it tho)."
    },
    {
        "subreddit": "videos",
        "sentence": "I don't know what's more surprising, him driving on a suspended license or having Sadie Sink as his lawyer."
    },
    {
        "subreddit": "videos",
        "sentence": "You could not have a better pfp for this particular subject matter lmfao"
    },
    {
        "subreddit": "videos",
        "sentence": "I live in a town of 70,000 people and we have zero fee bus service"
    },
    {
        "subreddit": "videos",
        "sentence": "I mean I'm in Montana for crying out loud"
    },
    {
        "subreddit": "videos",
        "sentence": "He has options, now he's getting jail time."
    },
    {
        "subreddit": "videos",
        "sentence": "nah this doesnt work"
    },
    {
        "subreddit": "videos",
        "sentence": "Dwight?"
    },
    {
        "subreddit": "videos",
        "sentence": "What a nonsensical retort"
    },
    {
        "subreddit": "videos",
        "sentence": "I guess we can give arbitrary sentences for crimes since the simple solution is for people not to commit crimes.\n\nThe comment also already told you what else could be done ie offer good public transport"
    },
    {
        "subreddit": "videos",
        "sentence": "Transportation as stupid as it sounds is a basic need like shelter"
    },
    {
        "subreddit": "videos",
        "sentence": "Also most people don't drive like maniacs because driving is just a utility to them, they actually want to get somewhere and not die within a couple of weeks, not to mention that you usually aren't any faster by driving erratically most time wasted comes from stuff like traffic not the speed limit or having to follow roads"
    },
    {
        "subreddit": "videos",
        "sentence": "Doing stuff like driving against the flow of traffic is actually very exhausting something people generally like to avoid."
    },
    {
        "subreddit": "videos",
        "sentence": "Then *reschedule the fucking doctors appointment*!"
    },
    {
        "subreddit": "videos",
        "sentence": "Must suck when someone points out what actually happens in the real world, instead of make believe.\n\nSuspending someone's licenses and sending them on their way doesn't work out"
    },
    {
        "subreddit": "videos",
        "sentence": "But yeah...its those damn liberals"
    },
    {
        "subreddit": "videos",
        "sentence": "in the directors cut , her breasts turned into truck headlamps"
    },
    {
        "subreddit": "videos",
        "sentence": "There’s another video on the guy’s channel of the rescue"
    },
    {
        "subreddit": "videos",
        "sentence": "The thing that immediately jumps out is that it’s now pitch black, so he must have been clinging to that tree for a while!  \n\nOnce they land back at base, one of the chopper crew can clearly be heard saying “anything for the ‘gram, huh?”"
    },
    {
        "subreddit": "videos",
        "sentence": "that boy a robust pumpkin"
    },
    {
        "subreddit": "videos",
        "sentence": "Oh I'm sorry, I thought this was America!"
    },
    {
        "subreddit": "videos",
        "sentence": "Don’t forget the prosecutor trying to hide her smirk in the corner lol"
    },
    {
        "subreddit": "videos",
        "sentence": "I'd imagine that PD stands for \"Public Defender\" in this particular case."
    },
    {
        "subreddit": "videos",
        "sentence": "I mean, have you changed your mind or something?!"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm just really curious why he had a doctors appointment scheduled at the same time as his Zoom Court date?"
    },
    {
        "subreddit": "videos",
        "sentence": "There was no sequel."
    },
    {
        "subreddit": "videos",
        "sentence": "I actually disagree."
    },
    {
        "subreddit": "videos",
        "sentence": "the sequel 6 years later proved you wrong"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm getting so sick of American liberals"
    },
    {
        "subreddit": "videos",
        "sentence": "You fuckers are so extremely annoying"
    },
    {
        "subreddit": "videos",
        "sentence": "You'll just excuse almost anything that someone does because the \"system is unfair\""
    },
    {
        "subreddit": "videos",
        "sentence": "It's unfair for everyone"
    },
    {
        "subreddit": "videos",
        "sentence": "If you can't follow basic rules in society, then you will penalised"
    },
    {
        "subreddit": "videos",
        "sentence": "If you break even more rules you'll go to jail too"
    },
    {
        "subreddit": "videos",
        "sentence": "Should we not do that because people need to support their family?  \n\n\"Oh yeah he raped a woman/beat up an old man/robbed a house, but he needs to support his family so you can't send him to jail.\""
    },
    {
        "subreddit": "videos",
        "sentence": "Love watching these every year 😆"
    },
    {
        "subreddit": "videos",
        "sentence": "...Most courts in the US already recognize this and that's why you have to royally fuck up to lose your license.\n\nAnd while US public transportation sucks, I think most people make it sound like we live in bum fuck nowhere"
    },
    {
        "subreddit": "videos",
        "sentence": "It's just going to be very inconvenient for you"
    },
    {
        "subreddit": "videos",
        "sentence": "Unless you're in like the Appalachian mountains somewhere, then make the case for your license and sometimes you can conditionally get it back.\n\n---\n\nSide note, there's a lot of people who I feel like let their heart get strung along by people who've fucked up and will continue to fuck up's sob stories without realizing how manipulative they are trying to get people to see as if their side is the only grand truth.\n\nThere are usually a lot of options"
    },
    {
        "subreddit": "videos",
        "sentence": "Most people are too lazy or too selfish to take advantage of the options and be considerate while they had privileges.\n\nAre there injustices? Yes"
    },
    {
        "subreddit": "videos",
        "sentence": "Are there a lot of shit that can be done better? Yes"
    },
    {
        "subreddit": "videos",
        "sentence": "But fuck, there are a shiton of people in the US that don't know how good they have it."
    },
    {
        "subreddit": "videos",
        "sentence": "“The sea was angry that day, my friends.”"
    },
    {
        "subreddit": "videos",
        "sentence": "imaging his locked-in monologue screaming into the void, unable to be heard"
    },
    {
        "subreddit": "videos",
        "sentence": "I'll raise you one exploding [whale](https://youtu.be/V6CLumsir34?si=i1W4SuLK0gcyRRtO)"
    },
    {
        "subreddit": "videos",
        "sentence": "Each day through my window i watch her as she passes byyyYyyy."
    },
    {
        "subreddit": "videos",
        "sentence": "I'd be such a bad judge"
    },
    {
        "subreddit": "videos",
        "sentence": "My reaction would just be like \"so you defrauded a multi-billion dollar company of $800 for some strangers, and received no material benefit?  This is stupid; get out of here.\""
    },
    {
        "subreddit": "videos",
        "sentence": "Police departments don’t call people for the court system."
    },
    {
        "subreddit": "videos",
        "sentence": "> You might be surprised to find out that if you get your license suspended\n\nYou might also be surprised to find out just how easy it is to NOT get your license suspended!"
    },
    {
        "subreddit": "videos",
        "sentence": "vegetable is a stretch looking at his physique"
    },
    {
        "subreddit": "videos",
        "sentence": "I mean look at what the largest demographic of reddit is by far and that should tell you all you need to know about why they came to this conclusion.\n\nAnd hell *I'm technically part of that demographic*"
    },
    {
        "subreddit": "videos",
        "sentence": "What can I do to have her represent me 😍"
    },
    {
        "subreddit": "videos",
        "sentence": "You’d be surprised as to how many people do actually just say it but not never reaches anyone important."
    },
    {
        "subreddit": "videos",
        "sentence": "These videos always kind of annoyed me the title is \"four levels of tacos,\" but these videos literally start with \"we invited a buncha chefs to make three levels of tacos.\" The fourth level is just somebody, what, talking about them?"
    },
    {
        "subreddit": "videos",
        "sentence": "how fucking stupid can you actually be 🤣this is gold comedy"
    },
    {
        "subreddit": "videos",
        "sentence": "That is sage advice"
    },
    {
        "subreddit": "videos",
        "sentence": "I will pass this on to my children"
    },
    {
        "subreddit": "videos",
        "sentence": "Thank you."
    },
    {
        "subreddit": "videos",
        "sentence": "This one is grandfathered in, I think"
    },
    {
        "subreddit": "videos",
        "sentence": "This reminds me of the movie Idiocracy."
    },
    {
        "subreddit": "videos",
        "sentence": "So, ,How do we download vimeo vids again? :-D"
    },
    {
        "subreddit": "videos",
        "sentence": "So then follow the fucking rules!!"
    },
    {
        "subreddit": "videos",
        "sentence": "You're absolutely right in everything you say"
    },
    {
        "subreddit": "videos",
        "sentence": "We all empathize with someone who has to do what's necessary to survive, so no compassionate person is going to condemn this guy for driving with a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "On the other hand, dude, come on, you just can't be that blatantly stupid to show up to your hearing operating a vehicle."
    },
    {
        "subreddit": "videos",
        "sentence": "No ones mentioning he's a victim, this is simple causality, cause and effect"
    },
    {
        "subreddit": "videos",
        "sentence": "Man can't provide a living without a car, what's he going to do lie over and die or just drive the car? This in turn hurts the general public, if anything the general public is the victim here and these car unfriendly infrastructure acts as a selection bias for harm to be done to law abiding citizens this way.\n\nNo one is saying the man shouldn't be in jail for being caught red handed like that"
    },
    {
        "subreddit": "videos",
        "sentence": "It's just a simple matter that for every 1 of him there are 9 others that won't be caught until they harm someone because on a personal level there is no incentive to comply"
    },
    {
        "subreddit": "videos",
        "sentence": "Yes you might say the incentive is \"Not be in jail\" which is normally a very good incentive but in this case it's being balanced against \"Not being homeless\" or \"Not being dead\" and it becomes obvious what survival instinct chooses as the greater of two bad choices."
    },
    {
        "subreddit": "videos",
        "sentence": ">You can’t even be armed in any place that serves\n\nThis is not the case everywhere, and depends on state law"
    },
    {
        "subreddit": "videos",
        "sentence": "Some states it's anywhere that serves alcohol, some states it's legal but you obviously can't drink, some states it's legal in the restaurant but not in the area considered \"the bar,\" and in some states it's illegal if they derive a certain portion of their revenue from alcohol sales"
    },
    {
        "subreddit": "videos",
        "sentence": "It's up to you to figure out which one is relevant to the state you're in."
    },
    {
        "subreddit": "videos",
        "sentence": "With the number of pedos in the movie industry, this scene is not that surprising."
    },
    {
        "subreddit": "videos",
        "sentence": "What happened to all those freedoms I keep hearing about"
    },
    {
        "subreddit": "videos",
        "sentence": "Can't even carry a gun anywhere you need it! Main people that get aggressive are drunks and they LIVE at the bars"
    },
    {
        "subreddit": "videos",
        "sentence": "SMH."
    },
    {
        "subreddit": "videos",
        "sentence": "Which is why you don't do it right?"
    },
    {
        "subreddit": "videos",
        "sentence": "I remember watching this when I was a kid"
    },
    {
        "subreddit": "videos",
        "sentence": "The nostalgia 😢"
    },
    {
        "subreddit": "videos",
        "sentence": "Just call back or put it on mute/face the phone down"
    },
    {
        "subreddit": "videos",
        "sentence": "Even when he was parked it looked like he was moving"
    },
    {
        "subreddit": "videos",
        "sentence": "Then he turned on the music"
    },
    {
        "subreddit": "videos",
        "sentence": "The judge looked up and was even like wtf?"
    },
    {
        "subreddit": "videos",
        "sentence": "I really wanted to hear him explain his way out of that but he just had a shocked face with a gaping open mouth."
    },
    {
        "subreddit": "videos",
        "sentence": "Oh god, I love this Judge"
    },
    {
        "subreddit": "videos",
        "sentence": "Court hearings can last a really long time while you wait for your name to be called."
    },
    {
        "subreddit": "videos",
        "sentence": "I’ve had that feeling and when it’s in front of a judge or superior or sucks!"
    },
    {
        "subreddit": "videos",
        "sentence": "> I thought that was the dumbest thing I’d ever seen in court.\n\nReddit be like, \"Hold my beer....\""
    },
    {
        "subreddit": "videos",
        "sentence": "It was strewn around here and there when it was called for for effect but it wasn't overt."
    },
    {
        "subreddit": "videos",
        "sentence": "I'm just pointing out that saying PRIVILEGE more doesn't solve the problem or keep these people off the roads until they are in jail"
    },
    {
        "subreddit": "videos",
        "sentence": "It's just screaming at clouds"
    },
    {
        "subreddit": "videos",
        "sentence": "An actual solution is to improve public transportation so it actually is a privilege"
    },
    {
        "subreddit": "videos",
        "sentence": "In most states you can be in a place that serves drinks but you cannot go to the bar with your concealed carry"
    },
    {
        "subreddit": "videos",
        "sentence": "I was under the impression that this was all states after my class."
    },
    {
        "subreddit": "videos",
        "sentence": "\"Hello?\""
    },
    {
        "subreddit": "videos",
        "sentence": "This is why I hate that people rip on all public defenders…I’ve worked with some that are better than the representing ADA or even DA, then you gotta deal with stuff like this"
    },
    {
        "subreddit": "videos",
        "sentence": "I’ve literally been given more trouble by defendants than the opposite! It’s sad but, true! I’ve been told I’m incompetent because I asked a question about the name of the persons work for example, had people literally bring in scalpels and stuff serious enough to lock down the floor but, yeah we were the young dumb idiots."
    },
    {
        "subreddit": "videos",
        "sentence": "they created the dialogue (with real AI, most likely), iterated on the voiced lines until they liked what they had, edited it together, with animations, and presented it as if it was one experiment happening in real-time"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s LITERALLY her job to zealously advocate"
    },
    {
        "subreddit": "videos",
        "sentence": "She did nothing"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s not making up explanations; it’s asking for time to confer with the client as to the reason."
    },
    {
        "subreddit": "videos",
        "sentence": "I don't think I've sent that many texts in my entire life"
    },
    {
        "subreddit": "videos",
        "sentence": "Would be not be surprised if I haven't sent a tenth that many texts over the past few decades"
    },
    {
        "subreddit": "videos",
        "sentence": "Sheesh"
    },
    {
        "subreddit": "videos",
        "sentence": "Unless he's one of those people that"
    },
    {
        "subreddit": "videos",
        "sentence": "Sends texts"
    },
    {
        "subreddit": "videos",
        "sentence": "Like this"
    },
    {
        "subreddit": "videos",
        "sentence": "Broken up"
    },
    {
        "subreddit": "videos",
        "sentence": "One"
    },
    {
        "subreddit": "videos",
        "sentence": "Or two words"
    },
    {
        "subreddit": "videos",
        "sentence": "At a time"
    },
    {
        "subreddit": "videos",
        "sentence": "There's a special place in hell for people like that."
    },
    {
        "subreddit": "videos",
        "sentence": "\"if not, can I show up really drunk to make my first evening of slow torture more tolerable?\""
    },
    {
        "subreddit": "videos",
        "sentence": "I was surprised no AI recognized that."
    },
    {
        "subreddit": "videos",
        "sentence": "The irony that 2 cases later is a guy pleading guilty to letting someone operate his vehicle with a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "Wait...the constant talking, arguing, singing, droning that goes on in my head isn't something everyone has?\n\nI couldn't even imagine life without that voice."
    },
    {
        "subreddit": "videos",
        "sentence": "There is a practical alternative, it's called follow the laws of the road so you don't get the your driving PRIVILEGES taken away"
    },
    {
        "subreddit": "videos",
        "sentence": "0 sympathy for any of these morons"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving can be incredibly dangerous and this dumb fuck was facetiming while driving, its pretty obvious he shouldn't be on the road and it's pretty fucking stupid for you to say people should be forced to share the road with people like this."
    },
    {
        "subreddit": "videos",
        "sentence": "Over four months! That's more than I've sent in the last four years"
    },
    {
        "subreddit": "videos",
        "sentence": "He said he was driving into his Doctors office because the fact that he had a court hearing about driving with his suspended license was a waste of his time"
    },
    {
        "subreddit": "videos",
        "sentence": "Then he said “hello?!” Impatiently because the court hearing didn’t end immediately with no consequences"
    },
    {
        "subreddit": "videos",
        "sentence": "Then he said “oh my gawwwwd 🙄” when his license was revoked and he was ordered to turn himself into the police or risk a bench warrant with no bond."
    },
    {
        "subreddit": "videos",
        "sentence": "bro what"
    },
    {
        "subreddit": "videos",
        "sentence": "Pretty distracting place to film an interview, driver probably distracted by the camera crew."
    },
    {
        "subreddit": "videos",
        "sentence": "> You can’t even be armed in any place that serves or while drinking\n\nI'm sure this varies by state, but in Ohio you can absolutely be armed in a bar, you just can't be drinking."
    },
    {
        "subreddit": "videos",
        "sentence": "luckily, we now have [KENN](https://www.youtube.com/watch?v=Svual-PcOxE)"
    },
    {
        "subreddit": "videos",
        "sentence": "Not her job to jump through hoops making up explanations based on zero evidence"
    },
    {
        "subreddit": "videos",
        "sentence": "If this was a criminal trial with presumption of innocence where her job is to generate a reasonable doubt, then sure, but this was a bond hearing and he blatantly got on camera while driving, and he had every opportunity to frame the situation as an emergency"
    },
    {
        "subreddit": "videos",
        "sentence": "He did not"
    },
    {
        "subreddit": "videos",
        "sentence": "He extremely casually talked about going to the doctor and acted as if there was no issue"
    },
    {
        "subreddit": "videos",
        "sentence": "He acts as if he forgot his license was suspended.\n\nA lawyer's job is to present the facts in a way that represents their client's interests, but fabricating \"it is possible\" type of situations is not the way to do that, especially when there is evidence (his demeanor) to indicate otherwise."
    },
    {
        "subreddit": "videos",
        "sentence": "Fine, take out the lightheaded part."
    },
    {
        "subreddit": "videos",
        "sentence": "ok i am just gonna speak on the power of facial hair i have seen this guys videos alot lately and i remember seeing this aricle but damn he looks different with a stache."
    },
    {
        "subreddit": "videos",
        "sentence": "True, but be careful not to generalize"
    },
    {
        "subreddit": "videos",
        "sentence": "I had a situation where I was completely innocent and my public defender did a fantastic job and not only got the case thrown out but the whole thing expunged off of my record.\n\n\nPublic defenders who actually care are amazing human beings, the job is stressful"
    },
    {
        "subreddit": "videos",
        "sentence": "That may be true, but you don't charged with driving with a suspended license unless you're doing something else wrong that causes a cop to pull you over in the first place"
    },
    {
        "subreddit": "videos",
        "sentence": "I've been driving for nearly 35 years, and have gotten pulled over by the police maybe 5 or 6 times, and every single time it was because I was doing something stupid like speeding, or running a red light, etc"
    },
    {
        "subreddit": "videos",
        "sentence": "If I had a suspended license, for whatever reason, and desperately needed to drive, I would make damn sure I followed the rules of the road.\n\nThis guy did something to get his license suspended, we don't know what.\n\nThen he continued to drive, and did something that caused a police officer to pull him over, thus getting him the charge he's facing in court of driving with a suspended license.\n\nThen, knowing the potential consequences, he not only continued to drive, but actually connected to a video chat of his own court case, WHILE DRIVING.\n\nSome people are too stupid to be allowed to walk around."
    },
    {
        "subreddit": "videos",
        "sentence": "Cleopatra's entire answer was basically just \"A ruler should play good cop bad cop\"."
    },
    {
        "subreddit": "videos",
        "sentence": "Hey, it's a competitive market, maybe they would like a Camel instead"
    },
    {
        "subreddit": "videos",
        "sentence": "I'd walk a mile for a Camel!"
    },
    {
        "subreddit": "videos",
        "sentence": "Maybe the client froze up because court proceedings make him nervous.\n\nI think you get the point"
    },
    {
        "subreddit": "videos",
        "sentence": "Sure, the judge may not  buy it"
    },
    {
        "subreddit": "videos",
        "sentence": "But it may be jusssstt enough to keep the client out of jail."
    },
    {
        "subreddit": "videos",
        "sentence": "Saying you're lightheaded is not a good excuse to go driving...\n\nIn fact, it's a damn good reason NOT to be driving."
    },
    {
        "subreddit": "videos",
        "sentence": "Because saying is much cheaper than doing."
    },
    {
        "subreddit": "videos",
        "sentence": "Watch out, you'll summon the ghost of Michael Jackson"
    },
    {
        "subreddit": "videos",
        "sentence": "The level of bullshit you have to produce to rise to the level of getting your license suspended is absurd"
    },
    {
        "subreddit": "videos",
        "sentence": "This guy must have been an absolute hazard on the road for it to get this far, and he still didn’t think twice about it."
    },
    {
        "subreddit": "videos",
        "sentence": "Granted, but in *one thousand years* will he be truly remembered?  As an example when I search 'world events in 1024' all I could find was:\n\nHoly Roman Empire\nHenry II died in 1024 and Conrad II, first of the Salian Dynasty, was elected king only after some debate among dukes and nobles"
    },
    {
        "subreddit": "videos",
        "sentence": "This group eventually developed into the college of Electors\n\nI am sure plenty of shit happened, but this is all the interwebs can cough up"
    },
    {
        "subreddit": "videos",
        "sentence": "In 3024, I doubt Trump would even get that much."
    },
    {
        "subreddit": "videos",
        "sentence": "I'm pretty sure many cartoon characters smoked, back in the day"
    },
    {
        "subreddit": "videos",
        "sentence": "Pepe Le Pew comes to mind."
    },
    {
        "subreddit": "videos",
        "sentence": "John's taco is the taco I'd expect from a John."
    },
    {
        "subreddit": "videos",
        "sentence": "I had to go to a sheriff's station to get fingerprints done"
    },
    {
        "subreddit": "videos",
        "sentence": "When needing to confirm my ID, I opened my wallet and my driver's license just wasn't in there"
    },
    {
        "subreddit": "videos",
        "sentence": "Turns out I had I left it at home paperclipped to my passport because I was doing other licensing stuff earlier"
    },
    {
        "subreddit": "videos",
        "sentence": "It was a pretty funny moment when I was calculating what I should do with the cop standing in front of me in a small room."
    },
    {
        "subreddit": "videos",
        "sentence": "All he had to do was to clear some time for the Court."
    },
    {
        "subreddit": "videos",
        "sentence": "It’s a wonder this dolt completed a driver’s test in order to have a license to be suspended."
    },
    {
        "subreddit": "videos",
        "sentence": "What insecurity or failure is on display here exactly? I'm just sick of seeing people made to dance and beg for scraps"
    },
    {
        "subreddit": "videos",
        "sentence": "Work is not some gift employers are bestowing on some deserving soul"
    },
    {
        "subreddit": "videos",
        "sentence": "You need employees to function, and you're going to pay them as little as you can get away with"
    },
    {
        "subreddit": "videos",
        "sentence": "Why should they have to perform a free show for you on top of that?"
    },
    {
        "subreddit": "videos",
        "sentence": "Oh man, that's gross..."
    },
    {
        "subreddit": "videos",
        "sentence": "https://www.theguardian.com/technology/2023/sep/01/mushroom-pickers-urged-to-avoid-foraging-books-on-amazon-that-appear-to-be-written-by-ai or https://www.reddit.com/r/behindthebastards/comments/15xclq9/this_is_worse_than_the_dinosaur_colouring_books/"
    },
    {
        "subreddit": "videos",
        "sentence": "Meanwhile, on some other careers subreddit, \"I just nailed my job interview, but they decided to pass on me, even though I was the obvious best candidate"
    },
    {
        "subreddit": "videos",
        "sentence": "I can't figure out why...\""
    },
    {
        "subreddit": "videos",
        "sentence": "I love how she tried to called to adjourn the case immediately once she noticed lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Maybe a .0001% of having worked if the judge hadn't been paying attention"
    },
    {
        "subreddit": "videos",
        "sentence": "If the only place to eat in town is a buffet that one guy keeps crapping in, that’s fine if he gets banned from the buffet"
    },
    {
        "subreddit": "videos",
        "sentence": "He can starve."
    },
    {
        "subreddit": "videos",
        "sentence": "His demeanor did not broadcast urgency at all"
    },
    {
        "subreddit": "videos",
        "sentence": "He sat there dumbfounded after juuuust pulling into the parking lot….almost there….just wait on me, your honor."
    },
    {
        "subreddit": "videos",
        "sentence": "Early 50s"
    },
    {
        "subreddit": "videos",
        "sentence": "I haven't seen this movie since I was a kid"
    },
    {
        "subreddit": "videos",
        "sentence": "All I remembered was the bald chick and V-Ger and the first movie being super disco while the tv show was low budget campy"
    },
    {
        "subreddit": "videos",
        "sentence": "Rewatching this edit made me realize how cool the visuals are even if they are cheesy."
    },
    {
        "subreddit": "videos",
        "sentence": "At high prices and fees."
    },
    {
        "subreddit": "videos",
        "sentence": "I still remember the days when carpooling was a thing.\n\nAnd you know"
    },
    {
        "subreddit": "videos",
        "sentence": "Uber"
    },
    {
        "subreddit": "videos",
        "sentence": "Bike"
    },
    {
        "subreddit": "videos",
        "sentence": "Walk"
    },
    {
        "subreddit": "videos",
        "sentence": "Doesn't really matter which.\n\nYou didn't appreciate the privilege of driving, so go figure it out yourself (figurative you)\n\nThis is like saying we shouldn't jail people because they have a house to maintain lol"
    },
    {
        "subreddit": "videos",
        "sentence": "The scene would move mountains if the genders were swapped!"
    },
    {
        "subreddit": "videos",
        "sentence": "I've always thought either with and without an internal monologue, depending on the situation"
    },
    {
        "subreddit": "videos",
        "sentence": "I assumed everyone else did, too, until just a couple years ago"
    },
    {
        "subreddit": "videos",
        "sentence": "Sometimes language is the tool for the job"
    },
    {
        "subreddit": "videos",
        "sentence": "Sometimes the internal feelings unfolding as they may get the message across to me just fine, too"
    },
    {
        "subreddit": "videos",
        "sentence": "It's interesting to me that folks can't choose when to employ these different modes."
    },
    {
        "subreddit": "videos",
        "sentence": "Facebook is absolutely shoving a bunch of crazy Terrence Howard posts at me right now"
    },
    {
        "subreddit": "videos",
        "sentence": "I don’t even think I clicked through."
    },
    {
        "subreddit": "videos",
        "sentence": "Unexpected middle aged white dude breaking it down is another GOAT genre of internet videos."
    },
    {
        "subreddit": "videos",
        "sentence": "They might not be lies according to what we saw in the video"
    },
    {
        "subreddit": "videos",
        "sentence": "There’s also statements where further proof is not possible (“I suddenly felt extremely sick and lightheaded without reason”)."
    },
    {
        "subreddit": "videos",
        "sentence": "Nah bro isn't a victim"
    },
    {
        "subreddit": "videos",
        "sentence": "He had to have done sth serious to have his license revoked"
    },
    {
        "subreddit": "videos",
        "sentence": "All of the hardship on that is his own fault."
    },
    {
        "subreddit": "videos",
        "sentence": "Really, you’re shocked that people respond directly to the words you actually say?"
    },
    {
        "subreddit": "videos",
        "sentence": "Yes"
    },
    {
        "subreddit": "videos",
        "sentence": "You can’t even be armed in any place that serves or while drinking, much less actually shooting"
    },
    {
        "subreddit": "videos",
        "sentence": "Alcohol makes people trigger happy and uncoordinated"
    },
    {
        "subreddit": "videos",
        "sentence": "A receipt for disaster."
    },
    {
        "subreddit": "videos",
        "sentence": "Exactly"
    },
    {
        "subreddit": "videos",
        "sentence": "Too many fucking morons can't get around without a car."
    },
    {
        "subreddit": "videos",
        "sentence": "Just you average car driver"
    },
    {
        "subreddit": "videos",
        "sentence": "Doesn't give a fuck about anyone else."
    },
    {
        "subreddit": "videos",
        "sentence": "Occupational licenses include going to and from work and necessities given set driving hours"
    },
    {
        "subreddit": "videos",
        "sentence": "Clearly you're unfamiliar with the situation and probably shouldn't comment."
    },
    {
        "subreddit": "videos",
        "sentence": "\"I have a doctor's appointment at 8 and traffic court at 7:30"
    },
    {
        "subreddit": "videos",
        "sentence": "I can drive to the doctor's office and do court while waiting in the parking lot.\" <some time passes> \"Oh fuck, I'm running late"
    },
    {
        "subreddit": "videos",
        "sentence": "Okay I need to call into court now.\"\n\nYes, it's dumb to use your phone while driving, but some people do it regularly"
    },
    {
        "subreddit": "videos",
        "sentence": "This could easily be one of those cases where someone was 1) running late, and 2) is so used to using his phone while driving that he didn't really think about what he was doing while using his phone.\n\nIt's not hard to imagine a common situation in which this is just an absent-minded, like they said: \"big fuckup, of the sort you'll probably make two or three times in your life\""
    },
    {
        "subreddit": "videos",
        "sentence": "Especially since being poor dumps a ton of stress on you that physically changes your body and consumes a lot of your everyday thought."
    },
    {
        "subreddit": "videos",
        "sentence": "The defendant couldn’t even get mad"
    },
    {
        "subreddit": "videos",
        "sentence": "He knew he just made the dumbest mistake."
    },
    {
        "subreddit": "videos",
        "sentence": "I believe most states revoke your license upon refusal to take a breathalyzer test for suspicion of DUI."
    },
    {
        "subreddit": "videos",
        "sentence": "You have insurance to protect everyone else on the road"
    },
    {
        "subreddit": "videos",
        "sentence": "Why should there be any expectations?"
    },
    {
        "subreddit": "videos",
        "sentence": "Ok judge."
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/MeowgicWhiskers,\n\n/r/Videos requires that your account be older than 7 days in order to submit content here"
    },
    {
        "subreddit": "videos",
        "sentence": "This is a spam-prevention method ***and cannot be waived***.\n\nPlease feel free to submit once your account is over 7 days old"
    },
    {
        "subreddit": "videos",
        "sentence": "You may also want to consider our minimum karma requirement of at least 10 of each type - [explained here](https://reddit.zendesk.com/hc/en-us/articles/204511829-What-is-karma) - so that you don't run into any further issues.\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "An occupational license allows you to do all those things so what's your issue?"
    },
    {
        "subreddit": "videos",
        "sentence": "Yea too bad so many places in the US don't have those exact services you're being sarcastic about!"
    },
    {
        "subreddit": "videos",
        "sentence": "I figured he was joking"
    },
    {
        "subreddit": "videos",
        "sentence": "But commenting just in case he didn't realize the video was 1988"
    },
    {
        "subreddit": "videos",
        "sentence": "Hence me pointing out the year rather than pointing out cellphones not existing then (to be pedantic cellphones existed and were used by millions of people, just not texting)."
    },
    {
        "subreddit": "videos",
        "sentence": "Nothing better than a good Judge Simpson or fraud arrest video"
    },
    {
        "subreddit": "videos",
        "sentence": "He knew that before he got his license suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "Its takes a lot of stupid little things or one big fuck up to lose it so just do those things"
    },
    {
        "subreddit": "videos",
        "sentence": "Its not the governments job to slap him on the wrist and say “look here buddy, having a license is important so don’t drink and drive again.” I’m sure he would learn his lesson…/s"
    },
    {
        "subreddit": "videos",
        "sentence": "I fully expect to see this on multiple court YouTube channels tomorrow"
    },
    {
        "subreddit": "videos",
        "sentence": "\"10 Girl\"? Ick"
    },
    {
        "subreddit": "videos",
        "sentence": "I would not be surprised if this wasn't the first...or second, or third...time she's had to deal with this same thing happening before"
    },
    {
        "subreddit": "videos",
        "sentence": "People are just plain stooopid."
    },
    {
        "subreddit": "videos",
        "sentence": "This is so salacious"
    },
    {
        "subreddit": "videos",
        "sentence": "I love it.\n\nIs it true? Well, the problem is that Kidman's dad was a vocal critic of Scientology when Nicole was married to Tom, so let's just say that Scientology likes to take long-term revenge on its critics.\n\nThat said, it's so juicy"
    },
    {
        "subreddit": "videos",
        "sentence": "I love stories like this"
    },
    {
        "subreddit": "videos",
        "sentence": "It's gossip that jumps the shark"
    },
    {
        "subreddit": "videos",
        "sentence": "But I have a taste for that."
    },
    {
        "subreddit": "videos",
        "sentence": "They even showed smoking in the cartoon itself."
    },
    {
        "subreddit": "videos",
        "sentence": "You obviously didn't watch this movie if you think it was about completely normal scenes."
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah but those would be lies.\nThe fact that the judge caught him driving would require more than a BS excuse.\nHe'd want actual, tangible proof (that doesn't exist)."
    },
    {
        "subreddit": "videos",
        "sentence": "> We can pretend everyone has options,\n\nThis man had options"
    },
    {
        "subreddit": "videos",
        "sentence": "Choices he made that lead to his license getting suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "He earned this, and he earned getting hit for it again"
    },
    {
        "subreddit": "videos",
        "sentence": "He's an idiot and the cause of his own problems"
    },
    {
        "subreddit": "videos",
        "sentence": "And then it very quickly cut away"
    },
    {
        "subreddit": "videos",
        "sentence": "Feels like those complaining about it didn't actually watch it."
    },
    {
        "subreddit": "videos",
        "sentence": "[This](https://youtu.be/wKNhCjA0pdU?si=jIqZPBNnVH6AQrIB) is my favorite"
    },
    {
        "subreddit": "videos",
        "sentence": "What does Shatner need with a Director’s Cut?"
    },
    {
        "subreddit": "videos",
        "sentence": "Not mine.....mine tells me to do things I shouldn't."
    },
    {
        "subreddit": "videos",
        "sentence": "[Quick, Johnny! Vamp, vamp!!!](https://youtu.be/y3drAHhNTog?si=fZndvYtX21VL4-rb&t=24)"
    },
    {
        "subreddit": "videos",
        "sentence": "Those popped collars returned in the mid-2000s"
    },
    {
        "subreddit": "videos",
        "sentence": "Lol I'm sure the cocaine was still around, too."
    },
    {
        "subreddit": "videos",
        "sentence": "That's a great idealistic response"
    },
    {
        "subreddit": "videos",
        "sentence": "In reality this is a regarded man"
    },
    {
        "subreddit": "videos",
        "sentence": "C'mon dude"
    },
    {
        "subreddit": "videos",
        "sentence": "Just call it as it is"
    },
    {
        "subreddit": "videos",
        "sentence": "How do you have a court date.."
    },
    {
        "subreddit": "videos",
        "sentence": "with ability of the **convenience** of not having to attend in person.."
    },
    {
        "subreddit": "videos",
        "sentence": "still manage to not only not be prepared, on time, and in a manner where you can put your best foot forward, but also **broadcast yourself breaking the same law you are accused of having broken**"
    },
    {
        "subreddit": "videos",
        "sentence": "And then on top of that be ***surprised at the outcome.***\n\nSaying this man lacks common sense is a comical understatement."
    },
    {
        "subreddit": "videos",
        "sentence": "Why were they naked though?.."
    },
    {
        "subreddit": "videos",
        "sentence": "\"I hate to see them work so hard.\"\n\n\"Yeah, me too, let's go out back where we can't see them.\"\n\ngreat joke..."
    },
    {
        "subreddit": "videos",
        "sentence": "I swear to god"
    },
    {
        "subreddit": "videos",
        "sentence": "They did it to us on purpose"
    },
    {
        "subreddit": "videos",
        "sentence": "1"
    },
    {
        "subreddit": "videos",
        "sentence": "Giant Dangerous streets all over\n\n2"
    },
    {
        "subreddit": "videos",
        "sentence": "Cripple public transit"
    },
    {
        "subreddit": "videos",
        "sentence": "Less busses, no trams/trains, no street cars"
    },
    {
        "subreddit": "videos",
        "sentence": "3"
    },
    {
        "subreddit": "videos",
        "sentence": "??????\n\n4"
    },
    {
        "subreddit": "videos",
        "sentence": "Profit \n\n\n\nIt’s so they can sell us a lot of car, a lot of gas, and a lot of repairs"
    },
    {
        "subreddit": "videos",
        "sentence": "It is a cruel game and I am so mad about it"
    },
    {
        "subreddit": "videos",
        "sentence": "I have a Toyota that kinda does that for a little while."
    },
    {
        "subreddit": "videos",
        "sentence": "Wait, it's illegal to operate a firearm drunk in the united states? That excludes like 99% of the fun parts."
    },
    {
        "subreddit": "videos",
        "sentence": "Wait till you hear about the 80s"
    },
    {
        "subreddit": "videos",
        "sentence": "No wait, the 70s were worse"
    },
    {
        "subreddit": "videos",
        "sentence": "No, no, the 60s!\nYou get the idea."
    },
    {
        "subreddit": "videos",
        "sentence": "Not necessarily true"
    },
    {
        "subreddit": "videos",
        "sentence": "People drive to urgent care for all sorts of urgent reasons"
    },
    {
        "subreddit": "videos",
        "sentence": "Or he may have been driving for an urgent reason for a family member"
    },
    {
        "subreddit": "videos",
        "sentence": "It doesn’t have to be fully justified"
    },
    {
        "subreddit": "videos",
        "sentence": "Just enough to make the judge not pissed off enough to revoke bond"
    },
    {
        "subreddit": "videos",
        "sentence": "Picking up urgent medications for a family member may be enough to just get a stern warning from the judge."
    },
    {
        "subreddit": "videos",
        "sentence": "> You're disgusting\n\nWhy not comment on that persons points instead of just insulting them?"
    },
    {
        "subreddit": "videos",
        "sentence": "Should had that cat lawyer"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm still shocked every time someone mistakes a general 'you' as a personal attack"
    },
    {
        "subreddit": "videos",
        "sentence": "\"***one*** can't cry about...\"\n\nsorry I got your dander up about something you don't even identify with."
    },
    {
        "subreddit": "videos",
        "sentence": "To be fair, these days you have to schedule doctors appointments months in advance."
    },
    {
        "subreddit": "videos",
        "sentence": "> But something on the order of 80% of people live within a 10 minute bike of a grocery store\n\nNot to mention delivery services, and rideshares"
    },
    {
        "subreddit": "videos",
        "sentence": "Or even, for that matter, *friends and family*."
    },
    {
        "subreddit": "videos",
        "sentence": "This guy is clearly mentally challenged"
    },
    {
        "subreddit": "videos",
        "sentence": "He probably need supervision, not being jailed, but sadly we don't have the resources dedicated to helping people like this."
    },
    {
        "subreddit": "videos",
        "sentence": "Most conversations are at least 5-10 messages back and forth"
    },
    {
        "subreddit": "videos",
        "sentence": "I have even longer ones with my accountant"
    },
    {
        "subreddit": "videos",
        "sentence": "Its not crazy to think you can have 5-6 conversations a day with your intern."
    },
    {
        "subreddit": "videos",
        "sentence": "I found this very funny as it was a violation of expectation"
    },
    {
        "subreddit": "videos",
        "sentence": "That is like my favorite flavor of humor"
    },
    {
        "subreddit": "videos",
        "sentence": "I can hear the horns from his song in my brain"
    },
    {
        "subreddit": "videos",
        "sentence": "Thank you"
    },
    {
        "subreddit": "videos",
        "sentence": "I feel really bad for him"
    },
    {
        "subreddit": "videos",
        "sentence": "He clearly doesn't have the mental capacity to understand what's going on"
    },
    {
        "subreddit": "videos",
        "sentence": "Jail is probably going to make all of this orders of magnitude worse, and won't address the core problem that he doesn't get that \"without a license\" is the problem he's dealing with."
    },
    {
        "subreddit": "videos",
        "sentence": "Why did Superman fall into the power lines?  Why did he have trouble with them?  Why did the bad guy put a gag on Lois and then order her to talk?"
    },
    {
        "subreddit": "videos",
        "sentence": "respect the grind tbh"
    },
    {
        "subreddit": "videos",
        "sentence": "Being a lawyer is about making the best (reasonable) argument possible"
    },
    {
        "subreddit": "videos",
        "sentence": "Obviously the dude was driving"
    },
    {
        "subreddit": "videos",
        "sentence": "Best argument is potential medical necessity."
    },
    {
        "subreddit": "videos",
        "sentence": "That is not a meaningful distinction"
    },
    {
        "subreddit": "videos",
        "sentence": "There is no difference between negligent and dangerous in this context"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving without insurance, for example, is dangerous to others in the form of potential financial harm.\n\nIt's certainly possible for people to have suspensions for bullshit reasons"
    },
    {
        "subreddit": "videos",
        "sentence": "But that's not a reasonable default assumption."
    },
    {
        "subreddit": "videos",
        "sentence": "Gee, if only we had things like delivery services available in this day and age"
    },
    {
        "subreddit": "videos",
        "sentence": "Or other people who make a living driving other people around"
    },
    {
        "subreddit": "videos",
        "sentence": "Imagine such a world!"
    },
    {
        "subreddit": "videos",
        "sentence": ">Having said that when I was a teen, if I were hit on by a cute teacher I would have been over the moon with joy so I totally understand how it happens often.\n\nI'm someone that this happened to, and wanted to offer a different perspective than the people who are just agreeing that they'd be happy about it but it's still wrong in principle.\n\nIt's easy to say you'd be over the moon with that sort of situation because when you imagine it, you're taking your safety as a given"
    },
    {
        "subreddit": "videos",
        "sentence": "But faced with the reality of someone you have conflicted and immature feelings about, someone with power over you, someone that you're in no position to refuse, it's different"
    },
    {
        "subreddit": "videos",
        "sentence": "The fantasy was harmless and innocent"
    },
    {
        "subreddit": "videos",
        "sentence": "The reality is petrifying, or at least it is for the ones teachers like that target"
    },
    {
        "subreddit": "videos",
        "sentence": "They aren't usually going after the popular students with lots of friends and a supportive family"
    },
    {
        "subreddit": "videos",
        "sentence": "The ones being groomed are the isolated kids from broken homes, the ones who don't have anyone they can turn to and who can be coerced into keeping quiet"
    },
    {
        "subreddit": "videos",
        "sentence": "The power is the point, and it's just damage on top of damage."
    },
    {
        "subreddit": "videos",
        "sentence": "I get all that, but why the fuck would he sign in to Zoom court on a driving with suspended license charge while *driving a car*? I don't know his circumstances or why he decided to drive with a suspended license in the first place, but to do the same thing that got him charged in the first place *while on a Zoom court call*  shows real stupidity and lack of judgement"
    },
    {
        "subreddit": "videos",
        "sentence": "What did he think was going to happen?"
    },
    {
        "subreddit": "videos",
        "sentence": "The man said “👁️👄👁️”"
    },
    {
        "subreddit": "videos",
        "sentence": "Preach"
    },
    {
        "subreddit": "videos",
        "sentence": "We are talking about someone that *already has a suspended license* - this isn't some poor schlub being downtrodden by the eeeeeevil capitalist society"
    },
    {
        "subreddit": "videos",
        "sentence": "Nope, dude got himself in trouble all on his own"
    },
    {
        "subreddit": "videos",
        "sentence": "If dude can't abide by the rules of the suspension of a license, then jail it is."
    },
    {
        "subreddit": "videos",
        "sentence": "“👁️👄👁️” and that is a direct quote"
    },
    {
        "subreddit": "videos",
        "sentence": "the problem is they suspend licenses for tons of extremely stupid reasons that have nothing to do with safety."
    },
    {
        "subreddit": "videos",
        "sentence": "No, I understand, and I disagree.\n\nI absolutely think about things before speaking"
    },
    {
        "subreddit": "videos",
        "sentence": "Always"
    },
    {
        "subreddit": "videos",
        "sentence": "The fact that you just live the bulk of your life on autopilot is severely depressing."
    },
    {
        "subreddit": "videos",
        "sentence": "The DAs cracking up was the icing on the cake"
    },
    {
        "subreddit": "videos",
        "sentence": "no one with a normal IQ would do that, right.."
    },
    {
        "subreddit": "videos",
        "sentence": "so he is impaired.."
    },
    {
        "subreddit": "videos",
        "sentence": "therefore: i think there should be some leniency if you could show he has a low iq.."
    },
    {
        "subreddit": "videos",
        "sentence": "like being detrimental to ones case due to a disability ought to be given some attention"
    },
    {
        "subreddit": "videos",
        "sentence": "(just speculation)"
    },
    {
        "subreddit": "videos",
        "sentence": "Sounds like the consequences of fucking around and finding out."
    },
    {
        "subreddit": "videos",
        "sentence": "Eh but also you can send a lot of texts in a short amount of time"
    },
    {
        "subreddit": "videos",
        "sentence": "I wouldn’t be surprised if the relationship was inappropriate but I could easily do 60 texts in a back and forth conversation in under and hour"
    },
    {
        "subreddit": "videos",
        "sentence": "Especially with the way my fellow millennials text where we send like one or two sentences over 5 texts slapped in with a couple emojis"
    },
    {
        "subreddit": "videos",
        "sentence": "I was on a flight with John Popper recently"
    },
    {
        "subreddit": "videos",
        "sentence": "Super random."
    },
    {
        "subreddit": "videos",
        "sentence": "At this time of year???"
    },
    {
        "subreddit": "videos",
        "sentence": "Dude I grew up poor, and yeah, I don't think I'd take a video court call on my phone while driving even with an active license."
    },
    {
        "subreddit": "videos",
        "sentence": "What if the punishment moves you further from the solution? Not driving is not earning, can't pay that fine without a ride to work."
    },
    {
        "subreddit": "videos",
        "sentence": "actually I get off on random redditors projecting their own insecurities & failures by taking offense at rhetorical questions not directed at them and then proceed to insert themselves into the thread with an angry, defensive response clearly driven by personal experience"
    },
    {
        "subreddit": "videos",
        "sentence": "for me its background noise ya i zone in and out"
    },
    {
        "subreddit": "videos",
        "sentence": "If you told me Bartmoss single handedly brought about our current capitalist hellscape as a spite fueled deadman switch, I’d believe you."
    },
    {
        "subreddit": "videos",
        "sentence": "Did anyone else notice the second defendant after the driving guy was literally playing a console game the whole time?"
    },
    {
        "subreddit": "videos",
        "sentence": "Birthday Girl! I Loved that movie"
    },
    {
        "subreddit": "videos",
        "sentence": "Super weird"
    },
    {
        "subreddit": "videos",
        "sentence": ">Which is why it's so very crucial to take your privilege of driving seriously.\n\nCool"
    },
    {
        "subreddit": "videos",
        "sentence": "In the real world people need to make money to keep a roof over their head"
    },
    {
        "subreddit": "videos",
        "sentence": "For most jobs in most parts of the country that means being able to drive.\n\nYou can talk about reasonability and privilege all day, but revoking someone's practical means to survive is going to cause them just to commit crimes"
    },
    {
        "subreddit": "videos",
        "sentence": "So the laws are ignored, or tax payers get to pay for another ward of the State.\n\nAnother thing drivers without a license can't get...insurance"
    },
    {
        "subreddit": "videos",
        "sentence": "Which is how you end up extremely high rates of uninsured drivers"
    },
    {
        "subreddit": "videos",
        "sentence": "The mantra that driving is a privilege is pretty meaningless when there is no practical alternative, particularly for the poor."
    },
    {
        "subreddit": "videos",
        "sentence": "As it stands, Americans barely show up for interviews"
    },
    {
        "subreddit": "videos",
        "sentence": "Source: Barely hiring for the last seven years haha"
    },
    {
        "subreddit": "videos",
        "sentence": "How do people this stupid survive to that age?"
    },
    {
        "subreddit": "videos",
        "sentence": "Checking the comments on the video itself, most of them don't even seem to mention the guy and are just talking about loving the judge"
    },
    {
        "subreddit": "videos",
        "sentence": "Do people really tune into these court session streams just to watch this guy? Or just watch random court sessions in general? I mean I get having random stuff on as background noise or whatever but this is a whole other level lmao."
    },
    {
        "subreddit": "videos",
        "sentence": ">usually, a consequence of *dangerous actions*\n\nI'm willing to bet the vast majority of suspended licenses are as a result of failure to pay for renewal or being pulled over without valid insurance and having their license revoked as a result.\n\nNeither of which are dangerous, negligent, but not dangerous."
    },
    {
        "subreddit": "videos",
        "sentence": "Are you kidding? That guy was hilarious"
    },
    {
        "subreddit": "videos",
        "sentence": "Really creative way to compare the AIs"
    },
    {
        "subreddit": "videos",
        "sentence": "If you think he was actually testing them in real time you are an idiot."
    },
    {
        "subreddit": "videos",
        "sentence": "I'd be willing to bet that he completely forgot about court lol"
    },
    {
        "subreddit": "videos",
        "sentence": "What kinds of jobs are you interviewing for? I guess it’s my industry bias but I’ve never interviewed anyone who wasn’t seated at a desk or table."
    },
    {
        "subreddit": "videos",
        "sentence": "He said “👁️👄👁️”"
    },
    {
        "subreddit": "videos",
        "sentence": "I didn't see a cause for the license suspension in the vid, did you? You can have your license suspended in my state for lapsed insurance or an unpaid fine"
    },
    {
        "subreddit": "videos",
        "sentence": "If you're broke and can't renew your insurance, do you call out at work until your next paycheck? Or ride dirty and hope it works out? Maybe you'd follow the letter of the law and let your life spiral, I'd choose survival.\n\nNot everyone that finds themselves in a situation like this is \"stupid\"."
    },
    {
        "subreddit": "videos",
        "sentence": "He was wearing his seat belt though"
    },
    {
        "subreddit": "videos",
        "sentence": "she did so well!\n\nimmediately pivoted to try get the matter put away before the judge clued in, but alas.\n\nand also the absolute deadpan \"Mr"
    },
    {
        "subreddit": "videos",
        "sentence": "Harris, I'll be giving you a call.\"  👩‍🍳🤌💋"
    },
    {
        "subreddit": "videos",
        "sentence": "They just needed to buy an extra ticket."
    },
    {
        "subreddit": "videos",
        "sentence": "Some really, ahem, interesting things, come up when you search for Mass Effect sex."
    },
    {
        "subreddit": "videos",
        "sentence": "Like I said hope you never fuck up so I can be just as self-righteous and indignant towards you as you apparently love to be towards other people.\n\nYou're disgusting."
    },
    {
        "subreddit": "videos",
        "sentence": "Cool, go argue with them."
    },
    {
        "subreddit": "videos",
        "sentence": "I wouldn’t be surprised if the PD called him before hand and told him not to call in while driving."
    },
    {
        "subreddit": "videos",
        "sentence": "It's out of control 🤖"
    },
    {
        "subreddit": "videos",
        "sentence": "this was a good one too"
    },
    {
        "subreddit": "videos",
        "sentence": "The coldest hot take ever, everyone."
    },
    {
        "subreddit": "videos",
        "sentence": "Directed by Robert B"
    },
    {
        "subreddit": "videos",
        "sentence": "Weide"
    },
    {
        "subreddit": "videos",
        "sentence": "y tho'."
    },
    {
        "subreddit": "videos",
        "sentence": "I clicked around and the first spot I stopped on was some kid who was giving discounts to people (that he didn't even know) at Target and turned himself in for embezzlement?! The judge had never seen something like this before, and was joking around by the end"
    },
    {
        "subreddit": "videos",
        "sentence": "Starts around 1:59:30 and goes to ~2:14:00"
    },
    {
        "subreddit": "videos",
        "sentence": "Some Robin Hood-type shit."
    },
    {
        "subreddit": "videos",
        "sentence": "in nosebleed level debt"
    },
    {
        "subreddit": "videos",
        "sentence": "the average price takes 50+ years of an average salary to pay off in the tier one cities"
    },
    {
        "subreddit": "videos",
        "sentence": "now the value of their homes have fallen but they cant default on their mortgage."
    },
    {
        "subreddit": "videos",
        "sentence": "> Suspension of license is a punishment.\n\nNot even necessarily"
    },
    {
        "subreddit": "videos",
        "sentence": "Sometimes it's in the interest of protecting the public from danger."
    },
    {
        "subreddit": "videos",
        "sentence": "You can see the wheels turning in the defendants head as the judge says it"
    },
    {
        "subreddit": "videos",
        "sentence": "His mouth went slack as he realized he just fucked up."
    },
    {
        "subreddit": "videos",
        "sentence": "iPhone 3 is crazy"
    },
    {
        "subreddit": "videos",
        "sentence": "this movie was so much fun as kid"
    },
    {
        "subreddit": "videos",
        "sentence": "This scene was like WOOOO to me"
    },
    {
        "subreddit": "videos",
        "sentence": "I mean I get what it was going for but cmon role reverse this and see the glaring issue"
    },
    {
        "subreddit": "videos",
        "sentence": "Walkable cities would be so nice"
    },
    {
        "subreddit": "videos",
        "sentence": "I even love cars myself but I would love to be in a city where I didn't need a car for every little thing I want to do.\n\nYou know what is a good idea? They have cameras for the breathalyzers to actually make sure it is you who is doing it"
    },
    {
        "subreddit": "videos",
        "sentence": "They could simply do the same thing every 30 seconds to minute  to make sure it is not you driving it."
    },
    {
        "subreddit": "videos",
        "sentence": "Crazy how that works"
    },
    {
        "subreddit": "videos",
        "sentence": "Same thing happened to Blur with Song 2"
    },
    {
        "subreddit": "videos",
        "sentence": "Made a song as a joke and became a hit."
    },
    {
        "subreddit": "videos",
        "sentence": "Still don't see how being poor means you do something stupid like this , unless you're actually stupid"
    },
    {
        "subreddit": "videos",
        "sentence": "You can be smart and poor and drive with a suspended license though, because people still have to get to their jobs, doctors appts, etc."
    },
    {
        "subreddit": "videos",
        "sentence": "At 2:29:15 - \"This is going well, people.\" 🤣"
    },
    {
        "subreddit": "videos",
        "sentence": "I can, if I'm being paid to do so"
    },
    {
        "subreddit": "videos",
        "sentence": "Unpaid vibe checks to justify the existence of middle managers is a different story."
    },
    {
        "subreddit": "videos",
        "sentence": "I was waiting for him to be like “uhhhhm can I drive to the jail?”"
    },
    {
        "subreddit": "videos",
        "sentence": "Just got a question for you, When you replied to that comment were you aware he was joking? Like the guy you're replying too knows that cellphones weren't around in 1988 so what were you trying to accomplish by posting your reply?"
    },
    {
        "subreddit": "videos",
        "sentence": "Literally the stupidest people who aren't incapacitated enough to have caregivers"
    },
    {
        "subreddit": "videos",
        "sentence": "Just about every competency proceeding is initiated by a public defender"
    },
    {
        "subreddit": "videos",
        "sentence": "A lawyer arguing \"my client is so stupid that it is impossible for them to understand what's happening and therefore can't possibly have a fair trial.\""
    },
    {
        "subreddit": "videos",
        "sentence": "Imagine using the plot of a movie to frame a kid for borderline sexualized behavior between a child and an adult"
    },
    {
        "subreddit": "videos",
        "sentence": "Your perspective right now is beyond wild.\n\nYou realize the movie is *not* real right? But the action still happened? An adult kissed a child on the lips.\n\nThis is why people like Dan Schneider get away with this shit"
    },
    {
        "subreddit": "videos",
        "sentence": "People really just don’t see anything is wrong."
    },
    {
        "subreddit": "videos",
        "sentence": "Of the hundreds of people, have you ever hired someone who made a fool of themselves by means of not giving a flying fuck?\n\nIt reminds me of this YouTuber who has almost gotten hired a couple times despite doing the most absurd no-fucks-given things during his interviews:\nhttps://www.youtube.com/watch?v=yzfjcjHkObI"
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah I think he’s just been driving without his license for so long he forgot he wasn’t supposed to be"
    },
    {
        "subreddit": "videos",
        "sentence": "Oh my god, what is going on in this district?"
    },
    {
        "subreddit": "videos",
        "sentence": "Sure does, definitely-genuine-user!"
    },
    {
        "subreddit": "videos",
        "sentence": "Fucks sake."
    },
    {
        "subreddit": "videos",
        "sentence": "Because AIs already pass the turing test if it's written.\n\nThe reason why AIs sounds so weird in conversation even when The voice chat is extremely realistic.."
    },
    {
        "subreddit": "videos",
        "sentence": "Is the same reason all AIs are easy to tell right now"
    },
    {
        "subreddit": "videos",
        "sentence": "They are either too precise or horrifically wrong"
    },
    {
        "subreddit": "videos",
        "sentence": "And respond the way we write.\n\nI was listening to an AI narrator on YouTube earlier today"
    },
    {
        "subreddit": "videos",
        "sentence": "If you misspelled a word it didn't correct it or pronounce it in a way that would make sense"
    },
    {
        "subreddit": "videos",
        "sentence": "So for Japane (clearly a misspelling of Japan) it pronounced JapanEee.."
    },
    {
        "subreddit": "videos",
        "sentence": "Instead of JapAIN which would have been the only charitable English mispronounceation if you didn't immediately recognize it was a typo"
    },
    {
        "subreddit": "videos",
        "sentence": "By having humans read the response they can transform it into a little bit more conversational speech simply by introducing error."
    },
    {
        "subreddit": "videos",
        "sentence": "You'd be paying them"
    },
    {
        "subreddit": "videos",
        "sentence": "Are your interviews paid? I get you have to filter out your candidates somehow, but when you're begging for workers you might want to start reducing the number of arbitrary hoops you make people jump through"
    },
    {
        "subreddit": "videos",
        "sentence": "I mean.."
    },
    {
        "subreddit": "videos",
        "sentence": "unless you just get off on the power dynamic."
    },
    {
        "subreddit": "videos",
        "sentence": "Training and use are two distinct steps with ANNs which is very different from how brains update with use live"
    },
    {
        "subreddit": "videos",
        "sentence": "A lot of ANNs are also just started from scratch with each update and only get trained once then never again.\n\nThere are structural similarities, of course there are neural nets were inspired by the structure of the brain but there's a lot of functional leaps between where we are with them and brains."
    },
    {
        "subreddit": "videos",
        "sentence": "I generally agree with the sentiment - punishing people with no solution doesn't help them (or society) resolve the issue"
    },
    {
        "subreddit": "videos",
        "sentence": "But something on the order of 80% of people live within a 10 minute bike of a grocery store"
    },
    {
        "subreddit": "videos",
        "sentence": "The joke used to be that after the drunks got their DUIs and had their cars impounded, you could find them biking along the road."
    },
    {
        "subreddit": "videos",
        "sentence": "It's crazy how many people feel like they're entitled to driving, I agree with the OP that it sucks that there's so few alternatives to having your own car (especially in the countryside) but you really do need to fuck around to lose your license"
    },
    {
        "subreddit": "videos",
        "sentence": "The consequences of putting other people in danger really should be rough, and honestly it isn't rough enough considering how many fuckers like the dude in the video drive around without licenses/insurance these days."
    },
    {
        "subreddit": "videos",
        "sentence": "I didn't say anything about change"
    },
    {
        "subreddit": "videos",
        "sentence": "Of course, people can and do change"
    },
    {
        "subreddit": "videos",
        "sentence": "The question is, should someone entrusted with a powerful position be allowed to remain there, whether they claim to have changed or not"
    },
    {
        "subreddit": "videos",
        "sentence": "How are we supposed to know if someone has changed? Just take their word for it?\n\nDoes the soldier that gets dishonorably discharged, but has reportedly changed get to rejoin the military? No"
    },
    {
        "subreddit": "videos",
        "sentence": "Do doctors that lose their licenses for malpractice get them back if they've changed? Almost always a no"
    },
    {
        "subreddit": "videos",
        "sentence": "Do non-violent felons get the right to own guns again if they've changed? No.\n\nWhy should it be any different for this judge? Of course people change, but if you are in a prestigious position, I really don't think that should matter"
    },
    {
        "subreddit": "videos",
        "sentence": "You were given a chance, and a prestigious one at that, to uphold the law of the land, and Judge Simpson failed"
    },
    {
        "subreddit": "videos",
        "sentence": "He should have been removed from the bench.\n\nNow, I'll wait for your reply where you twist my words again and focus on some miniscule part of my argument that you take issue with."
    },
    {
        "subreddit": "videos",
        "sentence": "no, that's nonsense"
    },
    {
        "subreddit": "videos",
        "sentence": "Neural networks are similar to neurons and neuronal connections in the way that a campfire is similar to a diesel engine"
    },
    {
        "subreddit": "videos",
        "sentence": "Assuming that it's just a scale problem demonstrates a fundamental misunderstanding of the technology."
    },
    {
        "subreddit": "videos",
        "sentence": "\"Okay, um, maybe I'm not understanding something.\"\n\nJust sent me."
    },
    {
        "subreddit": "videos",
        "sentence": "Feel like that's more \"strategy\" than \"staged\"."
    },
    {
        "subreddit": "videos",
        "sentence": "It sounds dangerously close to saying people shouldn't have to take responsibility for their actions."
    },
    {
        "subreddit": "videos",
        "sentence": "I've taken the bus and lightrail in my home city a few times but never had to rely on it on a long term basis so I don't have a lot of experience planning work around it"
    },
    {
        "subreddit": "videos",
        "sentence": "But I'm extremely sympathetic to the wish for more walkable cities"
    },
    {
        "subreddit": "videos",
        "sentence": "Every time I've had the joy of experiencing a truly walkable space it leaves me wishing everywhere was like that rather than the subtle hostility of sidewalks inches from instant death"
    },
    {
        "subreddit": "videos",
        "sentence": "[This illustration](https://www.vox.com/xpress/2014/11/18/7236471/cars-pedestrians-sidewalks-roads) sums it up well.\n\nAnyway, what you're saying makes sense"
    },
    {
        "subreddit": "videos",
        "sentence": "That said, impounding the car could ruin any other drivers that use it, which is common especially in poor areas, so it doesn't seem like a workable option in the general case"
    },
    {
        "subreddit": "videos",
        "sentence": "Not sure what real solution there is there to solve the apparent circular issue of people needing to drive to avoid biking on unsafe roads being driven by people that need to drive - other than an infrastructure overhaul to make roads more bike-friendly of course"
    },
    {
        "subreddit": "videos",
        "sentence": "Still, it would be better if he ate the 1-2 hour commute penalty for having his license revoked, and I think it's for the best if we crack down on unlicensed driving when people choose not to do so."
    },
    {
        "subreddit": "videos",
        "sentence": "Calls in mid-murder for a murder charge.\n\n\n\n*Audible exhale*"
    },
    {
        "subreddit": "videos",
        "sentence": "[ **Jump to 04:20 @** Hon"
    },
    {
        "subreddit": "videos",
        "sentence": "J"
    },
    {
        "subreddit": "videos",
        "sentence": "Cedric Simpson's Criminal docket on Wednesday, 05/15/2024](https://www.youtube.com/watch?v=jmGS0ZG2oS4&t=0h4m20s)\n \n ^(Channel Name: Hon J Cedric Simpson Live Feed, Video Length: [06:20:11])^, [^Jump ^5 ^secs ^earlier ^for ^context ^@04:15](https://www.youtube.com/watch?v=jmGS0ZG2oS4&t=0h4m15s) \n \n----------------------------------------------------------------------------- \n \n ^^Downvote ^^me ^^to ^^delete ^^malformed ^^comments"
    },
    {
        "subreddit": "videos",
        "sentence": "[^^Source ^^Code](https://github.com/ankitgyawali/reddit-timestamp-bot) ^^| [^^Suggestions](https://www.reddit.com/r/timestamp_bot)"
    },
    {
        "subreddit": "videos",
        "sentence": "Jesus christ you could suffocate box of kittens with the amount of privilege and self-satisfied superiority in the replies to this comment."
    },
    {
        "subreddit": "videos",
        "sentence": "That was the best part"
    },
    {
        "subreddit": "videos",
        "sentence": "Second is when the judge is all \"wtf?\" to what he just saw after waiting for him to park."
    },
    {
        "subreddit": "videos",
        "sentence": "people trying to attend court on Zoom while driving is pretty much a daily occurrence"
    },
    {
        "subreddit": "videos",
        "sentence": "I once saw a judge tell the driver to pull over, and her passenger started cussing at the judge"
    },
    {
        "subreddit": "videos",
        "sentence": "Great to know that people think and believe this, I'm sure that such a deep and fundamental misunderstanding about how the human mind and how LLMs work being this popular is totally not going to lead to major problems down the road"
    },
    {
        "subreddit": "videos",
        "sentence": "Needs more Markie Post."
    },
    {
        "subreddit": "videos",
        "sentence": "I've been happily married for 16 years"
    },
    {
        "subreddit": "videos",
        "sentence": "I don't think the wife and I have exchanged 14k text the entire time."
    },
    {
        "subreddit": "videos",
        "sentence": "Reminds me of study that said half the people don't have an internal monologue"
    },
    {
        "subreddit": "videos",
        "sentence": "Maybe having a voice in your head helping you plan things is good."
    },
    {
        "subreddit": "videos",
        "sentence": "I just spent 5 minutes thinking I'd lost my mind trying to work out where Natalie Portman was in the fifth element."
    },
    {
        "subreddit": "videos",
        "sentence": "They do"
    },
    {
        "subreddit": "videos",
        "sentence": "I know a lot."
    },
    {
        "subreddit": "videos",
        "sentence": "the job is about the job, and part of the job is being able to prioritize the job when working and setting aside the required time to do the job"
    },
    {
        "subreddit": "videos",
        "sentence": "if an applicant can’t even prioritize the one-time interview for the job or set aside the time for it, how could I possibly expect them to prioritize the job itself and put in the required time on a regular basis?"
    },
    {
        "subreddit": "videos",
        "sentence": "I agree with you here, but none of them stop him from pulling over and getting out the car before taking the call 😂"
    },
    {
        "subreddit": "videos",
        "sentence": "In South Dakota you can get an instructional permit at 14."
    },
    {
        "subreddit": "videos",
        "sentence": "I doubt it."
    },
    {
        "subreddit": "videos",
        "sentence": "I've had texting capabilities for like fifteen years now and I don't think I've texted 14,000 messages *in my life*"
    },
    {
        "subreddit": "videos",
        "sentence": "The recent Director's Cut smooths it out a bit."
    },
    {
        "subreddit": "videos",
        "sentence": "[ **Jump to 04:22:33 @** Hon"
    },
    {
        "subreddit": "videos",
        "sentence": "J"
    },
    {
        "subreddit": "videos",
        "sentence": "Cedric Simpson's Criminal docket on Wednesday, 05/15/2024](https://www.youtube.com/watch?v=jmGS0ZG2oS4&t=4h22m33s)\n \n ^(Channel Name: Hon J Cedric Simpson Live Feed, Video Length: [06:20:11])^, [^Jump ^5 ^secs ^earlier ^for ^context ^@04:22:28](https://www.youtube.com/watch?v=jmGS0ZG2oS4&t=4h22m28s) \n \n----------------------------------------------------------------------------- \n \n ^^Downvote ^^me ^^to ^^delete ^^malformed ^^comments"
    },
    {
        "subreddit": "videos",
        "sentence": "[^^Source ^^Code](https://github.com/ankitgyawali/reddit-timestamp-bot) ^^| [^^Suggestions](https://www.reddit.com/r/timestamp_bot)"
    },
    {
        "subreddit": "videos",
        "sentence": "That disappointed dad stare."
    },
    {
        "subreddit": "videos",
        "sentence": "It’s about showing you can dress to company standards and comport yourself like a normal human being for an hour lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Sheesh"
    },
    {
        "subreddit": "videos",
        "sentence": "“Suspending someone's license really only works to deter them if they have other options, otherwise it's like suspending someone from eating - they're going to have to do it.”  \n\nThey always have another option - jail.\n\nGetting your license suspended isn’t an accident, you have to be a moron to let it get to that point."
    },
    {
        "subreddit": "videos",
        "sentence": "I get what you're saying, but I've seen a lot of people with an insane record of cancelled, suspended, revoked, you name it"
    },
    {
        "subreddit": "videos",
        "sentence": "Eventually it gets to Cancelled-IPS and now you're spending some time behind bars."
    },
    {
        "subreddit": "videos",
        "sentence": "I imagine he was in a lobby and wasn't sure when they'd call his case and hoped he'd make it all the way and got within 1 minute of making it."
    },
    {
        "subreddit": "videos",
        "sentence": "people are complaining about this.."
    },
    {
        "subreddit": "videos",
        "sentence": "I mean if base jumping is a legal recreational activity, why shouldn't incidents like this be covered by search and rescue just like any other recreational activity in the mountains?"
    },
    {
        "subreddit": "videos",
        "sentence": "I've interviewed a *lot* of people the past few years (a few hundred, I counted lol)"
    },
    {
        "subreddit": "videos",
        "sentence": "I think you would be surprised at the amount of people who are driving during the interview, have someone else in the car with them while driving while being interviewed, who are pumping gas or grocery shopping, or are laying in bed in their pajamas (and absolutely not hiding it, I'm talking crumpled blanket, full jammies, slept in 'til noon and showing it)"
    },
    {
        "subreddit": "videos",
        "sentence": "Some people do not give a single flying fuck, and these are the people who usually think they're a shoo-in for the job."
    },
    {
        "subreddit": "videos",
        "sentence": "Then don't get your license suspended"
    },
    {
        "subreddit": "videos",
        "sentence": "Consequences exists for a reason, and if they weren't intrusive and a major pain in the ass then what would keep people from driving like maniacs, or drunk driving, or road raging etc etc?\n\nAnd sure, taking away someone's ability to get to work, drive their children to school, and go to appointments (like this guy was obviously doing right lol?) usually forces them to drive illegally, but doing that in front of a judge and prosecutors is a major tip-off that this person probably shouldn't be behind the wheel with that kind of decision making power."
    },
    {
        "subreddit": "videos",
        "sentence": "At least he didn't say anything and make it worse"
    },
    {
        "subreddit": "videos",
        "sentence": "[ **Jump to 02:25:00 @** Hon"
    },
    {
        "subreddit": "videos",
        "sentence": "J"
    },
    {
        "subreddit": "videos",
        "sentence": "Cedric Simpson's Criminal docket on Wednesday, 05/15/2024](https://www.youtube.com/watch?v=jmGS0ZG2oS4&t=2h25m0s)\n \n ^(Channel Name: Hon J Cedric Simpson Live Feed, Video Length: [06:20:11])^, [^Jump ^5 ^secs ^earlier ^for ^context ^@02:24:55](https://www.youtube.com/watch?v=jmGS0ZG2oS4&t=2h24m55s) \n \n----------------------------------------------------------------------------- \n \n ^^Downvote ^^me ^^to ^^delete ^^malformed ^^comments"
    },
    {
        "subreddit": "videos",
        "sentence": "[^^Source ^^Code](https://github.com/ankitgyawali/reddit-timestamp-bot) ^^| [^^Suggestions](https://www.reddit.com/r/timestamp_bot)"
    },
    {
        "subreddit": "videos",
        "sentence": "I got lawyers, your honor"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm gonna make some phone calls and have you indicted for double jeopardy! You ever heard of double jeopardy? You will find out what double jeopardy is! Double jeopardy!"
    },
    {
        "subreddit": "videos",
        "sentence": "No"
    },
    {
        "subreddit": "videos",
        "sentence": "Do not drive with a suspended license, period"
    },
    {
        "subreddit": "videos",
        "sentence": "Driving is not a right."
    },
    {
        "subreddit": "videos",
        "sentence": ">You might be surprised to find out that if you get your license suspended\n\nLicenses don't just get suspended out of nowhere"
    },
    {
        "subreddit": "videos",
        "sentence": "It's not like getting rained on.\n\nSuspension of license is a punishment"
    },
    {
        "subreddit": "videos",
        "sentence": "That punishment has more serious consequences for people in some circumstances than others"
    },
    {
        "subreddit": "videos",
        "sentence": "That punishment is, usually, a consequence of *dangerous actions*"
    },
    {
        "subreddit": "videos",
        "sentence": "Typically, a suspended license means you are no longer trusted to safely operate a car - a high-velocity, high-mass piece of equipment.\n\nWe certainly should have better public transportation, walkable cities, etc"
    },
    {
        "subreddit": "videos",
        "sentence": "That is a true statement"
    },
    {
        "subreddit": "videos",
        "sentence": "But separately, in the current world, if someone's choices are between being destitute and *endangering other people*, then the right choice for them is to be destitute, and we certainly can blame them for choosing to (continue to) endanger others."
    },
    {
        "subreddit": "videos",
        "sentence": "I mean."
    },
    {
        "subreddit": "videos",
        "sentence": "don't break the law in the first place and it's not an issue"
    },
    {
        "subreddit": "videos",
        "sentence": "If you get caught with a suspended license, chances are you again were breaking the law causing the pull over."
    },
    {
        "subreddit": "videos",
        "sentence": "But the \"AI\" we have now isn't able to simulate thinking, that's the problem, we keep calling a statistical model an intelligence, when it isn't, it doesn't know anything"
    },
    {
        "subreddit": "videos",
        "sentence": "When/if some kind of synthetic intelligence appears it will be very, very different to what we are seeing now."
    },
    {
        "subreddit": "videos",
        "sentence": "They drive among us too"
    },
    {
        "subreddit": "videos",
        "sentence": "“Glad she banged him” 💀🤣"
    },
    {
        "subreddit": "videos",
        "sentence": "While I'm not saying he shouldn't take public transportation I take you never had to take it before"
    },
    {
        "subreddit": "videos",
        "sentence": "It absolutely sucks outside of major cities like NYC"
    },
    {
        "subreddit": "videos",
        "sentence": "Delays, takes literally forever to get anywhere if you have to take multiple buses, the people you ride with are there because it is literally their only option so you see some interesting people to say the least, our cities really ain't walkable, etc"
    },
    {
        "subreddit": "videos",
        "sentence": "And biking you have people like him on the road with not even two brain cells to rub together"
    },
    {
        "subreddit": "videos",
        "sentence": "If I still had car while I had a suspended license the convenience factor is all too real.\n\nFor a idea of how rough it can be I live in a much larger city  than him and my 15-20 minute commute would turn into a 1 hour 20 minute ordeal assuming everything is running on time.\n\nThey should just impound their car if they suspend their license"
    },
    {
        "subreddit": "videos",
        "sentence": "I've never heard of a person with a suspended license who actually stopped driving."
    },
    {
        "subreddit": "videos",
        "sentence": "Hard disagree"
    },
    {
        "subreddit": "videos",
        "sentence": "I think the OG series has the most consistently good writing of the entire canon"
    },
    {
        "subreddit": "videos",
        "sentence": "There are some stinkers, yes, but overall it is fantastic."
    },
    {
        "subreddit": "videos",
        "sentence": "He can get an occupational license to go get groceries and go to the doctor?"
    },
    {
        "subreddit": "videos",
        "sentence": "I think about this every day."
    },
    {
        "subreddit": "videos",
        "sentence": "i rewatched that and it does look like that guy vapes at one point"
    },
    {
        "subreddit": "videos",
        "sentence": "Didn't say it was an excuse to attend your hearing actively driving with a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "I said it lowered that from \"you'd have to be mentally incapacitated to do this\" to \"a big fuckup, of the sort you'll probably make two or three times in your life\"."
    },
    {
        "subreddit": "videos",
        "sentence": "What about getting to school, groceries, or medical?\n\nI remember reading a LONG time ago that some states allowed 14 year-olds to drive to school if it was within a particular range."
    },
    {
        "subreddit": "videos",
        "sentence": "People say this shit all the time! Well.."
    },
    {
        "subreddit": "videos",
        "sentence": "not people, but ya know.."
    },
    {
        "subreddit": "videos",
        "sentence": "'job creators'."
    },
    {
        "subreddit": "videos",
        "sentence": "Well he had the option of not doing whatever it was that got his license suspended in the first place."
    },
    {
        "subreddit": "videos",
        "sentence": "Hello /u/4x420\n\nThank you for your submission, however it has been removed because it has been automatically determined to be breaking the following /r/videos rule:\n\n> **Rule 2** - No Politics\n\n##**Please consider posting it to /r/PoliticalVideo.**\n\nIf, [having read the rule in full](https://www.reddit.com/r/videos/wiki/rules#wiki_rule_2_-_no_politics), you believe that it does *not* apply to your video, [please click here](https://www.reddit.com/r/videos/wiki/automoderator/p/c11).\n\n*****\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "videos",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/videos) if you have any questions or concerns.*"
    },
    {
        "subreddit": "videos",
        "sentence": "If I’m going to jail I rather stop somewhere that the food actually taste better than jail food"
    },
    {
        "subreddit": "videos",
        "sentence": "There are so many movies that just exist that I am not aware of"
    },
    {
        "subreddit": "videos",
        "sentence": "Also who okayed the underage sexual assault?"
    },
    {
        "subreddit": "videos",
        "sentence": "Not always"
    },
    {
        "subreddit": "videos",
        "sentence": "Soon they won’t have any working age people left"
    },
    {
        "subreddit": "videos",
        "sentence": "China is going to be a shell of itself by 2050"
    },
    {
        "subreddit": "videos",
        "sentence": "https://www.osw.waw.pl/en/publikacje/osw-commentary/2024-02-07/a-disaster-their-own-making-demographic-crisis-china"
    },
    {
        "subreddit": "videos",
        "sentence": "even the people in the back couldn't believe the idiocy.😂"
    },
    {
        "subreddit": "videos",
        "sentence": "Why can't someone answer bullshit questions about hypothetical scenarios and repeat the information they already provided a third time while going about their day? Is the job about the job, or is it about dick-stroking some middle managers about how important they are, how much of your attention they have, and how excited you are to be a part of Wagetheft Inc."
    },
    {
        "subreddit": "videos",
        "sentence": "This guy deserves to be punished for breaking the law"
    },
    {
        "subreddit": "videos",
        "sentence": "But so does ANYONE STANDING IN JOHN CENA'S WAY WHEN HE TAKES ON 6 MEN IN A STEEL CAGE CHUTES AND LADDERS MATCH AT WWE SUPERRRRR SLAMMMMM"
    },
    {
        "subreddit": "videos",
        "sentence": "Classic mouth breather"
    },
    {
        "subreddit": "videos",
        "sentence": "\"I'm actually pulling into my Dr"
    },
    {
        "subreddit": "videos",
        "sentence": "office riiiiight.."
    },
    {
        "subreddit": "videos",
        "sentence": "now, actually.\" It's that slack jawed stare he does that really brings it all home"
    },
    {
        "subreddit": "videos",
        "sentence": "This guy is missing a chromosome or two."
    },
    {
        "subreddit": "videos",
        "sentence": "I have a cousin who is a sheriff"
    },
    {
        "subreddit": "videos",
        "sentence": "He teaches concealed weapons classes with a hands-on range session"
    },
    {
        "subreddit": "videos",
        "sentence": "He has arrested people for smelling like alcohol in his class"
    },
    {
        "subreddit": "videos",
        "sentence": "Some people just have no sense."
    },
    {
        "subreddit": "videos",
        "sentence": "I read “attacks court” and was very confused"
    },
    {
        "subreddit": "videos",
        "sentence": "Yep, back then you’d go to the movie theater to watch cartoons and to watch newsreels"
    },
    {
        "subreddit": "videos",
        "sentence": "TV service as we know it didn’t launch until after World War II"
    },
    {
        "subreddit": "videos",
        "sentence": "This cartoon came out during the war."
    },
    {
        "subreddit": "videos",
        "sentence": "Im sorry, that excuse only makes sense for parents that lose their license because they are behind on child support"
    },
    {
        "subreddit": "videos",
        "sentence": "Not speeding, drinking & driving, etc."
    },
    {
        "subreddit": "videos",
        "sentence": "Of course! The rural American taxi! A timeless classic!"
    },
    {
        "subreddit": "videos",
        "sentence": "So you think somebody can't change? That they can't learn from their mistakes? That no one in your world is allowed to grow and undeserved of redemption?\n\nGet the fuck out of here with that bullshit.\n\nMust be nice being holier than thou.\n\nGod forbid you ever fuck up in your life"
    },
    {
        "subreddit": "videos",
        "sentence": "I hope the people you come in contact don't give you any chance to redeem yourself that you're so hell-bent on making sure Judge Simpson doesn't receive."
    },
    {
        "subreddit": "videos",
        "sentence": "Lmao what are the odds that this happened at 4:20 in the video? Dude must be high"
    },
    {
        "subreddit": "videos",
        "sentence": "Note that the OG show isn't quite on the same level"
    },
    {
        "subreddit": "videos",
        "sentence": "Things matured a great bit for the movies"
    },
    {
        "subreddit": "videos",
        "sentence": "The later TV shows were wonderful."
    },
    {
        "subreddit": "videos",
        "sentence": "Literally no one said any of that."
    },
    {
        "subreddit": "videos",
        "sentence": "claude 3 opus dumb af"
    },
    {
        "subreddit": "videos",
        "sentence": "Jeeeeesus"
    },
    {
        "subreddit": "videos",
        "sentence": "That is indeed how punishments work"
    },
    {
        "subreddit": "videos",
        "sentence": "Not much of a punishment if it only has a negligible impact on your life, eh?"
    },
    {
        "subreddit": "videos",
        "sentence": "Zoom Court is the greatest unexpected joy of from the horrible Covid years, for me."
    },
    {
        "subreddit": "videos",
        "sentence": "Look into the earlier juice flavor bans"
    },
    {
        "subreddit": "videos",
        "sentence": "Predates the cartridge stuff"
    },
    {
        "subreddit": "videos",
        "sentence": "Was done by then."
    },
    {
        "subreddit": "videos",
        "sentence": "It's not like she'll get a bonus for going above and beyond"
    },
    {
        "subreddit": "videos",
        "sentence": "Move onto the next person who (hopefully) cares enough to not blatantly fuck up the case."
    },
    {
        "subreddit": "videos",
        "sentence": "Dude is trying to convince himself so hard lol"
    },
    {
        "subreddit": "videos",
        "sentence": "Well, if Tony Stark escaped the cave with Black Sabbath, you can bet he rocked his way out of there in style! Picture Iron Man jamming out with the band while blasting his way to freedom."
    },
    {
        "subreddit": "videos",
        "sentence": "A judge abusing his power has nothing to do with anything? Seems like it has to do with everything… especially today"
    },
    {
        "subreddit": "videos",
        "sentence": "He should have been removed from the bench, as was recommended at his hearing"
    },
    {
        "subreddit": "videos",
        "sentence": "We might have less corruption if people in power weren’t given slaps on the wrist all the time.\n\nAnd just because this was years ago doesn’t mean it isn’t still indicative of who he was and who he might still be"
    },
    {
        "subreddit": "videos",
        "sentence": "People in positions of power should be held accountable just like everyone else. \n\nIf anything, I think the consequences for elected officials should be more severe than for your average citizen"
    },
    {
        "subreddit": "videos",
        "sentence": "They should and do know better"
    },
    {
        "subreddit": "videos",
        "sentence": "They all take oaths"
    },
    {
        "subreddit": "videos",
        "sentence": "We should hold them accountable for breaking them."
    },
    {
        "subreddit": "videos",
        "sentence": "what???? How are those in any way comprable? expecting someone to wear a suit and tie to a zoom interview is a very different bar than expecting someone to not be actively driving their car while you begin the interview"
    },
    {
        "subreddit": "videos",
        "sentence": "One is a relatively high bar (depending on profession), the other is on the floor."
    },
    {
        "subreddit": "videos",
        "sentence": "IsItBullshit: Nicole Kidman's father died while fleeing pedophilia and child sacrifice cult charges.\n\nI have the picture of a news article saved in my gallery and I'm not sure whether this information is real"
    },
    {
        "subreddit": "videos",
        "sentence": "The rest of the article reads as follows:\n\n\"Dr"
    },
    {
        "subreddit": "videos",
        "sentence": "Antony Kidman died Friday after fleeing Australia when accused of the sexual abuse and murder of children in an elite Sydney pedophile ring"
    },
    {
        "subreddit": "videos",
        "sentence": "A month prior Fiona Barnett had filed a complaint with the Australian NSW police and Child Abuse Royal Commission alleging Kidman's sexual and physical assaults on her throughout childhood"
    },
    {
        "subreddit": "videos",
        "sentence": "When the Commission opened an investigation the clinical psychologist suddenly left his 43 years with the Sydney University of Technology and Royal North Shore Hospital to stay in Singapore until he died"
    },
    {
        "subreddit": "videos",
        "sentence": "The family has refused to comment and Singapore police opened an investigation on what they termed as an unnatural death\n\nYesterday Barnett released her own theory about Kidman's death,\" The main perpetrator of my child sexual abuse, Antony Kidman, is dead after I filed formal complaints accusing him of the rape, torture and murder of children in an exclusive Sydney pedophile ring"
    },
    {
        "subreddit": "videos",
        "sentence": "As a child victim of mind control I feel he's been sacrificed\""
    },
    {
        "subreddit": "videos",
        "sentence": "How is that different from humans? \n\nHow much knowledge do humans learn entirely without some frame of reference? \n\nDon't we also have to be \"retrained\" every time we are introduced to new concepts? \n\nRemember for an AI a new concept truly is new so when I'm talking new for a human I mean actually never before seen by any other human new."
    },
    {
        "subreddit": "videos",
        "sentence": "what would be the point in trying to see if an AI can emulate being human if the humans have to read stock AI answers?"
    },
    {
        "subreddit": "videos",
        "sentence": "Just seeing the liquid Co2 turn back to ice was worth the click"
    },
    {
        "subreddit": "videos",
        "sentence": "Being poor and desperate is an excuse to drive with a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "It is NOT an excuse to attend your court hearing while actively driving with a suspended license."
    },
    {
        "subreddit": "videos",
        "sentence": "I used to vape back when it was taking off at first"
    },
    {
        "subreddit": "videos",
        "sentence": "Like from 2011-2015 give or take a few years"
    },
    {
        "subreddit": "videos",
        "sentence": "Back then propylene glycol (PG) was the main liquid used"
    },
    {
        "subreddit": "videos",
        "sentence": "This was also what my grandmother used to vape her emphysema medicine"
    },
    {
        "subreddit": "videos",
        "sentence": "But it was thin and leaky, so vegetable glycerin (VG) was introduced to thicken the PG.\n\nEventually, whether people preferred the clouds or thickness or the allure of “vegetable” in the name, VG became the most popular liquid"
    },
    {
        "subreddit": "videos",
        "sentence": "People started doing 50/50, then 80/20, and eventually even 90/10 VG to PG ratios"
    },
    {
        "subreddit": "videos",
        "sentence": "I’m sure people were even doing 100% VG"
    },
    {
        "subreddit": "videos",
        "sentence": "There came a point where you couldn’t get mostly PG liquid anymore"
    },
    {
        "subreddit": "videos",
        "sentence": "This is when I quit"
    },
    {
        "subreddit": "videos",
        "sentence": "To me, VG was thick, and I could feel it sitting in my lungs"
    },
    {
        "subreddit": "videos",
        "sentence": "Before VG, my coughs were normal"
    },
    {
        "subreddit": "videos",
        "sentence": "After VG, they were wet and deep and concerning.\n\nI tried a friend’s disposable vape a few months ago for the first time and it felt like I had inhaled water, so it seems VG is still the hot thing"
    },
    {
        "subreddit": "videos",
        "sentence": "I’m sure PG wasn’t good for me, and any flavoring was surely the worst thing, but I am convinced VG is dangerous and is coating people’s lungs."
    },
    {
        "subreddit": "videos",
        "sentence": "The judge is still breaking over this during the resolution of the next case."
    },
    {
        "subreddit": "videos",
        "sentence": "LOL, what a dumdum, just sitting there with his mouth hanging open, like it never occurred to him that he shouldn’t let the judge see him driving when he’s charged with *driving on a suspended license*.\n\nI’ve watched several videos with cases before this judge"
    },
    {
        "subreddit": "videos",
        "sentence": "He gets some real knuckleheads in his court"
    },
    {
        "subreddit": "videos",
        "sentence": "Defendants, and lawyers too"
    },
    {
        "subreddit": "videos",
        "sentence": "It’s kinda like the old TV show Night Court, only without a laugh track or staff of comedy writers to pinch up the dialogue."
    },
    {
        "subreddit": "videos",
        "sentence": "Hol up"
    },
    {
        "subreddit": "videos",
        "sentence": "Maybe John Popper shouldn't have given one of the absolute greatest vocal performances of all time on the recording   lol\n\nGod damn I love him and his incredible lungs and vocal cords ."
    },
    {
        "subreddit": "videos",
        "sentence": "> Shows like COPS are basically, \"let's all laugh at this person for acting the way people are much more likely to act when they're poor and desperate and their lives are held together with duct tape\""
    },
    {
        "subreddit": "videos",
        "sentence": "This feels in the same vein.\n\nI remember an episode of COPS where the officer had to pull over in front of a house (that he wasn't even called to) because some skinny 120lb crackhead hit his 350lb wife's breaking point and she had him on his chest on their front walk hogtied with lamp cable.\n\nThe cop saw this and got her up off of him"
    },
    {
        "subreddit": "videos",
        "sentence": "The guy was mean mugging the camera, her, the cop"
    },
    {
        "subreddit": "videos",
        "sentence": "He looked pissed"
    },
    {
        "subreddit": "videos",
        "sentence": "The wife wasn't having any more of him and pressed for DV saying that the next time would be similar"
    },
    {
        "subreddit": "videos",
        "sentence": "The cop, for his part, couldn't stop laughing because she had hogtied him so professionally and thoroughly that he couldn't untie it and had to cut the guy loose."
    },
    {
        "subreddit": "videos",
        "sentence": "Was it really sanitised? The dude just vaped all the vapes"
    },
    {
        "subreddit": "videos",
        "sentence": "Towards the end at 4:22:33 it sounds like someone is struggling with keeping their laughter under control, but I can't figure out who it is from the video."
    },
    {
        "subreddit": "videos",
        "sentence": "Having to just roll right along into the next client on her list too, like its just a normal day."
    },
    {
        "subreddit": "videos",
        "sentence": "I believe the scientific name for them is \"moron.\""
    },
    {
        "subreddit": "videos",
        "sentence": "With everything you see on the news lately, it looks like just another teacher with her student!"
    },
    {
        "subreddit": "videos",
        "sentence": "Yeah, he's stupid, but also, I've noticed how American cities are not meant for people who don't own a vehicle"
    },
    {
        "subreddit": "videos",
        "sentence": "Therefore, people consider driving a vehicle not a privilege (whit it is) and more like a right, a necessity"
    },
    {
        "subreddit": "videos",
        "sentence": "So, I guess, some people can't (don't know how to) do basic chores like buying food, groceries, medication; if they can't drive a car there."
    },
    {
        "subreddit": "videos",
        "sentence": "I don't think it was implied what so ever which side Plemons was on"
    },
    {
        "subreddit": "videos",
        "sentence": "And that's the entire point"
    },
    {
        "subreddit": "videos",
        "sentence": "During war time, especially civil wars, even people fighting with you against your enemy may be crazy."
    },
    {
        "subreddit": "videos",
        "sentence": "No you just don't understand what they are saying"
    },
    {
        "subreddit": "videos",
        "sentence": "The only time you truly plan or \"think\" on what you are saying is during a presentation where you have pree planned what you were going to say"
    },
    {
        "subreddit": "videos",
        "sentence": "Or if you've been asked a question and been given time to think a response"
    },
    {
        "subreddit": "videos",
        "sentence": "Conversationally you're pretty much no different than the language algorithm"
    },
    {
        "subreddit": "videos",
        "sentence": "And if you were you'd be a weird conversationalist"
    },
    {
        "subreddit": "videos",
        "sentence": "It's why most conversations longer than a minute go on into off topic tangents.\n\nThe reason why these AIs are strange isn't because they \"can't think\""
    },
    {
        "subreddit": "videos",
        "sentence": "It's because they speak the way we write and we know only AIs do that or foreigners"
    },
    {
        "subreddit": "videos",
        "sentence": "If you learn a language by reading and writing it.."
    },
    {
        "subreddit": "videos",
        "sentence": "Then learn how to speak it native speakers will say you sound \"formal\" in the same way these AIs sound like they are reading a smart freshman's 3 sentence written answers to a college exam question."
    },
    {
        "subreddit": "videos",
        "sentence": "I can see why people would think this is weird but I don't think that kiss was meant to be sexual"
    },
    {
        "subreddit": "videos",
        "sentence": "I think that was her way of trying to be kind to this kid who had obviously been through a lot and who obviously had a crush on her"
    },
    {
        "subreddit": "videos",
        "sentence": "I'm not saying women or men should kiss kids on the lips in real life but in the context of this movie I think it was supposed to be a kind gesture"
    },
    {
        "subreddit": "videos",
        "sentence": "That's my take anyways."
    },
    {
        "subreddit": "videos",
        "sentence": "Yep, she was hot!"
    },
    {
        "subreddit": "videos",
        "sentence": "Good news: taxi cabs have been around for over a century! Will the wonders of technology never cease?"
    },
    {
        "subreddit": "videos",
        "sentence": "This is a very good argument for increased spending on public transportation and less car dependent city planning.\n\nIt isn't a good argument to simply allow and forgive dangerous drivers for driving offenses bad enough for a suspended license"
    },
    {
        "subreddit": "videos",
        "sentence": "Road safety is more important than what is ultimately the convenience of an individual.\n\nPublic transportation sucks in a lot of the US, but it only sucks, it's not impossible"
    },
    {
        "subreddit": "videos",
        "sentence": "It's always possible to get where he needs to go with some combination of walking/biking, one of the [30 bus routes](https://www.theride.org/maps-schedules/route-maps-schedules-library) in his area, the [Amtrak train](https://www.amtrak.com/stations/arb) if applicable, or taxis or ridesharing if cost permits"
    },
    {
        "subreddit": "videos",
        "sentence": "Choosing not to do so isn't like choosing to eat - he's choosing convenience, not a vital need."
    },
    {
        "subreddit": "videos",
        "sentence": "If he was going to Zoom in and he knew he was driving, then all he had to do was join without a camera"
    },
    {
        "subreddit": "videos",
        "sentence": "Then if the judge asks you to turn on your camera, simply say it is broken."
    },
    {
        "subreddit": "videos",
        "sentence": "Tom Brady kisses his son more intimately then that"
    },
    {
        "subreddit": "videos",
        "sentence": "Would? Dont you mean \"am\"?"
    },
    {
        "subreddit": "videos",
        "sentence": "45th anniversary cut!\n\nI had forgotten how beautiful Persis Khambatta was."
    },
    {
        "subreddit": "videos",
        "sentence": "idk guy seems to be moving pretty fast"
    },
    {
        "subreddit": "videos",
        "sentence": "Watched for like 10 minutes and he heard 5 cases."
    },
    {
        "subreddit": "videos",
        "sentence": "To be fair, I text my coworkers a LOT more than I text my wife"
    },
    {
        "subreddit": "videos",
        "sentence": "It's a primary form of communication at work."
    },
    {
        "subreddit": "videos",
        "sentence": "Accidentally jumped to 2:29:00 and the judge told him to stop vaping in court.\n\nThe guy is outside and it's just clouds"
    },
    {
        "subreddit": "videos",
        "sentence": "She does…what’s the point? Above explains the scene…"
    },
    {
        "subreddit": "videos",
        "sentence": "100% had a candidate start driving MID-interview last year"
    },
    {
        "subreddit": "videos",
        "sentence": "They were doing well before that lol."
    }
]