[
    {
        "subreddit": "WizardsUnite",
        "sentence": "Me too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Miss it so much"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Really helped my sanity to go for walks, and I can’t get motivated without it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Don’t really like pkGo"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m also playing Jurassic world Alive, but doesn’t have the benefit of rewarding walking."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had no idea this game existed.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'll have to go look for it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(Although I've started playing pokemon go again...)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can’t bring myself to delete the app in the hopes that one day I will be able to access all the documents & data I downloaded before it closed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But the 6 gB it’s taking up would be handy to have again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I know how you feel, I had the same experience the other day when I opened the app to try again it after months (because I’ve had homework and classes non stop since the new year) I was absolutely devastated."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This submission has been removed and locked for receiving numerous reports from the community.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/WizardsUnite) if you have any questions or concerns.*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ain’t that some stupid shit right there"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I guess New Zealand (middle earth) lost it’s mind during Covid"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Why would you fire your fucking wizard"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There isn’t many of us left.\n\n-The Wizard"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I opened the game today knowing I would get the closed message but just out of nostalgia."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I definitely miss it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was a life saver during quarantine"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My roommate and I would drive over to the park every day and play from the car"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It got us out of the house every day."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I opened the app"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "to give it another try over the weekend and was surprised to see it was gone."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There’s not as much incentive to leave the house anymore"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m trying to wrap up the semester intact (it’s been kind of rough), but maybe over the summer I’ll start looking into more games that encourage physical activity."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same here"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I enjoy telling folks that I'm playing with dinosaurs."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I still miss it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ":("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve been playing Jurassic world alive lately, it seems fun"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Reminds me of Pokémon but with dinosaurs"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I still miss it, it was getting a lot better towards the end"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve noticed it’s definitely decreased my exercise because I’m not going the extra mile to visit greenhouses anymore"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hold out hope they’ll revamp it one day but without all the bugs, glitches, and lengthy repetitive tasks."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "A pared down version of the app that required no connection to their server would have been nice"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just like an offline snapshot of your stuff."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I kind of wish they left the camera functionality as a legacy of HPWU"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "One of their first mistakes was not having the Unicorn being camera capable with the first Brilliant Event"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I guarantee there would have been staged unicorn pictures"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "As it is I got some cute niffler pics and such."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Cheers!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No, it will be on Xbox , PS, PC and recently it was put in their FAQ that it will also he released on Nontendo Switch."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just hope they don't kill it through bad management like they did with Wizards Unite."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "no, I think it's on everything - everyone will be able to play!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Super-stoked for this! I'm not really a gamer by any stretch, but I'm really looking forward to this, and wish it could have been multiplayer!\n\nIn case anyone who cares about it isn't already there, the sub is /r/HarryPotterGame/"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Is this going to be a playstation exclusive?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Being able to explore the world with friends, having duels, fighting enemies together, omfg that would be so cool!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Finally a real Harry Potter RPG"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Can't wait."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This looks really cool I just wish they'll have multiplayer."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss my game so much"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I use Pikmin Bloom to convince me time walk a little more but I really do not get it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I bought my kids the Switch game to see if that would help, but although they enjoyed the game for a few days they didn't really get it, either"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I tried the other games - HP Mystery won't even work on my phone anymore and wasn't that much fun anyway,  Jurassic Park didn't grab me, Ingress feels impossible to join at this point"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Mostly I switched back to audio books on my walks and crosswords at home so basically it's the 1900s all over again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss my game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This guy gets it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No problem, fellow wizard!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks you fellow wizard!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Reddit is weird"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I kind of think we should turn it into a sub about truly uniting all wizards out there."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "THANK YOU SO MUCH, MAY SCIENCE BLESS YOU A THOUSAND FOLD!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Go to the Galapgos Islands"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Start a large bonfire in the beach"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When the witching hour begins, cast a wooden figure of a tortoise into the flames and the image of Darwin will appear in the flames"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will answer three questions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Choose wisely."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "OH"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Because this is a dead sub that was for Harry Potter: Wizards Unite, not for real magic"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But why?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "*mild confusion ensues"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I keep hoping someone will come up with a way to keep playing if you did the ‘download all assets’ thing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I haven't deleted yet"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been close a few times but idk, I keep just not 🤷‍♀️\n\nI'm hella low on space though so I should"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Lol all this time later and I still haven't deleted the app 😅"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is looking to try pokemon go (or re try it), here's my referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks! \n\n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was able to get my game data although I requested it about two weeks after the deadline"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So it's worth a shot sending in a request if you want your data."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It should still be possible"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Something about international laws means they still are coming requests."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You don't even have to do anything with those challenges either"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You just watch them beat up mushrooms.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So odd"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can't decide if I'm enjoying it or not lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did name all my pikmin last night as I'd just been collecting them up to this point (apart from the special ones) so that was kinda fun but yeah.\n\nI have no idea what the point is."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Play Pikmin Bloom!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I took up Duolingo,as did my wife"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And like WU I have surpassed her XP count."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm playing Pikmin only to make myself walk and because I can send postcards to my HPWU friends"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Otherwise it is pretty pointless"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss the game so much and my in-game friends."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I don’t understand what the mushroom challenges are all about"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So weird"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm also trying to understand what the point is really.\n\nSo I plant flowers...ok.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Which enables me to get more nectar for my creatures so they can shed more petals so I can plant more flowers.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And increase the number of creatures I have to be able to do that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Some of the creatures can get comical costumes if you increase their friendship level, and the costumes are worth extra points when trying to defeat mushrooms.\n\n But what's the point of doing the mushroom challenges other than getting more nectar (uh yeay) and a postcard to send pne\n\nIt's really just a glorified step counter."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes that's really the only thing that makes it enjoyable for me, the fact I'm not constantly staring at the screen and can walk without stopping."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I send an email to privacy@nianticlabs.com on January 14th, a day before the deadline of Jan 15th, asking for my data"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I don’t know if it’s still possible to do so now that the deadline has passed."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hello! \\[waves\\]\n\nI still feel strange when I'm out and about places where there were inns or greenhouses and I don't need to pull my phone out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I finally deleted the app a few days ago when my phone got mad at me (again) for being low on space"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I stopped going for walks for a while which I know is bad so i'm making myself go for walks again sometimes now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Anyway, it's kind of weird that I miss WU the way I do since I don't remember ever being like \"THIS IS SOOOO FUN!\" But I guess it was a big part of my routine for a very long time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "How did you get the email with game data? Did you have to request it somehow?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When HPWU launched, a lot of my friends were playing Jurassic World Alive instead"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s a non-Niantic AR game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can’t be arsed to start Pikmin tbh"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Debating Ingress…"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Totally agree"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I really gave it a try for about 3 weeks and I just don't get it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It feels so pointless, I never got any feeling of achievement from it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not like in WU with finally placing a found able, or finishing those events (even if they happened a bit too often)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Plus it's so weird how it wants to be cute, but then you send out your minions to randomly (and kind of violently) beat up mushrooms."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Like what?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I like that you don’t have to stare at the screen so much on your walks"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I wish it had the equivalent of a wizards’ bus, to battle mushrooms remotely."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "r/PikminBloomApp uses the same map as HPWU"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(As do Pokémon GO and Ingress.) That church might be a mushroom or bloom."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss it too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haven’t started a new game because I’m not much of a gamer"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I only played HPWU because of my love for the fandom."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aw, appreciate the check in! I have not adopted a new game, and really miss the HPWU when walking"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I want to stop by an in or use it as an excuse to go for a walk"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Havent reduced cell phone time, watch way too many reels, so it feels like a net loss."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss this game, too! Pikmin is boring ( haven’t deleted it yet, so I’m boring too), and pogo just doesn’t cut it for me since the nerfed spawns a few years back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "At least WU would have a good variety and was always interesting"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The artwork was so good."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I switched to Pikmin Bloom and I find myself wondering what's the point?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I looked up at the full moon last week and thought “werewolves!” But, alas, there was no way to play"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I still plan to put together my annotated screen shots in a PDF booklet for myself, and I have watched some archived animations on YouTube"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "EDIT: I just received my game data from Niantic via email today! I intend to collate this with all the other PDFs and videos from the game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Someone was talking today about a wedding they’re going to in a particular church - my brain went ‘oh yes, the one that’s an inn/good spawn site’ 😫"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss it also"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yesterday I was dancing with my little kid and thought that all those steps would have counted towards portkeys"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Right back at you.\n\nI've switched to Pikmin Bloom mostly to push me to walk, but it's not the same"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "In fact my little pikmins are sometimes named things like \"I miss HPWU\" or \"Quidditch Fan Hermione\" (I'm still very sour about not being able to place her)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Despite its flaws, it was a great game and I miss it still."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "deleted 6gb chuck from my iphone 2 weeks after shutdown..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone would want to check out pokemon go for their next AR game, here's my referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions, and helps me with a badge"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks! Will work for any new or returning players! \n\n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The \"chat\" (Niantic Social) runs on a separate server that wasn't shut down, because Niantic Social is used in multiple Niantic games.\n\nIt sounds like somebody in your local group created an event and forgot to cancel it before HPWU ended.\n\nIf you ever start playing another Niantic game that uses Niantic Social -- currently Ingress is the only such game --  you'll be able to find your old HPWU friends and your old groups"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(Niantic has not removed HPWU groups.)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks! I have installed it and will try it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Harry Potter: Magic Awakened sounds like it might suit you? They rolled out in China first, but I just had an email about it being released wider … they’re talking about duelling other players and battling creatures."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes, I understand the connection, it's just odd that the now-pegged-to Ingress (or PoGo) \"STL Wizards\" would send out a fortress notification for Ingress or PoGo, which (from my very short research) don't seem to have \"fortresses.\" And despite the games using the same database, I shouldn't be getting notifications for games I've never signed up for or downloaded, if somehow they're actually coming styled like those from an app that's supposedly closed down"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's a pretty big privacy violation.\n\nAnd it's still weird that in the (admittedly short) time that hpwu had chat, I never saw a similar notification about a fortress meetup"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wish I'd known that was a feature while the game was live."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The chat group, friend list are shared among all Niantic game, so players can still access them in Ingress by the same login credentials"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's interesting, though the group name is the one I joined in hpwu, and I've never signed up for or played Ingress."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The chat system is available in Ingress too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Therefore if someone ping you in group chatroom from Ingress, you will also receive notification."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ohh yeah sorry I am reddit noob"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I know how to make it work for next time now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you for pointing it out!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You can use Imgur to link to images on Reddit, but in your case I’d recommend contacting niantic support (you can do that in app) and explaining your issue.\n\nEdit: you could also post on r/pokemongo or have a look at the sidebar/menu on that sub as someone may have already encountered this issue."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No I tried to connect both pogo and WU to my gmail after facebook tweaked out last fall and it wouldn’t let me connect both."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have the same email linked to both so I don't think that would create a problem unless shutting down the app somehow created a communication bug on the pogo/wizards servers."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Have you had a pogo account before?  If not I'd check your email for old pogo emails and contact support."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'd give you screenshots but I don't know how on reddit."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Tap your pokeball, go to settings, and scroll down"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You aren't prevented from using the same email on both"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just sign up using the same email address."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same here, lol."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This submission has been removed and locked for receiving numerous reports from the community.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/WizardsUnite) if you have any questions or concerns.*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If Jesus is coming back, could he resurrect WU too? Go annoy someone that cares."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Finally did it yesterday, but I'd already deleted the dowloaded assets"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Weird half measure lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What has this place become...?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted it the day after the game ended"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The app was too large, and there really was no point for me to keep it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I loved the game but am not as emotionally connected to it as others seem to be."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve just deleted it now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss the game and don’t want to look at the ghost of it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My user name there is the same as here if you need friends."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Awesome! I’m in!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Totally."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "All good points"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Permafields are so incredibly boring and irritating"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Others seem to find them optimal"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I guess it comes down to whatever is being stimulating about the game- for them it seems a sense of power and control"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They want to control the map with minimal time and effort, and, I have noticed, control other players"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This overrides any mental stimulation from strategy and adapting to an ever-changing world"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Looking forward to the event starting tomorrow where permafields will have less of an impact"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yet, of course I rid myself of the keys that were of no use because of same permafields, heh"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "True! \n\nIt can go both ways e.g"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "if yr surrounded by the same team but they're only interested in maintaining permafields\n\nI guess my point was that ingress can be far more dependent on other players, depending on your personality and play style - way more of a \"sandbox\" type game than one with specific routes to progression (as illustrated by the subset of players who never close fields, only link)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Would I encounter random Dinos on walks?  Dopamine seeking, here!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It can be a bonus to have lots of players on the other side"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have to drive a good distance to go and blow up green"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sometimes being irritating will get them to come blow things up and leave green, but that’s not reliable- often just 1 reso per portal, if anything"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So back I go- drive 30 or 45 min to blow stuff up"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "At least there are podcasts for the trip 😊"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "After a week I deleted it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Being there was a sad reminder that it was gone and I really needed the space on my devices."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just did it today"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was hard but there is no reason to keep it around."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted it on 1/31/22"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It took up a lot of memory."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted the day after the game ended"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Saving the space on my phone was the one silver lining."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Deleted it same day, I wanted the 4gb of space back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I suppose I could have just deleted the data and accomplished nearly the same, but if it the icon was still there I would have muscle memory launched it dozens of times by now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Jurassic World Alive (JW Alive)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Collect and combine DNA to build dinos, join an alliance, PVP combats, combat trainings and raids where you have to work with a team to defeat a boss dino to collect its DNA"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has filled the WU void quite nicely."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "once i saw it was still tracking me pretty heavily i deleted it!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "To add, I also play Ingress and Pikmin Bloom\n\nPikmin is definitely the most chill - ingress can be incredibly strategic but has a very steep learning curve, and is a lot more dependent on players in your local area (e.g"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "if they're all on the opposite team, it can be difficult to make progress)\n\nBoth encourage exploration tho - Pikmin more passively, and Ingress more actively e.g"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "portals further from roads/bus routes/populated areas have higher strategic value"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I put it in the very, very last page of my home screen, with all the apps that I only use when I need to travel."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been enjoying the Witcher Monster Slayer game from Spokko - no cooperation yet but fairly complex skill trees, decent battle mechanics\n\nThey also have regular events, and there's 1 season of \"quests\" that are quite fun e.g"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "little missions that lead you around your local area"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Delete it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's a space hog of an application"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It doesn't work anymore"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Free up the space on your device."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m just going to leave it there..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "ingress and Pokémon go are made by the same developers and are very similar"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Deleted it!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I uninstalled a couple days after it ended"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm sad to see it go, but I feel like I got about as much closure as I reasonably expected."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I haven’t deleted it, either"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Probably won’t"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "By the time I could use space I will get a new phone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I haven’t been walking hardly at all"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Did a bit today, but not what I did for the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Today was the first day that I didn’t reach for my phone to play it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The day of the shutdown announcement."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted the morning it stopped working"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m the rip the bandaid off type of person 😊"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I moved it off my main page but couldn’t bring myself to delete it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted it after the *second* time I launched the app by reflex."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Literally as soon as I thought about it for the first time a few days ago"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The spot of honor next to Pokemon Go (which has always been more my thing) hasn't had open competition in forever"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ":)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Day after"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was depressing/frustrating to see"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I would want to open it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Tf am I supposed to do on my lunch break now?! I played P.Go before, but I never got into battling people and then the shadow stuff got added and was out shortly thereafter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Needed space on my phone too."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted immediately"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Really wanted the 3gb space back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wasn’t planning on deleting mine"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You know, just in case it comes back…😬"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted mine on the day after"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I only miss it when I'm working, LOL"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was a professor, and I WFH, so when I would do Ruins 4 all afternoon to run up some XP and stuff"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Any other time I'd have it out, I'd usually be alternating between WU and PoGO."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I knew I’d keep hitting the icon out of habit, and Siri would keep recommending it, so it had to go"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Plus, it was taking over 6 gigs on my phone! \n\nI’m sad to see it go"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The only game I play now is Wordle which is certainly not any kind of replacement."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted February 1st since it just kept going to the help page"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I need to clear up memory on my phone so it'll probably be soon"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I should have already"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But for some weird reason I don't understand I haven't wanted to uninstall"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I feel very weird when I'm out walking but I don't need to go to the greenhouse or stop by the inn on my way somewhere"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And at around midnight most nights I have a quick pang of \"did I finish my tasks? oh wait never mind.\" Silly me."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm leaving mine until I get a new phone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hopefully that is more than a year away."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Deleted it as soon as I got booted out at about 12:07 am on the last day and got the final screen of death"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I knew if I didn't I'd keep opening it just out of habit and muscle memory, plus I wanted the space back on my phone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got rid of it today, as I notice md that it was still sending location info out."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had to delete mine the day after…it was too depressing to see"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve been trying to get into Pokémon Go, but I’m just not feeling it at all."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haven't got mine yet and, like OP, emailed just before the deadline"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Side note: I just had a minor panic because I didn't see a sent mail in my primary email address - I even sent a new email to Niantic to ask if they could tell me I did request! - but then I found it in my secondary email"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "PHEW!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If this game was part of your daily routine, then I'd kindly want to recommend you getting back to Pokemon GO! (Or creating an account, if you've never played it before)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has improved a ton since its early days"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has tons of new stuff to do, in both daily, weekly, and monthly doses"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Give it a GO, maybe? :p Here's my friend code if you want to try it out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This will give us both some rewards! HDKP4YYF9\n\nPlay safely!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Bonus points with whom? Cancel culture? SJWs? Morality ~~Police~~/Activists? If people got bored of the game, fine"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If they got frustrated by the lack of progress, OK"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If they found better things to do with their time, all good"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But to score points with a bunch of online zealots? Weak"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wanna boycott games, books, music, movies, TV, or other entertainment media because the creator is a jerk/racist/asshole/sexist etc"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "then just do it and don't apologize nor advertise it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No need to look for approval or SJW points from someone else."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Disagree"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The whole TERF controversy is overrated"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Over 99% of the US population is CIS, and most agree that trans people should not be beaten, or hurt or killed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Pointing out that a biological male who has male DNA and chromosomes (XY) is NOT identical to a woman (XX) does not make one a hater"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's biological reality"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "A trans-woman should not be demanding medical treatments or medication meant for CIS women- that could be dangerous or deadly"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nor should they demand a pap smear, because they don't have a cervix.\n\nSome very loud and visible activists make this TERF thing a big deal and cancel anyone who thinks otherwise"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But the reality is that Harry Potter theme park rides are always packed, people still watch the movies and related TV shows and the majority of the population aren't trans activists"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Whether people believe Rowling is right or wrong, if they want to consume HP merchandise, it has no reflection on their feelings about trans people."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just remembered another HUGE barrier: it was impossible to start this game late and also impossible to drop it and pick it back up later, because both the storyline and the ability to advance in the game were based on time-limited events"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you missed a couple of brilliant events you could not catch up, either in terms of completing achievements or in following the story"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That was a dumb move by the developers and I don't know why they did it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was obvious that the original plan was to advance the story via the \"mysteries\" and the SOS task list, which you could do at your own pace, but they dropped that quickly to focus exclusively on the brilliant events, which happened far too often"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This both wore out regular players and turned off anyone who either started late or took a break"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It meant that by the end all you had were a few day one players who had stuck with it; literally nobody else had any reason (or real ability) to play the game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just don't think you can sustain a game of this magnitude on an aging fan base, though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You have to be able to engage the new fans (of which there are plenty, every kid I know reads Harry Potter)."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will wear off eventually"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Or just delete or archive the app"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Pick up a new game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There are loads of them out there."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's not meant to be a complaint thread"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There's no point in spending time complaining about something that's in the past"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm interested in people's thoughts on why HPWU didn't work out and what it could mean for future games.\n\nI don't necessarily agree that HP is for kids"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I mean, that was the target audience, but the original fan base are adults now and a lot of adults who grew up on it still care about it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Though I'll admit that aside from HPWU and a nostalgia-fueled midwinter-by-the-fire movie binge every couple of years I haven't thought about HP much in a long time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I get that this is a complaint thread for people who quit playing, but most of the things mentioned here are things I liked about the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If I had a complaint (other than bugs, the bugs were bad) it would be that it was too mindless and easy - I would have liked some puzzles and strategy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But given how many people were always on the forums complaining that it was too hard, I think the lesson is that you can't please everyone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Actually my real answer is that HP is a series for kids and this game was impossible for kids to play"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You needed a better phone than most kids have, and you needed to be able to wander around populated areas"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My HP fan also had trouble casting spells when he was the right age to care."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah, I keep bouncing off PoGo because I can't do anything without increasing my storage"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The only time I spent money in WU was portkey events, and my husband didn't even do that."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yup"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Totally do this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I really need an app that's just the icon so I get get those gigs back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It'll probably be less heartbreaking as well."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But everytime I’m around some place to get energy or greenhouses, I think of it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I quit because of all the stupid bugs that they didn't fix for literally years.\n\nThey clearly didn't even have 1 full time coder .\n\nUnder-investment in development and QA was a big nail in the coffin."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This was my biggest barrier, too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was willing to put up with a LOT of bs, but in the end, the total randomness killed it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No matter how much I leveld up, it didn't matter because there was do little skill, it was all rng."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You can't charge for things that don't work (port keys with broken adventure sync, and dark marks with battles that kick you out randomly or if you achieve something during play) and expect to make money..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If this game was part of your daily routine, then I'd kindly want to recommend you getting back to Pokemon GO! (Or creating an account, if you've never played it before)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has improved a ton since its early days"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has tons of new stuff to do, in both daily, weekly, and monthly doses"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Give it a GO, maybe? :p\nHere's my friend code if you want to try it out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This will give us both some rewards! HDKP4YYF9\n\nPlay safely!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think the biggest downfall of the game was the everyday game play was more frustrating than fun"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My kid loves Harry Potter and games"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My wife loves Harry Potter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Neither of them played much (\"it's terrible.\"   \"Not fun.\")"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The foundable return mechanics were terrible"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You pretty much couldn't return something without a potion and you were chronically out of energy (much better after energy started appearing on the over world map during covid)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "In PoGo, I get excited when I see a rare pokemon - I hoard resources for those occasions (ultraballs and golden raspberries)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "In HPWU, I hated seeing anything rare because it inevitably meant spending a bunch of energy only to watch it flee"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Fundamentally, a game needs to be fun"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I would do the daily quests, but that was it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I usually couldn't even be bothered to complete the events"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The success rate was so low that you never got enough dopamine to get addicted"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got to the point where I had a rule of 3 foundables fleeing after great casts in a row, and I would kill the app and not open the game again that day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That exit criteria was met pretty much every day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It got a little better when they added a skill tree that included improving your cast success rate, but it wasn't really enough to make the game fun for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I spent a lot of time asking, \"why do I even bother playing this crap?\""
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The big turnoff for me with HPWU was the increasing complexity"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I liked doing the quests to level up my professor skill tree, and eventually I maxed it out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was looking forward to getting another professor-type tree.\n\nInstead I got hundreds of statistics and miniscule percentage buffs"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "As a casual fan, this never ending grinding for nearly negligible bonuses turned me right off"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I feel like Pogo doesn't have as much of that - its more straightforward and easier to wrap my head around what bonuses I have/don't have"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It doesn't go out of its way to quantify everything"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Granted, the information is out there, but I'm fine with \"Razz Berry makes me better at catching stuff? Cool"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Golden Razz is even better than that? Great.\""
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had an incomplete Auror that I used for Oddities and it was easier to take out Adversaries with that profession than with my Adversary-maxxed Professor, though it did take more potions."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ">Then the Adversaries and eventually Lethals were introduced with much fanfare"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And all that carefully crafted balance between the classes fell apart"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Instead there were, for Professors, long tedious battles with aggravating dexterity elements.\n\nCompletely agree.\n\nIn a standard fortress battle, a Prof was a very valuable support player"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aurors did the heavy lifting, Magizoos took the spiders, and a Prof with Proficiency and Det Hex and taking the Werewolves were very welcome"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Everybody was a true team, and each balanced the other out with unique skills that enhanced the entire team.\n\nProfessors were the 98lb weaklings for Adversary battles (solo only), and all their strengths were useless and unusable, leaving a Prof needing more spell energy and potions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "here's the kicker.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "no matter how many scrolls or spellbooks or levels, or XP gold you earned, you could NEVER improve your Prof for an Adversary battle"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You throw your precious red books and green books to buy all the Combat Training you can get, and you STILL suck at Adversaries"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "A baby Auror did better"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish there was a way to undo buying all those Combat lessons and regaining those books for a second profession (Auror)."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Who, me? I’m not even in the software business."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had maybe $10 in it, and certainly could have gone without that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But (and this might just be my overreaction, this is all opinion) at the beginning it felt like the game was asking for money hard."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted the game but today I went thru all of my screen recordings of me playing the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's been more than a week and I miss the fortress, the foundables, brewing potions and picking up ingredients"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I tried playing pokemon go again and it wasn't the same"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am playing pikmin bloom but there isn't much to do in that game except send them out on expeditions for fruit"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "With wizards unite I can play solo and get a lot accomplished"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Pokemon go you really need people to even get a 5 star raid"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "At least with the fortress I can solo a dark 5 and use potions."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I reference to point #2 Absolutely not"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There was no reason to ever spend money in this game and that was probably the actual problem, this game made less than .0000001% of what pogo made in the first year"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When the game ended I had over 80,000 coins and no reason to spend them."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I loved it but had to quit playing ladt year when I moved to a neighborhood with crappy cell service."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I also deleted it just so I wouldn’t keep trying to open it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The temptation was too strong when I would go for walks in places where there were inns and greenhouses, even though I knew it wouldn’t open."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And people have talked about it from the early days of the game being released"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I remember writing a few of [such](https://reddit.com/r/WizardsUnite/comments/bk8o7q/is_anyone_else_bored_already/emg4flv/?context=999) [comments](https://reddit.com/r/harrypotterwu/comments/c4mhgp/i_hope_this_game_becomes_as_viral_as_pokemon_go/ery61vv/?context=999) [myself](https://reddit.com/r/harrypotterwu/comments/cbt38u/seems_backwards_that_we_only_need_14_of_common/etktu1d/?context=999).\n\nSomehow it was obvious to everyone except the devs, not sure how that happened."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve been thinking about it! Are you playing? Thoughts?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted the app as soon as it ended so I wouldn't do this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Also I wanted that 5GB of space back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Don't see a reason to keep the app installed if it's dead."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve put the app in a folder and have a very sad empty space on my homescreen"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haven’t decided if any app (game or other) is “worthy” to fill the WU space.\nAnd yes, I almost stopped my bikeride to plant some snowdrop friday…"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes - 50, now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Plus additional requirements prior to reaching each next level - evolve 1 of each type Eeveeloution is one I gotta complete to reach 42, for example."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The first point is huge"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "By taking away the Pokémon and making it so you only focus on improving your wizard, they basically made an RPG with no loot"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Loot is a fundamental part of the gameplay loop of RPGs ever since the genres inception"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Imagine Diablo but once you maxed your character level there was nothing else to earn"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You could do Baal runs but there was no loot at the end, you just incremented a counter of how many times you had defeated Baal"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It wouldn’t be fun"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "HPWU lived as long as it did because 1) people like HP, and 2) fomo (people didn’t want to miss time-limited events/rewards)."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I honestly dont really remember having an issue with having enough energy in the early days, but we weren’t even a full year in when COVID hit and energy ended up boosted, so that’s probably why I don’t remember it well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I also didn’t burn through energy as badly until the knight bus became a thing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got back into POGO last summer and that’s when I really started comparing to HPWU"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Who knows how it would’ve played out if COVID had never hit and those changes weren’t implemented."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Did they raise the PoGo level limit? I remember it being 40 but it’s been a while since I looked at it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Early on the micro transactions were pushed a lot harder since spell energy was very scarce"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There was none on the ground, greenhouses gave no energy, and inns gave way less (many only gave ONE energy per spin)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They’re eventually made it a lot better but it seems like it was already too late."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I doubt that had any meaningful impact on the number of people playing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The game was bleeding players ever since it launched, the JKR stuff just gave a window for some people to score some bonus points on their way out."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What did I learn from HPWU? That your game is only as strong as your random number generator"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There are numerous examples, but even at the very end it was obvious: they added Baby Beasts to the Magical Creatures sticker page"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Had an event featuring those added stickers, then made them extremely rare so that at the end game I was left with empty sticker slots"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Dark detectors didn’t help make them appear"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just the same set of the same foundables appearing all over the map"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Your location didn’t matter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Your skill didn’t matter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Even items/coins didn’t matter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was just a random number that needed to be hit… 1/10,000? Who knows"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If I wanted to play a dice only game I could play Candy Land."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes, that pdf was just what I was looking for! Thank you so much!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There's this from u/Stefiman2 for the storyline: [https://drive.google.com/file/d/1n828yesQX45IfDWGL5RKFEjPi-d7y02Q/view?usp=sharing](https://drive.google.com/file/d/1n828yesQX45IfDWGL5RKFEjPi-d7y02Q/view?usp=sharing)  ([source](https://www.reddit.com/r/harrypotterwu/comments/qs6pl7/complete_story_and_resources_in_one_pdf/))\n\nAnd pdfs for each event by The Taskforce Times: [https://drive.google.com/drive/folders/1QNSjbPD6PimCToO\\_SVZWjiHQSDn009Le](https://drive.google.com/drive/folders/1QNSjbPD6PimCToO_SVZWjiHQSDn009Le) ([source](https://www.taskforcetimes.news/))\n\nu/zviznemte made many posts on Reddit with banners/assets (images) and such"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "He also made [this Google sheet with many, if not all, assets](https://docs.google.com/spreadsheets/d/1eM3PsAiXNpEtVmzVBdfrXlyPjN55MKotAveYm1g50lk/).\n\nRegarding foundables and actual gameplay, I've been screen recording everything the game had to offer the last couple of weeks and am currently in the process of uploading them on [this YouTube channel](https://www.youtube.com/channel/UCtj17BiEwH1kHoeudwKaSfw) (still work in progress).\n\nAnd of course there's the \"official guide\", the only actual physical book I know of"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's not entirely accurate unfortunately, as it was released not long after the game launched.\n\nWould love to know of more sources if I've missed any!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I played this game for maybe a few weeks but immediately dropped off because the gameplay loop wasn’t for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I worked at a mall so I had access to a lot of stops and stickers appearing, so it was nice having that all at the tip of my fingers"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But as soon as I started playing the game I knew the stickers would be the reason this game wouldn’t succeed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "With Pokémon, even though you’re collecting the same Pokémon over and over again, there’s a point behind it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Get candies to evolve, find shiny Pokémon, get one with great stats"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And then you use those Pokémon to fight other people, boss raids, or the towers"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You grow attached to your Pokémon that assist you with challenges"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The loop is rewarding"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And this loop attracts all ages, from children to elderly, because catching Pokémon is fun"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Collecting stickers for XP and challenges made me not care at all about them almost instantly"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Completing a page in my book brought me 0 satisfaction since you Just prestige it and go again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just leveling yourself up was neat, but I didn’t grow attached to my role as a “Professor” and stopped caring about the tower fights with my character quickly too, mainly because I didn’t have a crew for it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Plus, limiting certain level ups to events meant I couldn’t proceed in my character unless they were happening"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I knew this would make WU a failure.\n\nAll in all, the loop of grinding for xp by collecting stickers to fight in towers wasn’t for me and shiny purple stickers weren’t attractive either"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The Pokémon loop felt rewarding, you grow attached to the Pokémon you did catch, and the creatures are attractive to all ages and genders."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I actually feel like POGO was more necessary to spend money"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Like we got 10 gold daily in hpwu, guaranteed pretty easily"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Plus the monthly rewards added  a decent amount of gold"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sure, POGO you can get 50 gold/day but that’s only if you get knocked from a gym after being there the max time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There’s no guarantee"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You may not get knocked out, or you might have 5 knocked out in one day still only giving you 50"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So I know I accumulate gold much more slowly in POGO than in HPWU"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Plus we had the ability to brew tonics versus needing to use gold for incense"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Additionally, once covid came we had the ability to join the knight bus without it costing us anything, whereas on POGO if you want to remote raid you need passes and so it’s limited how often you can remote raid without spending $"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I found it immensely easier to expand my energy limit and potion limit without spending real money in HPWU whereas in POGO you need to expand your bag, plus your Pokémon storage, plus buy incense and remote raid passes, all while having a not guaranteed method of getting 50 gold/day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I do feel like this always needed to have some type of end in sight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The storyline meant it would be impossible to carry on forever, and since it’s not like you could pick it up a year in and get the brilliant events from the first year, it might have turned some people off who picked it up and felt like they could never “complete” it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And since all the brilliant events were where the story was developing if you picked it up a year in, or took a break, you were missing parts of the story which I don’t think is appealing to a lot of people."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah, my whole original friends list quit at that point."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hard agree on many of your points"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I never understood why they essentially made it a sticker collecting game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just doesn’t reflect the Harry Potter universe"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The fan made YouTube trailer (“Harry Potter Go”) that was made years before HPWU came out honestly looked a lot more interesting to me.\n\nInteractive diagonal alley that you can floo powder to, quidditch positions and games as another form of “profession”, more house themed anything, any type of Hogwarts interaction, letting us collect things that are actually collectible in the HP universe - chocolate frog cards, Bertie botts beans… so much potential 😫\n\nAlso, again to your point, agree there was not *nearly* enough story! \n\nEssentially it was a Harry Potter scrap booking game, while the designs were cool and the professions evolved adequately, just wasn’t enough typical game content for me to stick with it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was a day 1 player, and reached level 40 in HPWU before I fizzled out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Also day 1 POGO player, lvl 43 and still playing.\n\n&#x200B;\n\n* The biggest thing for me was that the foundable \"stickers\" did nothing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can catch the same Pokemon thousands of times because it gives me secondary rewards (candy, xl candy, stardust, chance of better stats for battle leagues, etc)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Upgrading the frame that the foundables are in didn't give enough real-time reward"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "* I didn't like the unknown nature of the foundable on the main screen"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was just an icon on the screen relating to a family, rather than the actual foundable"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "In POGO, I know exactly what Pokemon I'm choosing to tap on"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "* POGO has more diversity of events"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It seems like HPWU was doing a little more of this at the end, but the endless Brilliant Events (which were pretty much the exact same event over and over) is what made me ultimately leave at the beginning of 2021"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I came back when Adversaries were introduced, but once the newness of that wore off, there was nothing to keep me engaged.\n* I really enjoyed the Knight Bus when it was introduced, but I would have rather waited in a queue to join a full team than have to endlessly search lobbies to find a few more players"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "&#x200B;\n\nUltimately, I think HPWU was a good game when it was introduced, and it had a ton of potential, but it didn't evolve enough from a glorified sticker book to keep me engaged."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There are two that I know of: The [Taskforce Times](https://www.taskforcetimes.news/storyline) storyline archive and u/Stefiman2’s [wonderfully done PDF](https://drive.google.com/file/d/1n828yesQX45IfDWGL5RKFEjPi-d7y02Q/view) with the story plus a lot more material."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was playing and holding my metaphorical nose"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I also agree the story was not engaging though."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s true"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "She lost a lot of support and the game must have suffered some from that."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "While not the main issue, the whole JKR TERF issue did turn a lot of people off.\n\nI know I stopped recommending the game at that point."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When I started playing HPWU on day one I was impressed that it had just enough dexterity elements to prevent people from walking around with a half dozen devices to play, and the fortress battles with friends were fun and cool"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The balance and tradeoffs between the professions added a level of strategy missing from the other AR games"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then I spent 40 minutes walking at the tail end of a Brilliant event, didn't find the Foundable I needed to finish it, and stopped playing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "A while later I started hanging out with a different group of player friends, doing Fortress battles with them, and the game was fun and cool again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But fewer and fewer of my old friends were playing, some because they had gotten bored, some because of JKR's politics"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then came 2020 and all that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Suddenly needing to walk 250 meters a day was an important valuable reason to leave the house"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Suddenly sitting in the car along for the ride while my housemate fetched something from a store meant I got to see the sun that day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And then came version 1.0 of the Knight Bus and I could do Fortress battles again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But there never was a version 2.0 of the Knight Bus, instead we got a constant exhausting stream of haphazardly QA'ed events, with frustrating dexterity requirements"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The game became a chore.\n\nThen the Adversaries and eventually Lethals were introduced with much fanfare"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And all that carefully crafted balance between the classes fell apart"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Instead there were, for Professors, long tedious battles with aggravating dexterity elements"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Use a Dark Mark and my hand would hurt for an hour"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But still I finished nearly all of the events, even if it meant spending an hour or two driving the strip-mall loop to finish the bonus"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And the Knight Bus?  The cool unique interesting part of the game?  There was no way to link up with friends without chasing beacons, and even during events it was almost impossible to find pick up groups in a chamber"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Join a chamber"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wait"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Leave"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Switch servers"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Try again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was disheartening"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Eventually I realized that I was just chasing after my sunk cost of time and fun"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And I just didn't care enough to star out my pages after that."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I really like your idea of a set time episode or season you could win or lose!  Then, people could join at the beginning of a season rather than randomly and no know what the story line is."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm fairly new to it and I get what you're saying about it being a glorified pedometer"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I made it to level 15 and there's a new challenge feature that unlocked"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You can destroy these awesome looking enormous mushrooms, pick your squad according to colour and friendship level, and you can do the challenge with other players"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's cute, doesn't quite scratch the HPWU itch, but I think I'll stick with it for a bit"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "TBH I'm kind of enjoying not staring at my phone screen so much, especially after the last hectic month of trying to complete HPWU."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm giving pikmin bloom a chance too, but it's little more than a pedometer it feels like"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm at a POI right now and thinking same time last week I was dropping potions and dark detectors and having the thrill of trying to find those last hermione foundables (*narrator: she did not end up finding them*)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And now I'm just here and meh"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeay I planted flowers"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Won't be able to make the POI bloom by the time my son's soccer practice is over"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have no motivation to walk around now instead of sitting and sipping a coffee.\n\nIt's basically HPWU but only with potions brewing and portkey walking, there's no actual game element for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Am I missing something?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks! I'll try that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have always been trying to get in pokémon Go, but it's not as immersive as Harry Potter or interactive and so it just never works for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Maybe pikmin will help"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm using Pikmin Bloom to encourage me to take the longer route or walk that little bit further"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They are darn cute those little Pikmin and they do a big cheer when you walk lots, very encouraging."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been driving when last week I would have walked."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yesterday,  I visited the downtown area where I usually look for POI.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And I automatically opened the phone to check the apps..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😭"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Now I turn on Pokémon Go to hatch eggs"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s not the same and the satisfaction isn’t as quick (1km portkeys vs"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "5km eggs), but it’s something"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m trying to build on what HPWU started for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I walked more and I’m trying to maintain that for my health"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I also turn on my Peloton app so I get the minutes for exercising and I have more incentive to keep going"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If the overall result is staying more active, then it’s a win."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I completely agree with your view on it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I stopped playing specifically because I didn’t want to be addicted when it left and it was still hard for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can’t imagine how you must feel, my heart goes out to you big time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was sleep deprived and grumpy but I did a 32 minute screen recording going through everything and playing one last time but for the first 10 minutes after i was done, it wasn’t in my photos and i was so upset and thought i’d have to do all of it again and i would be grumpy when i did but then it popped up and there was so much relief"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m really sorry for your situation tho, that’s really shitty and they should have 100% made it more clear"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The app I put in the spot HPWU used to be is iMovie, so now I’ve started a YouTube channel LOL."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I play Duolingo as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was more engaging before the changes, though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "However, I am done with that in 15 minutes, as opposed to the 2 hours I played WU."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will never uninstall."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "❤️❤️❤️❤️ duolingo"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Cant even post a working link lol."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I couldn't bring myself to uninstall, but I cleared data to free up a few GB of space used by downloaded assets."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hehehe you're spot on with the repetition of useless phrases"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did a bunch of lessons in Italian and the line \"il cane bevé l'acqua/ the dog drinks water\" is hammered into my brain!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah, the fun words!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Interesting"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I lived in Belgium and Germany for a total of 12 years"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I learned enough German and French to ask simple questions  and know when I was getting cussed out."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They gamified learning foreign languages"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks, I will check that out!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh, maybe I should Duolingo again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was very into it for a while, and was doing mostly German"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wonder if they stopped emphasizing how to tell someone that they have a pretty cow?  The feedback that I gave was that it seemed like a waste to use the that much of the platform for something I would never need to say"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I liked the stories best; those helped to get a better feel for actual usage"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then they deemphasized those and I dropped it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Maybe I should check out some other apps to compare again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I liked the gaming structure of Duolingo, just was weak on content"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Edit: spelling"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I haven't deleted WU either"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just moved it to my folder of game apps I don't visit"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The spot where WU is empty and I just stare at it, wishing the game was still live"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "While I stare at the empty spot, I wonder what I'll do with my time now...then end up opening PokemonGo for 5 minutes and closing it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I actually had stopped playing PGo so much because I dedicated my time to WU instead."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Pimsleur is superior"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve used both"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Have you considered trying Pokemon Go? I've got a tonne of people on my PoGo friends list purely from HPWU, and I've been reluctant to delete them in case they start to play so they have some friends waiting for them."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What is thar game about."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did this! Moved WU to the back and put Duolingo in its spot"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I happened to just start using Duolingo a couple weeks ago because a friend mentioned it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same here"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I picked up Duolingo a few months ago and am now using that to fill my WU void."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have, too! I can’t delete the WU app yet, but maybe I’ll move Duolingo to its spot so something useful opens when I reflexively tap that space on my phone."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's true"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They've removed a lot of the more interesting stories and replaced them with specific characters."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I bought a tablet in December so I could hang onto the game over there, even though it would be just sitting there"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(I'd wanted one for other reasons, but this plus some nice holiday sale prices sealed the deal)  \nI also knew I'd want to reclaim the real estate on my phone, so this was a good way to help me feel all right (mostly; it still hurt) to uninstall right away"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I like the comfort of seeing the icon there in my Games folder"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "<3"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I tried, but I had iOS and couldn't find the resources"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And when I used an APK viewer in Windows I could not get the APK updated"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(Not a developer).\n\nI'd expect the youtobers and infographic creators had access to resources, perhaps they were provided to them."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just got the second email about the team and the 30 days, so time to wait and see what happens."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You’re welcome! I had the same concern, too, but hopefully they’ll be able to follow through"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Based on what I have learned from other commenters it seems that they have a legal obligation to disclose it in some parts of the world"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hope you can get your game data, too!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hope not! You would think there could still be a way to retrieve it, considering that some places require companies to disclose the data"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I logged in through both methods (Niantic account and Facebook)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hopefully they can figure something out!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I emailed a couple days ago and just got a reply that they don’t have an account associated with my email address"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I logged in with Facebook, so there’s only one email address it could be, so maybe they’re starting to delete data?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Took the survey"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ty."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m sorry"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m still in mourning for the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😔"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Most likely, but someone should be able to recompile the .apk from the installed files if they have it installed still"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Or at the least, use a file browser to locate the downloaded assets folder and zip it up.\n\nI'd say I could, but I don't have it installed anymore"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sorry, me too! Except that I enjoy watching the little group of videos"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I miss having Hagrid pop up all kinds of places!   I am unable to post more videos, so that makes me glad that I got Harry and Hagrid both up to share, at least"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish that I could post the Weasley’s Flying Car (it’s very cool), and the Unicorn because it’s someone’s favorite on here, and the Whomping Willow (another person’s favorite)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There must be a reason that they don’t want more videos, though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It does mess with my denial- because if protecting a defunct game’s content matters, then it would only matter if it is not going to stay defunct, right, RIGHT!!?!   I don’t even know"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😭  I seriously had no idea how much I would miss the game, and I wish we could at least get past the pandemic before it shut down, if it had to"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It isn’t about racking up AP or anything- I miss the gifting, that we will never have a return to the Community Days, and the wonderful way there were all of these fun surprises along a walk"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Missing the pasty busses, too!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Would love a compiled book of all the foundables, pages, fortresses, highplayer stats, along with the full storyline"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There really was some awesome artwork in the game that I’m sure many hours went into creating it and it’d be a good remembrance thing for all my hours I used the game to decompress at the end of the day."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sorry, I don’t have those two"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Would a baby Chinese Fireball do?  Or Baby Cerberus?  \n\nShoot- I just tried to post another video and was not allowed to make the post"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😖 So sorry, would love to share these as I know that it means a lot, and I had been pacing it to one per day, but I guess that’s that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "At least I can comment to let you know"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I could maybe try making a YouTube channel even though I don’t have much content (?)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Since the game is defunct IDK what the issue is"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sorry."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "For two days I kept opening the app hoping it was back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So finally early this morning I deleted the app."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aren't most of the assets downloaded?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Shouldn't be too hard to find an apk online and decompile it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Please do a three-point excuse me if I closer that I was denied"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This literally made me feel so much better"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Too soon 😭 I miss the big fellow"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That freaking autocorrect! I don't know why it changed goodbye message to horny but I'm not changing it!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You’re welcome!  I had turned off both the AR and sound early on, too, so it was nice to turn them on again and enjoy them, fresh"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They just seemed to drain the phone battery faster and after a while I forgot that the features were there"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will check when I can"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Probably not, though so I don’t want to get your hopes up"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Now I wish that I had recorded more than I did!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I forgot the sounds, I turned them off a month into playing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for sharing."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just tried as well and got the auto reply, I am really hoping it works.\n\nThanks for this thread OP, I had assumed it was far too late and not worth trying."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just took piles of screen shots over the last few months"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m sure there was a better way to grab them, but I’m not that tech savvy."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That was great, I'm going to miss these animations & the Portkeys the most"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Do you have one of the Mooncalf? Or the baby Norwegian Ridgeback?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hate to admit it, but I had a dream last night where I was suddenly able to play again and it made me so happy."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The thing is though, I’ve always loved Harry Potter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve never cared about Pokémon in the slightest, so there’s no allure to PoGo for me."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If this game was part of your daily routine, then I'd kindly want to recommend you getting back to Pokemon GO! (Or creating an account, if you've never played it before)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has improved a ton since its early days"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has tons of new stuff to do, in both daily, weekly, and monthly doses"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Give it a GO, maybe? :p  \nHere's my friend code if you want to try it out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This will give us both some rewards!\nHDKP4YYF9\n\nPlay safely!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I do that for all of these screen records!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hi!\n\nGood idea to suggest playing Ingress prime to folks suffering from WU withdrawal syndrome ;-)) like I we do.\n\nYou explain the basics well for novices to understand what it is about"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes, go and watch the tutorial or better several tutorials!\n\nBefore deciding on the faction, either green or blue, you are going to choose, you should look at the overview Ingress map of your region, your city or town, and see if the green or blue faction is more dominant in your neighborhood"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Because to level up further it's important to be able to attack and capture \"enemy\" portals of the opposing faction (green or blue, Enlightenment or Resistance) and to create new control fields, these appear as a smaller or larger triangular shape on the map"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And to work together with at least one other player  (friend, wife, husband, child, whatever ;-)) of your own faction to get stronger, to better defend your position by placing higher level defences on your portal, resonators and mods.\n\nThis means that if all the active Ingress players in your wider surrounding area belong to the same faction, nobody of them can attack an \"enemy\" portal and \"conquer\" this area.\n\nIt's fun to have a goal to achieve each day while walking around"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My husband and I started playing Ingress to work our way up to a high enough level to be able to create new waypoints - points of interest - portals - in our area"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Because when we started playing - since day 1 - WU we noticed that there were only very few foundables or ingredients on the map on our street and actually NO guesthouses,  greenhouses or a fortress in our immediate rural neighborhood.\n\nBack then, we needed to drive over to the next town every day to play, because before the invention of the Knightbus, one could not finish the daily tasks without visiting a fortress in the real world at least once per day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "During the first lockdown phase in spring of 2020, I was lurking around near a park in that small town and was consequently stopped by a police patrol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What are you doing here? Are you drunk!? \nSweet Merlin! \nCouldn't tell them that I was 'just' playing WU, could I!? \n\nNow we've plastered Ingress and WU infrastructure all over our village and enjoy finding or creating new wayspots in other areas whenever we manage to get out and explore the world"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And of course we, as members of the green faction, Enlightenment, are locked in an eternal fight for dominance in our area or wherever we travel to, with the opposing faction, the blue Resistance"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It never gets boring 🤣"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You’re welcome!  I plan to add more.\n\nEdit: I am unable to make more posts of any kind"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not sure why, but would have to find somewhere else to share any more of these awesome memories"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It does help me to share them, too, as I feel less alone in missing the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It is so weird to walk without it!  No vampires, pixies, swooping evil, just… nothing."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I describe it as a glorified step counter"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There's no actual game play"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's just walking and you don't even have to really interact with the screen until you get home"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you're not walking, there's really very little to do.\n\nGove me back my HPWU!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "...I literally swiped over the screen to cast the spell."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Excuse me the what message?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I received it but don't know how to open it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think it needs to be done on computer."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haven't played in months, yet I somehow get sad while listening to the sound effects; I already miss them :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Deleted the app"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "*Constantly.*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just emailed them"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hope it works."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nope, I left the game when the announcement came out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I find myself accidentally opening the app I 'promoted' to the front screen frequently."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I never check my personal e-mail unless I’m expecting something"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have to check work all the time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes a couple times a day."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted the app Monday morning but I do have that sad feeling at all the places where the greenhouses and inns were, especially since I play Pokémon Go"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And I also think about the spots I normally get greenhouses etc and it's sad :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had to uninstall it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was making me cry"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I put my gym app there thinking that might be a good substitute.\n\nYeah no"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I couldn’t bear to delete it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So I moved it to my App Library so I would have to see it and get sad."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haha, you're definitely going to have a good time with that data than."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s good to know"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m in the US and haven’t looked into our laws regarding data requests, but now I might need to find out.\n\nWhile it would be cool to have something pretty, I don’t mind if it’s not"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m a bit of a data nerd, so I’ll find it interesting regardless! 🤓"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think according to European Union law they just HAVE to deliver your data, can't put a time on it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(At least not 15 days before the actual end of the game...)\n\nSo just on that basis they'd have to keep offering the possibility to ask about your data for EU players.\n\n\n(I forgot about the deadline, I'm not sure if I want the data or not"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You're just going to get a bunch of spreadsheets with gps locations, aren't you? Not a pretty yearbook.)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I suppose you could still try to request it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The email address to send requests to is privacy@nianticlabs.com"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Let me know if you hear anything back from them!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I immediately uninstalled the app after it kicked me out at 12:09"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I really missed it on my afternoon walk today…"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It can be requested by sending an email to privacy@nianticlabs.com"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I emailed from the email address that my game was tied to and provided my username"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Even though the official deadline has passed, it’s worth trying!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted the app so I just unlock my phone, look at it and sigh then go back to whatever I was doing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s pretty cool! While I do agree that the location info is a bit scary, it does sort of make sense given that the game did require your location to play"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hopefully that info is super secure!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "How do you request for it?!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I received mine Jan 28"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Requested Jan 6"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Some interesting stuff and some a bit scary.\n\nFor example\nInteresting data\nTotal successful casts and total masterful casts"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Mine calculated as 17.4% of my successful casts were masterful.\n\nScary:\nGPS location coordinates on pretty much anything done in game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "One spreadsheet showed coordinates for each time I deleted a gift from my list.\n\nEdited to add: understand you are receiving a straight data dump"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nothing is neat or organized"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "IMO, the gameplay text file has all the cool information."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That gives me some hope! Your second email about the timeframe sounds identical to the one I and a few others received a few weeks ago"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That gives me a bit of hope that my friend can still submit a request, too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for sharing!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I emailed yesterday to ask, got an auto reply, then today another email that it's been passed to the appropriate team and it could take up to 30 days to fulfill"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So hell knows."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's a known bug from a recent update, apparently"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There is a workaround that works about half the time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I guess it wouldn’t hurt to try"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The only reason I’m debating making this suggestion to my friend is that I don’t want them to be more upset if Niantic definitely can’t make the request happen"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Our friend group only connected about a month ago, but we grew pretty close as we were working to finish as much as we could"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Eventually we’re probably going to try finding another game to play together"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "For now, though, we’re definitely feeling the presence of a void right now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "/*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was in the Niantic notice about the game ending"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If someone hadn’t linked to it I wouldn’t have even thought to request it myself."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I also want to know this answer! I waited so I could finish out a second profession before the end and didn't hear about the deadline"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes! I went to the shops yesterday and kept going to pull out my phone thinking that I could restock energy 😔"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What? Where was that announced?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I should say, my friends play it and they go outside and all, and I did it too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's generally possible so maybe you need other settings? \n\nOr if it just got broken recently, then ignore this comment"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hope if you like it then you will be able to play it, it does have a lot of bugs at the moment."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I deleted it off my phone after seeing the horny message for the first time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm still sad about it though and am like 'what should I do instead?'"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I described it to my husband as, imagine if WU were just brewing potions and opening portkeys"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's really it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "With pets."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I refuse to remove it from my phone yet, but I had to move the app so as not to keep doing that."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I downloaded pikman bloom too but have no idea how to play it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had to delete it off of my phone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was making me so sad."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish I knew to request this too."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "These are big, big feelings and they are understandable and valid"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Even if down the road you look back and think they were overblown, right now, in this moment of legitimate grief, they are reasonable and shared by a lot of people"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hugs again."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Despite my best efforts to only collect one task reward at a time and then return to the home screen, I got booted out when trying to collect rewards"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Which was probably just as well, otherwise I might not have got any sleep at all until the game ended in the last time zone!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh my gosh, the night bus was a savior"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was in a big accident in 2019 that through my life completely off horse and I didn't have anything anymore"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Like there was no point to getting up cuz I had no goals"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then there was this game and I played it all day every day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My goals were the daily goals and it seriously helped me through a hard time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I pressured my dad into playing with me and then once a week he would do a fortress with me, and then the Knight bus came and I could do more fortresses with people"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then I found this group and the discord and this app literally was everything for such a long time in my life\n\nThen right before the pandemic I was working like a 14-hour days and then the bandemic happened"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I never lost interest but I started losing time to do it so I heard it was closing and it broke my heart because I hadn't been there for so long and I didn't even get to say goodbye.\n\nOf course then just as I get super into the game again and finally have time for it they close it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will take this personally mostly to avoid feel like like I betrayed the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I promise I know that the game is a game and a nap and doesn't know or care, but it's kind of the same feeling I used to have about my stuffed animals"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Where they each had to have a turn on my bed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Like my love gave it sentience"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish I had discovered this community earlier! The game was released two weeks after I started a second job that has me working 65 hours a week"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I didn’t know anyone else who played, there was never anyone in my town’s single fortress, and I never thought (or really had the time) to look for other players"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish I had! That first year before they introduced the Knight Bus was pretty solitary, me faithfully doing the daily tasks (and tbh very little else in the game) and collecting my rewards before I fell asleep at night.\n\nAnyway, as I’ve done with so many things, I’m here now at the end of all things"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😄"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes, and I also can't make myself uninstall it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss it so much!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you so much"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think that's one of the reasons it hit me so hard again was I didn't get a proper goodbye"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I feel like they think they communicated properly and they just kind of didn't"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This community will always be a highlight to me though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So many times"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I can’t bring myself to delete it, yet."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was actually able to play until 1:10am but then I blinked and it was morning! Managed to place a bunch of wands I was missing and logged in and put to find an active bus"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was terrified I’d be alone for the end"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But sleep took me out first."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yep"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Done that several times"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "A couple of times I’ve started the app and seen the goodbye message"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It makes me sad"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I should really delete the app, but I just can’t bring myself to do it yet."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hello from North Van, BC!\n\nThe last few hours in the Knight Bus were so much fun! I'd maxed out my gifts by about 10 pm and didn't need any foundables but kept going anyway"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got kicked out of a battle at like 11:58 pm and was really scared I wouldn't be able to get back in in time, but I was able to rejoin the battle and then to play just long enough to finish all my tasks for Monday except the walking one (too lazy to get back out of bed at that time) and open my last few gifts from friends."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I replaced it on my screen with Pikmin Bloom, which is currently BROKEN (works only on WiFi, really great for a game that is all about walking places)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So I get the old timey login loop hell frustration"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Good times, it's 2020 all over again."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah, I went for a walk yesterday and kept trying to toggle between HPWU and PoGo"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's going to take a while to break that muscle memory"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was but I moved the app to my last page, and have been playing Pokémon go instead"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I keep checking like maybe TPTB relented."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have to resist the urge a lot"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ":("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm sorry friend."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It didn’t work when I tried it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think it was possible only as long as the game server was still active in the last time zone."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been hearing people say you can change the date on your phone to log back in, but I haven't tested that, and I'm not sure if they've shut down the actual servers by now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m so sorry"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I thought we had through the 31st as well - it made sense, the log in calendar showed a bonus for the day - and only realized that we didn’t a few days before"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was confusing and it left a lot of people blindsided like you"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It is really hard not just to have the game be gone but to have your plans for your thoughtful farewell be thwarted"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hugs."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They even sent an email out about it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just thinking this - I always turned it off because a) battery and b) took longer, but that looks fab"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wait what? They turned it off? It hasn’t even been two years"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There wasn't a miscommunication on it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think people just assumed it was the end of the last day of the month"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had until someone mentioned it; I went back to read the notice and sure enough, Sunday was the last day."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haha I definitely had a dream last night that when I tried it this morning it opened but was new and improved"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Here’s to hoping someone picks up the design and brings it back somehow and that my imagination wasn’t just running wild with the amount of hours I sank in the past few weeks especially."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am hoping that it will both help it to sink in, and that I will habituate to it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "and then, THEN, it will get bought by MacUSA and work again! With all glitches magically fixed and the pacing as individualized as the Weasley clock hands 🤪"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah, gotcha!  Yeah, one of the things that I think they might have gotten wrong was to have so very many events, quite a time sink even with good weather"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "In bad weather- forget about it! Hours extra already lost to snow clean-up and really want to get back inside!  Idk how widespread that experience is, though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It felt like it was important to be keeping up, and with the demands of the game that wasn’t possible for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was sad tbh"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I figured it would be harder to keep seeing the icon day in and day out knowing that it’s gone."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haha what I meant by that was when it was 5 degrees I could still enjoy the game from the comforts of my home"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The knight bus and pop a tonic or dark detector and that would give me hours of play time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Pogo just seems to require me to go outdoors more which when it’s 5 degrees out, no game is going to get me to be outdoors for long, if at all"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s dark by the time I’m done with work, add in snow/ice and it’s just not tempting."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What was it like to delete it?  😩"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Totally with you until the 5 degrees part, lol!  It felt like the spells required too much precision for cold, half-frozen fingers"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "From what I understand it varies by phone, though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Maybe if I had a smaller one it wouldn’t have been an issue"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Often I had to choose between retreating to the car to continue playing, or put the phone away and keep walking"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I haven’t deleted it, yet"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Still in partial denial, I guess"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There ought to be a buyer, right ?!?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My roommate and I would drive to the park and play from my car during covid, it got us out of the house every day and really helped both of us from getting too depressed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wands up for wizards unite /*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I ended up deleting it because my finger just kept going to the app and then the disappointment when the goodbye screen popped up"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve honestly got no clue what I’ll replace it with"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I go through phases with pogo but even when I’m into it it’s not the same as WU"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I liked that WU was playable from home, whereas I don’t get enough free items to allow pogo to be playable from home with the frequency I was able to play wu without spending real cash"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I enjoy the outside aspects of the game when it’s nice out but I think WU really excelled at making it enjoyable when it’s 5 degrees out with 2 feet of snow."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ahahahahaha!!!  That’s awesome!!  I will probably play these on my phone sometimes when I am missing the game too terribly"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "💯"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wow, that’s awesome!  That you have the recordings, I mean"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish that I had recorded more than I did"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Can totally relate to pulling the phone out; 4 times today for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just irritated with other games rn for not being WU, lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Can anyone confirm if this is still working?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have a screen recording of nearly everything in the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I woke up at 5:30 in the morning to take it in the hopes of seeing some doxies"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you want, I can make a google doc with it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Keep in mind it’s not very good because I was half-asleep at the time (and kept nodding off)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I also have some recordings of each portkey available at the end."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My dumb brain had me swiping to cast Protego even though I was just watching an animation"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Muscle memory, lol."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The amount of times today I picked up my phone to try and play"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss it so much already"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have over 300 screenshots and 20screen recordings of the game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "We must preserve it for future generations!!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sometimes it really enhances the experience, yes!  Depends on the background"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It is going to be so strange to go on walks with only muggles around"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will probably play some of these recordings, sometimes"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That makes sense"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you like, I could post some more"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Now I wish that I recorded more, though I felt a bit silly saving what I did"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The artwork just amazes me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There was talent on that team!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I should have played in AR more often"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This looks cool"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thx for sharing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can’t uninstall"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will be just moving it to a folder on a different screen where I can’t see it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm sure someone has them on Youtube somewhere, but it's nice to see them without some annoying commentary over it and with the actual sound."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was one of the few reasons I went outside for the last two years in this damn pandemic."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Or like how Facebook does videos"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just all your stats"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Days played, potions brewed, etc etc."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haha"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Lol yuuuup still"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was already to play today."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s just cruel"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's what I thought! I kept assuring myself that I was okay cuz we would have until midnight! I had three different kinds of port keys that I saved specifically because I wanted them to be my last time in the game and it was Hogwarts Express, dining hall, Dumbledore's office"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I saved them so I could do them one last time and say goodbye to the world I love"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes, I thought we had until midnight tonight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wanted to do a couple more things."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "LMK if you would like the Chinese Fireball posted"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I agree with you and OP that the artwork is quite fantastic! It kept on blowing me away!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This hurts, all of it hurts."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Right?? I thought the game would be open through the end of January, that just makes the most sense"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But then again, the game has been pretty terrible the past 2 months so I shouldn’t be surprised."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Somebody sat there long enough and recorded the leprechaun beating them and he danced at the end"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was hilarious"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone has it, please post it again."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "yeah, same"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "me and the other half were going to do a big blast today, empty out everything (they had to work over the weekend)  \n\n\nWhen you say Jan 31, its a bit silly to apply that as 12:01am.in which case, thats basically Jan 30th"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Me too, was gonna do some Adversary playing and take screenshots...damn"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same, I had all 4 potion slots finish brewing during the morning!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Mine is even worse.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Some friends send me messages to thanked me.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I cannot reply them or even read the full messages.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😭"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got a bittersweet notification this morning telling me a wit sharpening potion was done brewing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ll never be able to claim it though! Sadness."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Is this still working for you?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh yeah this was in the 90s I was just a little bit older than they were when they started watching the show and it was like annoying little brother stuff so has that bad association for me...brother had a big Pikachu in his room...but I was 15 when the show came out so it was \"little kid\" stuff to me...as opposed to Harry Potter which was my thing, read all the books as they came out in HS and college...anyway I will get over it lol I downloaded it and am learning how to play it now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "One nice thing is it looks like there are waaay more people playing it locally vs"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "hpwu or Pikmin bloom"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "yup, it's either for new players, or players who haven't logged in in 90 days"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "In any case, once you've logged in, you have 72 hours to enter a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've learned that last bit just now too.\n\nOh well, as soon as I get home and have a stable connection I'll add you!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I knew it was over… Saw the splash page this morning…And still logged in just now out of habit thinking “I need to make sure I collected my .25 km of walking for the day!”"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It wouldn’t feel right without one final miscommunication."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Last month was lame, wtf why wouldn’t they release the horcrux pages!!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It seems like the program is only eligible if one hasn’t logged in for a while, so I think you’ll have to add me the traditional way :)\n\nLooking forward to continuing the WU-journey of PoGo!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And then to cast the spells required putting your finger RIGHT"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "THERE"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Gave me a chuckle!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The code with letters is a Referral Friend Code, which gives us both rewards upon entering it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Upon logging in, or in your friends list, there should be a \"Have a referral code?\" button"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Try and see if you can enter the code there.\n\nIf you can't though, I'll gladly add you as a friend the usual way anyways \\^^"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hi,\n\nTrying to get back into Pokemon GO but not sure about how to input your code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Mine just allows for numbers, so the letters are a bit confusing.\n\nI can be found on 4875 4119 3206, if anyone wants a new friend :)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "IKR? Would have properly terrified me as a kid!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Glad you made it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same situation"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm so sorry! It's crazy they couldn't give us this one last day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Would've made more sense and been easier to communicate when the shut down was actually happening."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Total agreement"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish the KB had been like that the whole last month!\n\nI burned through more than 100 potions in a few hours, and managed to get just enough red books to finish the lethal adversary nodes for my second profession."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Me too :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I would expect this will stop working (if it is still working) once they actually shut everything down on their end."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There was a prominent notice in the in-game news."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s the thing, I’ve been playing even more since Nov because I knew the game was closing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s why I’m so upset, I was planning a huge game play day to screenshot everything and catch and record my foundables so I’d have some pics to look at"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But I didn’t get to do that and now it’s all gone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m grateful I had the game during some dark times, but it sucks how it all went to shit the past 2 months"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This isn’t the game that I loved"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was a shell of what it once was"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Like I read on the WU community board, the worst cut of all, denying us the last day."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "yeah just like when they launched the game they did an extremely poor job of spreading information"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m pretty sure if it wasn’t for just happening to find a reddit post about it, i wouldn’t have known either"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I agree, what happens with that game around here is not healthy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hopefully in other areas it is much better."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Could be"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think that the gold gifts were all that kept many players going though"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s possible that the rewards weren’t rich enough motivation to overcome the frustrations"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The right balance is important"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Everyone seemed much happier with the game in recent months when they could do more, so I guess unless they studied it before closing it down, it is all speculation."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had planned on going down to Universal and having a blowout on my potions and traces and the like at Diagon Alley or Hogsmeade"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Had a ton of keys and portkeys too.\n\n&#x200B;\n\nAh well."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Once i found out it was shutting down i kinda stopped playing for the last month or two"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m level 54 and it just didn’t feel worth it to get super invested again just to have it go away"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Last night tho right before i fell asleep i got lucky and remembered that it was closing down and did a screen recording playing a bit and talking about the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m glad i got to do it but it was definitely hard closing the game for the last time knowing i would never open it again"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Agreed (on both points)! And I liked how Luna apparently wanted to be friends with the fire breathing chicken"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Because I bet she would."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just tried and it didn't work"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh well, it was a good run anyway!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The servers are down now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But hey, I guess it’s better I got to enjoy it a bit yesterday instead of being sad, playing and knowing it would be my last time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Others have posted, try setting the date in your phone back one day; you might be able to play still (assuming Niantic hasn’t shut down the servers)\n\nEdit: just read a post that servers taken down now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sorry you missed the last hurrah"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Luckily I saw posts from the opposite side of the globe (maybe AUS or NZ), so I adjusted my schedule to play on Jan 30."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I only made 50 :(\n\nStill it was nice to level up right before the end."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When it comes to Pokemon, there's no age involved"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Specially with Pokemon Go; the way the game works, you'll find much more adult players than kids"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And some of the most passionate fans of the franchise are adults too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Maybe at some point they too were the annoying little sibling, but most of us are way past that phase =)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I don't know what do you mean about juggling multiple accounts"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you're that hardcore, it's not healthy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There are some bonuses when interacting with other players, but if you feel the need to **be** all these other players for yourself, then that kinda defeats the purpose of the game, which is connecting with others.\n\nOn the subject of cheaters.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "it's best to ignore them"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They think they are having fun and being happy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And unless your situation is very dire, one can always find a gym that isn't being defended, in order to get coins.\n\nRegarding the dangerous areas.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "some measures were taken in order to be able to play PoGo indoors, such as an extended interaction range for stops and gyms, and vastly increased Incense availability and spawn rate."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Me too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had planned today as my ‘screenshot everything day’."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah, that was weird."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The game wasn't making enough money that they thought it would be worth continuing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think they didn't think through the impact of the gold gifts, for one thing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ingress had a huge dedicated player base that dogpiled the subscription option the day it was started"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "HPWU, not so much."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was able to play a bit this morning, but now it doesn’t work"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Was fun!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's the one I won't miss.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "all those saliva strings.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "/shudder"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "More details in the original post"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It doesn’t help that I stayed up past midnight and didn’t get enough sleep but yeah, I feel pretty fragile and weepy about this today."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "❤️❤️"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There was a popup in the game months ago and since then it was all the time the only post in the in game news section.\nhttps://www.reddit.com/r/harrypotterwu/comments/sh19e0/some_people_will_be_disappointed_today/?utm_medium=android_app&utm_source=share"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Google, and I did change the timezone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It asks for my  birthday then won't let me choose my usual email."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s what I was doing before"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have to let go, like Rose on the door (I’ll never let go)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can get in, but it won't let me use my old account, I gotta start a new one with another email."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same when I passed the post office with a fortress that was my go to fortress before the Knight Bus"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Always had a bunch of foundables, ingredients, and portkeys around it too, so I was able to quickly snag stuff whenever I was at the stop sign by it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Felt so weird to not even check my phone there today."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "At least we actually could log in on the last day, and it didn’t chuck us all out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It must have been the most players in-game at once in a while"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nope iPhone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "She be old tho."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Haha that's a good point"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Went out in true WU style! The final message just needed Coming Soon®"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Those 1920s port keys helped me to get to level 60 on the last day too! I also got over 60k from one with a brain elixir running"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank goodness they fixed Adventure Sync towards the end"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I don't get out much, so I was shaking the crap out of my phone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same results, can't get passed the login page"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you though!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can’t set a time zone AND change the time manually"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can either choose a time zone, or set the date"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Also it only has options for cities, not +/- zones"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I set it to yesterday afternoon, didn’t work"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It got around the ‘bye’ screen but got stuck on loading after asking me to try logging in."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Very true! Not sure I would have known without this group."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nope, it skips the ‘ok bye’ screen but sits on the loading screen instead"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for the tip on that! I figured I give it a go tomorrow at the very least"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They could seriously keep the game running with no more updates and I think many players would have been fine with that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Would have let people fade away from the game in their own time at least, rather than this abrupt and bitter end."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did it, yay! Barely squeaked by with 3 seconds left in the challenge"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not wasted, spent with a purpose :) congratulations :)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I took about 50 screen shots last night to document my progress"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish there was a more elegant way to do this like download a pdf, but oh well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Glad I got almost everything finished."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah that’s rubbish, to be honest it’s not even a surprise at this point that they messed up their own closing date!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've seen that's a possibility, but unless it's a trick that will keep on working forever I don't necessarily see the point for myself"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I really just had the potions in to keep fiddling about last night"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had an extra 20ish minutes of game play before the game glitched and kicked me out."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well it almost worked for me! By passed the death message and started loading like normal, but it wants me to login and won't accept it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It just keeps reloading the login page"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you though!\n\nEdit: didn't realize how old your post was lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I thought you just posted it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh well ❤️"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I could absolutely see that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m sure it was very expensive."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My spouse teased me with, “well at least you get your life back.” “You’re assuming I had a life.”"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Where? I mean, I’m not on social media much (if so it is for a specific purpose), and hadn’t been on this group in a bit"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They should have put a notice in the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They put damn count downs for up coming events, and they couldn’t put one for the end of the game?!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well said! And you're definitely not alone! I was planning the same thing too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My To Do List included my final push to level 60, soooo we're just going to pretend it happened lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😭"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "After I wrote this I downloaded Pokemon and played a few hours this morning, it worked very well with PB on in the background so I'll probably do that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My spouse also redownloaded it after taking a break for a few years and is showing me how to do stuff."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The foolishly optimistic side of me Hope's this is sign that one day, down the line, the game may return"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Id love if they would sell the game off to someone who would keep it going."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Woke up this morning expecting to make my last push to level 60 and screenshot my final stats"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "....I'm going to live vicariously through you lol."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same 😔😔"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There’s no story to Pikmin Bloom"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s basically just a cute pedometer"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I used to flip back and forth between Pokémon Go and WU (with occasional flips to Pikmin Bloom), but PB isn’t really something you can play if you’re not out walking, unlike WU where you could play the Knight Bus or pop a TTD and play at home"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I guess now it’ll be flipping between Pogo and PB"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Might be time to give Ingress another shot."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I used to do the same (and still do on Pokémon Go)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Have a bunch of PG gifts for stops I nominated that were approved at a provincial park a few hours away, and some from a September trip to a national park"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will give them away if needed, but they go after all the boring gifts go first."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same here"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I knew it was down because I tried to open it early this morning"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then later I got a “potion finished” message and had a tiny bit of hope"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish they’d make the server code available somehow so people could keep playing, but I’m sure whoever owns the IP rights would never let that happen"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sigh"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got a port key notification"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I loaded them up with like 15 minutes left, didn't think they would do anything"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Lol"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Weirdly, I’m still getting notifications like “Your potent extimulo potion is ready.” So I suspect there’s some server involvement, but when opening the game, you just see the “buh bye forever” message."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "/* gonna miss this community"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's been fun ❤️"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Mine has been taunting me with these notifications all morning :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same! I’m glad I played for a bit last night about 2 hours before it shut down"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "R.I.P"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wizards Unite."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did the same!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You changed the time on ur phone?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm in the same boat!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nada :( I was hoping we'd have today."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was able to login last night not this morning"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been contemplating this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's not like I can access anything, but I've invested so much time and love into this game that it feels so final to uninstall it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I may wait a day."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Darn! This is such a bummer day for us truly dedicated wizards and witches."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If I understood correctly, I believe it was too expensive to keep going"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The licencing cost for WB Wizarding World cost too much for Niantic."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I think it's a bit cruel to still be recieving notifications from the wizards unite app"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had some potions I lined up at the end just and got notifications at 6:02am and 9:26 am that they had finished brewing."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes!!! Mine did that too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "False hope and a pang of sadness knowing they are left unclaimed."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well, def don't play if you don't want to"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But basically all the pogo players just focus on aspects of the game they like"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "For instance me and my girlfriend are both hardcore players, but there are things one of us do on a daily basis that the other almost never does"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "We just have fun with whatever we want to grind"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Okay Pokémon Go is fine if you are willing to juggle a dozen accounts using several phones and risk getting assaulted at the park"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Where I live it is full of toxic players who cheat- and try bringing their ways into Ingress, with varying levels of success"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "WU was free of all of that and a much healthier bunch of players"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I mean, if you really want to collect them someone said this morning that you can set your phone calendar back a day and go back in..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Cleared out all my portkeys and potions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Got one last gold gift that I gave to one last friend who was still playing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's strange after playing every day for 2 1/2 years and having friends all over the world"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will miss it too."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yes, either a buyer or allowed us the option to subscribe"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They did that with Ingress- paying for a subscription comes with some perks"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s a shame that they didn’t do that for WU"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They made it steadily worse with \"pandemic improvements.\" I can't imagine torturing myself with a game that I liked at one point"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will miss Wizards, I have played for 2-3 hours a day since the third brilliant event, but not enough to try the insanity that they turned Pokemon Go into."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Basilisk biting was… detailed 😂"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ooh, I love that one, too!  I recorded that one with sound, and also at night because the flames definitely show their best with a darker background"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm a little bummed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thought I had today as the last day.\n\nAh well, it's been fun."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The whomping willow was probably my favorite"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Very nice, what a way to go out."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I ended at 57 too! Right before midnight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was one achievement away from completing my Magizoology skill tree"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah well."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have the same thing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😩 I left potions brewing and portkeys…incubating? I’m going to miss this game more than I expected."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Right- there was no way to clear the gift queue of gifts that could not be used, so that strangled gift-giving"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got the same too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Time to uninstall."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That is a very rude awakening"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was sad enough without the shock of it ending"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What a terrible thing to discover."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "They have been talking about it for months....and there were announcements made long ago."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "/*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s been fun."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "/*"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I miss the game already."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So long, and thanks for all the oddities!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Nice"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I planted something in every greenhouse in the area around six p.m"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "so that it would be lit up for the last several hours of the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hoping if anyone turned it on, they'd see someone was still playing, someone still cared."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got one as well at 3:52 AM - I don't wanna slide out that push message 😢 I even screen dumped it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Follow the in-game tutorial for starters"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Then go out and find some grey portals and deploy resonators to “capture” it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hack it for more gear, and keys (important for linking, and fielding - making triangles)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Level up to L6 or do before you worry about attacking anything.\n\nThat’s the basics"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you tell me where you’re at, I can suggest a faction (green or blue) and connect you with some local players"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not OP but I just downloaded ingress out of sadness over WU and have no idea what I need to do."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did one last dark 2 last night at around 12:03am, woke up and the game was over"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ":("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been playing Pikmin bloom for the past month and there is like no game to the game it's mostly a fancy pedometer...I was hoping it was starting out slow like HPWU and would add more but two months in and still not much"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My husband got back into Pokemon this weekend so I may have to finally give in and give it a try"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've always associated Pokemon with my annoying little brothers so I was never a big fan of the franchise at all but maybe I can get over it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Goodbye friends, it's been nice playing with you all."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have been playing pikmin.bloom the past month and a lot of the spots are the same but I'm afraid the game is going to die because theres no real \"game\" to the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I guess I have to give in and try Pokemon go now....."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've been 60 for a while but I decided my last goal this week would be to get the burrofios acheivement even though I had over 100 to go"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I opened the game constantly and played so much more this week than I have in the last month since all the events ended...so much that my three year old got a little into the game (she loved the \"drinks\" aka potions and stirring the couldren and watching me get foundables) oooops"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "She also loves the Pikmin \"guys\" but that game has no game to it..thinking of finally giving in and joining my spouse in playing Pokemon go after holding out for years...\n\nMeanwhile I got the last burrofios I needed last night at around 8pm"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was tight there because up until Friday I thought the game was ending tonight midnight and I still had like 35 left to do on Friday."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ll send you a DM"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's exactly what happened"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's too bad, really"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I still can't believe they've actually shut it down"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ooh that sounds quite cool"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m in Oxfordshire UK"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you for sharing, this is why it is so hard to let this game go..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Another Niantic game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "same waypoints as you’re already used to (maybe more! Ingress allows a higher POI density).\n\nThink of it as a cross between Capture the Flag/Risk and geocaching.\n\nNinja edit: whereabouts do you play? I can look up your area on “intel” and see what the local Ingress scene is like for you"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Maybe it’s hopping… maybe it’s dead."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah I’m still not exactly clear what Ingress is 🤦🏻‍♀️"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Niantic only provide the platform, it's WB's game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Have you downloaded Ingress yet? You can control that park..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Back when the closure was announced, and it became possible to build up gold very quickly from doing the new Lethal Adversaries, I decided I would build up a gold pile for the last couple of weeks - something was bound to happen"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I always imagined this gold would get spent on potent exstimulo potions.\n\nI never imagined I would be spending the pile of 15,000 or so of gold on nothing but *silver keys* during the last week"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But in my attempt to reach level 60, I found that the 1920s Portkeys were giving out quite a lot of XP, and only needed a 1km walk"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "For the last week, I've always had 10 of these portkeys on the go at one time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "One of them gave me over 60,000 XP.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had just enough gold for the silver keys, I was down to 300 gold when I hit level 60.\n\nI also didn't expect to be constantly brewing the weak exstimulo potions, but they were cheap in ingredients and with the SOS upgrades worked very well for one-shotting emergency level foundables (some of which gave over 10,000 points with a baruffio at the end)\n\nAs a consequence, I also gilded all three 1920s pages"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Back when the 1920s stuff released, I never expected to even get bronze on any of them!\n\nSo it turned out to be quite a fun last week, and I just got in the level 60 club with less than 24 hours to go."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same here! But I'm glad they recorded it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm less sad about not getting that ending now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just set your clocks back abit or choose a timezone that has not reached Jan 31 yet to get more time!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "1 more hour to go in Hawaii"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for the great times!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My game didn’t shit down until 12:22am"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Was happy to have a little extra time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Game just shut down for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "12:22am"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Got in a few more levels on the knight bus"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Turned back the clocks on my phone and earned an extra day for Wizards Unite in my timezone and decided to walk the route where we used to play and light up the wizarding sky\n\nThanks for the memories! Hope there's a new adventure and see you there!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I keep gifts from significant moments, intending to never send them out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When I heard the game was ending, I took this screen recording and started either giving them away or deleting them"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you got one of them, I hope you enjoyed them as much as I enjoyed looking back at them.\n\n> Theory, Livermore: the first post-coronavirus trip I went on with my mother.\n\n> Floating Lady IV, Los Angeles: the hotel I stayed at on the first vacation I went on by myself.\n\n> Cricket Wireless, Hayward: the last day I spent outside (at the mall) before coronavirus.\n\n>Teemu Selanne Rookie Statue, Anaheim: the first hockey game I ever went to.\n\n>Rainbow Bridge, Campbell: picking up my brother from the airport after he graduated college.\n\n> Weather God, Elizabeth: a greenhouse in the airport during a layover the first time I went to New York.\n\n> Oscar Grant Memorial Mural, Oakland: the first protest I ever attended! I grabbed this after parking.\n\n> Floral Frames, San Jose: the first day I took my mask off after the initial coronavirus lockdowns.\n\n> Twin Peaks, San Francisco: the last birthday party I had pre-coronavirus.\n\n> Wizards Take Flight, New York: how could I not include a Harry Potter shop?\n\n> Seashell in the Galaxy, Miami: first time I was ever in Florida!\n\n> Blossom Train, Saratoga: the first time my entire immediate family was able to get together since coronavirus.\n\n> Strand Bookstore, New York: the last day in New York, with my ex.\n\n> Succulent Fountain, Ojai: my first trip to see friends since coronavirus.\n\n> Dire Wolf Skulls at Page Museum, Los Angeles: I went to the LA Tar Pits with my ex.\n\n> Flower Box, Bakersfield: near where I lived after moving out when my ex and I broke up.\n\n> Rabbits, Santa Clarita: waiting at the train station for a friend to pick me up immediately after my ex and I broke up.\n\n> Sherlock & Watson Mural, Bakersfield: the first time since coronavirus began that I went to the movies (to see Shang Chi).\n\n> Rose Garden Fountain, San Jose: the last date I had with my ex before coronavirus.\n\nI hope nobody minds the wall of text I used to share these moments with you"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The game may no longer be with us, but now, I have shared what it meant to me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you for reading."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I switched back to professor and did one last fortress run"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was originally a professor, but have been playing as an auror for months now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aaaww, I'm glad I wasn't the only one who took a screen video of their little magic self saying goodbye"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I took a video going through my registry and achievements etc"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "When I'll actually look at it I don't know, but it feels like the game hasn't totally gone"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Made it to 60 a couple of days ago, thanks to all the generous xp gifts"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What a lovely bunch of wizards and witches, will miss the game and the community"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So long!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If you change back to your actual date/time can you still log in and get to the farewell page?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You too! It’s a sad day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "i never knew this existed 😭😭 thank you for sharing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did the work around but the app just crashed and logged me out and I can’t log back in"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I actually turned the sound off right when i began playing this game back in the beginning, and never put it back on again till tonight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I went for a walk in the last hour to unlock my last batch of portkeys and then when i opened them all i put the sound on, since you had mention this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And then i got the tom riddle foundable right after that so i got to hear that creepy dead monster thing too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And now it's all done."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have notifications of gifts and messages from friends."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But cannot open them"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "X("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I didn't use any workaround, but was allowed on until my app finally crashed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I even got the next day's daily reward and several of the individual rewards like the 6 unicorn hair."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Exactly this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "But still, well done"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s been fun! Goodbye, HPWU 👋"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ha, I remember having to google wtf was going on with this one! Agree the detail in everything was one of the main charms of the whole game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Genuinely woken up feeling extra Mondayish now it’s gone!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That's exactly what is happening with me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I expected to get kicked off at midnight, didn't, and have done quite a few Dark V chambers after midnight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm on central time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m sort of envious that you got that ending"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had my screen recording, and it just kept going"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I made the mistake of collecting spell energy around 12:30 and got stuck in the buggy loop and that was it for me!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was secretly hoping someone would buy it out and improve the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have 3300, but gold was basically unlimited if you fought lethal adversaries, so my cap is 3375."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That was sweet"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "For some reason, it is letting me play after my midnight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm going out in Dark 5"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just finished a four man that I started after midnight."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same, I was planning a nuce walk and making some screenshots.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Instead I saw this and w\nHad a couple of hours before midnight came here..."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "sitting on the couch"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This game got me through so much, I don't get why they couldn't keep it running at least in some capacity"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Is it for always gone or will it come back?\nIt’s very sad if it wouldn’t… man that kinda ruined my day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congrats!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations! This is bittersweet."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same, I saw this and had one last hurrah"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "8m so so sad about this...."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thought I'd get to play on Jan 31st as well, now I'm absolutely heartbroken, had some stuff still to do."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The workaround still works for me.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "maybe once your timezone officially crosses midnight then you set your phone clocks back?\n\nIm using an iphone so i just unchecked timezone from set automatically and searched for \"san Francisco \""
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Love this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had so much fun with this feature!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The designers, artists and coders clearly put a lot of love and passion into this game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I appreciate the hell out of that."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Bye! \n\nSad and a real pity."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I kept playing after midnight and am still going...didn't change my device time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Am EST so will probably stop working when the west coast hits midnight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And I can't stay up that late to find out...but still was pleasantly surprised I can keep going for a bit"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ";) I'm guessing if I shut the game off, that'll be it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sadly."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am so Impressed!  Big congrats!!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Agreed!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You’re welcome! One of the originals-the one in the deep forest with the full moon is/was amazing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The sound effects in that one were 👌🏽."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "haha! yes, it was challenging !"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😂😂😂"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I managed to grind out my last three foundables pages to Gold level tonight"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I didn't guild all the challenge pages, but at least prestiged them all"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Finished all three professions, (minus the adversary skills of course)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Finished the skill tree last Monday and reached level 60 the week before that"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "OFFICIALLY DONE!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I switched mine but it still says I have 30 minutes left before gifts reset…"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish I would have done this too! I will just have to enjoy your photos."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Best of luck to you too! I hope you accomplished all of your goals for the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am going to miss the community too."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations! \n\nMy wife got so close"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "She gold framed all the lethal, but left one dragon without the gold frame."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Lucius was the last one I goldframe and that was yesterday! I focused on redbooks and finishing all 3 professions and skill trees"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The grind for that was crazy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I finally finished all professions a few days ago and that's when I figured I would try to gold frame elite adversaries."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations! I hit 60 back in November, but I’m glad that my Wizard XP gifts helped you and others do the same!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Leucrotta"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That gaping maw is just _wrong_"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(And nothing like the actual mythological creature.)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My youngest nicknamed the moon calf \"Baby time sheep\", and that immediately became it's only name in this house.\n\nWhen the baby moon calf came out, it became \"baby Baby Time Sheep\""
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Too darn cute.\n\n(And I never had significant issues catching them, and rarely used potions.)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish I had been more strategic in getting the fortress foundables, playing the right chambers with the right runestones and whatnot, but it is what it is"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Was what it was! \n\nThe possibilities of what I could do now with all the time I won’t be spending in WU! Oh… just play more Pokémon I guess!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am the same exact way"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I feel like the grind to get to 60 kept me playing from day 1."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well done! I’m so glad I hit it before I got kicked out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "To be honest, I’m glad I didn’t hit 60 long before now, or I can imagine I would have stopped playing shortly after"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The pages I didn’t get gold on weren’t even close, there were so many foundables that I needed so many of and never saw"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Getting to 60 was the only really achievable goal I had in mind."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "We're friends in the game as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My username is my long Polish last name(sz...wicz)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for all the gifts! I made it to 60 just a couple of minutes ago!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congrats! I just made it a couple of minutes ago"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Didn't think I'd actually do it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's a great feeling."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s how I felt! It’s probably for the best that I was forced out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s midnight local time, so the New Zealanders were out hours ago! I think the ‘official’ end time is 12:01 (0:01) on the 31st"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not the end of the 31st like the ‘ends: 1/Feb/2022’ message in-game would imply"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Im using San Francisco time, PST"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What time zone is the latest one?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am still in the game with no problems"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Does it end at midnight local time? Does it end at the end of the 31st? I've got another day to muck around.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "maybe"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Lol\n\nI'm honestly ready to be done since it is all pointless now, but can't bring myself to quit."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Update: it’s 2:30am"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I completed a daily task, went in to collect my reward for the last time, IT WAS A TRAP"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Could look around the achievements all I wanted but couldn’t go back to the map"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Boo"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Guess I should go to sleep or something now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Giant's Helm"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I rarely caught it on the first try"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Shouldn't have been that difficult."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "20422/115 I wanted to see how high the cap was."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You had to request it a couple weeks ago"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aw I’m gonna miss my little guy and his ‘yoohoo!’"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Update: it’s 2am"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m still in the game, still returning foundables, still battling with others in the fortress"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It’s all good as long as you don’t close the app! You can get some extra play time!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well it's 10 hrs since midnight and despite running in the background my game did exit to the farewell screen\n\nHowever setting my phone's timezone backwards is doing the trick, so i will definitely be there when the server officially closes in 6 hours!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m sad- never made it to level 60 and it doesn’t feel real that it’s just gonna be over tomorrow"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh well, time to find a new game."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This was my favorite one, I think"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I haven't seen it in forever"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks :)\n\nThough I'll just add, I enjoyed all the portkeys"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "There were lots of cool details in all those locations."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Amazing! A real accomplishment"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s awesome!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aaaaw this made me so sad! I’ll miss this game, and the community 💙"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "so long and thanks for all the portkeys :)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's been fun, hit Lvl 60 a couple days ago, defeated Voldemort one last time, and I'm out!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you so much!! I’m actually still in the game, I was panicking and literally got the level up at 11:58, but if you don’t leave the game you can carry on playing as normal! If you close the app and come back though you get the ‘bye forever’ message"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I hope Pokemon Go takes some of the best lessons of Wizards and incorporates them now."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Interesting Numbers:\n\nFinal Gold: 248,862\n\nEnergy: 3342/3375\n\nPotions: 1163/1335\n\nIngredients: 1506/1710\n\nSeeds and Water: 1269/65\n\nCurrencies\n\nSpell Books: 503\n\nScrolls: 54,947\n\nRestricted Section Books: 56\n\nDADA Books: 13,260\n\nField Guide: 162,153\n\nMinistry Manual: 42,206\n\nSilver Key: 1419\n\nDark Mark: 1\n\nDark Detector: 157\n\nBiggest Runestone collection: Oddity 4 with 1992"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Impressive, congrats! That's some serious grinding!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hey, I helped! I’m Akontios in the game and I added you today to send an XP Gift! Congratulations!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you, it took a ton of grinding"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Lucius was the hardest for me because originally I was extremely concerned about the 1920's keys, and they released Lucius during a 1920's event and I chose to focus on 1920's during those few days.\n\nAfter that he seemed to be the rarest of the spawns"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I had something like 95 edible dark marks and used every single one of them pursuing Lucius, plus the ones I got along the way, plus another 8 or 12 I bought.\n\nThe nice thing was that money was no longer an issue, so I could buy potions with abandon."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "10,066/145 .."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "haven't been able to open energy gifts in ages, LOL"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you for this! This was my least favorite because it was so hard to catch!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wow you green starred the adversary pages"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am in total awe! Congrats!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "How do you change the device time?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Damn, I knew that it was coming and it still snuck up on me.\n\nDoes anyone know if I am far too late to request my data? I expected instructions on how to do that to show up along the way sometime in January and then forgot to look for them when it didn't happen."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I spent sooooo much time staring out that window trying to spot the one whackspurt as it whizzed by."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Turns out you can keep playing if you don’t close the app"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well, I’m assuming anyway - I daren’t close it to find out if I can get back in or not!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Woohoo 🙌"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The game wasn't perfect, but it helped me mentally and physically through the last two years"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Enjoyed the camaraderie on the KB and daily walk/run."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "[Here is a link](https://imgur.com/a/A0zuh0d) to the proof of completion"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I tried to post this a few weeks ago but it never showed up."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Fuck Niantics greed"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hope everybody stops playing PoGo."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yay!! Congratulations! 🤗🎉🤗🎉"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That was a good portkey"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I wish the game gave you the opportunity to visit these locations just to look around."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My nephew always used it because he insisted it tastes like blueberry."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well done!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "thanks for this!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If anyone is wanting to try Pokemon Go (or retry it) as their next AR game, heres a referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give you bonus items for completing in-game actions"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Helps me with a badge as well"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! \n2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sent an invite"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks everyone!  Still got 10 hours to go here and nice to see folks in the Knight Bus"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Might as well use up those plethora of potions :)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm at 3414/185 and have been using a ton of energy the last few days."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you! Frustratingly, I just hit my daily cap for opening! There's a couple of people in the comments needing some still!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This :/"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hope the XP helped :)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "a little late, but sent a request anyway"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "xp for you!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congratulations!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "sent!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm on an inn so will try to get one for you if you add me\n\n3038 6515 8361"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’d never actually put the music on before! Thanks"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Grinding, I’ve gone from 53 to 55 today (nothing like waiting till the last minute haha) and would love some xp gifts if anyone can spare them"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I have only runestone and wit sharpening gifts to return, though, apologies \n\n5201 9274 4930\n\nEdit: thanks for the gifts, kind strangers! I’m a whisker away from 56 and I have to accept that I’m not going to make it to 60 - my own fault, I should have prioritized this game over work and family"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ";)\n\nIt’s been a lot of fun and I’ll miss it."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am going to spend all my spell energy doing my favorite thing- fighting fortress battles with a group of people"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It has been awesome to have people in the Knight Bus today!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Typical dev fuckup announce one thing and kill the day 24 hours earlier than announced, was hoping to go for a nice walk at lunch time on the 31st to say bye to it, loved this game sad it’s ended :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m playing with the music on for the first time in a couple of years and that’s adding to the melancholy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You're welcome, hope it helps and you get to Level 60 :)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That looks so cool! Thank you for sharing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I never thought I’d be so upset about a game ending"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😭💔"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I found one! She sounds as gross as she looks"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was up over 8000/100"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same here as they still had your daily sign in up to the 31st."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm still annoyed they're shutting it down when they've got PokeGo money coming out of their assholes"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm never getting into another Niantic game again."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And yes melancholy is definitely the word"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Have a quick search through some of the posts here - lots of friend codes around"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same! I'll be restarting it like, 'No! It can't just be.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "gone! It's just a bug! Let me change my internet to 3G...' haha"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Deleting the game from my phone will be hard too."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Added you, I have two xp gifts left"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "3564/115"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Absolutely! I am not at all prepared for the end"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can already predict I am going to be upset in the morning when the game won't load."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you so much!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sent invite"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just added you, have two Wizard XP, no need for anything in return, also in the UK"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "4627/405"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Last time I  could open a spenergy gift from friends was in mid December"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "One by one they sent them and they remain unopened so one by one  I stopped getting daily gifts \n\nPortkeys.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "huge influx of gold in December from all the lethals dark marks equals unlimited Keys which apparently means an ever climbing spenergy total"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Accepted! I have the day off and I’m grinding away with BBEs and TTDs lol \n\nI’m not going to make it though \n\nI had three months since the announcement to grind and get a better friend list but oh well the holiday season was exhausting at work\n\nEdit: tysm! 17,250 XP!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "100%"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "And yes, I wish it were ending with a bang rather than a whimper"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah it’s a sad day"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just discovered the discord server today 🤦🏻‍♀️ and had a brief chat with some nice people in the states"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Just friended, hopefully not too late!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!! This is such a nice community, and buggy as the game was, I'm really going to miss it! Also I'm not mentally prepared because I thought I had another day, what with the whole 'Ends: 1/Feb/2022' message I see every day haha"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My mums at 3295/185"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hadn’t played for months (1.5 year?), logged in today and tried to fight Voldemort with an SOS score of 206."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Added you! I hope you make it! \n 7128 0443 4040 for anyone else who needs a bit of a push"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "XP if you've got it!\n\n7821 4334 7184"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My husband could also use some last minute help! XP gifts pretty please?\n\n7821 4334 7184"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Interested to hear what happens with this!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!! A whole batch of portkeys just became ready so that helped, and an XP gift just pushed me over the line so I'm on 59 now!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Added you"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Have XP to give :) Good luck! Hope you make it!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Really sad no one just bothered to keep it going tbf"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!! I'm definitely not going to gold many more pages so figured reaching 60 was more achievable! I'm also at 19428/20000 for the protego achievement which is frustratingly close!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sent! Hope you make it!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I downloaded Pikmin Bloom and honestly got a little choked up seeing familiar names there"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The last few months have been dark and depressing with the omicron surge, so I may be a little extra emotional about the end of this game and the strangers who traded gifts with me to finish it out"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for hanging together, everybody"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This was a great community"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(I'm Torani.)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My guy stopped playing for a while and it wouldn’t let him back in since he hadn’t done the last update"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So if you haven’t logged in for a while, you’re probably done."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Same, I thought I still had one last day to play 😭"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wizards Unite *does* allow you to chat in Niantic Social"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The way to keep in touch with your HPWU friends is joining Niantic Social, them signing up for another game that supports Niantic Social."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "F :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wow.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I was hoping to have had during the Day of January 31, 2022, to play (walk).."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I just wanted to get the Dragon eggs green starred.."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "oh well, I will get as close as I can then screenshot the frames.\n\nHow are you feeling??"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wow, sure, thanks! \n\n5201 9274 4930\n\nI’ve been a daily but casual player since day one"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I work 65 hours a week and never had more than half an hour to play"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m feeling quite melancholy today."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "You might!! Can I send you some xp?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No less than she deserves 😂"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thanks for this"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve had the music turned off for ages but I’m turning it on today"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "🙂"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It does sound like your switch probably won’t flip “off” exactly at 12:01 but after that you’ll be borrowed time for sure"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "(As with so much with this cursed game the final communication was not well done…)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ah, nice"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m resigned to the fact that I’m not going to make it today."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh no! I read it wrong! 3 hours left for me! I was trying to get all my feared adversaries to silver, just need 3 piles of gold for the Ukrainian ironbelly… let’s see if RNG is kind!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This is unlikely to work for more than a few hours"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The servers are still on because it's not 12:01 AM everywhere yet.\n\nThe \"last time zone\" is 4 hours behind California time, so Niantic will probably be turning off the server as soon as they get into the office on Monday morning."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It did for me, 0000 hours of my local time 31 January"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’m low key in a state of denial and shock."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wow thanks for the info, my partner will be very pleased to get a few more hours of play time later!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The Azkaban escapee oddity"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I know it's rare enough to be exciting in some biomes, but I live in rainy BC so it's super common and takes way too many hits for very little reward."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This is wonderful! Thank you so much!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Does it shut down at midnight? I thought 11am pst on the 31sr"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ditto for me"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It saved my sanity and gave me something to look forward to and I loved seeing pictures of locations around the world❤️so sad it's ending😭"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "My kid used all my potions to catch anything"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "\"You used a POTENT to catch a chicken?!\" \"The dark blue is the prettiest!\""
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Robin Dao did a bunch of the art - the fire chicken and other animals plus a bunch of the portkey spaces and has videos of the various portkey rooms on their personal webpage: \n\nhttps://robindao.artstation.com/albums/1917987"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "12:01am your time on 1/31"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Awwww I love the moon calf!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I feel so cheated, the newspaper thing you get on the launch page said the game ends 1st Feb"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😭"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I must have misunderstood their news from a while back, I thought they're shutting it AFTER 31st? I was going to take screenshots \"on the final day\" for memories but LOL it's all gone for me now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "kthxbye."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "i mean if you want to for nostalgia purposes and play just one last time without worrying about leveling up or something"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "i know i’ve read about some people screen recording/shotting their favorite foundables"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Aww I feel the same"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I remember adding a ton of friends and giving out so many gifts and gradually I was only sending out a few at a time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I picked up more friends towards the end and it's been fun to see all of the places they visit thru gifts"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This game got me through the lock downs due to covid"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "The game got better for me because during lock downs the game added more spawns, energy on the ground, half portkeys km and the knightbus"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was fun and I would have played for 5 more years if it lasted that long."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Isn’t there one day left?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congrats!!! So happy for you!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "If only there was an option to put her back in the calamity for being ungrateful."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh yes the puking pastille was just awful too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Did your kid use potions to catch them?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Goodbye wizards unite"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "We loved you 😢"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I did it!!! Thank you everyone ❤️"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Did the game just turn off for you? Mine is still going...45 minutes after I expected to be kicked out...\n\nEdit: I think I might give Pikmin a go? Not sure yet"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I've heard of Wordle but not too sure what it is."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Dang"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Literally! Is there even a point in logging in now?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "what a fucked way to find out…on the last day omg"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yeah, they announced it 3 minths ago or so"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Yay! That's all I needed!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Hold on, the game's shutting down?! I'd taken a break for several months and I was just about to log in"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "This is just like Pottermore all over again :("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Slytherin student because she’s sooo ungrateful (yes I realise this is intentional!)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I don't think I've ever caught one as my kid loves that creepy thing so I always hand him my phone and let him do it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's his favorite"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I loathe the puking pastille and Hedwig."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Undecided yet - Wordle will only keep me entertained for so long 😂 you?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "👍"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Profound and beautiful! Well done! Are you moving onto a new game now?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I returned a Hagrid foundable, and placed his image in the registry for the final time"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That’s where it all started, so it seemed a good place to end it"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh - and I had also dropped dark detectors all around me to go out with a sparkle!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm QLD and in the final hour"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Glad that there's not just a black screen to wait for.\nWhat did you do as your last act?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "LunaRon13"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I got tons"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sent you request"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Please no energy gifts back"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I can’t open them."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "No Pickett (11/18), no demiguise (23/30), no chess Hermione (16/18), no quidditch Hermione (11/18), no goblet of fire (15/18), and no portrait of voldemort (21/30)"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "4 of them are severe and have been completely forgotten from this event, and the other 2 are orange beam and I barely ever see orange beams"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I'm a day 1 player, and in anticipation of the end I've been playing non stop for weeks and have never seen these foundables during that time."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "God I’m gonna miss this game so much"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Looks like a great map after you were done!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am so sad, too"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": ":("
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Only until 12:01 on the 31st"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "😕"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I thought we had until Monday?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "So pretty!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "We could use you in Pokemon go! If you'd like to try it as your next AR game, here's my referral code"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It will give us both some bonus items"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "2FCKH2VTV"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Ahh! I see"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "That picture makes my heart happy"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not wasted at all"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "What a sight and you finished an achievement."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "congratulations 🎉"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Well, I'm not saving them, but I did kinda waste them, since I didn't stop to capture any of the foundables they detected"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It was just a mad dash to see if I could deploy them all in 45 minutes!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congrats!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oo I need to find a hag now"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Congrats!\n\nBut."
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "wasted? Are you saving them for some other purpose?"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Sent a request"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Wow you are so close!!!!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I’ve sent you a friend request but today is the last day of this game!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you, I have been! I was at 56 yesterday and played my heart out - now I’ve hit 59 I really want to hit 60! I have a broken ankle so I just made my husband drive me around the good spots 😂"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "i just randomly found an option to do this after i saw your question! go to the settings > help > get support > type in delete and the question for how to contact support has the link to do so"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "just sent a request! good luck"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I will add you but use barrufio elixir"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "It's 10x xp"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I am sorry to hear that it is ending"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "I really like the game"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Thank you for your input!"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Not the same game but Niantic has some new one called pikmin if you like that kind of thing"
    },
    {
        "subreddit": "WizardsUnite",
        "sentence": "Oh no!  That is terrible!  Is anything going to come along to replace it?"
    }
]