[
    {
        "subreddit": "worldnews",
        "sentence": "What does that have to do with a war?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fuck you russia you started this shit and the sleeping lions are starting to wake up and you don’t like it, well tough shit!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But it needed to be a major nation that was part of the EU, Hence why Germany also gave its permission a few hrs ago"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Maybe it was a weapon test"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Cheap as fuck to make , strap a little cluster bomb on in instead of poop and there you go low cost artillery carpet bombing ."
    },
    {
        "subreddit": "worldnews",
        "sentence": "All missiles, guns & ammo to Ukraine.\n\nAlso like 300 F16s"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If I was a betting man, I'd bet that this is going to get a lot harsher over the next 5 years."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes, but not the \"burn the witch\" kind"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Many people are increasingly swinging in that direction."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just curious why israel wouldn’t start attacking Qatar ? If they are protecting the heads of Hamas then aren’t they complicit and part of the Israeli objectives of finishing the war ? Wouldn’t it then put pressure on Qatar to get hamas to cooperate ?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We can play Crysis on max settings?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "How common/uncommon is the use of solar panels in Pakistan?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The US supplied both China and the USSR heavily in WW2"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't forget who the supply daddy was"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We haven't been in a war economy since WW2"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If we actually did ramp the fuck up again, things would get real...real quick."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not if they ended up banning the shipment of Cluster munitions through European ports as they are a banned weapon"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But now that France has given its blessing, now even Scholtz has said fine they can hit military bases"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well, send balloons with sweets & candy bars back"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Go full Luftbrücke."
    },
    {
        "subreddit": "worldnews",
        "sentence": "We’re in the eye of the shitacane now boys!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What kinds of horns do humans have?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wouldnt want the sheep to see how they get fleeced by their corrupt betters"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They might get ideas."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Chain gun on something with a bit more meat, and battery life"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Similar things exist, this is definitely something a British person has a good look at"
    },
    {
        "subreddit": "worldnews",
        "sentence": "A propa ganda, if you will."
    },
    {
        "subreddit": "worldnews",
        "sentence": "\"Don’t underestimate the power of stink\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Lol wrong"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why do you lie so blatantly? As if people can’t just look it up???\n\nThis is literally the FIRST source on the matter.\n\nhttps://www.bbc.com/news/world-middle-east-68423995.amp"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ahh there's the little bit of Marxism censorship from China lol"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No way"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He acts like a dude with a giant dick that doesn't even get fully hard"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thinks just bc he got a hog he don't gotta know how to use it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Lmfao shut up"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This sounds like something the guys from Southpark would do"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You cant predict everything and be aware of all factors."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fair enough - I was"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It has been obvious for years that 1992 (Maastricht) or 2009 (Lisbon) both *badly* need revisions.Two whole years ago, a big conference about the \"future of europe\" laid out a ton of recommendations"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Jack squat happened ever since."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not surprising."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't count on it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is going to be lots of up and down before you see a permanent down trend."
    },
    {
        "subreddit": "worldnews",
        "sentence": "To be fair, I was drinking"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But my point still stands that the B21 costs 3x as much as they claim."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No, no, no, I said the plan was to help the defectors get to the south."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Like theJapanese Red Army Faction after hijacking a plane? Imprisoned and tortured by North Korea"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Bro, you say if Russia use nukes, we would go into Ukraine and all out on Russia or what’s stopping Russia from then using more nukes and or nukes on US military? There comes a point where you must use them in response, which is exactly what the mutual assured destruction is I don’t know if you’ve ever ever heard of that."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't you understand? Chinabad amirite?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thats great, now grow a house, oh you can't, I see, ok you can go now"
    },
    {
        "subreddit": "worldnews",
        "sentence": "bye bye nope take those ready bake rocks with you"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No we do not validate"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Security!!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "\"Hi I'm Great Leader and this is Jackass\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's an entirely different concept of bacteriological warfare."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why do people talk about capitalism like they think it’s a system of government and some kind of alternative to communism or socialism?\n\nRandom Redditor: “Communism doesn’t work”\n\nRandom idiot Redditor: “Oh yeah? Well, neither does gravity!”"
    },
    {
        "subreddit": "worldnews",
        "sentence": "NK mad cuz poor"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Neither did the US (or Russian and Israel iirc)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "MIC goes brrrr"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not to sound tight, but the whole world will not go down with Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia will inflict a lot of damage, but Russia will be the one that is no longer a country"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The US will glaze Russia over if they bomb the US"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sorry you can’t read a freaking map lol"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Keep in mind Ukraine got rid of its long-range weapons in agreement with Russia and the US in the early 00s"
    },
    {
        "subreddit": "worldnews",
        "sentence": "According to the Budapest memorandum, Russia and USA were supposed to not invade Ukraine and protect it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Some of the long-range rockets were shipped to Russia and later were used to attack civilians in Ukraine."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Adding to it, the Russia has been using them on population centers from the start so they don't even get to complain about Ukraine using them against military targets"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It really feels like it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Outside the sub, the dissaproval is overwhelming."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fuck"
    },
    {
        "subreddit": "worldnews",
        "sentence": "How many times do we have to say this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Read your own edit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Taiwan being an island is a bit different, but yeah"
    },
    {
        "subreddit": "worldnews",
        "sentence": "30x because hamas basically sacrifices its own people"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They're also well connected military installations, well suited for command and control hubs for other local defenses"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't doubt such a site would be useful as a large existing military installation even if (relatively) far from the front lines, even if you ignore it's over-the-horizon radar equipment."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sound like biological warfare to me"
    },
    {
        "subreddit": "worldnews",
        "sentence": "99 Scheiße Luftballons."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Idk, these stories about balloons seem full of shit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If IDF knew Hamas were there in Rafa couldn't they have arrested them or pulled a seal team 6 and neutralized them rather than resorting to bombs? If they knew Hamas were there why wouldn't they know there were weapons stashed?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "My ex-girlfriend is Lithuanian and she could speak fluent Russian too"
    },
    {
        "subreddit": "worldnews",
        "sentence": "She attributes this to watching Russian dubbed cartoon as a child"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So there’s that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I imagine a lot of Lithuanians are probably watching Russian news everyday."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Am friends with at least one fairly prominent popufur plus several other furry artista, can confirm."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It doesn't have any sights or reloading mechanism, only the robot's regular camera not mounted on the same bracket as the gun and a 30someting round magazine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I'd say this is pointless in this configuration, more of a concept and some cheap propaganda"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But it will of course be easy to build something much more effective"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is no reason not to use a chain fed gun for example."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">ASC 890 airplane\n\nThat's an AEW&C"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I'm trying to find out if Ukraine had one before, or was given one? I imagine it would be tremendously useful for them to have such planes above Ukrainian territory."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’m just saying it could be a prolonged conflict like Ukraine or nukes could start flying"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes I know the answer, I'm just asking the other commenter why they think it's crazy \"Obama got away with [it]\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "A former spy chief for Premier, what could go wrong? \nIn these times it's an interesting choice that looks further"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You clearly don't understand how NATO works at all, maybe you shouldn't comment on things you don't understand.\n\nNo one gets invited to NATO, they apply."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well there is an angry Winnie the Pooh looking at east Taiwan from West Taiwan looking to cause some issues"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He is also calling in his debt in Africa and Asia, so that's going to screw up global trade"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is the little dictator in NK looking to throw a tantrum"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Then there is Iran who just lost a bunch of bigwigs, and is going to try and show how tuff they are"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why is it there everyone threatens nukes and seems to want nukes\nDon’t they know no one wins and there’s nothing left"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I can be proud of my country for something finally? It’s been a rough 14 years"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I believe for most non Russian pro Putin people it's simply that they equate Putin with their strong daddies Trump/Hitler/another authoritarian asshole and see Ukraine and it's yearning for freedom and equate that with 'wokeism' and thus in their minds a strong daddy is killing the people they fantasize about killing in their home country"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't think it's much deeper than that.\n\nTldr: I need a mean racist, misogynistic hate filled evil daddy who will punish the people I don't like."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Look, I know war is hell and everything: but leaving landmines everywhere is one of the worst things anyone can do.\n\nJust blow it up then and there"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't leave it lying around for years and wait until a child loses a leg in the future."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia are targetting Ukraine using missiles they \"scammed\" from North Korea, and drones they \"scammed\" from Iran"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So yes, same thing, fuckwit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "US still evil says top US officials, stance remains unchanged since creation."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The US has those too"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It would be a horrible war, but there is absolutely no scenario in which the DPRK continues to exist if they invade South Korea (again)."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Poland desperately wanted an exchange between NATO and Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They also have a small, highly defensible border with Russia, and a NATO base with Aegis anti-ICBMs and hypersonic missiles on it. \n\n\nThe US had to cancel it's proposed EIS super base in Redzikowo after Russia drew a red line in the sand and told them it's stated goal of \"defending against Iranian attacks\" was bullshit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was.\n\n\n\nThe Polish people commonly believe that the linked article below was actually Russia assassinating their president in 2010"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I've been to Poland twice and spoken with people on the street about this.\n\n\nhttps://en.m.wikipedia.org/wiki/Smolensk_air_disaster"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I remember a story where shit leaked from a plane and villagers gathered icy shit stones like some valuable items."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Is the Kiev post a Russian propaganda media? Why would they be complaining about cluster munitions?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I mean we'll see that when Ukraine recovers some land, or halts an offensive push"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Bombing stuff will help with that, but it's not actually doing the thing, it's a facilitator."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I'm somehow reminded of [**Brock Turner**](https://en.wikipedia.org/wiki/People_v._Turner), a.k.a"
    },
    {
        "subreddit": "worldnews",
        "sentence": "**Allen Turner**"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Who is **Brock Allen Turner**, you ask? **Brock Allen Turner** is a convicted rapist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He assaulted an unconscious woman"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Being from a wealthy family, and because he lucked upon a very understanding judge, he did just three months in jail for his crime"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Even so, his father, **Dan Turner**, said that that was a steep price to pay \"for 20 minutes of action.\" They're very classy, the **Turner** family.\n\nAfter his short stint in prison, **Brock Turner** changed his name to **Allen Turner** in an attempt to cleanse from the \"**Brock Turner**\" name the stench of rape.\n\n[This is](https://en.wikipedia.org/wiki/People_v._Turner#/media/File:IntroCrimJusticeTurnerMugshot.jpg) what **Brock Allen Turner** looks like, by the way.\n\nThat's all I have to say about **Brock Allen Turner**."
    },
    {
        "subreddit": "worldnews",
        "sentence": "jokes on you kim, thats my fetish"
    },
    {
        "subreddit": "worldnews",
        "sentence": "“Launch the shitty balloons!”"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They have nukes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "GO GET EM UKRAINE! USE THEM ALL ON RUSSIA!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I can imagine Biden and Putin are both relieved at that."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Of course, there was no provocation at all"
    },
    {
        "subreddit": "worldnews",
        "sentence": "/s"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or what?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "so rather than publicly funded governments, there will be privatized “enforcement agencies” and arbitration courts… and what will their incentives be?  To side with the corporation who consistently pays their bills and will switch if they are ruled against?  Or to side with the little guy who has no influence whatsoever?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hm, and why do you think that is so?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Was a vidoe on Combat Footage in the last few days of exactly that, suicide bomber tried to charge some tanks"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He was only halfway successful, but the suicide part worked exceptionally well."
    },
    {
        "subreddit": "worldnews",
        "sentence": "And now even Germany has given a mostly green light to hit Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Did they get any airframes with this hit?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Should have learned from civilized countries and legalized bribery by calling it lobbying."
    },
    {
        "subreddit": "worldnews",
        "sentence": "He should stop using North Korean Chinese and Iranian weapons on Ukraine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I literally saw a picture of mr garrison"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, we know plenty"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It might still hold some bit of relevance in rural India, but in urban India, if you're rich, you can get away with almost anything, caste be damned."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Tbf whenever capitalism fucks up, you see similar cope mechanisms \"it was not real capitalism\"."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I suspect that the Tories know they will lose"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This policy just gives them something to bang on about in opposition"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It will be their new Brexit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I tried explaining this to a coworker once cause I mentioned his older kid was going for computer science and he threatened to punch me and walk out"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I like the guy, and he apologized like a minute later after storming off, so honestly I didn't care too much"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He said he didn't like that, not that I even said anything but that I may have been about to imply his kid wouldn't make it so to speak"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't care enough to explain that my man, your kid is getting a comp sci or math degree or some shit, you think AI isn't gonna take his job? We clean toilets for a living, a program will take your kids job before a robot takes ours my dude."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's not my logic and you know it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The concern with this bill is that it gives the government the power to silence opposition groups by labelling them as foreign agents"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The same law exists in Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Do you want *your* government to have that power?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Its not a total bluff"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Its their utter last resort but if there was no way Putin would ever push the button then Ukraine would be raining US missiles on Moscow and NATO countries would not be doing nuke training."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is stupid"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just fucking strike wherever you want man"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s either that or you get wiped out"
    },
    {
        "subreddit": "worldnews",
        "sentence": "lmao \"why don't Israel operate only when they are 100% sure there aren't any **unknown factors** that may make things go wrong?\"\n\nIt's almost like you operate according to the intelligence you have, and you can never be 100% certain your intelligence didn't miss anything"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What an hilarious load of nonsense."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I mean, the country hates terrorists more than they hate civilian deaths in a yet-to-be-recognized country on the other side of the world"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not really surprising."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Outer Wilds IRL"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Then that leaves the lesson that if you invade your neighbour, even with international condemnation and the West supporting the country you're trying to invade, you get territory out ot it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "China will feel emboldened over Taiwan and they aren't the only ones."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I sure hope we are"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Once again, pretty normal human behavior."
    },
    {
        "subreddit": "worldnews",
        "sentence": "If North Korea tries anything serious against South Korea, the only thing the DPRK will join is the dustbin of history."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Summer will be hot"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, because those hostages taken on Oct 7 aren't worth worrying about anymore, eh?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fuck China!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "do you think May 26 is act of self defense? murdering people in their sleep?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Depends, is it warfare or a prank?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The Ibero-American political left is once again showing the world its authoritarian/fascist vein without even bothering to disguise or camouflage it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You're pulling a dirty one on all the Waschlappen in the world"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They're straightforward and useful."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No it doesn't"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The restriction made sense to be able to help Ukraine while trying not to escalate the war to directly involve the nations assisting them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nobody wants a world war and nobody wants Russia to feel like they're cornered and have no choice but to use nukes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But we've reached the point where it's clear Russia is not going to accept a stalemate and give up"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And so enough is enough, and hopefully Russia sees that restraint was earnestly attempted but this shit can't go on forever.\n\nAllowing strikes on Russian soil using NATO nation weapons still has a huge risk of escalation and spiraling out of control"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I hope the targets are surgical and strictly aimed at crippling Russia's attack capabilities so that the attacks can easily be construed as self defense"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If instead their economy is too rapidly hobbled, or if civilian casualties explode, whatever we feel about it, that could lead to an escalation we can't hope to undo."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yep, the world doesnt care, if enough people repeat a lie it becomes the truth in this world."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ah i read about the foreign secretary saying that but since i didnt see Sunak mention it i didnt realize it was official. \n\n\n The UK definitely has to be recognized for leading the way."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not only aircraft.  NATO No fly zone doctrine means establishing air superiority, which in turn means destroying enemy anti air assets on the ground.  NATO would be bombing the shit out of quadruple digit numbers of Russian troops on the ground if that happens."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can this fucking despot please be assassinated"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yup"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's rich man's privilege"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There are plenty of super rich so called \"lower castes\" that get the exact same privilege."
    },
    {
        "subreddit": "worldnews",
        "sentence": "NATO spent decades developing multiple weapons systems just to saturate the Fulda Gap if the USSR ever decided to kick off WWIII"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia hasn't developed anything to overcome those systems and NATO has only been adding to the arsenal."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They decided to show theirs off after we showed ours\n\nhttps://arstechnica.com/gadgets/2024/05/robot-dogs-armed-with-ai-targeting-rifles-undergo-us-marines-special-ops-evaluation/"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’m really shocked at the “progressives.” I definitely wasn’t expecting the antisemitism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Idk what the deal is, but the propaganda coming out of HAMAS & the countries supporting them is definitely working like a charm"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s like, if Israel didn’t have the iron dome & was inept at defending itself, it’d make these people not antisemitic or something? Like if that iron dome wasn’t a thing, Israelis would be constantly killed on a daily basis"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Then would it be ok to invade Gaza? I’d love to hear these idiots answer to that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’m sorry you don’t feel safe in the US anymore\n\n:("
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’d love to say you’re wrong, but I’m not Jewish, so I can’t say"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I definitely wouldn’t want to be a Jewish student on one of these campuses ."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s the start of a shitpocalypse"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or what?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Honestly this is why I like my slice the internet writing porn and being friends with kink artists"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The downside is that companies and payment processors are trying as hard as they can to kill NSFW content on the internet"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If PayPal for example gets wind you're doing NSFW art and getting paid for it they'll just ban you from their service for life"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Gumroad recently announced similar, that they'd be removing adult content"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's fucking horseshit. \n\n\nMy only reprieve is that as a writer, nobody fucking reads so nobody knows that my shit isn't kosher."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hamas is the equivalent of ISIS on a lot of levels and they openly discuss their intentions to destroy Judaism and Christianity all over the globe.\n\nIt’s not even a conversation, Hamas is worse on nearly every available metric."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Georgia had very low chances of joining eu even before this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Dangerous rhetoric from Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "At the rate things are going I wouldn’t be surprised if they use this lie as a support for using nukes themselves"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I was worried about France’s support role at first but now I don’t think it’s near enough"
    },
    {
        "subreddit": "worldnews",
        "sentence": "it seems Putin has no limits to his sick ambition."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't worry, sfw."
    },
    {
        "subreddit": "worldnews",
        "sentence": "After that failed satellite launch somethings cooking"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yup"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Now the rich holds sway over the poor, like a proper capitalistic democracy."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Lmao what a weak argument"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Do you really expect me to believe that this \"intelligent young man\" only has access to Hungarian media?? Hungary has the same access to information and the same democratic tools as any other EU country"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are not a dictatorship yet."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ive never been in a fight with anyone who has said ‘I’m going to punch you’"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Only a fool gives notice of intent."
    },
    {
        "subreddit": "worldnews",
        "sentence": "At least they don’t have feces balloons dropping from the skies…"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or as Russia recognizes Ukraine as Russian territory, Nato is training for just that.\n\nNote that Russia left out who launches said Nuke."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Because Biden will punish them if they do it without it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "A North Korean fecal transparent could be helpful to your microbiome"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thanks Kim! /s"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What’s the next steps? March on Russia?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Imagine if a war breaks out because of that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The history books are turning to comedy books"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Starting with Trump who suggested to drink bleach as a sort of vaccination."
    },
    {
        "subreddit": "worldnews",
        "sentence": "OP said that a single B21 Raider is 150-200 million"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The Air Force says otherwise, that it costs 700 million per aircraft."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Does anyone seriously believe or think that the ANC could lose its absolute majority or even fall from power with this election?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I think because Biden says no"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't get why Biden hasn't said jack shit about this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He's made statements on Israel and Palestine but not Ukraine."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Power absolutely corrupts but it’s my personal belief that anti social personality disorder-people have been the bane of human existence from the very beginning"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They feel zero empathy or human emotion far before they realize any position of power (and they often do come into power because they don’t give a single fuck about anyone but themselves.) They are incredibly good at mimicking human emotion"
    },
    {
        "subreddit": "worldnews",
        "sentence": "These human beings walk among us."
    },
    {
        "subreddit": "worldnews",
        "sentence": "For this it’s simple"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don’t use nuclear weapons."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Biden isn't saying it, that's why."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No one, I think that is the whole point"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If anyone had an answer we would use it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fuck Russia, and fuck the fact we discovered atomic weapons while still behaving like apes."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's good to see other countries stepping up! Good job and up your's Putin!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "thanks"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why are you replying to them? Mind your own business."
    },
    {
        "subreddit": "worldnews",
        "sentence": "War Games"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You’re just ignorant"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Read some Lenin you stupid tankie.\n\nIsnt it convenient that every failed state preaching communism just isn’t communist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You make me sick."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This summer was insane"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Felt like everyday set a new record for most humid day"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The idea that after they used the first nuke they would still be acting rationally is hope based"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They would probably be trying to escalate to be offered an off ramp."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s because ISIS recently attacked Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It might seem odd to some, but the Taliban and ISIS are actually mortal enemies"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The enemies of my enemies are my friends."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Easier said than done.  Would a no fly zone be established over Russian occupied territory where they're being released from?  If so that means destroying every Russian AA target on the ground to establish air superiority.  That means thousands of Russian troops killed directly by NATO who may as well declare war on Russia if it goes that far."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Right but once that door is opened, who knows what could happen?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Waste of Ukrainian long range munitions"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They need to reserve those for large critical targets like the hard to replace and static early warning radar systems"
    },
    {
        "subreddit": "worldnews",
        "sentence": "These drones are tiny which means the machinery to produce them aren't that much bigger"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You could probably fit all of it in a building no larger than a McDonalds, making it hard to target or guarantee a critical hit, and which also means the equipment itself probably isnt all that expensive to replace"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ukraine needs to save its long range munitions for critical very hard to replace assets"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If this factory was destroyed Russia could probably order a new set of replacement machines delivered the next day from China."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Woof woof! About time NATO countries started showing their teeth."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sick of reading that one"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Weird armchair cheerleaders on here."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Makes me proud to be Swedish! Fuck Putin"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kim dung un"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is some protein in feces"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The north koreans will be regretting this move when they begin starving after the Ukraine war dies down and the Russians are not interested in buying their garbage tier weapons."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This reminds me of the one time in Malcolm in the middle when the boys floated used diapers with helium balloons and shot them down over the neighbourhood with a slingshot."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not all of it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Look at a map"
    },
    {
        "subreddit": "worldnews",
        "sentence": "How is, say, Жәнібек / Zhanybek, behind the Urals?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Autocracy..?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's in the part of the process where all attempts at communism ends up, and is the reason people say it wont work"
    },
    {
        "subreddit": "worldnews",
        "sentence": "People that believe communism is the way to go ignore that fact everytime! It's not REAL communism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes it is"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It is very real, because that is where attempts at communism \\*always\\* ends up.\n\nIt's like if I say Im going to make a flying dishwasher, and always ends up with a smashed dishwasher on the ground, and people go, yeh but thats not a flying dishwasher! Sure, but that's semantics"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I set out to make a flying dishwasher but ended up with a hunk of dangerous useless junkpile of metal instead."
    },
    {
        "subreddit": "worldnews",
        "sentence": "What do you think Oct 7 was? \"Resistance\"?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "South west sauce?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It probably made sense in the beginning when it was hoped that russia would just commit the initial force, and the goal was to stop that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But russia went all in and keeps feeding the gears of war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nevertheless this restriction should have been removed at least a year ago."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not only right, it's a proper thing to do"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Would be really stupid to ignore their threats"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, this temperature was recorded in a desert part of Pakistan"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Was prevented by PISs Poland, and since PISs was finally voted out is now done by Slovakia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "putin always made sure that hes got two trojan horses to cover each others ass with their veto."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They actually do have an independent investigatory team"
    },
    {
        "subreddit": "worldnews",
        "sentence": "https://x.com/IDF/status/1795507041135456626/mediaviewer?currentTweet=1795507041135456626&currentTweetUser=IDF"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Every accusation is an admission"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sweden announces new aid package worth 13b sek"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Including two ASC 890 airplanes, artillery shells, pbv 302's (?) and air to  air missiles"
    },
    {
        "subreddit": "worldnews",
        "sentence": "https://www.aftonbladet.se/nyheter/a/Avl5dz/nytt-vapenstod-till-ukraina-vart-13-miljarder"
    },
    {
        "subreddit": "worldnews",
        "sentence": "For anyone itching to reference the Obama medal meme, I'll remind you that when Israel fucks up, they generally own it (for example, the World Center Kitchen fuck up), as expected from a functioning democratic country (in a stark difference to a certain governing body that has literally 0 deaths since the beginning of this conflict)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Tokra kree"
    },
    {
        "subreddit": "worldnews",
        "sentence": "['Well a wave hit it'](https://youtu.be/3m5qxZm_JqM?si=-g8WsaD4cBSZUyRP)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well they are built for ICBMs and their exact capabilities are of course secret, but tracking normal ballistic missiles should not be a problem for the OtH radars."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I wonder how Russia apologetics think that the country is on right side (ok, they say Russia just defends itself from NATO) when they take a schoolgirl from her father and put her into ophranage while imprisoning father for the girl's drawing with \"no war\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or sentencing an ill piantress to seven years in prison for putting pieces of paper with description of what was going on in Mariupol in places of price tags in supermarket etc, while pardoning cannibals, rapists and killers if they go to kill Ukrainians."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Communism (In Theory) -> The citizens are the state as there is effectively no central government"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The citizens control the means of production and trade"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is not formal currency because basic needs are met through the exchange of goods and services between all members of society"
    },
    {
        "subreddit": "worldnews",
        "sentence": "State Capitalism -> There is a central government which controls all aspects of business, production, and trade"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is currency and it's distributed first to the state who then distributes what, if any, capital they dictate is acceptable to the citizens"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Goods and services are still bought and sold with currency.\n\nMarx himself said there would need to be a central government in the infancy of communism that would need to dissolve once society was organized"
    },
    {
        "subreddit": "worldnews",
        "sentence": "A lot of \"communism\" gets to that first step and never progresses and winds up \"State Capitalism\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "After all, if you were suddenly in charge of all wealth and production, why would you want to give that up?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So your take is ISRAEL is not a terrorist country and NOT comitting war crimes?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You figure out who has power, and work to get as much of what you want within those parameters."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's not what that says, first it does not reference a 24 hours period, second the commenter said launchers, meaning nuclear launching platforms and silos, that link of yours is about striking troops, not about damaging Russia's nuclear capabilities."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So they sold off all their missiles to russia or what?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "just fyi Albatros even despite sanctions is partner of Nvidia, and their workers still get invites on american conferences, informnapalm published article about it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So a satellite made of conventional materials - aluminium, steel, copper, fibreglass, semiconductors etc, with some nominal wood panelling.\n\nThis is huge."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I absolutely agree with you"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He has been a Waschlappen since the start of this."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Smell that Rand? It's the whispering winds of shit!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "> They suffered terribly under fascist dictatorship,\n\nWhen? They were proud bootlickers and allies for the Nazis"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They provided troops and gleefully used it to clean out their minorities (including the german ones, as soon as WWII was over"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Which was (un)funny enough the german minority least supportive of Nazi Germany among all german minorities"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They were perps, not victims"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That they became in '56.\n\nAnd clearly theyve learned nothing."
    },
    {
        "subreddit": "worldnews",
        "sentence": "And people still buy natural diamonds."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The burden of proof lies with the person who made the allegation (that its an israeli strike and not ammunition explosion)\n\nSo far all ive seen are health ministry (hamas) quotes."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Except it's behind the Urals and that's where Europe and \"most\"of russia ends."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So beef shipments?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "My dad always voted SPD up until the 2000s and continues to say that the party mostly became a joke"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I agree with him, some politicians are capable there but not a lot"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Probably cause there’s not much else to criticize Obama over that everyone universally agrees was bad"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Other than the air strikes it’s just policy decisions that 50% of people probably agree with and 50% don’t"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Whereas the other presidents you listed have many more clear shortcomings most agree on."
    },
    {
        "subreddit": "worldnews",
        "sentence": "How is everyone still alive in this made for TV film."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">I never expected Macron to show the most courage and leadership out of all NATO but here we are.\n\nUK has allowed Ukraine to do this since the beginning of the month."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nooo buddy thats not how it works, you dont just ignore everything other person said and ask your next stupid question\n\nSo again, do you think HAMAS is not a terrorist organisation"
    },
    {
        "subreddit": "worldnews",
        "sentence": "NATO isn't an offensive organization"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No reason countries can't ally without NATO though."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No, Orban isn’t somehow “holding back” the right wing loonies in Europe"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That’s a very bizarre take."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Repair crews count as enemy combatants, so hell yeah"
    },
    {
        "subreddit": "worldnews",
        "sentence": "sounds like someone wants an emergency climate lockdown"
    },
    {
        "subreddit": "worldnews",
        "sentence": "but would that interfere with the election?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No they're not."
    },
    {
        "subreddit": "worldnews",
        "sentence": "One teenager from West Germany got to Red Square in a Cessna.\n\nI’m sure we can get F-Wings in there with air support and control"
    },
    {
        "subreddit": "worldnews",
        "sentence": "no one want to murder anyone"
    },
    {
        "subreddit": "worldnews",
        "sentence": "but we perfectly know that who is the one enjoy murdering babies and innocents in their sleep"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Still lower than most of the Western European countries which is hilarious."
    },
    {
        "subreddit": "worldnews",
        "sentence": "https://www.currentaffairs.org/2024/04/israels-propaganda-machine-is-filling-the-internet-with-misinformation\n\nVery trustworthy"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kim doesn’t ever use the bathroom so it’s not from him"
    },
    {
        "subreddit": "worldnews",
        "sentence": "https://www.currentaffairs.org/2024/04/israels-propaganda-machine-is-filling-the-internet-with-misinformation\n\nWhat are your thoughts here?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We're already living in a parody."
    },
    {
        "subreddit": "worldnews",
        "sentence": "How the fuck are you being upvoted when its a lie\n\nI seriously lost faith in humanity.\n\nRepeat a lie enough times and it becomes the truth"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Oh please, you people are a joke"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, let’s listen to what an Isreali propaganda outlet has to say, one that benefits from downplaying all the negative reporting"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The article offers absolutely no evidence of anything"
    },
    {
        "subreddit": "worldnews",
        "sentence": "In your own propaganda piece: \n\n“New York Times correspondent Jodi Rudoren disputed and criticized the FPA statement: “‘Every reporter I’ve met who was in Gaza during war says this Israeli/now FPA narrative of Hamas harassment is nonsense,’ Rudoren tweeted, referring to Israeli accusations that Hamas pressure on foreign reporters had helped massage the messages coming out of Gaza in the last month.” And he said Rudoren’s Tweet “was followed by a furious email exchange with the FPA, in which Rudoren denounced the statement as ‘dangerous.'”\n\nIt’s always ironic that you guys always share your sources straight from an Isreali propaganda outlet, as if they don’t benefit from downplaying the negative reporting and coverage they’re receiving"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What evidence did they offer in the article besides heresay? \n\nAlso, even if true, why does Israel murder American journalists? Ones that are also reporting facts of what’s going on, facts that coincidentally paint Israel negatively?\n\nLet me explain to you the Israel narrative that they want us to follow and adhere to:\n\n“The party told you to reject the evidence of your eyes and ears"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was their final, most essential command.” \n\nThis is all that Israel has to rely on"
    },
    {
        "subreddit": "worldnews",
        "sentence": "See children beheaded"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Reject that premise, listen to our propaganda instead!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Arguably also St"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Petersburg too, no?\n\nBut otherwise good point."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Afghanistan has some of the world’s largest lithium deposits"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’m guessing that’s what the Russians want."
    },
    {
        "subreddit": "worldnews",
        "sentence": "At this point it's fruitless to argue with anyone who refuses to differentiate between Hamas and Palestine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You know there's a difference, you're just being willfully obtuse."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can anyone here answer, what is it about the F 35s that make them a clear upgrade?\n\nSurely we are reaching our limits of improving our mechanical engineering"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The physics hasn't changed and I don't imagine our precision while building these planes has progressed so significantly to make a difference."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So your take is ISRAEL is not a terrorist country?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "A plurality, not a majority"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Important distinction"
    },
    {
        "subreddit": "worldnews",
        "sentence": "50 seats in parliament translates to 33% of all votes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Still not a majority"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The second biggest party is left wing, the third is centre right and the fourth is right-leaning centrist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The main thing they have in common is conservativism.\n\nThe claim that the majority of Dutch people support far right is not correct."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You have three choices"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Let a nation use nukes with no consequences, I think everyone realizes this just means they and other nations will use more nukes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Respond with a nuke, now you've set a tit for tat of nuclear retaliation that more than likely will escalate"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Respond with conventional weapons, which has to be harsh enough to be a punishment for using nukes, cannot make the leaders fear they are going to be ousted from power and make it plain that using nukes was a mistake"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If the response to a conventional attack is the use of more nukes, then you are forced to respond with nukes and see who backs down from the tit for tat first.\n\nNo one wins a nuclear exchange, no one"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You have to be completely stupid to push for one"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I'm not sure why you think Russians are suicidal and stupid"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The leaders in Russia have very comfortable lives, they are not going to commit mass suicide"
    },
    {
        "subreddit": "worldnews",
        "sentence": "IF they had a puppet in the White House, they might try to change a losing battlefield with nukes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That isn't the case for at least the next seven months."
    },
    {
        "subreddit": "worldnews",
        "sentence": "And where do you think Putin will be while the Nukes are air-bursting above Paris & Moscow? \n\nSafely tucked away way  way down deep in the Urals"
    },
    {
        "subreddit": "worldnews",
        "sentence": "In comparitive luxury for the rest of his life provided his weapons do enough damage"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We aren't dealing with someone who cares at all about his citizens"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That much is evident after two years of the slaughter he has put them through."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Who did what? Nostrudamus"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What is the high road? Doing nothing? Just curious because that isn’t a very good answer either."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No western countries allowed this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Always has been a red line drawn by NATO allies to Ukrain."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Waaaa waaaaa"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">You can't say it's OK for Hamas to purposely target civilians \n\n\n I've literally never seen anyone say that here"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why do you need to use such a dumb fucking strawman? Being against indiscriminate, deliberate bombings of civilians doesn't mean being pro-Hamas."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Exactly"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I never expected Macron to show the most courage and leadership out of all NATO but here we are.\n\n\nI can tell there will be no shortage of surprises these next couple years."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well Putin can just fuck right off"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I did not call anything 'evil,' and you do not seem to know what the phrase 'conscious effort' means."
    },
    {
        "subreddit": "worldnews",
        "sentence": "First fuck trump\nNo see I actually do my research and read articles from every known scientific place and top scientists \n\nHeck scientists have stated even with global warming humans will be here and won’t go extinct for another 7,000 years of course that doesn’t count thing like nuclear war and such \n\nScientists also have stated that things can be fixed\n\nYou must be from I never do research and think I’m always right page\nMoron"
    },
    {
        "subreddit": "worldnews",
        "sentence": "“would require organizations in the former Soviet country that receive more than 20% of their funding from abroad to register as “foreign agents” or face crippling fines”\n\nWhy is this not a good thing, given that Russia may donate money to influence their decision, and it must be declared should such a thing happened?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s a reference to a comment from a retired US Army general and CIA director"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There’s no reason to believe they wouldn’t do this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Anything nuclear is a major escalation"
    },
    {
        "subreddit": "worldnews",
        "sentence": "[Source](https://www.theguardian.com/world/2022/oct/02/us-russia-putin-ukraine-war-david-petraeus)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They should never have discouraged or prevented Ukraine from returning fire on targets on Russian soil from the start."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Cluster munitions likely won't do much to runways and many Soviet/Russian aircraft are designed to operate on improvised/poor condition runways in the first place, but they will do a number on delicate and sensitive equipment all over the base and parked near said runways."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I moved to Israel - it's the only place that made sense and coincidentally the easiest for me to get a visa and move my tech career"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sure there are rocket attacks, but we have the early warning system, the iron dome, and every single building has a bomb shelter.\n\nI think one of the best things secular Jews can do right now is take advantage of the Aliyah system and help shift the political dynamic here"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I have greatly enjoyed the now three chances I've had to vote against Bibi :)."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They also played a huge face or in the Lebanese civil war, the PLO being one of the parties fighting"
    },
    {
        "subreddit": "worldnews",
        "sentence": "In Kuwait, they basically got themselves expelled by their blinding support of Suddam Hussein"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Egypt has been dealing with issues in relation to the Rafa border for a while now"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hamas has tunnels that run into Egypt and Egypt is constantly trying to stop them smuggling things in and out of Gaza"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Its sad, but because of the PLO in the past, a lot of surrounding countries have zero interest in bringing Palestinians in because it’s led to a lot of issues"
    },
    {
        "subreddit": "worldnews",
        "sentence": "did you get all that from infowars?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Man, this is kinda a Berenstein Bears moment for me"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I could have *sworn* it was \"*walk* softly and carry a big stick\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Looked it up and nope, what you said is correct"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Anyone else think that, too?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The subject of the article."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Because it's not communism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What aspect of North Korea do you think makes it a communist state? The government having total control of the means of production doesn't make a state communist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I think Biden just doesn't have the balls to pull the trigger in an election year."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Shhh, using facts is illegal here"
    },
    {
        "subreddit": "worldnews",
        "sentence": "🤣\n\n\nIt's either Russia = bad or you're a commie."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The situation was likely time sensitive; they probably found out about the Hamas leaders meeting at this location, only had a few moments to properly recon the area and send something to neutralize them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Gathering a bunch of IDF soldiers and sending them there was going to take too long, and elimination missions conducted by ground forces require a lot of preparation work, especially if they are in complex situations.\n\nIn short, they judged that if they waited to gather the necessary ground forces, prepare them, and transport them to the location (either by ground or by helicopter), it is very likely that Hamas would have fled and escaped at the first sign of approach"
    },
    {
        "subreddit": "worldnews",
        "sentence": "While if they conducted an air strike using precision munitions, it would give almost zero warning and thus a higher likelihood of success."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's surprising, that the French didn't allow it up until this point."
    },
    {
        "subreddit": "worldnews",
        "sentence": "If not stopped, the war will come to you sooner or later"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I'm not trying to be mean, but your English isn't great and I'm not sure what you are trying to say"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can you go to google.translate.com and translate from your native language?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Personally inflated by the dear (flatulent) leader"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That is some sad nonsense"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's been like half an hour and you still don't have sources right ?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The taliban are well known for their economic expertise, after all"
    },
    {
        "subreddit": "worldnews",
        "sentence": "/s"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Here’s 2 examples:\nHere’s a summary of some of the latest developments in this field:\n\n**In a groundbreaking development**, scientists at Baylor College of Medicine have secured a patent for a gene that significantly boosts plant resilience to heat stress, a timely innovation as global temperatures continue to rise"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This genetic breakthrough promises to sustain crop yields even as conditions grow harsher, with the potential to maintain full production levels despite temperature increases that would typically halve the output of essential crops like wheat"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The patented gene represents a quantum leap in agricultural biotechnology, offering a rapid solution to the slow process of traditional breeding, which often spans decades to produce heat-tolerant varieties.\n\n**Revolutionizing the agricultural landscape**, the advent of CRISPR-Cas9 genome editing tools marks a new era of precision in crop development"
    },
    {
        "subreddit": "worldnews",
        "sentence": "By enabling exact genetic alterations linked to heat resistance, this technology accelerates the breeding process, outpacing conventional methods in both speed and efficiency"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Additionally, synthetic biology is being harnessed to reengineer plant root systems, enhancing their ability to absorb nutrients and water, thereby fortifying them against the vicissitudes of climate change"
    },
    {
        "subreddit": "worldnews",
        "sentence": "These pioneering techniques are not just pivotal for upholding agricultural productivity amid escalating global temperatures but are also vital for securing the food supply for burgeoning populations worldwide.\n\nSome reading materials and sources:\n\nhttps://blogs.bcm.edu/2021/08/10/from-the-labs-new-gene-to-make-plants-heat-tolerant-in-rising-temperatures/\n\nhttps://news.stanford.edu/stories/2022/08/synthetic-genetic-circuits-help-plants-adapt-climate-change\n\nhttps://new.nsf.gov/news/heat-tolerant-crops-could-prevent-future#:~:text=However%2C%20Hannah%20developed%20two%20heat,have%20been%20observed%20in%20maize.\n\nhttps://www.science.org/content/article/rice-genetically-engineered-resist-heat-waves-can-also-produce-20-more-grain"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yup, exactly"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It would cause corporations to lose income"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was expected because the United States is an Israeli puppet, but it makes no sense to me either.\n\nThrowing weight behind Israel as though it can do no wrong has become hugely unpopular with the general public"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The only reason I can see they may continue to do this is the Israeli government having a huge amount of leverage over the US government"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Which makes me wonder, what do they know that we don't"
    },
    {
        "subreddit": "worldnews",
        "sentence": "> And to stop lying and telling people everything is going wonderfully when it simply isn't.\n\nLiterally no one is saying that, what is he talking about?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So your take is HAMAS is not a terrorist organisation?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "In fact animals are largely considered very important to Indians thanks to their Hindu faith"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s a reason why such a large percentage of Indians don’t eat meat"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia is training to not have their own nukes blow up on Russian soil."
    },
    {
        "subreddit": "worldnews",
        "sentence": "A good part of the North Korean population is in hunger and absolute misery, and the North Korean dictatorship spends resources on this and a good part of its public treasury on a nuclear arsenal.\n\n\n\n(With this kind of neighbor, it is understandable why a growing percentage of South Koreans are flirting with the idea of becoming a nuclear power)."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hamas is not being funded or armed by my government, the Israeli forces are"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I am against the horrific crimes committed on both sides, but the scale of devastation is not equal nor is the stance of our PM"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I refuse to believe anyone that dumb can exist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Someone would have to be diagnosed with something more severe than the most serious case of mental retardation to genuinely believe that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "North Korea using the most advanced weapons in their armory"
    },
    {
        "subreddit": "worldnews",
        "sentence": "ah ah only if they're \"extremely large\" mind you /s"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Link, cause I have seen quite a few of the drone footage and cannot recall any inferno troops from drones."
    },
    {
        "subreddit": "worldnews",
        "sentence": "What did he get away with that others did not? For some reason Obama is synonymous with Middle Eastern bombings despite it being standard practice for Bush, Obama, and Trump."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They get a whole lot of propaganda in Hungary"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I visited last year and met a very intelligent young man, entrepreneur, who had solid values about most things, but thought the invasion of Ukraine was justified, since Russia would only remove the biological weapons factories he had been taught were placed in Ukraine by NATO…"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Disingenuous to say"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So you’re saying that you let our corporate overlords fleece you slowly of your money since you haven’t revolted yet, instead you’re just casually commenting on Reddit?\n\nI want you to ask yourself what can you realistically do yourself to topple the current structure?\n\nNow ask yourself what can random Russians do?\n\nCool, now be realistic and tell me if you’re willing to give up your creature comforts to fight"
    },
    {
        "subreddit": "worldnews",
        "sentence": "All I’m seeing is you doomscrolling."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Where did you move to? Where do you think you are the safest?\n\nThe conflict aside, the global increase of anti semitism is really worrying."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The same Yemen attacking international shipping?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Stop trying to make Rafah happen it's not going to happen"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Their sewage systems are so bad that they’re now resorting to this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "With how outdated their military tech is, this might be their best export."
    },
    {
        "subreddit": "worldnews",
        "sentence": "/r/movingtonorthkorea"
    },
    {
        "subreddit": "worldnews",
        "sentence": "you should look around a little more"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What enemy would require a D-Day pier? Russia is contiguous and NATO can control the Baltic Sea, Mediterranean Sea, Aegean and Black Seas, and has ports all over those, and China is affixed to the Korean Peninsula which is a major US ally on the bottom, and I can’t see any other countries wanting to start shit that we couldn’t reach by land."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They must be importing the feces from China"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You need food to have feces and we all know they don’t have much food"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Must not be a lot of balloons…."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sure"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You assumed I Was american, and I assumed you were a tankie"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Its not really a misuse of communism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The people going for it probably believe they are actually doing that, whilst they end up with autocracy always"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And thats due partly to the use of planned economics which IS autocracy distilled."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So US, the richest country in the world by far, shouldn’t spend any money helping the less fortunate countries, even when they are facing destruction by an aggressive third country that also threatens US almost daily?\n\nAre you 100% sure that stopping such help would not lead to a much worse outcome for the US, and therefore you?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't think Reddit is the right place to ask such questions"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Diplomatic relations are a complex and nuanced subject that a one sentence ELI5 from a dumb right or tard left won't give justice."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is sad."
    },
    {
        "subreddit": "worldnews",
        "sentence": "China, India, UK, France to start with..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hungary can be blackmailed or bought"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And yes, of course it does."
    },
    {
        "subreddit": "worldnews",
        "sentence": "For what it’s worth, I’d say vote DA"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Better record of service delivery.\n\nDon’t vote for the ANC"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are corrupt and their record speaks for itself.\n\nDon’t vote for the EFF"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are radicals and plain crazy.\n\nDote vote for MK, well, unless you want the leader to have a fire pool and money in his couch."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well, one might argue that bombing a refugee camp is never acceptable, or even that a refugee camp is likely to have a lot of gas canisters and a distinct lack of fire extinguished and sprinklers, because, you know, you bombed their homes flat."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Probably .."
    },
    {
        "subreddit": "worldnews",
        "sentence": "as everyone versus everyone."
    },
    {
        "subreddit": "worldnews",
        "sentence": "30 seconds of Googling is all it would've taken to not utterly embarrass yourself here"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Think before you speak."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They do, not nearly enough though"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hard to make expensive missiles during an all-out war with a bigger aggressor when your economy is almost destroyed by the said war and all the men are at the frontline"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And democrats are forcing to fight with hands tied behind back"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Biden administration is regularly pressuring Ukraine on not striking Russian territory, it even pressuring other counties to not allow their provided weapons to be used against Russian soil"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They even managed to pressure Sweden on stoping plans on providing Gripen jets because Biden doesn’t like that that would allow UAF to strike Russia with weapons whose use is not controlled by Americans"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You don’t even vote for the president"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You vote for the Electoral College who will then decide if you voted for the correct candidate"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If you didn’t vote for the correct candidate, they will change your vote for you!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So you say India has no caste system anymore and is a proper democratic country? \ninteresting..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’m betting the armed forces (I mean the entire military system here) are glad that if they were to be thrown into Ukraine, NATO would rule the waves and there’d be plenty of ports.\n\nGreece and Turkey can control the Aegean, Italy, France, Spain, and Gibraltar can control the mouth, and nobody is getting anything through the Suez Canal because they’d have to go through the Aegean anyway.\n\nTurkey and Romania and Ukraine can control the Black Sea."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wasent it 10 to 1 like 2 months ago? Catching up pretty quick tbh"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Conservatives because you have 2 hard at work braincells that was tongue in cheek."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They have a head with no brain in it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Assuming you mean Gaza, and yes, always has"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They’ve been striking each other with Israel for many decades"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ray Bradbury was a time traveler"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">It really wouldn't.\n\nIt would certainly be enough to start a lawsuit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If they would win that lawsuit is a different question, but that's irrelevant to the story, because they didn't win this lawsuit either."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I agree with that\n\nDoesn't mean theyre communist though does it lol\n\nI can correct the misuse of the word communism to describe dictator authoritiive states without being a tankie."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That is not how that works."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was a jeep full of weapons and missiles"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They’re hoping the south can check the samples for parasites and send the results back so they can be treated."
    },
    {
        "subreddit": "worldnews",
        "sentence": "We'll have a mass casualty wet bulb event this decade"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Air conditioning is the only escape and so many very hot very populous places cannot power enough air conditioners to keep everyone alive."
    },
    {
        "subreddit": "worldnews",
        "sentence": "How do they work?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I actually think it would be better for the 1% Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "1% is like 1,5 million people"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This war really only profits like 10-20 people or so"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Really just Putins inner cycle"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russias oligarchs would be better off if they could make business with the West."
    },
    {
        "subreddit": "worldnews",
        "sentence": "My fear is that will push people to embrace fascism if it can promise that none of those people will make it to their country to ruin it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "People might start resorting to extreme measures like sending their navy and army to ensure these people don’t make it to their country, which would be one of the worst tragedies and human history of that became the norm."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Putin won't love you in return."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Full of shit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They have thousands left"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I know they are old but they fire and that's good enough for them."
    },
    {
        "subreddit": "worldnews",
        "sentence": "US left the place..?!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Are you also going to ask about what I think will happen if a monkey dances on its head? Just as irrelevant."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah because those Nazis loved free speech..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kim's new biological weapon."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's not only Hungary"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There are many other parties in Europe in other countries, including most of the right-wing parties, many centralist parties, Unions, and corporate interests who are gaining prominence across the continent that do not support the war for either moral, political or financial reasons"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hungary is acting as the spokesperson for many of them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thinking that Hungary or Orban is alone is a mistake"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If the CIA or whatever tries to silence Hungary or Orban you're going to see a huge surge in the right-wing parties across the board in election poles"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Keeping all of those 'voices' at a low volume by having Orban be the fall person is actually better, for now."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The problem with communism is it breaks down over about 500 people"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Villages were probably the closest thing to communism that actually worked, but they were very small weren’t they?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kazakhstan is South of Russia, not East"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And even then, it's south of the Western part of Russia more than than the Eastern part of Russia.\n\nBy some definitions, a small part of Kazakhstan is in Europe."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Uh huh, sure"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I totally believe your bringing that up was \"just a data point\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "There's no way it could have anything to do with the fact \"Hamas steals the aid\" has become one of the most commonly used lines when people want to justify the blockade, distract from aid being stalled.\n\nI'm not trying to tell you your beliefs, but don't pretend your only impulse to type that reply was because you wanted to bring \"new\" data to the table"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's not a mystery how that line gets used, and I find it very hard to believe you're not smart enough to have picked up on it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "eh, the rest of the country goes along with it, so potato /tomato"
    },
    {
        "subreddit": "worldnews",
        "sentence": "[The recording](https://youtu.be/kCV_25Urfc4?si=HZZvYR8hB3lpvyEW) saying Senior Hamas members were eliminated and there were unexpected hidden weapons caches around the camps is pretty damning."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Turn off all fans immediately, can’t let it happen"
    },
    {
        "subreddit": "worldnews",
        "sentence": "yeah, feel sorry for Pistorius to be in the same party."
    },
    {
        "subreddit": "worldnews",
        "sentence": "My Grandfather was a spitfire/hurricane pilot in 134 squadron of the RAF"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He said the numbers related to height.\n\n1ft was low level\n3ft was attack height \n4ft was high altitude \n\nYour comment reminded me of him."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't think the arms suppliers get to dictate anything past when they are sold to the US government, especially when we're talking about artillery rounds or, like, short range rockets"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The US is generally supplying these out of a stockpile"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The US also field tests their equipment, and, for something like artillery rounds, would be regularly trialling them at a test range."
    },
    {
        "subreddit": "worldnews",
        "sentence": "In the sixties.."
    },
    {
        "subreddit": "worldnews",
        "sentence": "HOW OLD ARE YOU? Respect man"
    },
    {
        "subreddit": "worldnews",
        "sentence": "you're ignoring his point"
    },
    {
        "subreddit": "worldnews",
        "sentence": "go protest about Hamas hiding in refugee camps"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’m told if they don’t they lose their access to smiley face stickers, if true this is a very extreme reaction for Canada."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Im not american"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Im from Norwy, and am \\*very well\\* versed in what communism is.\n\nThe whole point tankies, like you, dont understand is that communism is a pipe dream"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No matter who tries it, it always ends up the same"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's simply not possible to achieve with humans running it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The same big war problem"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You'd see an US transport plane on route going to land in Kyiv airport"
    },
    {
        "subreddit": "worldnews",
        "sentence": "To enforce NFZ you'd have to shoot down that plane."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why did you ignore that article? You were keen to respond prior"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Welp, time to review some Erisco products"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Come with a solution then"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Do nothing and wait for the next 1500 innocent jews to get beheaded isn’t a solution."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I could not add this in the post itself but the volume of propaganda is disgusting"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The jailed dissidents with Nobel peace prizes are losing their minds about the international communities sympathy right after all of the work that went to acknowledge the mass rapes and murders of minor girls and boys in Iran"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Gassing their middle schools"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The media is trying to encourage us to forget that the majority of the people of Iran hate their government and they are NOT in mourning"
    },
    {
        "subreddit": "worldnews",
        "sentence": "(Follow up, I have live accounts from people in Iran would have loved to share screenshots to validate proof but it’s not allowed.)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "\"Illegal / unlawful\" what law? There are no laws in war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Even if there were, who is supposed to enforce them? Pacts and conventions are nothing more than a pinky promise."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Putin will send his dog Medvedev to do the usual nuclear saber rattling."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The support for the PVV has grown massively in the last year, with polls showing he would take almost 50 seats in Parliament if new elections were held.\n\n\nThe majority of Dutch support far right parties, all of which are climate change deniers, to various extents."
    },
    {
        "subreddit": "worldnews",
        "sentence": "> The discussion includes protecting western Ukraine's airspace\n\nSo only western Ukraine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "While that's a start, it should be established over the entire Ukraine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Including Donbas, Luhansk, Mariupol, Crimea"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Still won't change the fact that Hungary is in NATO...\n\nAlso NATO doesn't give out invitations, that's not how it works."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">Can't even keep up with all of hamas' lies\n\nthat's the point"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's like gish galloping propaganda."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nope, one nation (Israel) went to war because the opposing party (Hamas) went and slaughtered innocent civilians, and is now embedded between their own civilians hiding like cowards"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Stop making excuses for terrorist scum."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Isn't she considered 'rich' for north Korean standards ? Her mother was a business woman"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Her father was an official, high enough to be able to smuggle goods into the north."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I wonder how butthurt the CCCP will be if Hungary is removed from EU"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Their car production is in Hungary and it is the only reason why Chinese brands are currently flooding the european market."
    },
    {
        "subreddit": "worldnews",
        "sentence": "All the German articles I found call him \"former officer\" so I guess this already happened."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Most incompetent army, sooo many tragic accidents, definitely not intentional 😉"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So it's OK for Russian folk to do the same?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yea its been pretty obvious since the start"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or would 9f been a serious commitment to long range weapons early to pummel assets in russia before grouping"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Best bet for ukriane is to lose the Eastern parts, crimea and keep the rest"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Like finland in the winter war just a bigger scale"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hey it seemed perfectly structurally sound"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But apierances can be decieving"
    },
    {
        "subreddit": "worldnews",
        "sentence": "For what it’s worth, Israel has been in Gaza long before this war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But also, it won’t continue even for years, let alone decades"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are already almost done with the major operations as Rafah is the last big target.\n\nBig question is what they do after the active phase of war is over"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Because if the plan is “build a bigger wall”, then it’s just a matter of time until new wave of violence and rebellion."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Current AI is good at solving known problems.\n\nE.g"
    },
    {
        "subreddit": "worldnews",
        "sentence": "if there is something you know exists, like a particular pathfinding algorithm, but you don't know how it is implemented - LLMs know, and they can write code that uses it, because it is a solved problem"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I think they are not very good when asked to customise it.\n\nThey are not good at combining systems.\n\nThey are good learning tools - e.g"
    },
    {
        "subreddit": "worldnews",
        "sentence": "to find the legislation, or part of the legislation, that contains some law"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is a known problem.\n\nIf they need to do something that hasn't been done before, they will openly lie and get everything shamelessly wrong.\n\nTo solve new problems, they need to make AGI"
    },
    {
        "subreddit": "worldnews",
        "sentence": "AGI will do whatever it wants to do"
    },
    {
        "subreddit": "worldnews",
        "sentence": "AGI will probably see that humans are a massive drain on the planet and try to get rid of us"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It should be regulated above even nuclear weapons."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well, those people would only ask for verification of IDF claims in hope that there's none"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If there is independent verification, it's ignored."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, so convenient that they have video footage of their initial \"small\" munition strike followed by a huge explosion when Hamas' munition warehouse exploded"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They even have [a recorded phone call](https://allisrael.com/idf-releases-preliminary-results-of-investigation-into-rafah-strike-iaf-munitions-not-to-blame-for-fire) between 2 Gazans talking about the warehouse exploding and that it was right near the Hamas leaders' meeting location that was targeted."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Would you have been taken captive or fought to the death?\n\nJust interested."
    },
    {
        "subreddit": "worldnews",
        "sentence": "As far as I know emigration from the North of Italy to South America happened more between the 1880s and WWI"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We’re also talking mostly about a mass of farmers and so-called “unskilled” workers, with not much knowledge of history and Italy’s role in it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They just went where they had been told there would be more bread and money, often with the project of going there for a few years and then come back with more money than they could have made at home."
    },
    {
        "subreddit": "worldnews",
        "sentence": "After a careful cost-benefit analysis they figured out, instead of terraforming mars, colonizing it, just to be king of a world, it's much cheaper (and more convenient) to spend a couple of years in a huge bunker to wait out nuclear winter and reset the earth to re-colonize it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Türkiye isn't in EU, they want to be tho.\n\nBut EU needs a reform so a 80% vote is enough to pass bills and remove the veto powers as they are right now."
    },
    {
        "subreddit": "worldnews",
        "sentence": "My god."
    },
    {
        "subreddit": "worldnews",
        "sentence": "> pls take them all \n\nExactly! Once we \"cleanse\" Gaza of all of the Palestinians, the problem will be solved."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I like reading bad Google maps reviews from other languages and translating them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This reminds me of how often Japanese people say that they wish for a business to be destroyed when they don’t like it lol."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Diamond thermal paste"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Allow how exactly? Long-range radars is a thing, and its not hard to detect that plane that took off from a Poland airbase is now flying in the Ukraine airspace."
    },
    {
        "subreddit": "worldnews",
        "sentence": "YOU  regret it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yea but it's taken a darker turn recently"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The left is being primed to blame Israel if Trump gets into office"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Trump himself has a very solid base of anti-semites already that get extra jumpy when he is in office"
    },
    {
        "subreddit": "worldnews",
        "sentence": "America isn't safe for Jews anymore in my eyes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I left 5 years ago, been trying to get my family on board too."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Everybody acting all liberal till they have to deal with terror in their backyard"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Let's see their strategy then"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wish there was as much mercy/sympathy for yemen being pounded shitless by Saudi."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's a lake surrounded by mountains and it usually rains every day in summer"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The Spanish absolutely did them dirty by messing with the setup the Mexica had going there.\n\nThe city could have been Venice meets Machu Picchu today, but no, the arrogant dimwits decided to pave the lakebed."
    },
    {
        "subreddit": "worldnews",
        "sentence": "But those are gifts"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Read about how they collect shit in NK by government order."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Users often report submissions from this site for sensationalized articles"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Readers have a responsibility to be skeptical, check sources, and comment on any flaws.\n\nYou can help improve this thread by linking to media that verifies or questions this article's claims"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Your link could help readers better understand this issue.\n\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This sounds just like the mirror after Christmas holidays"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I wish more people understood this crucial difference"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You may disagree with the accepted amount collateral deaths, but it’s wild to me how many people truly believe that Israel’s literal goal is to just blow up babies and women.\n\nLike yes, their tactics can be horrible and brutal, but the goal itself seems pretty widely accepted as valid (take out Hamas)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Another reason I hate the comparison with Russia since their goal is literally “annex land and destroy a sovereign country that never attacked us once”."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well...it isnt.\n\nFirst rule of communism, there are no rulers in communism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No money"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No classes.\n\nThe ccp isnt communist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nk isnt communist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia isnt communist.\n\nAmericans dont know what communism is, to you lot its just \"the bad guys that aren't us.\"\n\nCuba got pretty close.\n\nJust look at the first lttle paragraph on Wikipedia.."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Dictators are not communist"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Americans just use communism to mean \"the bad guys\" because its propaganda against socialism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Then I’m sorry I can’t do anything for you"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You’ll just have to continue disliking me and move along.\n\nEdit: Yes I blocked him"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Because you can’t make some people happy"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nice stealth edit btw."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hi /u/Alien0105"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thank you for participating on /r/worldnews"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Unfortunately, your post has been automatically removed because we do not permit anyone to post more than 4 times over a 24 hour timespan.\n\nPlease wait a while and try again later."
    },
    {
        "subreddit": "worldnews",
        "sentence": "And some type of phosphorus"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I agree with that, but plenty of people seem content to take reports coming out of Gaza at face value.\n\nThis is like the Shifa Hospital strike all over again."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Putin warns again? And again and again and again and ..."
    },
    {
        "subreddit": "worldnews",
        "sentence": ":D"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Are north and South Korea about to join the imminent global theater?"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">Ukraine isn't going to fall altogether.\n\nIt could"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We know that’s Russia’s ultimate goal, given the RIA Novosti article accidentally published near the start of the war hailing their swift victory and the annexation of Ukraine (and Belarus)."
    },
    {
        "subreddit": "worldnews",
        "sentence": "What is your argument here? i don't understand\n\n\nAre you just writing for the sake of writing or did you actually have a point?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And how could they ensure or guarantee or promise that this would not escalate into an all-out NATO-Russia war?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ok I admit I didn't think of Trump despite him being such an obvious counterexample\n\nThen again, he is in campaigning mode and blabbers incoherent stuff 24/7"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Now Ukraine can say, \"From France with love!\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is how government works, haven’t  you noticed?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You literally just said \"Russia didn't invade Ukraine because USA is awesome\" when concatenated"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Make sense.\n\n\nIf Russia bluffed then they wouldn't have gone to war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia is at war after warning that it would go to war if certain things happened (Ukraine tried to join NATO), then Ukraine ignored them and they went to war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This was the bluff I was paralleling in my example.\n\n\nThe US is the world's single and only *military* superpower. \n\n\nIt loses in a variety of other metrics commonly used to guage a superpower, including economy, manufacturing capacity, nukes, which is why various other countries get called superpowers too.\n\n\nOf course the very reason I'm now sitting at probably -100 karma for the GF post is that USA gets very pissed of when you don't massage it's ego and try and engage in objective comparison.\n\n\nI'm well aware of US power projection, it's abuse, and how it's totally irrelevant to a proposed conflict with CANADA.\n\n\n\"Glass cross?\"\n\n\n🤣\n\n\nOoh Rah."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I think it has more to do with 5m+ civilians being treated as terrorists and viewed as collateral damage in the attempt to wipe out the small number of *actual* terrorists."
    },
    {
        "subreddit": "worldnews",
        "sentence": "this will all be avoided if Hamas have surrendered already"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I saw"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I just didn't find your explanation satisfactory"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or honest.\n\nEdit: lol he blocked me"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Because he's a liar."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I agree that it’s the same in principle, but the difference is that when you have so much bad influence from the inside you have to stop it from coming from outside as well.\n\nIt’s not that there are no hate crimes when there are no immigrants, but western values are so so different than middle-eastern or asian values."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The will of Allah"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He’s rewarding them for purging the Christian’s."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It really wouldn't."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was already hit once"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just not enough"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Good for you, wasting an insane amount of  money on a lump of carbon that can be mass produced cheaply"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">How can an opinion like thinking that something is too sweet even be ruled \"wrong\" by a court?\n\nDid you not read anything I wrote? I'm sorry, but you sound like a malfunctioning bot"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The defamation was her accusing the owner's brother of killing people, **not** saying it's too sweet."
    },
    {
        "subreddit": "worldnews",
        "sentence": "No, I was just using that as an example to show how much 800 billion actually is"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don’t think we would actually get rid of our military and give the money to the poor"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just a hypothetical of what could happen in a perfect world."
    },
    {
        "subreddit": "worldnews",
        "sentence": "“Support”"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah that doesn’t work"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Free market is an utopia, if you have no regulations the companies form alliances to colude with one another to reach a fake equilibrium in the cost/demand curve.\n\nJust look at car companies, many brands are under the same mother company so it “looks” like they are in competition but in reality all money is going to the same company"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It happens with food, pharmacy, supermarket, etc"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Big producers buy the small producers and so the competition is always between less actors, until you reach a point where the market is controlled by 3-5 mother companies, at that time they just have a few meetings and agree on an optimal margin (for them) for the product and all put the same price"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I live in Chile, we have discovered that companies agreed on the price for: tissue paper, chicken, many medicines and who knows what else is still in hiding."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Always 💛💙🥲"
    },
    {
        "subreddit": "worldnews",
        "sentence": "fuck Russia & Putin"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes, there are such quantities of diamonds that the homeowners of all of Europe could gravel their driveways with a layer and still there would be half the diamonds left in stock..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That’s fucking hilarious"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So, prankwise, this is the equivalent of flaming-bag-of-dogshit on the porch, right?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Next, North Korea needs to smash South Korea's mailbox."
    },
    {
        "subreddit": "worldnews",
        "sentence": "classic \"Scholzing\", changing his opinion like a flag in the wind, as we say in Germany."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes you gotta love the Hungarian.\n\nThey suffered terribly under fascist dictatorship,\n\nThen horribly under Communist dictatorship.\n\nThey get their freedom.\n\nHungarian, \"you know what, dictatorship worked so well for us the last two times.\n\nLet's elect a dictator.\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "5 seconds I’m over this chair, I’m in your face, and I’m kicking you in the chest"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not surprised"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Bootlicking is a thing in developed countries because most of us are still on the Kool Aid that \"if I work hard someday I will remove my family from poverty\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "So people who run businesses are glorified."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That’s."
    },
    {
        "subreddit": "worldnews",
        "sentence": "not how it works"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The reason for hitting those OtH radars was to divert some of the anti air capabilities that would otherwise be somewhere closer to the frontlines.\nThose over the horizon early-warning radars are for nuclear strike detection (ICBMs basically), not for your everyday missiles or planes."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Some people like the taste of leather."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The only bias here is yours"
    },
    {
        "subreddit": "worldnews",
        "sentence": "When you see \"Israel,\" you assume it's unreliable"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The Times of Israel is an independent, credible source that often criticizes the Israeli government"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Show me one article where Al Jazeera criticizes Qatar"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's like saying The New York Times can't be trusted on issues related to New York..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "If Russia other nukes maybe they will have north korea, China and India will also be \"angry\" at them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Talk about a dirty bomb!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is their highest and most top secret novel technology"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Next spring they will hopefully finalize their pee-pee mitton"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s a hyper advanced woolen mitton (cloth hand covering) that has been urinated on at least once upwards of dozens of times"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This chemical weapon takes 2.5 days to create and will ensure other countries think twice, nay, thrice before thinking about thinking of attacking North Korea"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Furthermore, a majority of the healthy NK community are being taught how to “pick it and flick it” making their home population supremely edgy and as supremely ready to rumble."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Haven’t you caught on yet? It’s always the Jews fault, no matter what."
    },
    {
        "subreddit": "worldnews",
        "sentence": "\"Intact\" is a non-hyphenated word"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You could say the word should be left intact instead of being split by a hyphen ;)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "How can an opinion like thinking that something is too sweet even be ruled \"wrong\" by a court? Why do some countries keep painting themselves and their legal system as a complete system of a clown?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He won't response\n\nThese basement dwellers will only troll till they get banned, then make another account"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Oh là là !"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes, people need to forget appeasement, it never ever works"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Definitely"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Figure out animal versus human"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If human, ID the families"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Etc."
    },
    {
        "subreddit": "worldnews",
        "sentence": "150 Handgranaten fliegen in den Kindergarten, alle Kinder ducken sich, nur den Erzieher Thomas juckt es nicht."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">Why does everything posted by the IDF need to have independent verification when people just run with everything that goes against them.  \n\n\nEverything posted by anyone needs to have independent verification"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's just that no one expects anything HAMAS claims to ever be verified."
    },
    {
        "subreddit": "worldnews",
        "sentence": "North Korea's response: \"All your base are belong to us\"."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">Same goes for capitalism though - not sustainable.\n\nCapitalism in various forms has existed throughout the millennia and here we are now with the greatest period of advancement in human history"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What has communism ever contributed to the world beyond death and civil decay? \n\n>Also id say that the examples of communism is never really communism, but I get your point.\n\nYes I'm familiar with the trope \"but real communism has never been tried\" and that is exactly the point"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's a fanciful daydream that ignores objective fact, which is why it never gets to its promised utopia before devolving into tyranny and repression"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's no different to a person thinking that by wishing hard enough, he can fly and then leaping off a cliff time and time again to the same results"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sure, in an ideal world, we might all have the benefit of flight but that's just not how it works because that goes against human nature."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So, no sources right"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just the voices in your head and wishfull thinking."
    },
    {
        "subreddit": "worldnews",
        "sentence": "To be fair, we're not their customers so it doesn't matter.\n\nIt's like when you see local politicians making crazy statements"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They know that the people that will vote for them agree with the statements and the people that care about the statements probably wouldn't vote for them."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Looks like a shit storm is brewing"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You literally just made that shit up out of your ass."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Apparently the whole fab is rigged if China were so bold lol."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This delusional little creature is experiencing something akin to getting punched in the mouth for being ill-behaved"
    },
    {
        "subreddit": "worldnews",
        "sentence": "He's firing Chinese and North Korean missiles into Ukraine and he's upset it's coming back at him?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Parts of the issue are that Gaza's economy was already so underdeveloped that, when the war and blockades started, citizens had very few supplies stockpiled"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thus, the existing supplies (available to the public, anyways) were eventually exhausted and not enough supplies are getting in and being distributed to replenish those supplies"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Iraq and Afghanistan didn't have (as severe, anyways) those issues because they had a better, pre-existing economy that wasn't fully blockaded."
    },
    {
        "subreddit": "worldnews",
        "sentence": "here comes the usual imbecile calling communism “state capitalism”"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can this breed of dipshits die off already? Communists are like cockroaches for some reason, even through they’ve suffered 50 eradication events at this point, they still seem to come back to life eventually."
    },
    {
        "subreddit": "worldnews",
        "sentence": "According to your logic, there should be no law, because it can be misused"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You are troll."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Joke aside, to be used as a fertilizer for human food production, human feces must be treated or can lead to disease and parasite spreading"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's why it is not commonly used while very abundant."
    },
    {
        "subreddit": "worldnews",
        "sentence": "In a uniformed military, the line between a soldier and a civilian is whether they are armed and in uniform"
    },
    {
        "subreddit": "worldnews",
        "sentence": "When a Bundeswar tank commander goes on leave and puts on lederhosen, they become a civilian"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Active duty IDF in uniform and under arms are not intentionally barracked in elementary schools."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Even assuming you could get it to work, using fusion to obtain gold would be vastly more expensive than just mining it in the first place."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You know how wars goes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was an estimated 3 days"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But if Putin put alot of faith in his army he might be able to take Kyiv in a Venus week or 2."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Redditor: posts total bullshit take\n\nAlso redditor: prove me wrong!!!\n\nLMAO"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This warms my heart"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hit that equipment, hit that runway, free Ukraine, free everyone! \n\nAm swedish and so happy we say \"go for it\" when it comes to Russian territory!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "> My reaction after reading: \"Help me advise your brother to stop ki***ing people with his product\" [censorship originally in the article, not mine]\n> \n> Oh, so it was actual defamation after all...\n\nI've seen this story posted a few times, and this is the first time I've seen the actual defamation.\n\nNobody reads the article"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Myself included, because I only flicked through after seeing your comment.\n\nSeems like her comments seriously affected their business and that's their logic for suing her personally, too (two separate suits, one criminal and one civil)\n\nI don't agree with the company, but important information is being left out"
    },
    {
        "subreddit": "worldnews",
        "sentence": "She didn't say it was too sweet, she said it was killing people and made a *concerted effort* against this company."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s grammatically correct, though"
    },
    {
        "subreddit": "worldnews",
        "sentence": "🤷‍♂️"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If they made it, they won't be letting Americans have it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Or the British."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Maybe this is what happened to u/agitated-sandwich-98 s basement sink"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Cluster munitions on airfield is like the most absolute reasonable use of them you could think of though.\n\nI agree with you in that justifying war crimes by saying \"they did it first\" isn't an acceptable position"
    },
    {
        "subreddit": "worldnews",
        "sentence": "that's exactly what it is"
    },
    {
        "subreddit": "worldnews",
        "sentence": "and what most drone-mounted guns are"
    },
    {
        "subreddit": "worldnews",
        "sentence": "easier than trying to redesign a whole new platform"
    },
    {
        "subreddit": "worldnews",
        "sentence": "they likely didnt use anything larger due to weight"
    },
    {
        "subreddit": "worldnews",
        "sentence": "id opt for an lmg with a good amount of ammo, but no way rover there is capable of handling that."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's one way to shit on their enemy"
    },
    {
        "subreddit": "worldnews",
        "sentence": "As soon as I see ”Russia claims” I zone out."
    },
    {
        "subreddit": "worldnews",
        "sentence": "A foreign agent is a foreign agent"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It doesn't matter if it's Russian or EU"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It seems you are the ignorant."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kimchi Dung B*mb"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They finally realized that this is the only thing they can send into the air that won’t immediately explode."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I mean yeah, you said they weren't a machine learning algorithm but for the wrong reasons"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You seem to think machine learning is \"smart\" and ChatGPT is \"dumb\" and just querying a database, while instead the training of ChatGPT probably uses some of the most advanced machine learning algorithms.\n\n\nBut ChatGPT itself has no database, there is no algorithm in the sense of \"user queried x, let me look up x in the database\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "The input first gets encoded by the model into high-dimensional vectors that capture the contextual meaning of each word and then decoded again to generate an output based on that. \n\n\nThe iteration you describe is based on the optimization algorithm I mentioned earlier, during training a loss function is used to calculate a number that signifies the difference between desired output and actual output and an algorithm is used that iterativelly adjusts the model based on that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's the learning, the model is learning patterns and relationships from the data."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Exactly that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "When I threaten you with a knife, in the end I don't want to use it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "When I want to stab you, I won't show it first."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That person is obviously Indian, just take a look at their profile"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Visit moving to north korea then"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I imagine the masses of pissed off protesters might better represent the will of the people"
    },
    {
        "subreddit": "worldnews",
        "sentence": "oh so hamas killed their own people again and again blamed israel and again people willingly went along with it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ho lol  \nOK  \nI really suck in sarcasm, haha sry  \nthanks"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, what ancap people do not understand is the strongest or richest company (or coalition of companies) would simply create a new de facto government, even if not de jure"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It would simply revert back"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Government is just an emergent level of complexity that society naturally evolves."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There are well planned & researched strategies for this situation.\n\nNukes change the rules, which is why every tin-pot dictator desperately wants them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "At a certain point, Nuclear weapon use becomes not just possible, but actually likely"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's not rational, but dictators seldom are, and that's what Russia is now"
    },
    {
        "subreddit": "worldnews",
        "sentence": "An irrational nation ruled by a dictator who is more likely to survive a Nuclear exchange than most of the population in both European or Russian cities."
    },
    {
        "subreddit": "worldnews",
        "sentence": "In my fantasy alt Mexico, Tenochtitlan is a pueblo magico and one of the world's most unique archeological sites (alongside Machu Picchu) with fully utilized chinampas, surrounded by a moderately-sized lakeside city with natural drainage"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So for destroying most of what the city was and kicking off the drainage/paving spree, I'm going to have to blame the Spanish for precluding this timeline.\n\nQueretaro seems like much better choice for the capital, maybe Puebla second."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">saying sugary products kill is hyperbola but not really defamation.\n\nThat's not what she said though"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There's a galaxy wide difference between \"sugary products kill\" and \"advise your brother to stop killing people\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "The latter would be considered defamation in most Western countries as well."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They got the idea from the chinese?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "like an M249 with a camera sighted with the rifle at 100m"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I mean this is definitely just for propaganda for heir citizens, same with the video of the guy making 5nm chips with his hands, but to anyone who has a highschool diploma and some critical thinking skills, this is hilarious."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Getting real tired of Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Like the world is pretty shitty I'm sure if you asked..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I've heard the same, but I don't know the truth of that one way or another"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just wanted to give people a source and a little context in case they were interested."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don’t think it’s about caring about what people say, more that it’ll be incredibly annoying if thousands of people start spamming their email address"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Your submission has been automatically removed because your account does not meet the minimum karma or account age requirements for /r/worldnews"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If you are new to reddit, we suggest you read:\n\n* [reddit 101](http://www.reddit.com/r/help/comments/2bx3cj/reddit_101/)\n\n* [How reddit works](http://www.redditblog.com/2014/07/how-reddit-works.html)\n\n* [The rules of /r/worldnews](http://www.reddit.com/r/worldnews/wiki/rules)\n\nYou may also want to review the [Reddit guidelines regarding spam](http://www.reddit.com/help/faq#Whatconstitutesspam) and the [wiki on self-promotion on reddit](http://www.reddit.com/wiki/selfpromotion)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The Hungarian people who elected Orban for over a decade"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Orban who made clear his stance, before and after the war in Ukraine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Is really not that complicated"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There is no lizard leading Hungary"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are a EU democratic country that chooses not to be so democratic anymore and align with Russia and China against our western values."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The IDF infantry is made up mostly of conscripted college students"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why on earth would you think that would cause less collateral than targeted air strikes when an all-volunteer US Army couldn’t do it right in like seven different campaigns in similar environments?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You're asking him to prove a negative"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You made the claim, you should back it up"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You can't just say to people it's their responsibility to prove what you said is BS"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I mean, how can you prove someone *didn't* say something? Record their entire life and watch it on video? That doesn't make sense."
    },
    {
        "subreddit": "worldnews",
        "sentence": "About 50_55% of israel's JEWISH population are brown"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Jews make about 70% of the Israeli population"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The other 30%(arabs, druze, Samaritans ect) are functionally all brown."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I get this is world news but the hourly bluster about nuclear war and red lines from Russia over their botched genocidal invasion is barely news at this point."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Biological warfare, maybe it's from the revered leaders poop because apparently he doesn't shit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "With [arson, murder, and jaywalking](https://tvtropes.org/pmwiki/pmwiki.php/Main/ArsonMurderAndJayWalking)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fuck off Russia don't want war at home don't start a war.\n\n\nHint you can stop missiles hitting Russia by going home."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can we Google bomb them? Asking for a friend."
    },
    {
        "subreddit": "worldnews",
        "sentence": "In 2023, clean power made up 35% of China’s electricity mix, with hydro the largest single source of clean power at 13%"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wind and solar hit a new record share of 16%, above the [global](https://ember-climate.org/countries-and-regions/regions/world/) average (13%)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "China generated 37% of global wind and solar electricity in 2023, enough to power [Japan](https://ember-climate.org/countries-and-regions/countries/japan/).\n\nYet, China relied on fossil fuels for 65% of its electricity in 2023, making it the world’s largest emitter"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Its per capita power sector emissions were [more than double](https://ember-climate.org/insights/research/g20-per-capita-coal-power-emissions-2023/) the global average.\n\nChina’s electricity demand continued to grow in 2023, increasing by 6.9%"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wind and solar met 46% of this demand increase, but coal met the remainder"
    },
    {
        "subreddit": "worldnews",
        "sentence": "As a result, China’s power sector emissions rose by 5.9% compared to 2022 – six times the global increase of 1%"
    },
    {
        "subreddit": "worldnews",
        "sentence": "However, this increase would have been greater if not for the record additions of wind and solar"
    },
    {
        "subreddit": "worldnews",
        "sentence": "China is now approaching a tipping point where clean additions outpace demand growth, with the IEA [forecasting](https://www.iea.org/reports/electricity-2024) a 3% fall in coal generation in 2024.\n\n- [https://ember-climate.org/countries-and-regions/countries/china/](https://ember-climate.org/countries-and-regions/countries/china/)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I was convinced groundbreaking was the orinigal method for getting diamonds"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So you are saying that hamas is worse? Even though Israel killed like 30x what hamas did"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Israel will not get through this unscathed"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I’ve already explained myself to someone else"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Read my comment history if you’re that interested"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Otherwise kindly move on as I’m already engaged in discussion with someone else."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ya the scientific benefit seems nice and all, but now I can start making high fashion jewelry for ants."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Another hypocritical propaganda where bribing is national pastime."
    },
    {
        "subreddit": "worldnews",
        "sentence": ">this is verbatim a claim of Russian propaganda.\n\nPeople seem to not realise that internal Russia propaganda is quite different to external Russian propaganda (which is in English, *for some reason*).\n\nAnd by \"quite different\" I of course mean \"batshit insane\"."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Shit storm."
    },
    {
        "subreddit": "worldnews",
        "sentence": "As is our fucking right to do so."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hmm.."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Someone called the bluff"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I wonder how this plays out."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Tech clearly stolen from Boston Dynamics, but clearly much poorer"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Knowing how badly things made in China are, you could probably be able to read 'made in China' written on it before you would be in immediate danger."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It hasn't been independent since '67, dude"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What are you talking about? If you occupy and prevent a country from becoming independent for more than half a century, you kinda have a huge amount of responsibility for the state that country is in"
    },
    {
        "subreddit": "worldnews",
        "sentence": "An _overwhelming_ majority of the population of Gaza has only ever known Israeli occupation"
    },
    {
        "subreddit": "worldnews",
        "sentence": "My understanding is that turkey has not been occupying Iraq for half a century, so I don't think your analogy really lands."
    },
    {
        "subreddit": "worldnews",
        "sentence": "xD    \n( /r/respass4379 's \"Whatever the reason, it's Israel's fault\" was a joke)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Well, shit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I was betting on global warming, with more heat- and drought-resistant plants in my garden, pv installation on the roof, and air-conditioned safe-room in the cellar"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Now, it will be nuclear winter instead 😬 That'll ruin mynday..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Putin has destroyed Russia for nothing.\n\nCredit where it's due."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just because it’s a public institution doesn’t mean the property is public"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They have the right to bar or trespass people who refuse to leave."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I heard that the president basically allowed the occupation of the university and was forced to change when the mayor of berlin intervened.\n\nAlso there haven’t been any consequences yet, I don’t think any of that will and can happen due to the law"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It must be all they have left after selling their artillery shells to Russia."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That’s some funny shit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Try hot shots :).\n\n[https://www.youtube.com/watch?v=TdTeHvVoQhQ](https://www.youtube.com/watch?v=TdTeHvVoQhQ)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, she’s underwater now…"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why waste their only fertilizer? What about their starving population"
    },
    {
        "subreddit": "worldnews",
        "sentence": "US Flight Crews train for a wide variety of mission profiles"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nuclear strike is one of them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If the tempo on that variety of training by NATO forces has increased, maybe look to your own (RFs) recent tendency to threaten nuclear strikes on other countries."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I think it depends on your definition of ancap"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Are there any taxes in your definition? How does the government prevent violence?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don't think he meant to use volunteers, using POWs means forcing prisioneers to fight"
    },
    {
        "subreddit": "worldnews",
        "sentence": "POWs are awarded protection under Geneva convention, forcing then to fight would be a war crime."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They've still gone over."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Who the fuck do you think you are"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Do your own research."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Is this bad because it leaves unexploded munitions on the ground?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Poopaganda from the North"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Literally only a week ago!\n\nhttps://www.reuters.com/world/europe/russia-says-it-starts-nuclear-military-drills-2024-05-21/\n\nBut this was training for a nuclear strike against Ukraine, so I guess in Russia’s head that means it’s a strike against internal Russian territory 🤦‍♂️"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">My point is that Hamas steals and profits from international aid sent to civilians and that they don't even deny it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's all, it's just a data point"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The digital warrior is never tired."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Same goes for capitalism though - not sustainable.\n\nAlso id say that the examples of communism is never really communism, but I get your point."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not a fucking chance"
    },
    {
        "subreddit": "worldnews",
        "sentence": "One side raped and pillaged their way door to door, slaughtering parents in front of kids, kids in front of parents"
    },
    {
        "subreddit": "worldnews",
        "sentence": "One maintains humanitarian corridors and facilitates hundreds of tons of food and medicine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ridiculous."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This post seems to be about US internal politics which is not allowed in r/worldnews.\n\nThis classification may be wrong"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If the article is in fact international in scope, please contact the moderators who will then review the issue and might reapprove it.\n\n*I am a bot, and this action was performed automatically"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Please [contact the moderators of this subreddit](/message/compose/?to=/r/worldnews) if you have any questions or concerns.*"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">Oil producers will lower the cost of oil until all is sold\n\nA barrel of oil still has production costs"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You realize the basis of propaganda is to have you believe everything coming from the other side is nothing but propaganda"
    },
    {
        "subreddit": "worldnews",
        "sentence": "IIRC Ukraine knocked 2 out"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Either way even knocking out 1 means you now created a blind spot you can use to knock out the rest"
    },
    {
        "subreddit": "worldnews",
        "sentence": "your sweat glands move closer to your skin so you can cool off faster"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Is *thoughts* a Storm Shadow and *prayers* a JDAM? If so, yes."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The Russians make the mistake of believing that we can be intimidated with atomic bombs"
    },
    {
        "subreddit": "worldnews",
        "sentence": "In the end, we all perish."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Anarcho-capitalism, a system where the state would essentially disappear and would lose all the power and say on corporations which would be completely free to do whatever they want, no regulations whatsoever"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Everything would be private.\n\nIt's gaining a lot of traction lately but tbh it's an insane idea"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Private Firemen, private police or private judges sounds stupid as hell."
    },
    {
        "subreddit": "worldnews",
        "sentence": "i mean europe is plastered with dud bombs that arent just russian"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I dont really think its quality control, its just common for cluster bombs to have duds"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Duds also conveniently act as mines"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Get a load of this fucking guy with the puns"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I disagree"
    },
    {
        "subreddit": "worldnews",
        "sentence": "When one side consistently and repeatedly keeps working through the geneva convention as if it was a checklist, you are morally justified in countering with similar means, if that is what it takes.\n\nAnd since Ukraine does not have the luxury of abundant OTHER methods, so be it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Reddit is full of Putin bots and Maga trolls or the willfully ignorant and cowardly."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Indian here, 100% second this."
    },
    {
        "subreddit": "worldnews",
        "sentence": "If you mean the events in Berlin: Local law forbids the universities to kick people out for that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Naaa,,  \nHamas is at fault for this,  \nThis could all end tomorrow if Hamas surrender and give back the hostages."
    },
    {
        "subreddit": "worldnews",
        "sentence": "And one could argue that it's not even that hyperbolic"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are adding tons of sugar to what is being sold as \"tomato puree.\" They are the ones that should be in trouble."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Countries can have more than one enemy and more than one radar.\n\nThis one has been a bit puzzling - as it's basically a defense against long range nukes, destroying it likely has no direct benefit to this war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "However, it's probably also something Russia would like to keep, so now they have to relocate air defense away from the areas Ukraine *actually* needs to hit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Got a name or a link to that at all? Super interesting"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why?  Not every German soldier was a staunch Nazi"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The average German solider was running to surrender to the West instead of the Soviets"
    },
    {
        "subreddit": "worldnews",
        "sentence": "How did having the Soviets control part of Germany and Berlin work out for Germany and the rest of Europe?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia claims NATO planning for UFO Invasion fleet to attack the Kremlin! They are such fucking weirdos."
    },
    {
        "subreddit": "worldnews",
        "sentence": "its because they are chinese/russian allies."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Please, let this not be the start of another pandemic."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I mean they're probably using it as a testing ground to see how to build a pier that *won't* break from a big wave.\n\nThis isn't so much a \"donation\" or an \"act of good will\".."
    },
    {
        "subreddit": "worldnews",
        "sentence": "it's a testing ground for the next time they need to set up a pier for an invasion"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's just now they can justify the expense while pretending it's out of the good of their hearts."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ukraine used them on an airstrip, not a civilian center"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Calling that evil isn't just wrong, it's a conscious effort to spread Russian propaganda."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Taxing the rich to stifle the smothering of the poor and create a more capable society is good politics"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Taxing the rich while in a war economy and using that money to send your work force to die elsewhere with zero return on investment is bad politics."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's a message to toy with Russia, not a genuinly considered scenario by Poland. \n\n\nPoland, coordinates and adjust it's messaging strictly to align with US general gameplan"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Since US is against shooting missiles so is Poland.\n\n\n It's just for sake of keeping Russia uncertain with respect to little issues, exclusively .\n\n\nSorry to disappoint ones hoping it's something genuinly considered as probable option."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wow, a person with a different take, must be bots"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Literal reddit brain rot"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What's next gonna snatch Halloween candies, or tie the hollow cans to the guard dogs."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I wasn't trying to rip on the EU"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hell forming it was needed, they didn't get it perfect but they are better off with it then not"
    },
    {
        "subreddit": "worldnews",
        "sentence": "[eriscofoods\\_cooldude4u\\_1978@icq.kids](mailto:eriscofoods_cooldude4u_1978@icq.kids)"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">no government regulation\n\nIt's not about \"no government regulation\", it's about \"no corporate influence on the government\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "In ANCAP system, the government still regulates that all contracts are being made voluntarily, violence isn't used by any parties\\*, the contracts aren't being broken, the parties\\* aren't lying, etc.\n\n^(\\*By \"parties\" I mean \"individuals\" and \"corporations\", not political parties.)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Only if that's what Russia wants"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hate to break it to you, but I’m not German nor have I ever heard these new lyrics to the song"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I just read the article"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Should I hate Americans since their government murdered by relatives in Pakistan? \n\n\nDid Russia and Iran behind? Or every countries can be POS when lives are mere despensibles."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sugar has a known causal link to diabetes, saying sugary products kill is hyperbola but not really defamation."
    },
    {
        "subreddit": "worldnews",
        "sentence": "He is a war criminal, he has carried out crimes against humanity, and is *actually* attempting real genocide...His aim is to wipe out Ukraine, its language, culture & people"
    },
    {
        "subreddit": "worldnews",
        "sentence": "With that in mind, why exactly do we have to listen to him? All he wants is war, & this isn't the 1930s, and there are a lot of countries that remember"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Nobody, NOBODY wants any of this but HIM."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Using words such as state capitalism is just cope mechanics for tankies.\nIts not REAL communism all over again"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Remember, all they show is just the one thing that works"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The west's response to this will be 100x more powerful and this dog is just a scare scam"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">Because it's a war between two different religions\n\nIt's not a war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "a war would involve both countries' armed forces fighting each other"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This sounds to me  like one nation(Israel) slaughtering innocent civilians  on a daily basis in an attempt to cleanse the area for their own people to claim."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Are you drink or are you NOOORMAL?!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "\"Are you here to help us?\"\n\n\"Dude, I hate it when the training dummies talk to us...\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hmmm"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Interesting"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What kind of problems are they known to cause?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "> and it is used in a constantly escalating war\n\nNot banned globally and not an escalation since Russia's been using them on Ukrainian civilian centers since the war started"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I get that you want to try and paint Ukraine as some sort of rogue state but the facts of the war are against you here."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I understand the effort that has gone into integrating Hungarian forces into NATO"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But honestly, can NATO really expect that they will turn up on the first day of operations against Russia?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "maybe for comedy reasons? I mean, you cant make shit up when you read/hear stuff like the \"US developed birds\" who are built to spread pandemics or we Germans enjoying to hunt squirrels to grill them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "However I 100% agree with this politics and wish we would implement them as well"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Even without wars"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Tax the rich!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are literally still holding hostages what are you on?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "fuck him"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So WWII again lol but china instead of the USSR"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Would mean Russia was looking the wrong way for the wrong thing"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Also knocking it out has its its own benefits."
    },
    {
        "subreddit": "worldnews",
        "sentence": "ANCAP = anarchocapitalism"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's the direct opposite of fascism; fascism being \"a merger of state and corporate power\", as defined by Benito Mussolini himself, and anarchocapitalism being \"a separation of state and corporate power\"."
    },
    {
        "subreddit": "worldnews",
        "sentence": "get a cancer and die putin"
    },
    {
        "subreddit": "worldnews",
        "sentence": "world needs it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I can’t help but to picture him giggling behind a tree like a child while peaking out at them going over the horizon"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Like what a lame ass move."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Truly wild that Joe wants to turn a slam-dunk election into a nail-biting fight that he might well lose."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not doing anything proves that human shield strategy works"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This in turn allows any malicious force to just put some civilians around their weapons platforms and we can’t shoot at it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This quickly becomes unsustainable."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are really letting anyone to write anything they want as fact."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So you are saying kids & adults in Africa don’t need to die for diamonds anymore?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can we see the review though? Since when does doing reviews send you to prison? Im glad I never started a youtube review channel! Smh!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "16 years"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Shocks me that people think appeasement will help when it hasn't worked ever if an aggressor is on the march you have two options"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fight or at least prepare for the fight or bend the knee and surrender everything and everyone to whom if the conqueror."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not clicking that.\n\nEdit: grammar as sphelling is hard"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are just like that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Even good numbers, published by western producers are taken from tests under optimal conditions"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Try dropping cluster munitions on muddy ground and it starts to look ugly again."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Abrahamists hate you, but mostly they hate themselves."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't stick your dick in crazy ........"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Part of the romance is knowing a few poor African kids died for your proposal."
    },
    {
        "subreddit": "worldnews",
        "sentence": "> all Russians are uniquely innocent children of God\n\nI know you already know this but for those not in the know, this is verbatim a claim of Russian propaganda"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They also use it to downplay all the rape they did in WWII."
    },
    {
        "subreddit": "worldnews",
        "sentence": "If it’s what you need to believe to fuck off out of Ukraine, ok."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not really"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I've never slept well"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Good job dodging the question again."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Indian here, there's really a cult for this guy here"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Safe to say it's horrible."
    },
    {
        "subreddit": "worldnews",
        "sentence": "That’s why Ukraine should have a formal invitation to NATO already."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They can"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's only a waste, since countries already pay EU funds"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hungary is basically freezing the bank account and you'd need to get money from your other bank account, which is meant for other things"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Working around this is a huge bureaucratic hassle, just because some wannabes want corruption money."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Because Russian and Iranian social media PsyOp campaigns have found their latest marks in the West."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I still remember how they hit the park in Kharkiv with cluster munitions at the very beginning of the invasion, sick fuckers"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I actually think the best way to troll them is to send back some of South Korea’s best snacks like the HBAF honey butter almonds"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s like saying your system produces shit…while ours produces the good stuff 🤔"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If America votes for Trump again...it will be Israel's fault?\n\nWhat's scary is I was having a conversation with my neighbor yesterday about this very thing"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I thought it crazy but could totally see progressives refusing to vote for Biden, Trump winning, and then everyone deciding to blame the Jews"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Now after seeing your comment I realize it isn't that crazy."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Indian here, 100% second this."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Will you please join me in sending them thoughts and prayers? \n\nYes, absolute bullshit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia had levelled towns and cities"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Crying about a bit of tarmac."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Errr, thus, is news? If they weren't training for this their not doing their jobs."
    },
    {
        "subreddit": "worldnews",
        "sentence": ".."
    },
    {
        "subreddit": "worldnews",
        "sentence": "and I'm not that good at that"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just a few, as a treat"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Utilizing german POWs, at that point I don't think we would be much better then the Nazis."
    },
    {
        "subreddit": "worldnews",
        "sentence": "This would drag NATO into a direct war"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Enforcing a no-fly-zone means firing on any Russian aircraft that violates the no-fly-zone."
    },
    {
        "subreddit": "worldnews",
        "sentence": "How is the US supposed to ensure those supplies get to the people?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Oh ffs, she used hyperbole in an online comment in reply to someone else because it's so sugary"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Are you so pro-corp that you think that merits a fine and/or jail time?  \n\n\n> \"Help me advise your brother to stop ki***ing people with his product, yesterday was my first time of using and it’s pure sugar.”\n\n\nReally you're on the manufacturer's side for **that**? Lame."
    },
    {
        "subreddit": "worldnews",
        "sentence": "She's a very unreliable storyteller, as much as I think this specific story might be real I wouldn't take her word for it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The plans to attack the Soviets were already drafted in 1945 and then discarded"
    },
    {
        "subreddit": "worldnews",
        "sentence": "By the time the Soviets started doing their nonsense, everyone was content that the war was over"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The people were simply tired of having another big war start."
    },
    {
        "subreddit": "worldnews",
        "sentence": "West Bank is a weird area under the control of IDF"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The settlers you're talking about are illegal, but you can't say Palestine harbours Jews since any jew falling in the hands of Hamas will immediately be killed, but the same can't be said of IDF"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They don't kill any Muslim on sight"
    },
    {
        "subreddit": "worldnews",
        "sentence": "That's what the topic of our conversation was about."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I get that, but Israel is committing war crimes at a much greater rate than the US in Iraq and Afghanistan combined (plus the US was there for 2 decades, Israel has been in Gaza 7 months)."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Look up the history of isreal and palestine BEFORE Oct"
    },
    {
        "subreddit": "worldnews",
        "sentence": "7"
    },
    {
        "subreddit": "worldnews",
        "sentence": "In fact, go all the way back to 1976."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I know we’re 80 years on but those things took a year to design, a year to build and even then one sank after 12 days"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The logistics that went into building those was immense."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The police should really try to help that poor Prince whose money is stuck in a bank."
    },
    {
        "subreddit": "worldnews",
        "sentence": "We will have to fight China, that should be our main focus."
    },
    {
        "subreddit": "worldnews",
        "sentence": "They hate us cuz they anus."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Although you could argue that Ukraine only used cluster munitions on a military base, while Russia drops them on residential areas"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No kid is gonna wonder onto that air base and accidentally pick up an unexploded bomb."
    },
    {
        "subreddit": "worldnews",
        "sentence": "In Germany some university presidents support antisemitism from students and no action has taken place against them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s a shocking trend, unfortunately"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is probably an empty threat because they know there's nothing they can do about it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Russia science and engineering has been dog shit for decades"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's why they have not taken over Ukraine."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So now bribes are a capitol crime.\n\nHow civilized....."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The problem is you suppose that the nation that just used a nuke would just watch there stuff getting wiped whitout nuclear striking the bases the attacks are coming from."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Unfortunately I think you’re right"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Always was"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">growth in fossil fuel is outstripping growth in clean energy\n\nAnd what basis do you have for that claim contradicting the article? From the [carbonbrief report](https://www.carbonbrief.org/analysis-monthly-drop-hints-that-chinas-co2-emissions-may-have-peaked-in-2023/):\n\n>Overall, the record addition of solar and wind capacity in 2023 enabled these sources to deliver 22% of power generation and almost 90% of year-on-year growth in March, as shown in the figure below"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The share of non-fossil power generation rose to 36.2%, from 32.6% last year."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kids are resilient, they should never have been put in this situation though."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You can’t kill innocent children and not be a villain"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Have either of them actually given any weapons to Ukraine capable of striking within Russia? How about some of those Taures missiles Scholz?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "North korea is out of fertilizer so they’re baiting the South"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Send a couple air balloons to the South as a “provocation” and hope South Korea retaliates a thousand fold"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Profit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Always was"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ignore them, they be edgy and shit."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Many fighter jets have enough engine power to accelerate *straight up*"
    },
    {
        "subreddit": "worldnews",
        "sentence": "With a long enough runway, you don't need much power to accelerate a comparatively light fighter jet to just enough speed to lift off."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Bro, your /s detector has failed you today."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Countries can supply aid as sovereign countries"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Without EU"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But which country is willing to fund orbans cronies? If they abuse EU policies, just work around them"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Send aid to ukraine and sanction hungary for obvious obstruction and corruption."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Just put a bullet in his head and be done with it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I agree with you, but that's hardly surprising, we are far more than just in the early stages of yet another war, we are in fact at the knife edge of a historical change of the same size as the industrial revolution.\n\nAI, internet, phones and automation have crossed a line where our previous social contract just doesn't make sense anymore, and truth be told none does, socialism, capitalism, other isms, all of them assume that we people are the source of wealth, after all who's going to work at the factories?\n\nBut our society and most societies in general got no idea of what to do when that no longer is true, and that's how you get conflict, war is trying to make everyone agree with you by the bullet, and if you think our societies are broken just you wait to see how bad it is for those who just never truly embraced our current world, like the Russians for example."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wow check the comments… seems a lot Nigerians (in these comments) support the company here"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No they haven't"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Post a source if you are so confident."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, the ANCAP move would be to send hitmen after Her, Boeing style."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Their next high level military meeting: \"so we just need to figure out how to get every South Korean to fall asleep at the same time, sneak across the DMZ, and out their hands in bowls of water...\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Personally I wouldn't trust an enemy's spouse to guard the gates to the base."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yes, because the alternative being presented is worse than accepting collateral damage."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I hope so"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can we end this yet"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No thanks"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I prefer mine covered with blood"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Team Amurica world police"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's wrong, sorry, it's more like 100,000 which to be honest I find difficult to believe"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But it's more than 3000"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Apologies"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Same in my environment"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Thanks."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ukraine military says it shot down 13 out of 14 drones launched by Russia\n\n>KYIV, May 29 (Reuters) - Ukrainian military shot down 13 drones out of 14 launched by Russia in an overnight attack on three regions, the country's air force said on the Telegram messaging app on Wednesday.\n\n>Drone debris fell on energy infrastructure in Ukraine's northwestern region of Rivne, governor Oleksandr Koval said on Telegram"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The attack triggered a defence mechanism that cut power to some localities, although it has since been restored.\n\n>Drone debris also damaged power lines in central Kirovohrad region with repair work ongoing, its governor said.\n\n>The air force shot down 11 drones over the Mykolaiv region, with no details on damage reported by the local governor.\n\n[https://www.reuters.com/world/europe/ukraine-military-says-it-shot-down-13-out-14-drones-launched-by-russia-2024-05-29/](https://www.reuters.com/world/europe/ukraine-military-says-it-shot-down-13-out-14-drones-launched-by-russia-2024-05-29/)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The delusional is strong with this one."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Anarcho capitalism, basically full on capitalism where everything is a market and no government regulation"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Not sure if it's the same weapon or a different one also targeting runways, but they're also either deployed in conjunction with or include mines"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So before any repairs can start they first have to demine the place."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Every accusation is a confession"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Remember, RUSSIA CONSIDERS UKRAINE RUSSIAN TERRITORY"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So yes, with that perspective, I would say NATO would be smart to consider that."
    },
    {
        "subreddit": "worldnews",
        "sentence": "He warned already before the invasion and nobody really believed that Russia will invade Ukraine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's not that Russia is bluffing."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Maybe just let all the trucks lined up at the entry points instead of the US paying all this tax payer money for a bullshit pier solution"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You must be exhausted."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wasting fertilizer like this, their agriculture must be doing well."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The realpolitik answer is that while the American Left is ambivalent to Jewish hostages even if they're Americans Citizens; they're just as aggressive as the right if they're not Jews"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So if the practice of taking American hostages rises again we're gonna have to break out Truman's big stick again."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You think a local food company in Nigeria cares what someone in North america has to say about this? You act like they even have one customer outside Africa."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Classy company, rocking the gmail address 😆"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I don’t think India will be rushing into any alliances with China."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can a German speaker help me write an updated version of 99 Red Balloons? I'm calking it \"150 Brown Balloons\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Wait for Ukraine to collapse and annex Zakarpattia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Create a NewEU and Hungary is not allowed to join"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Source: Elementary school club rules."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It looks like someone put a regular rifle on the robot"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I was expecting a special gun designed specifically for mounting on the robot."
    },
    {
        "subreddit": "worldnews",
        "sentence": "It'd make no difference"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They aren't a global brand that would care, they're just making money off of corruption."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Lol"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's quiet common in India"
    },
    {
        "subreddit": "worldnews",
        "sentence": "India is not for begjnners"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is an older article but the charge is absolute bullshit that no reasonable prosecutor would ever agree to bring and not one that a grand jury would be keen on"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Imagine if a jury had to hear this"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They’d run the ketchup krew out on a rail"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They’re a public company, there’s no actual malice or intent to defame shown even prima facie, and she’s saying that overly sugary foods are both unhealthy and key drivers of diabetes and other diseases with high mortality"
    },
    {
        "subreddit": "worldnews",
        "sentence": "She didn’t give actual sugar measurements or put out a pamphlet comparing this person’s ketchup to the leading competitors saying they had special sugar that murders people.\n\nThis’d turn reviews on their head as no one could give an opinion anymore"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Imagine if a toothpaste commercial said “10/10 dentists refuse to comment on our product on advice of counsel”! \n\nThat said, it’s that it *can* get this far that’s the disturbing bit"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Her life is changed forever before any conviction because this company has the weight to tip the scales in a way that very few Nigerians (including actual victims of crime) have the privilege of."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Troll"
    },
    {
        "subreddit": "worldnews",
        "sentence": "\"He work so hard he burns up the energy inside\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Isn't that just the French? Or were they just doing the old plan of creating a radioactive wall across Germany?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Someone should tell him."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Vetoed by hungary.\n\nWhat you can very well do is cut off any funding"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There's in fact a difference between declaring war and invading without declaration"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hitler also never declared war officially to any country he invaded."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Can someone enlighten me about what ANCAP is? I have googled it, but all I'm getting is Australasian New Car Assessment Program and I don't that's what everyone commenting below is fired up about..."
    },
    {
        "subreddit": "worldnews",
        "sentence": "35C @ 100% is a dew point of 35C"
    },
    {
        "subreddit": "worldnews",
        "sentence": "[Highest ever recorded in the world](https://www.guinnessworldrecords.com/world-records/645732-highest-dewpoint-temperature)\n\n\n Doesn't make sense, your equipment must be broken or something \n\n\n Looking at past weather in London in 2018, I see 31C @ 40% at most. \n\n\n https://www.timeanddate.com/weather/uk/london/historic?month=7&year=2018"
    },
    {
        "subreddit": "worldnews",
        "sentence": "> This explains why Ukraine knocked out a tracking facility within the last 2 days"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If you mean the over-the-horizon radar, that apparently was a) looking in a different direction, and b) for entirely different threats."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The same un thst spent more time grieving the genocidal Iranian dictator than the thousands of innocent Israelis murdered by hamas?\n\nThe same un that parrots hamas's casualty stats, lying about the deaths of thousands and thousands of women and children?\n\nThe same un who's agents took part in October 7th?\n\nThe same un that operates unrwa, a group that spent the last 75 years radicalizing Palestinians into murderers?\n\nYeah, I don't have much trust in them either"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We need to get rid of either unanimity voting or Hungary"
    },
    {
        "subreddit": "worldnews",
        "sentence": "TBF, based on the headline, I kinda assumed this was going to be a story about Florida or Texas."
    },
    {
        "subreddit": "worldnews",
        "sentence": "NATO countries are able to go to war independent of the alliance"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If all the NATO countries get together and decide to join the war, they don’t need article 5 or anything else in the treaty"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They can just do it outside the bounds of the treaty."
    },
    {
        "subreddit": "worldnews",
        "sentence": "There are applications of diamonds for particle detectors for physics experiments along these lines."
    },
    {
        "subreddit": "worldnews",
        "sentence": "> fossil fuel production is increasing as ever\n\nFossil fuel consumption isn't though"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It was still slightly increasing, but not \"as ever\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Since 2018 there has been only very little growth of fossil fuels in the [global primary energy consumption](https://ourworldindata.org/grapher/energy-consumption-by-source-and-country?stackMode=absolute): In 2022 the fossil fuel consumption was 1680 TWh or 1.24% higher than in 2018"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Compared to a growth of 6786 TWh (5.27%) between 2014 and 2018"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Over the previous crisis, when emissions fell in 2009, the growth between 2007 and 2011 was 7068 TWh (6.02%).\n\nIf you consider ten year periods, 2012-2022 fossil fuel consumption grew by 10897 TWh or 8.63%, while between 2002 and 2012 it grew by 28670 TWh or 29.35%.\n\nQuite clearly the growth in fossil consumption has slowed down and isn't increasing as ever"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The increase in 2022 over 2021 was 0.48%"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We *are* approaching stagnation and decreasing fossil fuel consumption"
    },
    {
        "subreddit": "worldnews",
        "sentence": "And there are clear inflection points visible around the crises"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It also is reflected in the [global per-capita CO2 emissions](https://ourworldindata.org/explorers/co2?time=1850..latest&facet=none&country=~OWID_WRL&hideControls=false&Gas+or+Warming=CO%E2%82%82&Accounting=Production-based&Fuel+or+Land+Use+Change=All+fossil+emissions&Count=Per+capita), which peaked in 2012 and has fallen since from 4.9 tons to 4.7 tons.\n\n>What has changed a lot is the way emissions are calculated (they're not measured anyway), mostly by carbon offsetting that's not working in reality.\n\nI don't think that carbon offsets are considered in the carbon emissions data from the [Global Carbon Budget](https://globalcarbonbudget.org/) project and also not in the linked analysis on Chinas emissions.\n\nCan you share the data that indicates that fossil fuel production \"increases as ever\" and hasn't slowed as visible in the primary energy consumption shown by ourworldindata above?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yo, I heard you liked bombs within bombs, so I made you a bomb with a bomb inside it to really show that runway who's in charge!"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It is an ethnic conflict over land"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Get rid of religion and you might have fewer suicide bombers, but the fighting would still continue."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The point, that the west is even talking about that, is a win for Russia"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They established the one sided rule, that they are the only ones who is allowed to shoot in this conflict.\n\nBut thats what you get when you are messing around for 2years"
    },
    {
        "subreddit": "worldnews",
        "sentence": "NATO should have fully supported Ukraine with an army full of equipment **before** Ukraine started thier counter offensive, NATO should have not taken a nap for 6months to argue about some internal backwater politics during a war, NATO should not delay each and every promised help to the time, where it is barely enough to hold to line far inside Ukraine territory.\n\nPersonally, i feel ashamed"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If this is the best we can do with 1.1trillion dollar NATO countries spend per year, then we have to ask: \"Is that just money we want weapons producers to have, or is this something we need and use?\".\n\nIf we say: \"We cant do anything against nuclear powered nations\", then why do we have a defense budget at all?  \nYou dont discourage bullies by being a meekly coward"
    },
    {
        "subreddit": "worldnews",
        "sentence": "We act like this war is barely a presentation room for our military economy"
    },
    {
        "subreddit": "worldnews",
        "sentence": "There are lives at stake and we act, like we only care for the sales pitch."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Sounds like something Trump told him to do."
    },
    {
        "subreddit": "worldnews",
        "sentence": "So?  You brought up NATO"
    },
    {
        "subreddit": "worldnews",
        "sentence": "What does it have to do with the point being made?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Seeing as how a significant portion of qassam rockets are made from Israeli duds, yes it is."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You were never going to vote for him"
    },
    {
        "subreddit": "worldnews",
        "sentence": "This is just the latest excuse."
    },
    {
        "subreddit": "worldnews",
        "sentence": "There might be some delays in aid"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But a sufficient amount of aid is getting into Hamas controlled territory"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It's simply not being distributed."
    },
    {
        "subreddit": "worldnews",
        "sentence": "What if all the TikTok:ers in the world could do their own review of this product (and company)? Making the stated the common world wide truth."
    },
    {
        "subreddit": "worldnews",
        "sentence": "> You lose heat very quickly as water evaporates from you skin,\n\n\n\nBut *ONLY* if it evaporates away.\n\n\n\n>What needs to be as dry as possible is the air, not you\n\n\n\n\nHe said he was running in *FLORIDA*, ie: basically through a waterfall, this isn't possible"
    },
    {
        "subreddit": "worldnews",
        "sentence": ">If you are completely drenched that's an indicator you're probably not cooling fast enough\n\n\n\n\nYes.\n\n\n\n\n>drying yourself off is just self sabotage at that point.\n\n\n\n\nOnly if the air is *NOT* humid."
    },
    {
        "subreddit": "worldnews",
        "sentence": "He's not talking to Ukraine."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yea absolutely"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I work in tech and have worked with and do still work with Ukranian teams, and i have to say they are above average and many are very good"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They are just as smart as anyone else amd treating them with kid gloves just gonna lead to more ukranian deaths"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Give them all the weapons, let them fortify their borders and allow them the proper opportunity to fight back in asymmetrical ways."
    },
    {
        "subreddit": "worldnews",
        "sentence": "australia's already told them they can do whateva they want with whateva we give them, it wouldn't be giving it to them otherwise would it, so if putins warning doesn't bother australia, i dont think the yanks are gonna give 2 fucks  lol  unfortunately we dont make missiles."
    },
    {
        "subreddit": "worldnews",
        "sentence": "yet"
    },
    {
        "subreddit": "worldnews",
        "sentence": "so, yeah, i agree, get your shit together america, no one cares what gender the missile is, just let them use it for what its designed for, otherwise whats the bloody point."
    },
    {
        "subreddit": "worldnews",
        "sentence": "A significant portion of the explosive material used in Hamas missiles comes from unexploded Israeli munitions"
    },
    {
        "subreddit": "worldnews",
        "sentence": "They don’t need to smuggle it."
    },
    {
        "subreddit": "worldnews",
        "sentence": "She said the sauce was killing people (it was sweeter than her previous brand)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I can see the manufacturer's viewpoint better than hers"
    },
    {
        "subreddit": "worldnews",
        "sentence": "She also got out conditional that she apologize, which she then refused to do"
    },
    {
        "subreddit": "worldnews",
        "sentence": "(I read the linked story.)"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Article 1 section 1 of the Korean War Armistice reads \"A military demarcation line shall be fixed and both sides shall withdraw two (2) kilometers from this line\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "While they technically did not cross the demarcation line with soldiers, Mr"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Kim didn't read the footnote, which to the chagrin of many negotiators was included by an adamant Canadian man:\n\n>You don't cross my shit line, I don't cross your shit line\n\nLahey *was* right to include such verbiage, we are in the eye of a shiticane here."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Literally if you watch the statement in it's entirety you will hear him say that they are cooperating with an outside body to investigate and will release their evidence soon"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I bet you trust hamas casualty numbers though."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Lemme just check a dictionary real quick to double check I'm not off base, and.."
    },
    {
        "subreddit": "worldnews",
        "sentence": "_one that is associated with another as a helper : a person or group that provides assistance and support in an ongoing effort, activity, or struggle._\n\nWe certainly are an ally to Ukraine"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Being a member of a multinational alliance organization like NATO is not the only definition of an ally."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Don't want Ukraine to fire missiles at you? Maybe don't invade them then? Seems pretty simple to me."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ope that's Russia definitely wanting us to not do that and we should definitely be doing that."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, I'm repeating myself because you refuse to answer the question"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Why did you bring up Hamas when I said Israel is responsible for the famine? I'm asking because I want to know, and me making shit up is not the way to achieve that."
    },
    {
        "subreddit": "worldnews",
        "sentence": "What the fuck is “state capitalism”…capitalism requires private ownership and free production of goods and services"
    },
    {
        "subreddit": "worldnews",
        "sentence": "NK is essentially a Stalinist monarchy, fucking “state capitalism” nonsense"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Everyone eating their cake and having it, too."
    },
    {
        "subreddit": "worldnews",
        "sentence": "But Macron has already OK-ed it?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Hamas charter, section 7"
    },
    {
        "subreddit": "worldnews",
        "sentence": "German here: Scholz is a joke of a chancellor"
    },
    {
        "subreddit": "worldnews",
        "sentence": "The comma usage in this post title is giving me eye-cancer."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Fly to Tel Aviv and just look at the sky."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah donno why they are giving away their fertilizer."
    },
    {
        "subreddit": "worldnews",
        "sentence": "Its 3 Venus days"
    },
    {
        "subreddit": "worldnews",
        "sentence": "One Venus day = 243 days."
    },
    {
        "subreddit": "worldnews",
        "sentence": "The issue with the Taliban was that the drones were to good at taking out leadership so they didn't have anyone to sign a peace treaty with."
    },
    {
        "subreddit": "worldnews",
        "sentence": "If Putin's launched nukes, then the nuclear war has already started, you are afraid of starting a fight that is in progress"
    },
    {
        "subreddit": "worldnews",
        "sentence": "You could wipe out all Putin's military with conventional weapons and he's still have nukes to kill your people"
    },
    {
        "subreddit": "worldnews",
        "sentence": "But you won't kill his by your own denial"
    },
    {
        "subreddit": "worldnews",
        "sentence": "So he has the advantage and you lose.\n\nThe fix is to obliterate Russia the first nuke it fires.\n\nAnd the fix now is to make it clear, that this is how it will be."
    },
    {
        "subreddit": "worldnews",
        "sentence": "What a shitshow…….."
    },
    {
        "subreddit": "worldnews",
        "sentence": "[The UN.](https://press.un.org/en/2024/sc15621.doc.htm) You got any that aren’t Qatari state owned propaganda mills?"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Ukrainians look too white for progressives to care /s.\n\nReally though, these progressives are just so brainwashed into hating the west that they only care about conflicts if they can try to blame the west for it"
    },
    {
        "subreddit": "worldnews",
        "sentence": "If they can find a way to directly blame the west for killing people in Ukraine, or Sudan or wherever, they'll protest that too I'm sure."
    },
    {
        "subreddit": "worldnews",
        "sentence": "dude there are no legal or illegal wars !"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Given they were staff level commanders of the militant wing: yes, Israel is justified."
    },
    {
        "subreddit": "worldnews",
        "sentence": "With how little they have to eat over there that was probably everything they had at the waste management plant"
    },
    {
        "subreddit": "worldnews",
        "sentence": "https://youtu.be/B23hnCTfPPk?si=vzmA3mM5_Vf-lxOQ\nIt's getting buried by the algorithm, if you search idf statement rafah strike you'll only get Netanyahu saying it was a mistake and not the actual statement by the idf"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Seems normal."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You feel that Randy? The way the shit clings to the air Randy"
    },
    {
        "subreddit": "worldnews",
        "sentence": "It’s already started my dear good friend, the shit blizzard"
    },
    {
        "subreddit": "worldnews",
        "sentence": "Yeah, it's screaming \"bomb me\""
    },
    {
        "subreddit": "worldnews",
        "sentence": "Guess it will perhaps be more protected, but we'll see."
    },
    {
        "subreddit": "worldnews",
        "sentence": "I was totally thinking Gone in 60 Seconds when I wrote that, not sure how I confused the titles"
    },
    {
        "subreddit": "worldnews",
        "sentence": "I did have the Tokyo Drift song stuck in my head earlier, that might have caused the mixup"
    },
    {
        "subreddit": "worldnews",
        "sentence": "No doubt full of  worms."
    },
    {
        "subreddit": "worldnews",
        "sentence": "You identify the ones you can and then arrest them individually, like they do in stadiums… we are in 2024, not 1024."
    }
]